{"url": "https://en.wikipedia.org/wiki/Template_talk:Harry_Potter", "content": "Template talk:Harry Potter - Wikipedia \n Template talk:Harry Potter   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n WikiProject Novels  /  Harry Potter \n (Rated Template-class) \n Novels Wikipedia:WikiProject Novels Template:WikiProject Novels novel articles \n Novels portal \n v \n t \n e \nThis template is within the scope of  WikiProject Novels , an attempt to build a comprehensive and detailed guide to  novels ,  novellas ,  novelettes  and  short stories  on Wikipedia. If you would like to participate, you can edit one of the articles mentioned below, or visit the project page, where you can join the project and contribute to the  general Project discussion  to talk over new ideas and suggestions. \n   Template   \n This template does not require a rating on the project's  quality scale . \n Harry Potter portal \nThis template is supported by  Harry Potter task force . \n   \n WikiProject Children's literature \n (Rated Template-class) \n Children's literature Wikipedia:WikiProject Children's literature Template:WikiProject Children's literature children and young adult literature articles \n Children's literature portal \n v \n t \n e \nThis template is within the scope of  WikiProject Children's literature , a collaborative effort to improve the coverage of  Children's literature  on Wikipedia. If you would like to participate, please visit the project page, where you can join the  discussion  and see a list of open tasks. \n   Template   \n This template does not require a rating on the project's  quality scale . \n   \n Tasks you can do: \n edit \n history \n watch \n purge \n Here are some open tasks for  WikiProject Children's literature , an attempt to create and standardize articles related to  children's literature . Feel free to help with any of the following tasks. \n Add {{Portal|Children's literature}} to the  See also section  of related articles. \n Tag the talk pages of related articles with {{ WikiProject Children's literature }} \n Join  WikiProject Children's literature  and list yourself as a  Participant  in the project. \n Cleanup :  A  cleanup listing for this project  is available. See also  the list by category ,  the tool's wiki page  and  the index of WikiProjects . \n Deletion discussions : listed at  Wikipedia:WikiProject Deletion sorting/Literature \n Notability :   Articles with notability concerns , listed at  WikiProject Notability \n Rate  the  Unassessed articles  in the  Children's literature WikiProject . \n References :  Add references to  Unreferenced BLPs . \n Requested articles :   Create a requested article on literature \n Stubs :   Improve a stub-class article \n edit \nArchives \n Archive 1: 2004 – June 2006 \n Contents \n 1   Soundtrack column \n 2   in regard to having the last film in this template \n 3   Separate books and movies etc. more? \n 4   Philosopher's Stone \n 5   Regarding organisations \n 6   If Mary Grand Pre is to be included... \n 7   Years being listed in the template \n 8   Differences between book and film links \n 9   New article \n 10   Colors \n 11   What has been done? !!!!!!! \n 12   What's been done (arbitrary break) \n 13   New design \n 14   Chandler's design \n 15   Rowling \n 16   Finally did it \n 17   Characters \n 18   Oh Dear \n 19   Removing redlinks \n 20   New Template \n 21   Fansites \n 22   Cast section? \n 23   Template far too wide \n 24   Problem with template \n 25   Watford Junction \n 26   Wonderbook Book of Spells \n 27   Formatting of columns for each book \n Soundtrack column [ edit ] \n Hi, while doing some poking around relevant to  Wikipedia:Articles for deletion/Harry Potter music , I noticed that your template had no mention of the soundtracks. I thought it would be a nice addition, so I went ahead, ( WP:BOLD ,) and did so. Feedback would be appreciated. -- RoninBK E T C  11:47, 18 November 2006 (UTC) \n in regard to having the last film in this template [ edit ] \n Mention of the last film was taken out because  \"There is no information on this film yet\" . There is however some information available. See  [1]  &  [2] . I think some discussion on the matter is needed. -- RockerballAustralia  03:36, 10 April 2007 (UTC) \n I think the link should be included, because the page exists  BaconLover  19:16, 18 April 2007 (UTC) \n I added a link to the DH film article, which redirects to  Harry Potter (films) . As all of the discussion on this page is in favor of a link, please DO NOT remove without posting here first. Thank you. In regard to the actual article itself, I feel that there is enough information to constitute a separate page for it.  Lutherjw  17:04, 28 April 2007 (UTC)\n As soon as there is an article on it, you can add it back.  John Reaves   (talk)  00:56, 30 April 2007 (UTC) \n Separate books and movies etc. more? [ edit ] \n With the addition of 'soundtrack' we now have a template far more heavily weighted in the movie-interpretations and their spin-offs (games soundtracks, et all), whereas the books are an altogether separate canon. Would it not be possible to make the books in a more separate column (which the comic relief books also adhere to)? - Kez  16:50, 17 June 2007 (UTC) \n Do you have a specific idea for the formatting change? I don't think we really need to distinguish in a  template  from canon and noncanon. -- Fbv 65 e del  /  ☑t  /  ☛c  || 17:38, 17 June 2007 (UTC) \n Philosopher's Stone [ edit ] \n The name of the first book is \"Philosopher's Stone,\" not Sorcerer's Stone except in the USA. As the books are British, and all other nations use the proper name then Philosopher should be used.  Dewarw  14:08, 18 July 2007 (UTC) \n I never understood why they changed the title in the first place, considering the Philosopher's Stone is an actual legend of alchemy. Whereas Sorcerer's Stone means next to nothing.  vlad § inger   tlk  17:29, 26 July 2007 (UTC)\n There (was) a perception that US audiences don't know the correct meaning of 'Philosopher' in the context of the book. A bit like the film title 'The Madness of King George' being used instead of 'The Madness of George III'. -- Theoldgoat  21:09, 16 October 2007 (UTC) \n Regarding organisations [ edit ] \n Having largely disregarded the organisations section of the template until about three seconds ago, I noticed there were links to  Animagus  and  Metamorphmagus . I understand they are not organisations, but - for want of a better word - magical conditions. Opinions? Thoughts? ~~  THE   DARK LORD   TROMBONATOR   ( ( (¶) ) )  07:39, 21 July 2007 (UTC) \n Hang on... I clicked the wrong link... this discussion will be relocated to  Template talk:Harry Potter characters . Entirely my mistake. ~~  THE   DARK LORD   TROMBONATOR   ( ( (¶) ) )  07:50, 21 July 2007 (UTC) \n If Mary Grand Pre is to be included... [ edit ] \n Then she shouldn't be listed alongside the fictional elements of the Harry Potter story. Rather, she should be listed in a separate category, possibly also including  Stephen Fry  and  Jim Dale , though I don't know what the category should be called, nor do I know how to create it.  Serendipodous  10:34, 23 July 2007 (UTC) \n Years being listed in the template [ edit ] \n Are they really needed? Templates should be for navigating: extra things such as years, just clutter it up.  RobJ1981  06:59, 28 July 2007 (UTC) \n I was bold, and just removed them. I've seen quite a few templates (and I checked a few other book series templates), and I see none listing years. Harry Potter shouldn't be an exception. Navigational templates aren't for organizing by lising years.  RobJ1981  11:06, 28 July 2007 (UTC) \n Differences between book and film links [ edit ] \n Hi, I added these links (see  this revision  for the links I added). The main reason is that if they aren't in this template, then we have a separate template for the film pages that looks redundant and ugly (I mean, a whole template box for  five links ) and then we don't get these links on the other pages. I think the links work fine in this template because you can then get to these pages from more than just the film-specific articles and we can remove that ugly/redundant template to boot. So can someone explain why these were reverted? I agree clutter should be minimal, but I think it fits in the template just fine - only one more column, and the template stays the same size. So I'd like to add these back, unless someone has some reasoning why they should be gone. -- midkay  18:29, 29 July 2007 (UTC) \n I've re-added them, I see no problem with listing the differences in the template. The IP that removed it didn't give a reason for removing them (or re-adding the years either). So I've fixed the template.  RobJ1981  10:21, 30 July 2007 (UTC)\n Cool, sounds good, I felt the same: a revert for no reason. I was prepared to re-add them but I hadn't decided what the verdict was on keeping the years; I thus prepared a version of the template that has the  differences  links as well as the years, in case it's later decided to keep the years. So I'll put the code up, you can find it at  User:Midkay/Template:Harrypotter , in case/if ever it's wanted or needed. -- midkay  10:47, 30 July 2007 (UTC) \n New article [ edit ] \n Hi. I started a new article,  List of alliterative phrases in Harry Potter , at the behest of another editor who didn't think lists belong in the article. If it's supposed to be put into some template that includes all articles on Harry Potter, by all means...  DRosenbach   ( Talk  |  Contribs )  02:23, 31 July 2007 (UTC) \n Colors [ edit ] \n What do ppl think of this as a \"remake\" for the template: \n v \n t \n e \n J. K. Rowling’s   Harry Potter  series \n The Philosopher's Stone \n book \n film \n book/film differences \n game \n soundtrack \n The Chamber of Secrets \n book \n film \n book/film differences \n game \n soundtrack \n The Prisoner of Azkaban \n book \n film \n book/film differences \n game \n soundtrack \n The Goblet of Fire \n book \n film \n book/film differences \n game \n soundtrack \n The Order of the Phoenix \n book \n film \n book/film differences \n game \n soundtrack \n The Half-Blood Prince \n book \n ( film ) \n The Deathly Hallows \n book \n ( film ) \n Other books \n Other games \n Fantastic Beasts and Where to Find Them \n Quidditch Through the Ages \n Harry Potter: Quidditch World Cup \n Lego Creator: Harry Potter \n World :  Timeline  •  Characters  •  Places  •  Magic  •  Spells  •  Objects  •  Plants  •  Potions  •  Beasts \n Blood purity  •  The Dark Arts  •  Money  •  Laws  •  Ministry of Magic  •  Publications  •  Quidditch \n Politics  •  Fandom  •  Religious debates  •  Legal disputes  •  Parodies  •  Influences and analogues \n Translations  •  Films  •  Lego  •  Theme park  •  Trading card game \n J.K. Rowling  •  Mary GrandPré  •  Jim Dale  •  Stephen Fry \n Chandler talk  12:02, 26 August 2007 (UTC) \n The CoS box sticks out too far on my browser. Is that the same for anyone else? Also, is it possible to shrink the book/film differences title, coz it's way massive compared to everything else.  THE   DARK LORD   TROMBONATOR  09:53, 27 August 2007 (UTC) \n What has been done? !!!!!!! [ edit ] \n My god, this template was once attractive, easy to use and generally nice. \n Now it is a mess, difficult to use and a disgrace! \n It must be returned to the old style (a row for each book title with Book, Film, Music columns etc.) immediately!  Dewarw  20:16, 25 September 2007 (UTC) \n It would be nice if you would communicate in a little more calm manner and if you would consider how reading something like this would make the author of the template feel. There are two things I like about this new template that I would like to keep, but other than that, feel free to change it however you see fit. The things I like about it are that it is much more space efficient, which allows us to have many more links on it while still using a reasonable amount of space, and secondly, that it uses the standard form for navigation boxes, {{ navbox }}, which is nice because it provides consistency with other articles and ease of coding. –  Basar  ( talk   ·   contribs ) 01:34, 26 September 2007 (UTC) \n I agree that the new box is more streamlined, but in terms of navigating the books/movies of the series, I prefere the old design. Perhaps someone (not me, my skill extends to making links and editing text) could combine various elements the next time it is revised. Either way, it's still useful and if the author is reading, they did a good job, I just liked the old book setup.  —Preceding  unsigned  comment added by  Romuluscrohns  ( talk  •  contribs ) 01:56, 26 September 2007 (UTC) \n I am sorry, if I offended the \"designer\" with my language. However, I do not care as the template is an absolute disgrace! And as for changing it myself, well, it would be changed back immediately. I do not like edit wars, and I do not promote them. Making such a revolutionary change would provoke one, even if the change is for the better. \n The change needs to be done. The sooner the better.....  Dewarw  17:49, 1 October 2007 (UTC) \n I absolutely, 100% agree with Dewarw that the new format is a major hindrance to its navigability. It requires much more extensive reading and time spent parsing and understanding the template to jump from a book to the film. \n Fundamentally, this data is tabular. Presumably there will be 7 books, 7 games, 7 films, 7 soundtracks, and 7 book/film difference articles. That's 35 links with 5 per book. Presenting this as a list is the wrong direction to go. A 5 column table was perfect. It was clear, concise, and didn't require reading through a list to find what you wanted to find. In case the obvious must be stated: the point of a nav box is to ease navigation. If I have to read through a list it just as well be category. Please restore this template back to its tabular format.  Cburnett  22:27, 14 October 2007 (UTC) \n Well, I dunno where I stand on this one. I did like it better when it was in the table - and we can make it smaller now that the deletionists have had their way with the book/film diff articles (go guys! you rock!). However, I have reverted to this a couple of times mainly coz I don't like big mega dramatic changes without consensus. Mind you, did anyone ask for feedback about this in the first place? Maybe a \"y'know, I was thinking of making the HP template easier to use. Will I recieve hate mail if I put it this way...?\" would have gone down nicely and we wouldn't have had all this angriness on Wikipedia. Honestly, guys, it'll kill your soul. Just learn to bottle it all up and pop it out on someone who actually deserves it. Like bitchy English teachers. ;P But on a serious note, read  WP:CIVIL .  the   DARK LORD   trombonator  06:54, 15 October 2007 (UTC) \n Don't patronize me. Being strongly opinionated does not make one uncivil. Did I insult anyone? Did I demean anyone? Did I rail anyone for their contributions? \n Or did I present my position logically and explain why I don't like the current template and why I preferred the old? Oh, and I haven't had an English teacher in a decade...  Cburnett  13:14, 15 October 2007 (UTC) \n We shouldnt bring back the old one, because 1. so many links have been deleted/added/changed. And as Basar said, the {{ navbox }} should be used. So i tried to make some sort of mash-up of the old and new, that might be put in its place. \n v \n t \n e \n The  Harry Potter  series \n Philosopher's Stone \n Film  •  Game  •  Soundtrack \n Chamber of Secrets \n Film  •  Game  •  Soundtrack \n Prisoner of Azkaban \n Film  •  Game  •  Soundtrack \n Goblet of Fire \n Film  •  Game  •  Soundtrack \n Order of the Phoenix \n Film  •  Game  •  Soundtrack \n Half-Blood Prince \n Film  •  Game  •  Soundtrack \n Deathly Hallows \n Film  •  Game  •  Soundtrack \n Characters \n Harry Potter  •  Ron Weasley  •  Hermione Granger  •  Lord Voldemort  •  Albus Dumbledore  •  Severus Snape  •  Sirius Black  •  Rubeus Hagrid  •  Minerva McGonagall  •  Draco Malfoy  •  Ginny Weasley  •  Neville Longbottom  •  Luna Lovegood  •  Weasley family  •  Dursley family  •  James and Lily Potter  •  Hogwarts staff  •  Dark Wizards  •  Ministry Officials \n Universe \n Locations  •  Magic  •  Spells  •  Quidditch  •  Hogwarts  •  Ministry of Magic  •  Magical creatures \n Other \n Harry Potter influences and analogues  •  Politics of Harry Potter  •  Religious debates over the Harry Potter series  •  Legal disputes over the Harry Potter series  •  Chronology of the Harry Potter stories  •  Harry Potter music  •  Harry Potter fandom  •  Parodies of Harry Potter  •  Harry Potter in translation  •  List of Harry Potter films cast members  •  Harry Potter: Quidditch World Cup  •  Lego Creator: Harry Potter  •  Fantastic Beasts and Where to Find Them  •  Quidditch Through the Ages \n Chandler talk  14:03, 15 October 2007 (UTC) \n I'm all for that even with the  huge  amount of wasted white space. \n Consistency and \"ease to code\" are wholly irrelevant if the nav box fails to aide in navigation, which I think the current one does.  Cburnett  14:29, 15 October 2007 (UTC) \n First: Cbarnett, it was Dwarw that was uncivil. Second: I haven't had an English teacher since second period today. And third: can we put the stuff on the bottom of the table along the right hand side? As in, making it smaller and using up the space? --  the   DARK LORD   trombonator  05:31, 16 October 2007 (UTC) \n I suspect not since that doesn't fit in with this whole new \"paradigm\" change in navbox'ing.  Cburnett  05:36, 16 October 2007 (UTC) \nI've made some \"updates\" or maybe I should say another suggestion for the style \n v \n t \n e \n The  Harry Potter  series \n Philosopher's Stone \n Film  •  Game  •  Soundtrack \n Chamber of Secrets \n Film  •  Game  •  Soundtrack \n Prisoner of Azkaban \n Film  •  Game  •  Soundtrack \n Goblet of Fire \n Film  •  Game  •  Soundtrack \n Order of the Phoenix \n Film  •  Game  •  Soundtrack \n Half-Blood Prince \n Film \n Deathly Hallows \n Film \n Characters \n Harry Potter  •  Ron Weasley  •  Hermione Granger  •  Lord Voldemort  •  Albus Dumbledore  •  Severus Snape  •  Sirius Black  •  Rubeus Hagrid  •  Minerva McGonagall  •  Draco Malfoy  •  Ginny Weasley  •  Neville Longbottom  •  Luna Lovegood  •  Weasley family  •  Dursley family  •  James and Lily Potter  •  Hogwarts staff  •  Dark Wizards  •  Ministry Officials \n Universe \n Locations  •  Magic  •  Spells  •  Quidditch  •  Hogwarts  •  Ministry of Magic  •  Magical creatures \n Other \n Harry Potter influences and analogues  •  Politics of Harry Potter  •  Religious debates over the Harry Potter series  •  Legal disputes over the Harry Potter series  •  Chronology of the Harry Potter stories  •  Harry Potter music  •  Harry Potter fandom  •  Parodies of Harry Potter  •  Harry Potter in translation  •  List of Harry Potter films cast members  •  Harry Potter: Quidditch World Cup  •  Lego Creator: Harry Potter  •  Fantastic Beasts and Where to Find Them  •  Quidditch Through the Ages \n One downside with this one is that I couldnt find any substitute for the {{ Navbox generic subgroup }} for the {{ Navbox_with_columns }} So I had to make my own, and it's far from perfect. PS. I know it doesnt look as good in lower resolutions, but from 1280*x and up it looks OK imo.  Chandler talk  18:37, 16 October 2007 (UTC) \n Better, except the first book's name. The book has  two  english titles and both should be present. This has nothing to do with spelling thus  WP:SPELLING  doesn't apply.  Cburnett  19:27, 16 October 2007 (UTC)\n No,  Wikipedia:WikiProject Harry Potter/Style guidelines#Philosopher.27s vs Sorcerer.27s   Chandler talk  19:45, 16 October 2007 (UTC) \n \"At most, high-traffic pages may warrant...\" and you don't consider this template \"high traffic\"? Contrary to your tone you are not a god of any flavor and cannot dictate. The HP wikiproject cannot dictate. Nevermind the page you link is a  style guide , not policy.  Cburnett  20:12, 16 October 2007 (UTC)\n What's so hard to understand? the US version IS a translation, this isnt the American wikipedia, its the English and its only in the USA (and Canada?) who don't use Philosopher's.  Chandler talk  20:18, 16 October 2007 (UTC) \n The difference is that I'm being  inclusive , making it more widely usable and understood by more people. You're are being  exclusive . Why are you giving me an AE vs. BE lecture when you're the one excluding?!? The point of nav boxes is to make navigation easy for  everyone , not just brits who know the book as the philosopher's stone. Stop being self-centered.  I  should be giving you the AE vs. BE lecture. WP:SPELLING doesn't apply. Your style guide is not policy. And your best argument is that I should have a world view by  excluding  a title? (Nevermind that your definition of \"translation\" makes no sense. Since WHEN do you trnaslate english to english???)  Cburnett  20:27, 16 October 2007 (UTC)\n It's you who's being self-centered, trying to push something into here without a consensus. It's been discussed already  (even on this talk page) . This is why the book/film/soundtrack articles are named  Philosopher's Stone . \"not just brits who know the book\" Its not \"just brits\" its EVERYONE except 1 or maybe 2 countries...  Chandler talk  20:54, 16 October 2007 (UTC) \n Cburnett, you may want to look at  WP:ENGVAR . Seeing as it's a British book, we use British English and the British titles.  Will   ( talk )  19:25, 29 October 2007 (UTC) \n Too wide.  Way  too wide. What was wrong with the old version, again, with a row for each story? I don't see any obligation to use {{ navbox }} when it doesn't suit. {{ ASUE }}, e.g., doesn't. \n —wwoods  20:16, 16 October 2007 (UTC) \n I'd be absolutely fine with the way it was.  Cburnett  20:27, 16 October 2007 (UTC) \n What's been done (arbitrary break) [ edit ] \n Please, let's just stop the uncivilness and calm down. The world ain't going to end if the changes aren't immediate, and no one - not one of you thanked Chandler for knocking out that template work (exceptional work, btw), even when he acted on changes that folk suggested. CBurnett, grow a thicker skin. If people say things that bug you, realize that you might not be the source of their snippy (althought you certainly own the subsequent snippy when you gave it back). Please communicate with your fellow editors politely, or you will almost assuredly end up on the wrong end of a civility block. Pay attention to the crowd around here. They are a mostly even-handed bunch, but you aren't being polite, and are in fact asking for a fight that you really aren't going to want. Make the effort, please. -  Arcayne   ( cast a spell )  09:01, 17 October 2007 (UTC) \n Yeah, good points, Arcayne. I've been away from the desk for a couple of days, and was surprised by the incivility ensuing. Well done, Chandler, for your tireless work - I wouldn't have a clue about any of it! I assure you, had I known who was behind the incredible masterpieces of templating, I would have piled praise on earlier. Perhaps, though, it is good that there were humungo arguments over the first few, because the newest one is \"brillo\", IMHO. I do feel, however, that it is slightly wide, but understand that because JKR made such long titles, it is difficult - maybe even impossible - to rectify this. Furthermore, Cburnett, there is in fact policy about the title of Book One. Approximately located at  WP:MOS#Strong national ties to a topic , it goes something along the lines of: \"British subject, British spelling/title/etc.\" As PS is a British publication, we use the British title, which of course is the Philosopher's Stone title. We are NOT being exclusive; we are following Standard Wikipedia Procedure. Let's try and continue, as Arcayne so nicely puts it, to make the effort to get along and reach a peaceful solution. --  THE   DARK LORD   TROMBONATOR  07:34, 19 October 2007 (UTC) \n For the \"too wide\" problem, you can do the width you want (% or px) I don't think you can go much under 750px at this one, if you dont want the \"film game soundtrack\" to be on multiple rows. I've trimmed it down as much as posible, with font-size @ 90% and film game soundtrack at 80% even though I think it looks better with original font size  Chandler talk  14:05, 19 October 2007 (UTC) \n v \n t \n e \n The  Harry Potter  series \n Philosopher's Stone \n Film  •  Game  •  Soundtrack \n Chamber of Secrets \n Film  •  Game  •  Soundtrack \n Prisoner of Azkaban \n Film  •  Game  •  Soundtrack \n Goblet of Fire \n Film  •  Game  •  Soundtrack \n Order of the Phoenix \n Film  •  Game  •  Soundtrack \n Half-Blood Prince \n Film \n Deathly Hallows \n Film \n Characters \n Harry Potter  •  Ron Weasley  •  Hermione Granger  •  Lord Voldemort  •  Albus Dumbledore  •  Severus Snape  •  Sirius Black  •  Rubeus Hagrid  •  Minerva McGonagall  •  Draco Malfoy  •  Ginny Weasley  •  Neville Longbottom  •  Luna Lovegood  •  Weasley family  •  Dursley family  •  James and Lily Potter  •  Hogwarts staff  •  Dark Wizards  •  Ministry Officials \n Universe \n Locations  •  Magic  •  Spells  •  Quidditch  •  Hogwarts  •  Ministry of Magic  •  Magical creatures \n Other \n Harry Potter influences and analogues  •  Politics of Harry Potter  •  Religious debates over the Harry Potter series  •  Legal disputes over the Harry Potter series  •  Chronology of the Harry Potter stories  •  Harry Potter music  •  Harry Potter fandom  •  Parodies of Harry Potter  •  Harry Potter in translation  •  List of Harry Potter films cast members  •  Harry Potter: Quidditch World Cup  •  Lego Creator: Harry Potter  •  Fantastic Beasts and Where to Find Them  •  Quidditch Through the Ages \n I'd like to address my comment to the Trombonator (kewl name, btw) but anyone can respond. I think its important that since the 'Sorceror Stone' title was in fact utilized, it is unencyclopedic to disinclude it in the higher profile articles as well as the book and film titles. I think this isn't really covered by the British subject and spelling issue - we are talking about an actual title, not one misinterpreted/misspelled by the silly Americans and their grubby Jerry-Springer version of English (lol). Therefore, we would be remiss an encyclopedists in ignoring that alternate title in favor of national product. \n Lastly, thanks for the compliment. :) -  Arcayne   ( cast a spell )  22:26, 19 October 2007 (UTC) \n OK, so we can mention that in the article, but it makes it waaaaay too cluttered on the already stretched table. Alternatively - and IDK how you'll like this - but you could put the common abbreviated title as the link or reference to the book (having a link to the book under a \"book\" link similar to the \"film\" etc links, and having the ref as plain black (bold) text. Is that comprehenable? I mean like  Stone  - book - film - game - soundtrack. Yes? No? \n Chandler - the original font is easier to read and looks better too. Did I mention I like this style best? I'll say it again. Arcayne - I hate the contast in languages. Living in  New Zealand  it is hard to know which to use! I vote for a global English... not that this is the place for it of course :D --  THE   DARK LORD   TROMBONATOR  07:20, 20 October 2007 (UTC) \n I guess I need to apologize - I don't think it needs to be said in the template. I was speaking in a more specifica sense to the articles. Yeah, put a link or some other explanatory comment that notes that Sorceror is covered by the references to Philosopher. Your every reasonable alternative might confuse people into thinking that Sorceror is a different book, and not just an alternatively-titled book with illustrations. -  Arcayne   ( cast a spell )  18:39, 20 October 2007 (UTC) \n Sorry, Arcayne, I don't get the last bit:  Your every reasonable alternative might confuse people into thinking that Sorceror is a different book, and not just an alternatively-titled book with illustrations. . However, I have ruthlessly copied and pasted Chandler's \"nice\" table and then hacked at it violently for a couple of minutes to produce what I had in mind. Note, I have taken the last bit off, as I was fine with how it was and didn't want to take up so much space. Also, I have alternative titles - the first four being the operative/key word in the title that it is commonly referred to by, the latter three having the inititals of the title. Which do you think is best? \n v \n t \n e \n The  Harry Potter  series \n Stone \n Book  •  Film  •  Game  •  Soundtrack \n Chamber \n Book  • Film  •  Game  •  Soundtrack \n Azkaban \n Book  • Film  •  Game  •  Soundtrack \n Goblet \n Book  • Film  •  Game  •  Soundtrack \n OotP \n Book  • Film  •  Game  •  Soundtrack \n HBP \n Book  • Film \n DH \n Book  • Film \n Er, the one you worked very hard upon. Good work! :) -  Arcayne   ( cast a spell )  00:18, 21 October 2007 (UTC) \n Ooh, we could also call them by number, e.g. Book 1, Book 2, etc. And yes, that was me above. Perhaps the disjointed narrative gave it away. --  THE   DARK LORD   TROMBONATOR  01:05, 21 October 2007 (UTC) \n Well I dont really like the idea of Book 1-7, or having just Stone, Chamber, Azkaban, Goblet, and then abbreviations (I've never refered to them as just Stone Chamber Azkaban Goblet etc.). I dont think the titles (english) should be compromised because of a translations into American-english, as it's been stated the title \" Philosopher's stone \" is just not one thing invented by JKR and has substance, which Sorcerer's stone doesnt. Keep the full names imo, with removing of the \"Harry Potter and the\".  Chandler talk  04:26, 22 October 2007 (UTC) \n I guess I see what you mean, Chandler, and I guess I agree. However, the book was  not  'translated into American English' at all. The  same  book was issued in both countries (speaking of US and UK). The only differences were the different title (which appeared in other countries as  Sorceror's Stone  aside from the American version), the presence of illustrations in at least the US version and of course (presumably) jacket art. I am not sure its something that needs to be addressed  here  so much as perhaps re-addressing the topic in the wikiproject discussion itself, and decide which articles should include the caveat about the alternat titling.\n I must disagree, there are differences in the language, not just the title. I have listened through the audio-books of the first four books in the English version with Stephen Fry and the American version with Jim Dale. And there are differences. I cant make a real list of this word here and this sentence here. But there are differences.  Chandler talk  07:45, 22 October 2007 (UTC) \n I guess I was a bit humbled by the effort you had made, Trombonator - Xhanlder has a valid point, and the template isn't where this matter should be addressed. -  Arcayne   ( cast a spell )  07:27, 22 October 2007 (UTC) \n Effort? No, it was simple copy and paste. I confirm there are differences within the versions - there's the cut passages from PS and HBP, plus a whole lot of word changes to suit the audience, e.g. \"Sherbert Lemon\" to \"Lemon Drop\", \"Holiday\" to \"Vacation\", etc., etc. So, yes, I would consider it a translation, as I consider American and British English to be two different strands of the same language. Yes, the same language, but would you call the changes between two different dialects of Chinese a translation. And... oh, now I see it. It shouldn't be addressed here. Shall we move discussion elsewhere, and let a wider range of editors look at it? And yeah, full titles is probably best. --  THE   DARK LORD   TROMBONATOR  08:49, 22 October 2007 (UTC) \n New design [ edit ] \n Xhandler, why do you say this looks \"retarded\"? \n v \n t \n e \n The  Harry Potter  series \n Books \n 1  •  2  •  3  •  4  •  5  •  6  •  7  •  QA  •  FB   \n Films \n 1  •  2  •  3  •  4  •  5  •( 6 )•( 7 ) \n Games \n 1  •  2  •  3  •  4  •  5  •(6)•(7)•  Quidditch World Cup  •  Lego Creator  •  Trading Card Game \n Soundtracks \n 1  •  2  •  3  •  4  •  5  •(6)•(7) \n Characters \n Harry Potter  •  Ron Weasley  •  Hermione Granger  •  Lord Voldemort  •  Albus Dumbledore  •  Severus Snape  •  Sirius Black  •  Rubeus Hagrid  •  Minerva McGonagall  •  Draco Malfoy  •  Ginny Weasley  •  Neville Longbottom  •  Luna Lovegood  •  Weasley family  •  Dursley family  •  James and Lily Potter  •  Hogwarts staff  •  Dark Wizards  •  Ministry Officials \n Universe \n Locations  •  Magic  •  Spells  •  Quidditch  •  Hogwarts  •  Ministry of Magic  •  Magical creatures  •  Potions  •  Plants  •  Chronology of the Harry Potter stories \n Other \n Harry Potter influences and analogues  •  Politics of Harry Potter  •  Religious debates over the Harry Potter series  •  Legal disputes over the Harry Potter series  •  Harry Potter music  •  Harry Potter fandom  •  Parodies of Harry Potter  •  Harry Potter in translation  •  List of Harry Potter films cast members \n Xammer  15:13, 24 October 2007 (UTC) \n Because that's my opinion of it.  Chandler talk  16:31, 24 October 2007 (UTC)\n I dislike the 1,2,3,4 ... It should say Philosopher's Stone, Chamber of Secrets, Prisoner of Azkaban, Goblet of Fire, etc. That would make it look a little less \"retarded\". Sorry to those who find the word offensive.  24.49.35.99  ( talk ) 02:22, 15 August 2010 (UTC) \n Chandler 's design [ edit ] \n I liked Chandler's design of the template, only if we get the links shorter I think it would be really nice. And maybe a removal of the characters section, keeping the old HP characters template improved, and including a link to the characters' list. Something like this: \n v \n t \n e \n The  Harry Potter  series \n Philosopher's Stone \n Film  •  Game  •  Soundtrack \n Chamber of Secrets \n Film  •  Game  •  Soundtrack \n Prisoner of Azkaban \n Film  •  Game  •  Soundtrack \n Goblet of Fire \n Film  •  Game  •  Soundtrack \n Order of the Phoenix \n Film  •  Game  •  Soundtrack \n Half-Blood Prince \n Film \n Deathly Hallows \n Film \n Universe \n Characters  •  Locations  •  Magic  •  Spells  •  Quidditch  •  Hogwarts  •  Ministry of Magic  •  Magical creatures \n Other \n Influences and analogues  •  Politics  •  Religious debates  •  Legal disputes  •  Chronology  •  Music  •  Fandom  •  Parodies  •  Translation  •  Cast members  •  Quidditch World Cup  •  Lego Creator  •  Fantastic Beasts and Where to Find Them  •  Quidditch Through the Ages \n Comments?  Lord Opeth  ( talk ) 23:37, 19 November 2007 (UTC) \n Anything is better than what we have at the moment! I have been off this page for months and am surprise at the level of redesigning. The current template is vile and needs to be changed. I prefer this one: \n v \n t \n e \n The  Harry Potter  series \n Philosopher's Stone \n Film  •  Game  •  Soundtrack \n Chamber of Secrets \n Film  •  Game  •  Soundtrack \n Prisoner of Azkaban \n Film  •  Game  •  Soundtrack \n Goblet of Fire \n Film  •  Game  •  Soundtrack \n Order of the Phoenix \n Film  •  Game  •  Soundtrack \n Half-Blood Prince \n Film \n Deathly Hallows \n Film \n Characters \n Harry Potter  •  Ron Weasley  •  Hermione Granger  •  Lord Voldemort  •  Albus Dumbledore  •  Severus Snape  •  Sirius Black  •  Rubeus Hagrid  •  Minerva McGonagall  •  Draco Malfoy  •  Ginny Weasley  •  Neville Longbottom  •  Luna Lovegood  •  Weasley family  •  Dursley family  •  James and Lily Potter  •  Hogwarts staff  •  Dark Wizards  •  Ministry Officials \n Universe \n Locations  •  Magic  •  Spells  •  Quidditch  •  Hogwarts  •  Ministry of Magic  •  Magical creatures \n Other \n Harry Potter influences and analogues  •  Politics of Harry Potter  •  Religious debates over the Harry Potter series  •  Legal disputes over the Harry Potter series  •  Chronology of the Harry Potter stories  •  Harry Potter music  •  Harry Potter fandom  •  Parodies of Harry Potter  •  Harry Potter in translation  •  List of Harry Potter films cast members  •  Harry Potter: Quidditch World Cup  •  Lego Creator: Harry Potter  •  Fantastic Beasts and Where to Find Them  •  Quidditch Through the Ages \n It is clear and concise, having the most important info at the top. I would advise us to change it now, and discuss for better one after (and then change again). \n Dewarw  ( talk ) 18:22, 21 November 2007 (UTC) \n Rowling [ edit ] \n Doesn't it seem weird that she's not there? She should probably be included in whatever template you guys use, too.  SouperAwesome  ( talk ) 14:39, 23 November 2007 (UTC) \n Really? I hadn't thought she was that important :p I'll make sure she gets in. Guess we overlooked it coz she's usually on the title bar. --  THE   DARK LORD   TROMBONATOR  00:40, 24 November 2007 (UTC) \n Done.  Cburnett  ( talk ) 14:17, 28 November 2007 (UTC) \n Finally did it [ edit ] \n I couldn't take it any more. Sorry Basar. \n I changed it to use one book per line inspired by  this version . I don't care how it ends up but something had to get things going and this talk page is all talk with 20 dozen variants and nothing be done.  Cburnett  ( talk ) 06:02, 28 November 2007 (UTC) \n Characters [ edit ] \n Is the characters section needed in this template? I'm pretty sure there is a separate template with only the characters.  Stuart DD   contributions  20:29, 13 December 2007 (UTC) \n The thing is that the characters template is nominated for deletion. Anyway, with the Notability issues, more and more pages are merged, so it would be useless to have a template only for 13 characters and a couple of articles about groups of characters.  Lord Opeth  ( talk ) 19:30, 14 December 2007 (UTC) \n Oh Dear [ edit ] \n What has happened to the lovely template we once had? \n The gaps on the new one look dreadful. \n Sort it out! Go back to an old version that was actually good!  Btline  ( talk ) 18:28, 11 February 2008 (UTC) \n Gonna have to be more specific as to which version you're referring to. If you look above you'll find that the layout has been quite contentious...  Cburnett  ( talk ) 23:47, 11 February 2008 (UTC) \n The one above the heading \"Rowling\"  Btline  ( talk ) 13:00, 17 February 2008 (UTC) \n Btline, I don't think that was ever an actual template, just a suggestion for a possible template. Shame, though, I rather liked that one. I also think it is considerably smaller (in terms of screen size, no idea about characters etc) than our current one, and also more visually appealing. --  THE   DARK LORD   TROMBONATOR  05:42, 18 February 2008 (UTC) \n Removing redlinks [ edit ] \n I do not think that redlinks should appear in the template. The purpose of the template is to allow users to easily navigate the articles on Wikipedia relating to  Harry Potter , the red links don't ease navigation of such articles so they may not be appropriate in a navigational template. The normal reason for having redlinks in tables or lists is that it will encourage users to create the pages, in this instance there are enough editors commited to the topic that as soon as the relevent information is available the articles will be quickly created no without the links. In some ways the links are misleading as they indicate that the articles should be created even though at this stage such articles would likley be based on  original research  and not  verifiable  information from  reliable sources . Any thoughts?  Guest9999  ( talk ) 21:23, 28 February 2008 (UTC) \n You make a good point, I wont re-add them until the articles are created. (Maybe commented out until then?)  Chandler talk  21:30, 28 February 2008 (UTC)\n What articles would they be then? If some haven't been made yet you could throw some articles my way, I'll be more than glad to create them and edit them.  Lord of Moria   Talk   Contribs  21:17, 5 July 2008 (UTC)\n This is a really old topic, it was about the film, soundtrack and game for Deathly Hallows, which I guess is under consensus not to create until later as there isn't really much to go on yet. —  chan dler  — 21:20, 5 July 2008 (UTC) \n New Template [ edit ] \n Hope that you like it. It's much easier to read than the other one, I think. Comments and criticisms please! \n v \n t \n e \n The  Harry Potter  series by  J. K. Rowling \n Books \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows \n Film series \n Films \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Music \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Related \n Cast members \n Production of  The Deathly Hallows \n Characters \n Main \n Harry Potter \n Ron Weasley \n Hermione Granger \n Lord Voldemort \n Albus Dumbledore \n Severus Snape \n Rubeus Hagrid \n Draco Malfoy \n Supporting \n Hogwarts staff \n Order of the Phoenix \n Dumbledore's Army \n Death Eaters \n Fictional universe \n Hogwarts \n Magic \n Magical creatures \n Magical objects \n Ministry of Magic \n Muggle \n Places \n Potions \n Quidditch \n Related works \n Fantastic Beasts and Where to Find Them \n Quidditch Through the Ages \n The Tales of Beedle the Bard \n Prequel \n Pottermore \n The Cursed Child \n Hogwarts: An Incomplete and Unreliable Guide \n Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists \n Short Stories from Hogwarts of Heroism, Hardship and Dangerous Hobbies \n Games and toys \n Quidditch World Cup \n Lego Creator: Harry Potter \n Lego Harry Potter: Years 1–4 \n Lego Harry Potter: Years 5–7 \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Book of Spells \n Book of Potions \n Trading Card Game \n Lego  Harry Potter \n Attractions \n The Wizarding World of Harry Potter \n Orlando \n Japan \n Hollywood \n Dragon Challenge \n Flight of the Hippogriff \n Harry Potter and the Escape from Gringotts \n Harry Potter and the Forbidden Journey \n Hogwarts Express \n Harry Potter Movie Magic Experience \n Warner Bros. Studio Tour London \n Fandom \n Harry Potter Alliance \n The Leaky Cauldron \n MuggleNet \n LeakyCon \n Wizard rock \n Wrockstock \n Voldemort: Origins of the Heir \n Related \n Influences and analogues \n Legal disputes \n Parodies \n Politics \n Religious debates \n Translation \n A Very Potter Musical \n The Harry Potter Lexicon \n The Magical Worlds of Harry Potter \n Potter Puppet Pals \n   Book \n   Category \n   Portal \n Could I also ask that you DON'T change it without proper thought. And if you are going to change it, then please don't change it back to the previous one, because it was just an unorganized jumble of words! \n Asf08  ( talk ) 18:15, 14 August 2008 (UTC) \n I see no difference between this one and the supposedly \"unorganized jumble of words\" other than the fact that this one is much less visually appealing. All you have changed is the width of page taken up by the template, and the reduction of this has caused it to bunch up text that does not fit across the page (or is this my monitor's fault?). In any case, I find it  harder  to read than the original, which I consider an organised and coherent way to display such amounts of information. I am considering reverting this, but will wait for any other viewpoints. Further, it would have been more appropriate to design a new template in a user sandbox than to overwrite the existing. --  THE   DARK LORD   TROMBONATOR  23:34, 14 August 2008 (UTC) \n Most of navboxes are in full-width format. Also, sorting characters and lists into \"Main\" and \"Supporting\" is rather subjective. Who says that Luna alone is more important to the plot than all of the Death Eaters alone and as an organization? And one more addition: the titles of \"Spin-off canon\" move when they become bold (when the article is visited) and the sub-section has three lines and only four articles listed. -- LøЯd   ۞pεth  04:54, 17 August 2008 (UTC) \n Fansites [ edit ] \n Anyone thinks this template should mention the Harry Potter fansites (those notable ones that have articles, as listed at  Category:Harry Potter websites ). I think this is an important part of Wikipedia coverage of Harry Potter. Comments? -- PeaceNT  ( talk ) 10:57, 15 August 2008 (UTC) \n I disagree with your idea, as fansites aren't part of the franchise and have nothing to do with it.  Jammy  ( talk ) 16:28, 15 August 2008 (UTC) \n I don't think everything in this template is part of the franchise. Also,  Harry Potter Fandom  is mentioned and the fansites can be considered related, too. Was just thinking a comprehensive template may make easier navigation... -- PeaceNT  ( talk ) 02:42, 16 August 2008 (UTC) \n Interesting idea...I don't feel strongly either way, but I wouldn't mind if sites such as the  Harry Potter Lexicon  and  MuggleNet  were added.  faithless   ( speak )  02:44, 16 August 2008 (UTC) \n I disagree with it. They are not part of the fictional universe and are not part of the franchise as well. The related section should only list general and main matters. For example, the list of cast members instead of listing every actor, or the HP fandom article instead of listing all websites and HP derived bands. -- LøЯd   ۞pεth  04:49, 17 August 2008 (UTC) \n Cast section? [ edit ] \n Should there be a section for cast (Radcliffe, Grint, Watson, etc.) of the films? I'm not necessarily saying that I think there should be, just that it should be brought up.  faithless   ( speak )  18:27, 19 December 2008 (UTC) \n If you ask me, most definitely not. It sounds like a good idea but it will soon become unwieldy, especially considering the templates already-too-large size. Plus we already have  List of Harry Potter cast members , which will always be much more complete.  Mr. Absurd  ( talk ) 19:12, 19 December 2008 (UTC)\n I would tend to agree with you; it's also probably worth mentioning that comparable templates (i.e.  Template:The Lord of the Rings  and  Template:Star Wars ) do not have such a section. However, I have seen a few that do (from admittedly smaller series) - I just figured it was worth at least discussing. :-)  faithless   ( speak )  20:10, 19 December 2008 (UTC)\n No, I see your point—it's good to bring it up.  Mr. Absurd  ( talk ) 21:33, 19 December 2008 (UTC) \n Template far too wide [ edit ] \n Can someone fix this please. IMO the only real way is to remove the seven column and go back to 7 lines. See  Portal talk:Harry Potter#Harry Potter navbox  --  SGBailey  ( talk ) 22:49, 21 January 2010 (UTC) \n I've addressed this issue-- 71.187.173.34  ( talk ) 06:35, 26 June 2010 (UTC) \n --Via linebreaks within the book titles.-- 71.187.173.34  ( talk ) 02:51, 28 June 2010 (UTC) \n It is too wide again. Needs fixing by someone who understands the formatting better than I. But i'll have a go if noone else does it in the near future... --  SGBailey  ( talk ) \n   Done  I have changed the column widths. Hope that does the trick.  Apuldram  ( talk ) 11:19, 18 March 2013 (UTC) \n Problem with template [ edit ] \n I am the only one noticing that the template has 7 groups but only shows 6? The Attractions section is not seen. Can some admin fix this? -- LoЯd   ۞pεth  02:27, 12 July 2011 (UTC) \n {{ Navbox with columns }} only supports a maximum of 6 groups, so you'll need to seek an increase there or regroup the articles in this template.  Bencherlite Talk  06:33, 12 July 2011 (UTC) \n   Done . :)  Edenc1  •  Talk  11:11, 12 July 2011 (UTC) \n Watford Junction [ edit ] \n Does anyone think the template should include a page about the tour in Watford Junction?-- TimothyJacobson  ( talk ) 22:08, 10 May 2012 (UTC) \n Just realised I made very little sense with the above comment. I meant, should the template include a link to this page:  http://en.wikipedia.org/wiki/Warner_Bros._Studios,_Leavesden  ? I am leaning toward \"NO\" at the moment, seeing as the Dr Who template doesn't have a link to their similar exhibit in Earl's Court. Also, as the Leavesden page isn't solely about the Potter tour, although I feel a page maybe should be made about this tour. Thoughts?-- TimothyJacobson  ( talk ) 22:13, 10 May 2012 (UTC) \n I added Attraction:  Warner Bros. Studio Tour London  which redirects to the appropriate section of the \"Leavesden\" article ({{ R to section }}). \n That template documentation shows to handle this, the only real problem you have mentioned in my opinion. The Studio Tour certainly is worth naming and section-linking as a Harry Potter attraction. (The linked \"Attractions\" include particular rides within HP theme sections within amusement parks.) And I doubt that a separate page is warranted. \n -- P64  ( talk ) 19:11, 18 March 2013 (UTC) \n Wonderbook Book of Spells [ edit ] \n I believe the Wonderbook Book of Spells game should appear in the list of games on the template now.  68.53.225.204  ( talk ) 06:53, 23 November 2012 (UTC) \n   Done .  Edenc1  •  Talk  11:13, 23 November 2012 (UTC) \n Formatting of columns for each book [ edit ] \n The columns for each story currently have links under the book title to the corresponding film, soundtrack, and game. In the case of Deathly Hallows, these three links are each on a different line, whereas the other columns have film and soundtrack on one line and game on the line below. Not sure if there necessarily needs to be a column for Cursed Child, but when that column was created a few days ago, the Goblet of Fire column also switched to three lines, one for each media type. For uniformity's and aesthetic pleasure's sakes, should we set each column to have three lines, one for film, another for soundtrack, and a third for game? The \"third line\" for the first six stories is just an empty space at this point, so I figured maybe we can make it look nicer and more uniform. Then, whether Cursed Child gets a column of its own or not, the columns will look fairly similar. - RM  ( talk ) 14:48, 11 June 2016 (UTC) \n the multi-column format is very bad, especially on a narrow screen. we should reformat the navbox to use standard groups/lists.  Frietjes  ( talk ) 16:58, 10 July 2016 (UTC)\n I agree that something should be done, but I'm not sure the standard format works either. It'd leave four groups in a row with almost exactly the same content. — Flax5  14:15, 31 July 2016 (UTC)\n Would people prefer something like  this ? — Flax5  11:04, 8 August 2016 (UTC)\n no objections, so done.  Frietjes  ( talk ) 14:29, 5 September 2016 (UTC)\n Sorry for coming late to the party, but I think a separate group for the films (which would include the soundtracks) would be more appropriate. -- Rob Sinden  ( talk ) 15:04, 5 September 2016 (UTC)\n Would the games also be given a second line, or be kept with the films, which they're also derivative of? (Trying to spatially represent 31 works which only have seven names between them is such a weird problem!) — Flax5  15:35, 5 September 2016 (UTC)\n I'd be inclined to put the games in the \"Games and toys\" section. However this is done, I think it's important to separate the books from the films. -- Rob Sinden  ( talk ) 15:40, 5 September 2016 (UTC) \n Something like  this , but we can lose some of the \" Harry Potter and... \". -- Rob Sinden  ( talk ) 15:58, 5 September 2016 (UTC) \n I did  this  is one of my sandboxes for practise and I agree that it ends up a little wonky with so many columns. I think  this  version is definitely the best. *Trekker  ( talk ) 07:44, 30 October 2016 (UTC) \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Template_talk:Harry_Potter&oldid=746903740 \"\t\t\t\t\t \n Categories :  Template-Class novel articles NA-importance novel articles Template-Class Harry Potter articles NA-importance Harry Potter articles Harry Potter task force articles Template-Class children and young adult literature articles NA-importance children and young adult literature articles   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Template Talk   \n Variants \n Views \n Read Edit New section View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information   \n Print/export \n Download as PDF   \n Languages \n  This page was last edited on 30 October 2016, at 07:44. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}