{"url": "https://www.reuters.com/article/us-reviews-film-harrypotter/review-harry-potter-goes-out-with-magical-and-dark-bang-idUSTRE76609Z20110707", "content": "Review: Harry Potter goes out with magical, and dark, bang | Reuters \n Discover Thomson Reuters Financial Government Solutions Legal Reuters News Agency Risk Management Solutions Tax & Accounting Blog: Answers On Innovation @ Thomson Reuters Directory of sites Login Contact Support Review: \"Harry Potter\" goes out with magical, and dark, bang Sections Business Markets World Politics Tech Commentary Breakingviews Money Life Pictures Reuters TV Discover Thomson Reuters Financial Government Solutions Legal Reuters News Agency Risk Management Solutions Tax & Accounting Blog: Answers On Innovation @ Thomson Reuters Directory of sites Login Contact Support Featured The wider image Trading inside the Rohingya camps Commentary What Merkel’s political woes mean for the EU Reuters Backstory The resignation – and return – of Lebanon's Hariri Pictures Reuters TV United States Africa América Latina عربي Argentina Brasil Canada 中国 Deutschland España France India Italia 日本 México РОССИЯ United Kingdom United States #Film News July 7, 2011 /  1:12 AM / in 6 years Review: \"Harry Potter\" goes out with magical, and dark, bang Alonso Duralde 5 Min Read LOS ANGELES (TheWrap) - With the million awful, tacky, shrill, stupid, condescending, tasteless, “Eragon”-y things that could have gone wrong over the 10 years and eight movies that brought J.K. Rowling’s mega-popular Harry Potter series to the big screen, it’s practically a statistical anomaly that the final entry, “Harry Potter and the Deathly Hallows, Part 2,” brings its A-game from start to finish.   <p>Britain's Emma Watson poses with Daniel Radcliffe (L) and Rupert Grint as they arrive for the world premiere of \"Harry Potter and the Deathly Hallows: Part 1\" at Leicester Square in London November 11, 2010. REUTERS/Stefan Wermuth</p>\n It’s something akin to finding a herd of eight adorable, cotton-candy-pooping unicorns.   This far into the story, screenwriter Steve Kloves (who adapted all but one of Rowling’s seven Potter novels) doesn’t have to explain the stakes (Voldemort and his Death Eaters are poised to take over the magical world and destroy Muggle-kind) or the characters or the plot mechanics.   “Deathly Hallows, Part 2” even opens with long, silent shots of Voldemort (Ralph Fiennes) and Snape (Alan Rickman) staring significantly out different windows, and after the introduction of so many characters and places and magical devices over the years, the actors and the audience alike have earned a bit of silence.   But there’s little time for introspection.   Harry (Daniel Radcliffe), Hermione (Emma Watson) and Ron (Rupert Grint) are still out to find and destroy the various horcruxes that contain pieces of Voldemort’s soul, but thankfully, the endless, gloomy-teen campout sequences of “Deathly Hallows, Part 1” are behind us. Their quest takes them everywhere from the cavernous and deadly vaults at Gringott’s bank to the halls of Hogwarts.   This once-cheery castle, perhaps the movies’ ultimate British boarding school, has the somber feel of an occupied fort. The forces of darkness are in charge, and they’ve cast a pall over everything, even the usually indefatigable Professor McGonagall (Maggie Smith).   In other words, things have gotten way, way darker since “Harry Potter and the Sorcerer’s Stone” back in 2001. Major characters have been dying ever since Robert Pattinson got snuffed in “Goblet of Fire,” but the body count has never been as high as it is this time. Parents whose young children haven’t already read the books and aren’t prepared for what’s coming might think twice about this one.   As if to give fans one last look at every corner of this world, Kloves’ script calls back almost every element of the wizarding world we’ve come to know: From Gringott’s to Olivander’s wand shop to the Honeydews candy store to the Room of Requirement, places that have played key roles in the plot all come up yet again. (Even the Sorting Hat from the first film makes another appearance.)   Similarly, there’s a seemingly endless parade of movie stars (Smith, Fiennes, Helena Bonham Carter, Emma Thompson, Jim Broadbent) and Potter stars (particularly Matthew Lewis’ Neville Longbottom) on display as well.   If there’s one substantial flaw to the film, it’s that this cavalcade of people and places and objects can barely fit in the 130-minute running time. Looking forward to the emotional culmination of the courtship between Harry and Ginny Weasley (Bonnie Wright)? Well, tough.   Characters in the movie are sacrificing themselves for the greater good, and characters are getting sacrificed from the script for more daily showtimes.   Trying to keep tabs on, say, the older Weasleys or the Hogwarts faculty is like trying to spot your favorite singer getting one line during an Aretha Franklin tribute at the Grammys.   As such, the actors here have to make the most of their fleeting moments, and they consistently do. What the post-Potter careers of Radcliffe, Watson and Grint will be like is anyone’s guess, but at this point they know how to take these particular characters to the bridge without breaking a sweat. Alan Rickman gets to show us many sides of Snape, and he’s as compelling as always, even when the flashbacks use some freaky age-erasing special effects that leave his face looking odd.   Bonham Carter’s Bellatrix Lestrange is as goth-gorgon as ever, but she has some fun with some early scenes in which she gets to portray the Hermione-on-polyjuice-potion version of the character. And during the film’s big climactic battle, Smith and Julie Walters get some tasty moments that make their relatively small roles over the course of the series worthwhile.   Thankfully, there’s more to “Deathly Hallows, Part 2” than just the simple tying-up of loose ends. Even after everything he’s endured in his years at Hogwart‘s, Harry continues to learn secrets about his past, including a heretofore-unrevealed backstory of a certain character that makes for an interesting twist.   If you have no affection for these British teen wizards, of course, this is not the movie that’s going to make you change your mind. But if you’ve been a devoted follower of the Potter saga in print and at the movies, you’ll come away from this final chapter with a feeling of catharsis and, perhaps, a slightly damp handkerchief. Our Standards: The Thomson Reuters Trust Principles. 0 : 0 narrow-browser-and-phone medium-browser-and-portrait-tablet landscape-tablet medium-wide-browser wide-browser-and-larger medium-browser-and-landscape-tablet medium-wide-browser-and-larger above-phone portrait-tablet-and-above above-portrait-tablet landscape-tablet-and-above landscape-tablet-and-medium-wide-browser portrait-tablet-and-below landscape-tablet-and-below Apps Newsletters Reuters Plus Advertising Guidelines Cookies Terms of Use Privacy All quotes delayed a minimum of 15 minutes. See  here for a complete list  of exchanges and delays. ©  2017   Reuters. All Rights Reserved."}