{"url": "https://m.wikihow.com/Avoid-Getting-a-Computer-Virus-or-Worm", "content": "How to Avoid Getting a Computer Virus or Worm (with Pictures) \n Home Random Browse Articles Add to This Page Add Tip Easy Ways to Help Approve Questions Review Tech Feedback Fix Spelling More Things to Try...   \n Log in / Sign up   \n Desktop Site   \n Reader Approved How to Avoid Getting a Computer Virus or Worm   \n The internet is a vital part of many lives, and some of us use it constantly throughout the day. But that constant usage has increased the risk of infection by viruses and malware, leading to potential data loss and identity theft. Every internet user should be versed in how to prevent virus infection and what to look for. Think of it as a driver's manual for the internet superhighway. Armed with the knowledge to avoid getting and spreading virus infections, you'll not only make the internet safer for yourself, but for everyone else you connect with. \n Steps Edit \n Part One of Four: Browsing Safely Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/98\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-1-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-1-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/9\\/98\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-1-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Avoid clicking on everything.  There are thousands of banner ads and popups on the internet that are designed to get your attention and make you click. Due to the way most modern browsers work, there are very few ways for you to get infected with something online UNLESS you click on it yourself. This means you should avoid clicking on banners for offers that are too good to be true.\n Make sure your browser is configured to always ask before running files and downloading automatically. If you have to confirm everything, you are much less likely to get infected. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/54\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-2-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-2-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/54\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-2-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Beware of misleading popups.  Some of the most nefarious popups on the internet are designed to mimic the look of legitimate anti-virus software. These popups attempt to trick the user into thinking their antivirus software has found an infection. When you click the popup, however, the adware is actually installed.\n Instead of clicking the warning, close the popup window and open the antivirus program on your computer. You most likely will not see any warnings. If you are still worried, run a scan using your installed software. \n Don't try clicking the \"X\" to close the popup window, as this will usually lead to more popups. Instead, use the  Task Manager  to get rid of it.Alternatively you can install adblock plus to prevent ads appearing in the first place [1] \n Other popups may warn of an infection that only their software can fix. No legitimate antivirus company will advertise their product this way, so avoid clicking on any of these popups. \n Check to ensure that your browser is configured to block popups. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/24\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-3-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-3-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/2\\/24\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-3-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Clear your cache.  Popups can store information in your browser's cache, leading to them reappearing constantly. To help prevent this,  clear your browser’s cache  regularly.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b3\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-4-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-4-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/b\\/b3\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-4-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Consider a different browser.  If you are using Internet Explorer or an older browser such as Netscape or Safari for Windows, you may be leaving yourself exposed to security risks. Browsers such as Firefox, Chrome, and Opera are much more secure than older browsers, and more customizable. Firefox, for example, has a large array of  privacy- and security-related add-ons  that will help protect you online.\n If you don't want to switch browsers, make sure that it is always  up to date  to help prevent unauthorized attacks. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/11\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-5-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-5-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/11\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-5-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Don't go where you're not supposed to.  As viruses are illegal, they thrive on other illegal sites. Avoid sites that let you download copyrighted content or other illegal communities. File sharing is a quick way to get infected files. You will find that your computer is much less prone to infection if you avoid things you shouldn't be doing.\n Besides viruses from files you download, many of these sites will have a litany of annoying popups and misleading advertisements. All of these could lead to virus and spyware infection. \n Advertisement \n Part Two of Four: Handling Downloaded Files Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c2\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-6-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-6-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/c\\/c2\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-6-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Be selective with your downloads.  There are programs available for nearly every task you can think of, but ask yourself if you really need the program that you are about to download. Do a little research about your task; you may find that you already have a program capable of what you want to do. Downloading extra programs for every task you want to complete increases the likelihood that you'll download something malicious. [2] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f6\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-7-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-7-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/f\\/f6\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-7-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Download from trusted locations only.  If you are downloading a program or other piece of software, it is always advisable to try to download it from the developer's site as opposed to a download service. Many of these services install their own download managers, and can infect your browser with adware.\n Downloading illegal files or watching pornography will always be a lottery when it comes to getting viruses and worms. If you can, download from \"trusted\" sources in the community to reduce the risk of infection. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/dd\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-8-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-8-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/dd\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-8-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Look at the extension.  Mischievous files often have fake extensions designed to trick you, such as \".txt.vb\" or \".jpg.exe\". Windows will often hide common file extensions to make browsing through your files and programs more visually appealing. Double extensions exploit this by hiding the second, dangerous extension. If you normally don't see extensions on your computer and it all of a sudden appears on a file that you've downloaded, you may have downloaded a malicious file that is hiding as something else.\n To make your file extensions visible, open Windows Explorer, click the View tab/menu and select Options. Click the View tab in the Folder Options window, and uncheck the \"Hide extensions for known file types\" box. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/20\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-9-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-9-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/2\\/20\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-9-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Scan your downloaded files.  If you have an antivirus program installed, you should make a habit of scanning files that you've downloaded from unknown locations. Most antivirus programs allow you to immediately scan specific files by right-clicking on the file and selecting your antivirus from the list of options.\n Always scan ZIP files as these often contain multiple files in one archive. \n Email programs will often scan your email files for viruses automatically, but you should still scan any downloaded files with your own antivirus program. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/db\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-10-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-10-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/db\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-10-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Don't open anything you don't trust completely.  A virus or worm can do nothing unless you actually run the program that it is attached to. That means that simply downloading a file does not put you in any real danger. If you decide after downloading that you don't exactly trust the file, avoid opening it or delete it until you can confirm its integrity.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/50\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-11-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-11-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/50\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-11-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Read the license agreement.  You know those legal documents that you always blindly accept when installing a program? Well, shady companies like to use the fact that most people skip them to sneak in clauses about installing spyware and other malicious software. Make sure to take the time to read these agreements, especially from companies that you've never heard of before.\n Advertisement \n Part Three of Four: Dealing with Emails Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/0e\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-12-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-12-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/0e\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-12-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Don't download attachments from a source you don't know.  Email attachments are the number 1 way that viruses and other malware get spread. You should never click an attachment or link in an email from someone you don't recognize. If you are unsure of the sender, get confirmation from them that the file is legitimate before downloading it.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-13-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-13-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/9\\/97\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-13-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Don't download attachments from a source you DO know unless you were expecting it.  Many times people will get infected with viruses that send emails without their knowledge. This means you can receive email from trusted sources but the email itself is not trustworthy. If the writing is odd or the attachment looks off, do not click it. Verify with the person that they intended to send you the attachment you received.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/73\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-14-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-14-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/73\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-14-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Disable image previews.  Many email applications can automatically load images for convenience, but this can leave you more vulnerable, as images can contain malicious code. You should only download the images in an email from a trusted source.\n Note: Some services have started changing way email images are handled, making image loading safer. For example, Gmail no longer disables images on default. Check with your mail provider for the best practices on their service. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2b\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-15-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-15-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/2\\/2b\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-15-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Beware of odd emails from companies you do business with.  A popular phishing technique is to copy the style of a company email and include links that look similar to the regular URL, but instead send you to a fake site (\"povver\" instead of \"power\", for example). These sites then collect personal information that you though was going to a trusted server.\n Any legitimate company will never ask you for passwords or other personal information through email. [3] \n Advertisement \n Part Four of Four: Protecting Yourself Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/13\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-16-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-16-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/13\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-16-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Install an antivirus program.  An antivirus program will actively protect your computer from virus infections by scanning active programs and performing scheduled full-system scans. There are free antivirus programs that come with basic virus protection, such as AVG, Bitdefender, and Avast, and there are paid programs that come with other internet security protections such as firewalls and anti-phishing measures. Paid programs include Norton, Kaspersky, and paid versions of free antivirus options.\n You should only have one antivirus installed at a time in order to avoid conflicts between them. \n Make sure that your antivirus gets updated at least every week. \n Scan your computer at least weekly, more often if you are heavy internet user. \n An antivirus program is not a foolproof system, and should not replace good browsing habits and common sense. [4] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/dc\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-17-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-17-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/d\\/dc\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-17-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Install an anti-spyware program.  Beyond viruses, your computer can also get infected with spyware and adware. These programs are difficult to exterminate and often hijack your browsing experience. They also make your computer more susceptible to future infection. Most antivirus programs do not scan for or remove spyware and adware.\n Popular programs include Malwarebytes, Spybot S&D, HitmanPro, and Adw Cleaner. \n You can have multiple anti-spyware programs installed at once. More programs means you are more likely to catch offending spyware. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-18-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-18-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/e\\/ef\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-18-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Enable a firewall.  Firewall software protects your networks ports, which are the \"doors\" facing the internet that allow data to be sent back and forth. Windows comes with firewall software already installed and enabled, which is usually more than enough for most home users. There are a variety of companies that offer more powerful and customizable software as well. Most of these are the same companies that provide paid antivirus software.\n Firewalls are also available in hardware form. \n You can only have one firewall enabled at a time. If you install a software or hard firewall, you'll need to disable the Windows firewall. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/19\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-19-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-19-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/19\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-19-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Keep Windows updated.  Many viruses and other malicious programs exploit holes in the Windows software. These holes are quickly patched by Microsoft, and updates are made available for all legitimate copies of Windows. if you don't keep your copy of Windows updated, your system will be much more exposed. In order to ensure that you're always protected, make sure that Windows is  set to update automatically . [5] \n If you are using Windows XP, upgrade immediately. Support for Windows XP will end on April 8, 2014. This means that any exploitable cracks found after that date will no longer be fixed, and Windows XP will become very insecure. For more information on upgrading, see  this article for upgrading to Windows 7 , and  this article for upgrading to Windows 8 . \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/64\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-20-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-20-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/64\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-20-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Be careful with USB drives.  USB drives are a popular vehicle for virus transmissions, usually without the owner being aware at all. You could get an infection just by inserting the USB drive in your computer (if autoplay is enabled for removable media, which it is by default), or you could get your USB drive infected by plugging it into a public computer (or even a friend's unprotected computer) that might already be infected, especially if many unknown people connect their USB drives to the computer. You can use other methods for file sharing, such as online storage or email to send files. Or you can disable autoplay for removable media on your PC which will prevent your PC getting infected automatically via USB and make sure you scan the drive with your antivirus after you plugged it into a strange computer (if you are an advanced user you can check if the autorun.inf file on the drive was edited and if there is an open command in it that links to the virus (Make sure show hidden and system files is enabled) or if all the real files on the drive was were hidden and replaced by shortcuts with the same name that link to the virus). You can disable autoplay for USB drives by searching for autoplay settings or going to Control Panel > Default Programs > Change autoplay settings, then uncheck use AutoPlay for all media and devices, then go to removable drive and say take no action. This is an easy way to prevent inadvertently getting a virus by sticking an infected drive in your computer and from spreading a USB virus, however this will not prevent your USB drive from getting infected if you stick it in a strange computer. So make sure you scan it regularly or even set an icon for the drive in the autorun.inf file and if the icon disappears you know your drive has been infected.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5b\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-21-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-21-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/5b\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-21-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Be wary about remote access.  In our more connected world, remote access and remote sharing of resources has become much more prevalent. While this can be great for productivity, it does put your personal machine at more risk if there are a variety of other machines connecting directly to it. Ask yourself if you need that remote connection, and always ensure that your protection software is up to date.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/93\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-22-Version-2.jpg\\/v4-460px-Avoid-Getting-a-Computer-Virus-or-Worm-Step-22-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/9\\/93\\/Avoid-Getting-a-Computer-Virus-or-Worm-Step-22-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 7 \n Keep a good backup.  If disaster strikes, you don't want to be left without your important data. A regular backup schedule will mitigate any damage done by a virus, and will allow you to get up and running much quicker. There are a  variety of ways that you can go about backing up your data , both locally and remotely. [6] \n Advertisement \n Community Q&A \n Search \n Add New Question \n When you say to update your software, does that mean I should upgrade my computer to Windows 10? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\t Denneisk   \n Not at all. It simply means to update security software that Microsoft releases for Windows. You can also update browsers, plug-ins, anti-virus software and such to make sure there are no holes or ways viruses can get in. \n Thanks! \n 6 \n 1 \n How do viruses work? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\t Denneisk   \n A computer virus works by entering the system, usually by a Trojan horse where the virus pretends to be a safe software, and then goes on to infect other software. A virus can upload information to the internet or to the host, the creator of the virus, and can slow down your computer. The virus also tries to latch onto any drive such as a USB drive and can even transport itself into another computer on the same network. \n Thanks! \n 4 \n 1 \n I get these weird pop-ups saying that my browsers have been infected with viruses, but every time I download some antivirus app it says my phone is just fine. What is going on with it? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\t MidnightSkies   \n It is probably a scam. Scammers tend to say that your device has viruses so that you can call them, and they will get into your system, and then they will access your info. That app may actually give you a virus, or do nothing.  \n Thanks! \n 2 \n 0 \n Why do I get viruses when I download something, even on safe websites?  \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\t MidnightSkies   \n Sometimes, you can still get viruses, even on safe websites. That \"safe\" website may not actually be safe. I recommend you get an anti-virus app, which can remove it, or if you know someone who can remove viruses, maybe ask them. \n Thanks! \n 1 \n 0 \n Ask a Question \n 200 characters left \n Submit \n Tips Edit \n Keep a recent backup of your personal files. This will come in handy should you get infected with a program that deletes your files, or prevents you from accessing them. \n 1 \n Helpful? \n   0 \n Remember: if it seems suspicious, it probably is. \n 1 \n Helpful? \n   0 \n Delete your browser's temporary internet files every day. \n 2 \n Helpful? \n   0 \n If you are fixing simple errors like a blue screen, simply shut it off and reboot it after 10 seconds. \n 1 \n Helpful? \n   0 \n Don't do any surveys that look suspicious and never, ever give  any  money away to something better than usual. \n 1 \n Helpful? \n   0 \n Do NOT give out your password. \n 1 \n Helpful? \n   0 \n Most downloads from \"Softonic\" and \"Softpedia\" contain malware. \n 1 \n Helpful? \n   0 \n Add \n Warnings Edit \n If you don't keep a good backup of your files, you risk losing everything when a virus or spyware hits. Scan your computer once in a while. \n 43 \n Helpful? \n   4 \n Related wikiHows Edit \n How to  Delete Adware Threats That Norton Antivirus Can't Delete \n How to  Become Computer Literate \n How to  Remove a Virus \n How to  Secure Your PC \n How to  Recognize a Computer Virus Infection \n How to  Minimise Security Risks from Hackers and Crackers \n How to  Create a Virus \n How to  Remove Adware Manually \n How to  Locate Viruses Using the Attrib Command \n How to  Stop Redirects \n Advertisement \n About This Article \n How helpful is this? \n\t\t\t\tCo-authors:   102 \n Updated:  \n\t\t\t\tViews:  471,614 \n\t\t\t\tCategories:  Spyware and Virus Protection \n Sources and Attribution \n Reader Success Stories \n\t\t\t\t\t\tOB\n Owen Bentley \n Nov 23, 2016 \n\t\t\t\t\"This article helped me because I had to write an essay about trying to avoid viruses, so thank you.\"\n\t\t\t\t\t\tAS\n Ann Sweatman \n Jul 24, 2016 \n\t\t\t\t\"This article has very clear, concise information that is easy for even a beginner to understand.\"\n\t\t\t\t\t\tAM\n Ashlee Mcghee \n Aug 4, 2016 \n\t\t\t\t\"This article helped me look up things I needed for a middle school project.\"\n\t\t\t\t\t\tCS\n Clifton Small \n Aug 15, 2016 \n\t\t\t\t\"Great information for anyone to know about.\"\n\t\t\t\t\t\tMN\n Mitchisabell Nyakairma \n May 1, 2016 \n\t\t\t\t\"Exactly what I was looking for. I'm happy.\"\n\t\t\t\t\t\tA.\n Anonymous .. \n Jul 30, 2016 \n\t\t\t\t\"This may come in handy.\"\n More reader stories \n All reader stories \n Hide reader stories \n Share your story \n Is this article up to date? \n Yes \n No \n\t\t\t\tNo\n\t\t\t\t\t\t{{questionText}}\n\t\t\t\t\t\t{{currentMethod}}\n\t\t\t\t\t{{cheerText}}\n\t\t\t\t\t{{oopsText}}\n\t\t\t\tYes\n Share \n Browsing Safely Handling Downloaded Files Dealing with Emails Protecting Yourself Community Q&A Tips Warnings Related wikiHows \n Surprise Me! \n 299"}