{"url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/consistent-behavior-no-extreme-changes-context.html", "content": "Understanding Success Criterion 3.2.5  | Understanding WCAG 2.0\n    \t\t\t\t Understanding WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  SC  3.2.4 [Consistent Identification] Next:  Guideline  3.3 [Input Assistance] On this page: Intent Examples Related Resources Techniques & Failures Key terms   -   Change on Request : Understanding  SC  3.2.5 \n 3.2.5  Change on Request: \n Changes of context  are initiated only by user request or a  mechanism  is available to turn off such changes. \n\t\t\t\t\t(Level AAA)\n\t\t\t\tIntent of this Success Criterion\n\t\t\t The intent of this Success Criterion is to encourage design of Web content that gives users full control of changes of context. \n            This Success Criterion aims to eliminate potential confusion that may be caused by unexpected changes of context such as automatic launching of new windows, automatic submission of forms after selecting an item from a list, etcetera. \n            Such unexpected changes of context may cause difficulties for people with motor impairments, people with low vision, people who are blind, and people with certain cognitive limitations.\n           Some types of change of context are not disruptive to some users, or actively benefit some users. For example, single-switch users rely on context changes that are animated by the system, and the preferences of low-vision users may vary depending on how much of the content they can see at once and how much of the session structure they can retain in working memory. Some types of content, such as slide shows, require the ability to change context in order to provide the intended user experience. Content that initiates changes of context automatically only when user preferences allow can conform to this Success Criterion.\n           Note:  It is possible for more than one change of context to occur simultaneously. For example, clicking on a link which automatically opens a new window is an example of two separate changes of context related to the change in content and to the change in the viewport (window). The change in the content in this case is initiated by user request when they click on the link, but unless the user can be aware that the link will open in a new window then that change of context cannot be regarded as user-initiated. \n\t\t\t\tSpecific Benefits of Success Criterion 3.2.5:\n\t\t\t Individuals who are unable to detect changes of context or may not realize that the context has changed are less likely to become disoriented while navigating a site. For example: individuals who are blind or have low vision may have difficulty knowing when a visual context change has occurred, such as a new window popping up. In this case, warning users of context changes in advance minimizes confusion when the user discovers that the back button no longer behaves as expected. \n                     Some individuals with low vision, with reading and intellectual disabilities, and who have difficulty interpreting visual cues may benefit from additional cues in order to detect changes of context. People with certain  cognitive limitations  do not get confused if automatic redirects are performed by the Web server instead of the browser. \n\t\t\t\tExamples of Success Criterion 3.2.5 \n an \"update now\" button \n  Instead of automatically updating the content, the author provides an \"Update now\" button that requests a refresh of the content.\n An automatic redirection \n A user is automatically redirected from an old page to a new page in such a way that he or she never realizes the redirect has occurred.\n\t\t\t\tRelated Resources\n\t\t\t Resources are for information purposes only, no endorsement implied. \n Use standard redirects: don't break the back button!  ( W3C \n QA  Tip).\n HTTP/1.1 Status Code Definitions: Redirection 3xx .\n\t\t\t\tTechniques and Failures for Success Criterion 3.2.5 - Change on Request Each numbered item in this section represents a technique or combination of techniques that the  WCAG  Working Group deems sufficient for meeting this Success Criterion. However, it is not necessary to use these particular techniques. For information on using other techniques, see  Understanding Techniques for WCAG Success Criteria , particularly the \"Other Techniques\" section. \n\t\t\t\tSufficient Techniques  \n\t\t\t Instructions:  Select the situation below that matches your content. Each situation includes techniques or combinations of techniques that are known and documented to be sufficient for that situation. \n   Situation A: If the Web page allows automatic updates: \n G76: Providing a mechanism to request an update of the content instead of\n          updating automatically \n   Situation B: If automatic redirects are possible: \n SVR1: Implementing automatic redirects on the server side instead of on the\n                    client side  (SERVER)\n G110: Using an instant client-side redirect  using one of the following techniques:     \n H76: Using meta refresh to create an instant client-side redirect   (HTML)\n\t\t\t\t\t\t\t\t\t\t\t                Situation C: If the Web page uses pop-up windows: \n Including pop-up windows using one of the following techniques:     \n H83: Using the target attribute to open a new window on user request and indicating this in link text   (HTML)\n SCR24: Using progressive enhancement to open new windows on user request   (Scripting)\n\t\t\t\t\t\t\t\t\t\t\t                Situation D: If using an onchange event on a select element: \n SCR19: Using an onchange event on a select element without causing a change of\n                    context   (Scripting)\n\t\t\t\t Additional Techniques (Advisory) for 3.2.5 Although not required for conformance, the following additional techniques should be considered in order to make content more accessible. Not all techniques can be used or would be effective in all situations. \n                  Opening new windows by providing normal hyperlinks without the target attribute (future link), because many user agents allow users to open links in another window or tab.\n G200: Opening new windows and tabs from a link only when necessary \n\t\t\t\t Common Failures for  SC  3.2.5 The following are common mistakes that are considered failures of Success Criterion 3.2.5 by the  WCAG  Working Group. \n F60: Failure of Success Criterion 3.2.5 due to launching a new window when a user enters\n                    text into an input field \n F61: Failure of Success Criterion 3.2.5 due to complete change of main content through an\n                    automatic update that the user cannot disable from within the content \n F9: Failure of Success Criterion 3.2.5 due to changing the context when the user removes\n                    focus from a form element \n F22: Failure of Success Criterion 3.2.5 due to opening windows that are not requested by the\n                    user \n F52: Failure of Success Criterion 3.2.1 and 3.2.5 due to opening a new window as soon as a new page is loaded \n F41: Failure of Success Criterion 2.2.1, 2.2.4, and 3.2.5 due to using meta refresh to reload the page \n Key Terms   changes of context major changes in the content of the  Web page  that, if made without user awareness, can disorient users who are not able to view the entire page simultaneously Changes in context include changes of: \n user agent ; \n viewport ; focus; \n content  that changes the meaning of the  Web page . Note:  A change of content is not always a change of context. Changes in content, such as an expanding outline, dynamic menu, or a tab control do not necessarily change the context, unless they also change one of the above (e.g., focus). Example:  Opening a new window, moving focus to a different component, going to a new page (including anything that would look to a user as if they had moved to a new page) or significantly re-arranging the content of a page are examples of changes of context.   mechanism \n process  or technique for achieving a result Note 1:\n\t\t\t\t\t The mechanism may be explicitly provided in the content, or may be  relied upon  to be provided by either the platform or by  user agents , including  assistive technologies . Note 2:\n\t\t\t\t\t The mechanism needs to meet all success criteria for the conformance level claimed. \n               Top Contents Intro Previous:  SC  3.2.4 [Consistent Identification] Next:  Guideline  3.3 [Input Assistance] This Web page is part of  Understanding WCAG 2.0: A guide to understanding and implementing WCAG 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}