{"url": "http://www.telegraph.co.uk/business/2016/05/23/ship-ahoy-new-video-shows-scale-of-britains-new-aircraft-carrier/", "content": "Inside Britain's biggest-ever aircraft carrier HMS Queen Elizabeth \nPremium\nNews\nPolitics\nSport\nBusiness\nMoney\nOpinion\nObituaries\nTravel\nTech & Science\nCulture\nFilm\nTV\nLifestyle\nFashion\nLuxury\nCars\nVideo\nFree Mobile App\nJobs\nFinancial Services\nTutors\nRewards\nEvents\nDating\nOffers\nShop\nGarden Shop\nBookshop\nBox Office\nPuzzles\nFantasy Football\nWine Shop\nWork at The Telegraph\nTelegraph Corporate\n Search \n Video \n Rewards \n Upgrade to Premium \n My Account \n My details \n My newsletters \n Logout \n Upgrade to Premium \n Search \n Video \n Rewards \n Subscribe - 30 days free \n Login \n Register \n Search \n Video \n Rewards \n My Account \n My details \n My newsletters \n Logout \nHome\nNews\nSport\nBusiness\n ALL SECTIONS \n Business \nEconomy\nCompanies\nOpinion\nOpen economy\nMarkets\nAlex\nTelegraph Connect\nEvents\nNewsletter\nMore\n Telegraph \n Business \nInside Britain's biggest-ever aircraft carrier HMS Queen Elizabeth\n Comment icon \n Alan Tovey ,\n Industry Editor\n 24 May 2016 • 5:00pm \n T he scale of the  Royal Navy’s new aircraft carriers  has been highlighted by a series of videos showing computer generated versions of the ships entering Portsmouth. \n The 65,000-tonne Queen Elizabeth class carriers will be the largest ships ever in the navy and at the forefront of Britain’s ability to project military power. \n BAE Systems, which is part of  Carrier Alliance consortium  building HMS Queen Elizabeth and sister ship HMS Prince of Wales in a £6.2bn defence deal, is also close to completing a £100m contract to build the facilities at Portsmouth needed to support the vessels. \n HMS pannable graphic \n F-35B: Fifth-generation fighter-bomber with stealth characteristics that is also capable of short take-offs and vertical landings. It can fly at Mach 1.6 and carry 15,000lb of weapons 900 nautical miles  \n Forward island bridge:  The Queen Elizabeth is unusual in having two \"islands\" on the flight deck - the forward one from which the ship is commanded and the aft one which controls aircraft movements. Having two islands means airflow over the flight deck is more stable, making flight operations safer. The aft island is also better positioned to command aircraft landings  \n Long-range radar: Claimed to be able to automatically detect and track up to 1,000 air targets at a range of around 250 nautical miles  \n Aircraft lifts: The Queen Elizabeth class has two of these lifts to move aircraft between the hangar and flight deck.  Each one can move two F35s from the hangar to the flight deck in 60 seconds   \n AgustaWestland AW101 Merlin: Medium-lift helicopter designed to replace ageing Sea King, this three-engine aircraft can carry a crew of three and 26 troops up to 450 nautical miles. It also conducts anti-submarine warfare and is due to take on airborne early warning duties using the new Crowsnest radar   \n Medium-range radar: Artisan radar able to beat the most complex jammers and said to be able to track a target the size of a snooker ball 12 miles away  \n Small calibre gun: The carriers are designed to receive the latest generation of the Phalanx close-in weapon system to defend against aircraft and missiles, firing 3,000 20mm shells a minute. Each ship will also have 30mm guns and mini-guns to tackle threats such as small boats   \n Aircraft hangar: The hangar can accommodate any helicopter in the British military arsenal, including the twin-rotor Chinook  \n Commanding officer's suite: When not on the bridge, the ship's commader works out of this group of cabins. The Queen Elizabeth's first seagoing captain has been named as Commodore Jerry Kyd, the former Captain of HMS Ark Royal and HMS Illustrious   \n Bulbous bow: Protrudes just below the waterline and alters the water's flow around the hull, which reduces drag and improves efficiency, as well as improving buoyancy at the front of the ship  \n Forward engine room: The ship is powered by two Rolls-Royce Marine Trent MT30 48,000 horsepower gas turbine generator units, the largest ever supplied to the Royal Navy. They can drive the ship along at more than 25 knots and it carries enough fuel to sail 10,000 nautical miles  \n Propeller: Each of the ship’s two propellers weighs 33 tonnes - nearly two and half times as much as a double-decker bus  \n C overing an area the size of 10 football pitches, the depot will be capable of holding 15,000 pallets of medical, mail and naval stores, as well as accommodating the sailors and civilians who will look after the ships. \n Britain's vast new aircraft carriers will make enemies 'think twice' about starting war  \n C ommodore Jeremy Rigby, naval base commander, said: “The work on the Queen Elizabeth Class centre is a tangible milestone in getting the base ready to support our new aircraft carriers. A huge amount of activity is in train ashore and in the harbour to make sure we are ready to receive HMS Queen Elizabeth. \n “These are exciting times for the base and the wider Portsmouth area as we prepare for these huge ships which have secured the future of the base for the rest of the century. \n “BAE is working in partnership with the Royal Navy to improve the Queen Elizabeth class ships’ company experience that the carrier’s crew will receive at the waterfront and provide the resources, information, material and facilities they will need in Portsmouth and on operations around the world.” \n T he creation of a dedicated area for the carriers forms part of the overall update of Portsmouth Naval Base – with four areas to support different types of vessels. The first of these was opened in 2015 as the Centre of Specialisation for Frigates and Destroyers, while work began on minehunter HMS Brocklesby in the new Small Ships Centre of Specialisation in early May. \n   \n Comment icon \n Follow Telegraph Business \nFollow on Facebook\nFollow on Twitter\nFollow on Instagram\n READ MORE ABOUT: \n Royal Navy \n BAE Systems \n Defence industry \n HMS Queen Elizabeth \n Portsmouth \n Ministry of Defence \n Show more \n Show comments \nIf you would like to add a comment, please register or log in\n Register \n Log in \n Please review our  commenting policy \n Follow Telegraph Business \nFollow on Facebook\nFollow on Twitter\nFollow on Instagram\n Galleries\n Gallery \n 09 Nov 2017 , \n 1:45pm \n Gallery:  Equal Pay Day: 10 ways to visualise the gender pay gap \n Gallery \n 03 Nov 2017 , \n 7:00am \n Gallery:  The most expensive and extravagant advent calendars to buy this Christmas \n Gallery \n 02 Nov 2017 , \n 9:29am \n Gallery:  'I'm truly the reflection of perfection': the 16 daftest Apprentice candidates of all time \n Business latest\n 25 Nov 2017 , \n 9:43pm \n 'No EU-UK deal? It is not the end of the world', says WTO chief \n Premium \n 25 Nov 2017 , \n 8:00pm \n Comment:  There's still time to halt the madness of our foreign-owned nuclear juggernaut \nJeremy Warner\n Premium \n 25 Nov 2017 , \n 7:50pm \n Shoring up of Spanish steel giant Celsa will secure 600 jobs in Wales \n 25 Nov 2017 , \n 7:40pm \n Insurers cast doubt over future of Maplin \n 25 Nov 2017 , \n 7:30pm \n Daily Mail owner to review US property ties \n 25 Nov 2017 , \n 7:20pm \n LSE to reveal reasons for Rolet's exit as bitter feud comes to a head \n 25 Nov 2017 , \n 7:10pm \n Productivity could take off soon as economists are warned: you’re too gloomy \n 25 Nov 2017 , \n 7:05pm \n Johnson & Johnson pulls plan for first UK research centre \n 25 Nov 2017 , \n 6:54pm \n Jobs boom is tailing off in key sectors, warns Bank of England \n 25 Nov 2017 , \n 6:51pm \n Gig economy tsar calls out Uber drivers for trying have 'best of both worlds' \n 25 Nov 2017 , \n 6:50pm \n Tidal power schemes face growing wave of uncertainty \n 25 Nov 2017 , \n 6:30pm \n Ministers urged to put £100m into new BAE jet \n 25 Nov 2017 , \n 6:30pm \n Comment:  Thames Water tries to clean up its act - at last \nBen Marlow\n Premium \n 25 Nov 2017 , \n 5:45pm \n Shedding light on the dark art of shorting shares \n Premium \n 25 Nov 2017 , \n 5:00pm \n Will the UK's finances ever get back into the black? \n 25 Nov 2017 , \n 3:03pm \n Pret a Manger pulls coconut porridge from shelves - but denies it's because of a global coconut shortage  \n 25 Nov 2017 , \n 2:27pm \n Comment:  Future battles in business will create the survival of the digitally fittest \nSimon Freakley\n Premium \n 25 Nov 2017 , \n 2:14pm \n Comment:  We must solve this productivity puzzle \nLiam Halligan\n Premium \n 25 Nov 2017 , \n 1:39pm \n As pressures mount over the funding of UK defence, has a 'fog of war' descended over the arms industry? \n Premium \n 25 Nov 2017 , \n 1:19pm \n Questor: Workspace should appeal to those who believe in London's entrepreneurial streak \n Premium \n 25 Nov 2017 , \n 1:11pm \n Investor revolt leads Rio Tinto to abandon plans to name Sir Mick Davis as chairman \nContact us\nAbout us\nRewards\nArchive\nReader Prints\nBranded Content\nSyndication\nGuidelines\nPrivacy\nTerms and Conditions\n © Telegraph Media Group Limited 2017 \n We've noticed you're adblocking. \n We rely on advertising to help fund our award-winning journalism. \n We urge you to turn off your ad blocker for The Telegraph website so that you can continue to access our quality content in the future. \n Thank you for your support. \n Need help? \n Click  here  for instructions  \n Close"}