{"url": "http://steemilieskillshare.org/?cat=7&paged=2", "content": "Ste-Emilie Skillshare | Community Arts Collective \n Ste-Emilie Skillshare  | Community Arts Collective \n Open Studio Closed :( \n Categories:  News & Upcoming Events Posted on March 2, 2013  \n Our pipes recently burst    \n We are getting it fixed up and will be back in action soon! \n   \n   \n   \n   \n   \n   \n   \n   \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n OPEN STUDIOS: Saturday’s 13h00-18h00 \n Categories:  News & Upcoming Events Posted on February 19, 2013  \n Our power-washer is out of commission    \n This means we don’t have screens for you to use. You can still silkscreen if you have your own, but you won’t be able to wash the emulsion out. Sorry !!! \n Our sewing machines are also acting out    \n You can still check us out on Saturdays to hang out, check out our  distro , use the studio space, check out the  darkroom  and  make some 1″ buttons . \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n Ste-Émilie gets serious for real real – 1st AGM evah! \n Categories:  News & Upcoming Events Posted on November 28, 2012  \n (francçais si-dessous) \n * Come see installations from Ste-Émilie’s archives, eat snacks, elect members to our Board of Directors, adopt a constitution, dance, hangout, see what we’ve been up to in the past 6 years! \n Saturday, April 20th, 2013 – 6pm-8pm – Party at 9pm! \n@ The Ste-Émilie Skillshare \n3942 rue Ste-Émilie* \nMontreal, QC \n(metro Place St-Henri) \n*We regret that our space is not wheelchair accessible \n The Ste-Émilie Skillshare has recently taken steps towards ensuring the solidity of our future.  For many years, this volunteer-run organization has provided marginalized communities and those who work in solidarity with marginalized communities with: project support, programming in and out of our space, as an event venue, and as a screen-printing workshop, among other things. With our emphasis on self-representation and self-expression from an anti-oppression framework, our members have been building an organization dedicated to social transformation.    Read more » \n Comments Off   \n\t\t\t\t\tTags: \t\t\t\t \n Sérieuse ou quoi? 1e AGA de Ste-Émilie + party! \n Categories:  News & Upcoming Events Posted on November 28, 2012  \n *Venez regarder des installation de l’archive de St.Emilie, manger des collations, élire le Conseil d’administration, adopter la constitution, dansez, jasez et apprendre ce que nous avons fait les 6 dernières années \n Samedi, le 20 avril, 2013 – 18h-20h – Fête à 21h \n@ Le centre d’art communautaire Ste-Émilie Skillshare \n3942 rue Ste-Émilie \nMontreal, QC \n(métro Place St-Henri – carte) \n* Malheureusement, cet espace n’est pas accessible en fauteuil roulant… \n Le centre d’art communautaire Ste-Émilie Skillshare a récemment pris des mesures pour assurer la pérennité de notre collectif. Depuis de nombreuses années, cette organisation dirigée par des bénévoles a, entre autre, fourni à des communautés marginalisées et leurs alliés un soutien pour leurs projets. Nous offrons une programmation tant à l’interieur qu’en dehors de nos murs; un lieu événementiel, de rencontre ou d’atelier pour la sérigraphie, le dessin et la photo. Avec un accent sur l’auto-représentation et l’auto-expression et selon nos principes d’anti-oppression, nos membres ont construit une organisation dédiée à la transformation sociale.  Read more » \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n Say Hello To September’s Fight Boredom Zine Resident! \n Categories:  News & Upcoming Events Posted on September 22, 2012  \n Say Hello To September’s Fight Boredom Zine Resident! \n FIGHT BOREDOM ZINE DISTRO \n Khristina Acosta is a mental health worker and caretaker living in central New Jersey. A co-organizer of C.L.I.T Fest New Brunswick, she is interested in making people of color (POC) more visible in the punk and DIY scenes. Her zine will be about how a string of disappointing romantic situations have convinced her to be non-sexual with anyone until January of 2013. Although these disappointments were the catalyst, it will also deal with issues of consent, boundaries, mental health, family history, failed polyamory, and both internalized misogyny and white suprematism. Overall, what it means to be a sex-positive feminist while figuring out how to unlearn your oppressive and unhealthy habits. An avid reader of zines, this will be her first zine coming to fruition and not just floundering in Google Docs. \n   Read more » \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n ZINE LAUNCH AND PERFORMANCE TONIGHT — Unicorn Heroes on the Wrong Side of the Tracks \n Categories:  Distro ,  News & Upcoming Events Posted on September 22, 2012  \n Come party with us to launch our new zine, Unicorn Heroes on the Wrong Side of the Tracks, celebrating our supernatural, glamourous and monstrous heroes. We invite you to take part in our fantasy revolution, our monster’s heroic journeys across the train tracks of our struggles this Saturday, September 22nd, at Café L’Artére! FREE ADMISSION! Bring your friends! \n Joining us to celebrate monstrosity in all its forms, there will be spectacular performances by: \n Lily Raphael, Slam Poet \n Ryan Thom, Performance Artist \nKama LaMakerel, Performance Artist\n plus swirling psychedelic harmonies by band Vostok1 !( www.vostok1.ca ) \n Doors at 7! Show at 7:30! FREE! (Zines for sale!) \n This event is a part of a longer exhibition of Sidetracks (the Ste-Emilie Skillshare’s volunteer silkscreening team) members’ work. Art work is/will be on display at Café L’Artère from now until September 30th! \n Facebook:  https://www.facebook.com/events/453793741337910/ \n @ Cafe l’Artere \n(7000, Avenue du Parc, Montréal, H3N 1X1) \n   \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n « Previous Page  —  Next Page » \n Pages \n Home \n Join the Collective \n Zine Distro \n Who We Are / Mandate \n Photos and Glam \n Contact Us \n Sign up for our Newsletter \n Categories \n Distro  (4)\n News & Upcoming Events  (162)\n Ste-Emilie Skillshare  | Community Arts Collective RSS :  Entries  /  Comments \n WordPress  |  Valid :  XHTML  /  CSS"}