{"url": "https://www.dpreview.com/", "content": "Digital Photography Review \n Facebook \n Twitter \n YouTube \n Instagram \n Sign up for our weekly newsletter! \n Submit a News Tip! \n            Reading mode:\r\n             Light \n Dark \n Login  |\r\n                 Register \n News Reviews Articles Buying Guide Sample Images Videos Cameras Lenses Phones Printers Forums Galleries Challenges \n            What camera should I buy?\r\n            Get inspired: holiday gift ideas!\r\n November 25 20 Shooting Kīlauea Volcano, Part 1: How to melt a drone 7 hours ago Erez Marom shares the story behind a beautiful series of Kilauea Volcano drone photos... and how his enthusiasm led to a melted drone camera! 95 Gear of the Year 2017 - Barney's choice (Part 2): Nikon D850 8 hours ago In the first part of Barney's Gear of the Year article, he wrote about the camera he's used most in 2017 – the Leica M10. In Part 2, he's writing about a camera that he's barely even touched. Read on to find out why the D850 made his list for best gear of 2017 regardless. November 24 365 TIME calls Sony a7R III 'one of the best mirrorless cameras ever made' Nov 24, 2017 at 18:18 TIME Magazine has named the Sony a7R III one of its top 10 gadgets of 2017. It was the only camera that made the illustrious list this year, receiving high praise from TIME, who dubbed it \"one of the best mirrorless cameras ever made.\" 64 LG V30 camera review review Nov 24, 2017 at 14:00 The LG V30 differentiates itself from the competition with an expansive video feature set and a secondary wide angle camera, making it something of a Swiss Army knife for content creators. 104 Top 10 sample galleries of the year #1: the Nikon D850 sample gallery Nov 24, 2017 at 12:00 We're counting down our top 10 most popular sample galleries of 2017. Holding down the top position is none other than the Nikon D850 – by a landslide. November 23 107 Throwback Thursday: the ups and downs of running DCResource Nov 23, 2017 at 14:00 It's been twenty years since Jeff Keller founded the Digital Camera Resource Page, one of the first websites dedicated to digital photography. Jeff, who has been at DPReview for nearly five years, looks back at the rise and fall of consumer digital cameras and his website. 70 Top 10 sample galleries of the year #2: the Sony Alpha a9 sample gallery Nov 23, 2017 at 12:00 We're counting down our top 10 most popular sample galleries of 2017. At #2 we have another staff favorite – the Sony Alpha a9. November 22 29 Rotolight Anova Pro 2 features improved output and 'unrivaled battery' Nov 22, 2017 at 21:43 Rotolight has released the Anova Pro 2 circular LED for stills and video, boasting a 70% increase in brightness and what the company describes as \"unrivaled battery performance.\" 80 Designer imagines the perfect keyboard for Adobe software Nov 22, 2017 at 20:36 Designer Vinicius Araújo has imagined what he believes the perfect Adobe software keyboard might look like. From customizable touch pads, to a scroll wheel, to a little display that shows the tool in use, his design is pretty compelling. 33 Peak Design unveils limited edition Leica Backpack Capsule Nov 22, 2017 at 18:38 Peak Design has teamed up with Leica to release a limited-edition backpack made special for fans of the Red Dot.  282 Portrait of a robot takes 3rd place in prestigious Taylor Wessing Portrait Prize Nov 22, 2017 at 17:27 A portrait of an android woman has beaten over 5,700 pictures of humans to take third place in this year’s prestigious Taylor Wessing Portrait Prize. The judges were not told the subject was an 'android' until after the winning images were chosen. 20 Matthews unveils C-stand shoulder and roller bags Nov 22, 2017 at 16:24 Hauling around C-Stands just got a whole lot less annoying thanks to these new Matthews shoulder and roller bags, which can hold two or three C-stand (respectively) plus accessories.  135 Canon illuminated buttons patent hints at future prosumer DSLR design Nov 22, 2017 at 16:11 Future prosumer Canon DSLRs might feature light-up buttons, if this newly published patent is any indication of the camera company's plans. 806 Sony a7R Mark III review review Nov 22, 2017 at 15:00 Sony's a7R Mark III shoots 42.4MP files at 10fps and incorporates a robust video feature set, large battery, refined ergonomics and more. It certainly looks impressive, but what is it like to use, and how does it stack up against the rest of the market? Find out in our full review. 37 Top 10 sample galleries of the year #3: the Fujifilm X100F sample gallery Nov 22, 2017 at 12:00 We're counting down our top 10 most popular sample galleries of 2017 – the Fujifilm X100F takes the bronze and the #3 spot. November 21 83 2017 Buying Guides: Best cameras for every kind of photographer Nov 21, 2017 at 20:25 There's never been a better time to shop for a new camera, but the number of options available can be overwhelming. In this series of buying guides we've provided customized recommendations for several use cases, from shooting landscapes to buying a first camera for a student photographer. 33 2017 Buying Guides: Best cameras for any budget Nov 21, 2017 at 20:24 Shopping for a camera with a set budget? No problem! We've rounded up our favorite cameras, broken them into price brackets and picked the best of the bunch. 13 2017 Buying Guides: Best compacts, drones and phones Nov 21, 2017 at 20:22 Looking for a lightweight compact camera that's easy to bring with you anywhere? Or maybe you're smartphone-shopping and want the one that takes the best picture. And what if you want to shoot from above? In these buyers guides we have recommendations for the best compact cameras, smartphones and drones. 436 UPDATED: Sony a7R III is still a star eater Nov 21, 2017 at 20:00 Despite reports to the contrary, analysis of DPReview images by our friend Jim Kasson confirms a disappointing fact: Sony a7R III is still a Star Eater. But there may be some improvements. 99 Facebook just doubled the resolution of photos in Facebook Messenger Nov 21, 2017 at 17:24 As the saying goes: A photo is worth a thousand words. And if you're sending that photo through Facebook Messenger, your thousand words now look twice as nice after today's update to 4K resolution. 92 Video: first look at the Leica CL video Nov 21, 2017 at 17:00 Get to know the new Leica CL in short order by giving our 90 second 'First look' video a watch. 358 Leica CL brings built-in viewfinder, conventional control layout to L lineup camera news Nov 21, 2017 at 14:00 Leica has just released the CL, the forth in its series of APS-C L-mount cameras. Despite sharing a name with a camera released in the mid-70s, the new CL is a thoroughly modern ILC, with a 24MP sensor and built-in electronic viewfinder. 37 Leica CL: first sample images sample gallery Nov 21, 2017 at 14:00 The Leica CL is a 24MP rangefinder-style mirrorless camera, which sits alongside the TL2 in the company's APS-C lineup. We've been using one for a few days – check out our gallery of images. 412 The Leica CL is (almost) what the TL should have been Nov 21, 2017 at 14:00 While it shares a name with one of Leica's most popular and affordable cameras of the 1970s, the new CL is separated from its namesake by more than just years. We've been using one for a few days - click through for a detailed first-impressions report. 31 Top 10 sample galleries of the year #4: the Leica M10 sample gallery Nov 21, 2017 at 12:00 We're counting down our top 10 most popular sample galleries of 2017, and the #4 ranking goes to the Leica M10. November 20 74 Sigma's high-end Art lenses get $100 Black Friday discount lens news Nov 20, 2017 at 20:35 Sigma is discounting 13 different high-performance 'Art' series lenses from today until November 30th. The company is calling it an 'unprecedented' sale. 31 DJI AeroScope demo shows drone tracking tech in action Nov 20, 2017 at 19:55 See DJI's 'AeroScope' drone-tracking technology in action. This is the system that DJI says can help law enforcement and airport (among others) track and identify rogue drones. 57 Moment releases new case and lenses for Apple iPhone X mobile Nov 20, 2017 at 18:12 iPhone X owners can already accessorize their new phone with high-quality smartphone photography lenses courtesy of Moment's new lineup. 42 Sigma releases full-res sample photos captured with 16mm F1.4 DC DN lens Nov 20, 2017 at 17:52 Considering buying Sigma's exciting new 16mm F1.4 DC DN Contemporary lens for crop-sensor E-Mount and M43? Check out these official full-res samples first! 37 Vimeo adds support for 8K 10-bit HDR videos video Nov 20, 2017 at 17:15 Vimeo has just added support for 8K HDR 10-bit content, making it possible to show up to 75% of the colors the human eye can perceive vs the usual 35%. Take THAT YouTube. 55 Treat yourself 2017: the ultimate holiday gift guide for that special person (you) Nov 20, 2017 at 14:00 The holidays are coming, but your gear isn't cutting it? It's time to treat yourself! 39 Top 10 sample galleries of the year #5: the Fujifilm X-T20 sample gallery Nov 20, 2017 at 12:00 We're counting down our top 10 most popular sample galleries of 2017, and sitting pretty at #5 is the Fujifilm X-T20. November 19 549 Retrographic: The world's most iconic black & white images brought to life in color Nov 19, 2017 at 15:00 See some of the most iconic black-and-white photographs throughout history brought to life by a community of colorization enthusiasts and professional retouchers in the new book Retrographic. 1 Photography gifts for every budget Nov 19, 2017 at 14:00 Shopping for a photographer? Whether you are one yourself or not, chances are you could use some ideas. From stocking stuffers on up, we've got some photography gift suggestions for every budget. 16 Top 10 sample galleries of the year #6: the Sigma 85mm F1.4 Art sample gallery Nov 19, 2017 at 12:00 We're counting down our top 10 most popular sample galleries of 2017. Drum roll please... the #6 spot belongs to none other than the Sigma 85mm F1.4 DH HSM Art. November 18 177 Photo story of the week: A spectacular wedding shoot in Norway Nov 18, 2017 at 18:53 Read the story behind this gorgeous wedding photo captured at Trolltunga in Norway by husband and wife duo Priscila Valentina Photography. The 14 hour hike in the rain that preceded this shot was TOTALLY worth it. 224 Behind the scenes: Shooting a cinematic short film with the iPhone X video Nov 18, 2017 at 17:00 Go behind the scenes with filmmaker Nick Arcivos, who recently created a beautiful cinematic short film in Paris using only the iPhone X, a couple of gimbals, and a few lights. The results are very impressive. 250 Is the future of beginner photography a bright orange camera with no buttons? Nov 18, 2017 at 14:00 A Bay Area startup offering a pay-by-the-photo camera service cleverly addresses the pain points photographers experience when they pick up their first DSLR. But can it survive the smartphone? 144 These are the best smartphone cameras you can buy now mobile Nov 18, 2017 at 14:00 It's been a big year for software innovations, dual cameras and huge displays. Take a look at our picks for the top smartphone cameras and why we think they stand out. 39 Top 10 sample galleries of the year #7: the Olympus Tough TG-5 sample gallery Nov 18, 2017 at 12:00 We're counting down our top 10 most popular sample galleries of 2017. At the #7 spot is the ready-for-any-weather Olympus Tough TG-5. November 17 82 Ultra-creative NYC 'layer-lapse' plays with night and day... and your mind Nov 17, 2017 at 23:18 By combining his skills as a time-lapse filmmaker and an engineer, Julian Tryba created this out-of-this-world creative 'layer-lapse' of New York City that alternates between night and day in time with the music. 124 Canon Japan unveils a few silly gear-themed gifts for Canon lovers Nov 17, 2017 at 19:53 Canon Japan's new lineup of novelty camera-themed gifts was just revealed online, including a lens mug and lens thermos, two retro camera-themed USB drives, and a picnic mat. 203 Polaroid wants Fujifilm to pay millions in royalties for Instax Square format Nov 17, 2017 at 14:54 Fujifilm has asked a US district court to clear it of any wrongdoing, after allegedly being threatened with trademark litigation by Polaroid. 440 Sony a7R III added to studio scene comparison Nov 17, 2017 at 13:00 While a couple of our reviewers are out testing the Sony a7R III in Arizona, back in Seattle we slapped the camera in front of our studio scene to get a close look at its image quality. See how it stacks up against the competition. 22 Top 10 sample galleries of the year #8: Nikon D7500 sample gallery Nov 17, 2017 at 12:00 We're counting down our top 10 most popular sample galleries of 2017, and the #8 ranking belongs to the Nikon D7500. November 16 77 Blackmagic unveils DeckLink 8K Pro capture card for 'real time 8K workflows' video Nov 16, 2017 at 22:07 8K video is coming a lot faster than you think, and Blackmagic is ready for it. Meet the DeckLink 8K Pro, a new high performance PCI-E capture and playback card built to handle 'real time high resolution 8K workflows.' 53 RAW Power: An iOS raw editor designed by the former Apple Aperture lead mobile Nov 16, 2017 at 20:56 Former Apple Aperture lead developer Nik Bhatt has designed an iOS app called RAW Power that lets you edit raw photos from your professional camera using your phone and tablet.... color us intrigued. 290 Surface Beast: A photographer's review of the Microsoft Surface Book 2 Nov 16, 2017 at 20:04 Advertising photographer Blair Bunting got his hands on the new Microsoft Surface Book 2, and it blew him away. Bye bye MacBook Pro... 60 OnePlus 5T unveiled: edge-to-edge display and a dual-camera optimized for low light mobile Nov 16, 2017 at 18:09 The OnePlus 5T retains many of the 5's features and specs, but comes with an edge-to-edge display and a dual-camera that is optimized for low light. 382 Expect twice the resolution and speed from the next Fuji GFX and Hasselblad X1D Nov 16, 2017 at 16:37 Sony's recently announced IMX461 backside illuminated medium format sensor will bring 100MP resolution and almost 2x the speed to the next-gen Fuji GFX and Hasselblad X1D. \n Total: 14332, showing: 1 – 50 \n « First ‹ Previous 1 2 3 4 5 6 7 Next › Last » \n 2017 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov 2016 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2015 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2014 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2013 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2012 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2011 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2010 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2009 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2008 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2007 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2006 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2005 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2004 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2003 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2002 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2001 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 2000 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec 1999 Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec \n In other news AI-powered 'Google Lens' is being integrated into Assistant on Pixel phones Thanks to Google Assistant integration, the Pixel 2's AI-powered 'Google Lens' camera feature will soon be easier and quicker to use. Nov 24, 2017 22 mobile Ugly Places, Pretty Photos: A portrait shoot at Lowe's Photographer Jenna Martin and her model friend Rachelle Kathleen set themselves a challenge: could they create beautiful portraits in an 'ugly' location? So they went to a local Lowe's hardware store and gave it a go! Nov 24, 2017 jennamartinphotoblog.com 19 The man behind rock music's most iconic photos discusses his process Neal Preston has shot timeless photos of everyone from Led Zeppelin, to Whitney Houston, to Michael Jackson. In this interview, he offers insights into his craft to up-and-comer Elijah Dominique. Nov 22, 2017 VICE 6 Profoto A1: Is this the future of mobile flash? The Profoto A1 most certainly isn’t for everyone [...] But for those who are used to using the Profoto systems, and want something that pairs seamlessly with the strobes you already have, there is no better companion. Nov 17, 2017 Lens Rentals 10 B+W releases 3-slot filter holder for 100mm filter system B+W has announced a new aluminum filter holder that offers three slots so users can use multiple filters at the same time. The holder goes with the 2mm thick 100mm square filters it launched earlier this year. Nov 16, 2017 27 The history of photography is a history of shattered glass \"Glass is everywhere in photography. From Eugène Atget’s reflective vitrines to Lee Friedlander’s sly self-portraiture, photographers have long been in thrall to the visual complications glass can inject into a composition.\" Nov 16, 2017 New York Times 0 Instagram testing feature the lets you follow hashtags Instagram is testing a new feature that lets you follow hashtags in addition to people, making it possible to keep track of your favorite #landscapes or #portraits without leaving your home feed. Nov 15, 2017 17 Instagram is 'liking' natural wonders to death Instagram popularity is threatening some of the most beautiful landscapes in the US, as hordes of 'nature lovers' trample over the same spots over and over again in search of the same exact shot. Nov 15, 2017 theoutline.com 39 The risk of 'crowdsourcing' your wedding photos It might be tempting to skimp on a wedding photographer and 'crowdsource' your wedding photos instead. But as this couple found out, you could end up with no photos and a big headache. Nov 14, 2017 valleynewslive.com 29 How to predict when your camera is going to die Using a combination of tools freely available online, you can predict when your beloved camera is likely to kick the can. No need to let your camera's demise catch you unawares. Nov 13, 2017 Fstoppers 18 VSCO adds 'Recipes' feature that lets you create 10 custom presets VSCO has released a new custom presets feature called Recipes to its VSCO X subscribers, allowing them to save up to 10 custom edits under a new menu item. Nov 8, 2017 16 Corephotonics sues Apple over dual-camera zoom patents The Israel-based company has filed a patent infringement case claiming Apple has made unauthorized use of its dual-camera zoom technology in the iPhone 7 Plus and 8 Plus. Nov 8, 2017 84 mobile Phase One introduces Capture One ambassador program Phase One just launched a brand ambassador program for its photo processing software Capture One, bringing in 13 photographers and retouchers who can \"share their talent and skills to inspire the photographic community.\" Nov 7, 2017 98 A retoucher reviews the Touchbar MacBook Pro \"I was highly skeptical of this laptop before buying it because on paper, it looked dumb [...] I have to say that it did beat my expectations and I don’t regret my purchase. It actually keeps up with me and I work like a maniac!\" Nov 6, 2017 retouchist.net 30 Market report provides interesting insights into camera module industry Yole Développement's \" Camera Module Industry Market and Technology Trends 2017\" report finds the industry is still mostly driven by mobile.  Nov 6, 2017 26 mobile HTC U11+ combines U11 camera specs with large 6-inch display The U11+ comes with the same camera specs as the excellent U11, and is HTC's first device to feature an almost bezel-less display. Nov 2, 2017 37 mobile Macphun has changed its name to 'Skylum' now that it's not Mac-only Photo editing software maker Macphun is no longer... well... Macphun. Now that it's making software for Windows as well, the company has officially changed its name to Skylum. Oct 31, 2017 60 InVisage reportedly acquired by Apple It appears InVisage, which developed a new image sensor architecture for increased light capturing capability, has been taken over by Apple. \n   Oct 26, 2017 32 mobile Report: Snapchat has hundreds of thousands of unsold Spectacles sitting in storage After a successful first round of sales, Snapchat ordered hundreds of thousands more of its Spectacles camera glasses... then demand tanked. Oct 26, 2017 46 Sony to shift focus as demand for automotive image sensors increases Sony is expected to shift some of its CMOS sensor production capacity from mobile devices to automotive. Oct 25, 2017 48 Canon's 'holy grail': Using the Canon 200mm F1.8L USM \"With only a few hundred of these lenses still in existence, and the inability to get them serviced and repaired if damaged, one can only assume that finding one of these will only become more and more difficult as time goes on...\" Oct 23, 2017 Lens Rentals 12 My experience at an Instagram influencer party \"Everyone was wearing essentially the same outfits, doing the same poses, and felt like they needed 37 versions of each pose. As irritated as I was by this, it wasn’t what annoyed me the most.\" Oct 23, 2017 thephoblographer.com 49 Canon now offers next-day service for CPS Platinum members \"CPS Platinum members will now enjoy next-day service, with equipment serviced and shipped the business day after an estimate is approved. For repairs that will take longer, Canon will offer next-day loaner equipment.\" Oct 20, 2017 usa.canon.com 18 Detu launches F4 Plus professional grade 360-degree 8K VR cam The F4 Plus can can capture 360° stills, videos and broadcast livestream footage at 8K resolution... that's 7680 x 3840 pixels! Oct 18, 2017 24 camera news The 'Nude' app uses AI to detect and hide NSFW images on your iOS device The aptly-named 'Nude' app automatically detects NSFW images on your iPhone, moves them to a protected vault and deletes the original files in the camera roll and on iCloud. Oct 18, 2017 43 mobile This is how Rolling Stone finds and hires its photographers PDN sat down with Ahmed Fakhr, director of photography at RollingStone.com, to talk about how the famed publication is adapting to the changing photo and video needs of the modern era and how he 'evaluates the skills of potential contributors.' \n   Oct 17, 2017 PDN 0 Canon hit two milestones today: 90 million cameras and 130 million lenses Kudos to Canon. Earlier today, the camera giant announced that it had produced its 90 millionth EOS camera and 130 millionth EF-series lens. Oct 17, 2017 124 Google Photos introduces new pet-friendly features Google Photos is adding a few pet-friendly features that will make it easier to find photos of your favorite pooch. Now, you can organize your pet photos by facial recognition, and you can even search your library by breed. Oct 16, 2017 techcrunch.com 2 Don't be a desperate (and dangerous) wildlife photographer \"Wildlife photography in Yellowstone National Park is an incredible opportunity, yet some bad photographers are giving all photographers a bad name by not following the rules.\" Oct 14, 2017 trentsizemore.com 51 I was sentenced to 15 years in an Egyptian prison for taking pictures \"I was 22. I was young, careless and a firm believer in the importance of my work. I was not going to let myself be stopped by mere bullets, beatings, and angry people. That all changed one day in July 2016—the worst day of my life.\" Oct 11, 2017 witness.worldpressphoto.org 40 Tips or suggestions?  Contact us! More articles  » \n @ dpreview\r\n Tweets by @dpreview \n Latest reviews Sony Alpha a7R III 90 % Sony Cyber-shot DSC-RX10 IV 84 % Panasonic Lumix DC-G9 Canon EOS M100 Review 79 % Fujifilm X-E3 84 % See all reviews  » \n Finished challenges The Engineer by EXX from Steam Trains Ship Captain by gz927 from Captain Discover more challenges  » \n Most popular cameras Sony Alpha a7R III 4.3% Fujifilm X-T2 2.6% Nikon D850 2.3% Panasonic Lumix DMC-LX10 (Lumix DMC-LX15) 2.2% Olympus OM-D E-M10 III 2.2% Canon EOS M100 2.1% Sony Cyber-shot DSC-RX10 III 2.0% Canon PowerShot G7 X Mark II 1.9% Nikon D500 1.8% Sony Cyber-shot DSC-RX100 V 1.8% Other popular cameras  » \n Features Beginner's Guides Getting Started In-depth testing Latest Camera Reviews Beyond the studio tests Feature Articles and Videos see how we see Sample Galleries Choose the best camera for you 2017 Product Roundups real world performance Field Test Videos Throwback Thursday Classic Cameras from Days Past What's that Noise? Shedding some light on the sources of noise \n Top threads 107 Should I step away from Micro Four Thirds or keep investing? 90 *** This Week Through Your M4/3 2017.11.25 *** 83 Battery Grip?  Why? 61 #361|MONOCHROME THREAD|POST YOURS| *24Nov-26Nov2017* 60 Lumix GX80/85 Maybe ? 60 Epson Photography Awards... Yuck! 53 Fuji XT2 is no good for landscapes 49 0o-o0  Weekly \"Is it \"ART\"? Thread Nov 25 - Dec 2 0o-o0 41 On the subject of taste... 38 Any bets on Panasonic's December announcement? 34 Macro? 30? 60? 0? 34 Sony A6300 vs A6500.... or A7II? 32 *** Wildlife Thread starting 25th November2017 *** 32 A9R ? 32 ILCE-7RM3 (A7R III) Photographic Dynamic Range (PDR) at PhotonsToPhotos 31 Sigma 16mm or Samyang 12mm or both? 30 Just ordered an X-T2: suggestions about cards and batteries? 30 Image cropping 29 Lowest price DXO Photolab elite can go in the past 28 What's wrong with the KP??? \n www.dpreview.com \n                    Follow us\r\n Mobile site \n About \n About us \n Work for us \n Advertise with us \n FAQ \n Feedback \n Interest-Based Ads \n Privacy \n Legal \n Editorial content \n News \n Camera reviews \n Lens reviews \n Printer reviews \n Buying guides \n Sample images \n Videos \n Cameras & Lenses \n Cameras \n Lenses \n Camera search \n Camera comparison \n Lens search \n Product timeline \n Browse all products \n Community \n Forums \n Challenges \n Galleries \n My Profile \n My Settings \n My GearList \n                All content, design, and layout are Copyright © 1998 - 2017 Digital Photography Review All Rights Reserved. \r\n                Reproduction in whole or part in any form or medium without specific written permission is prohibited.\r\n Advertising \n Continue to www.dpreview.com »"}