{"url": "https://toshl.com/terms/", "content": "Toshl Finance - Terms of Service\n Terms of Service\n These Terms of Service constitute a legally binding agreement between you and Toshl, Inc. (“Toshl”) governing your online and offline use of the software and collection of services (“Services”) offered by Toshl.com, its mobile applications, and related services (collectively the “Site”). \n Show non-binding sidenotes \n Hide non-binding sidenotes \n We’ve added these side notes as help with the understanding of the legalese, perhaps even comic relief to help you from turning into a Kafkaesque cockroach before you get to the end. \n Keep in mind though that these are only comments, you are agreeing to the main legal text, NOT these side notes. \n By using the Site, you agree to these Terms of Service. If you do not agree, do not use the Site.  By clicking the “I AGREE” button or accessing or using any part of the Site, you agree to be bound by these Terms of Service. \n To use Toshl you have to agree to these terms. \n Internet technology, and the applicable laws, rules and regulations change frequently. We reserve the right to make changes to these Terms of Service at any time.  Continued access and/or use of the Site in any manner constitutes assent to any existing and new Terms of Service  that may be posted on the Site. \n These terms can change, if they do, we’ll post them here. \n 1. Toshl.com \n Toshl Finance is a service that helps people keep track of personal finances with apps on multiple mobile and desktop platforms. Know your finances.  Have fun! \n 2. Eligibility \n To be eligible to use the Site and sign up for any of its Services, you must be at least 13 years of age and eligible to form a binding contract in your country of residence.  \n You must be at least 13 to go on this Toshl ride. Not because there’s anything especially kinky going on here, but because you need to be a certain age to be bound by contracts in most countries. \n 3. Free Toshl Account \n Toshl offers users the opportunity to register for a Free Toshl Account, which offers basic features to registered users free of charge.  To register and activate your Free Toshl Account, you must either:\n Provide  a unique password to access your account, a valid email address and the confirmation of it validity by clicking on a link sent by email; or \n Log-in using your: \n Google email address and Google+ profile in accordance with Google’s  Terms of Service  and  Privacy Policy \n Facebook account in accordance with Facebook’s Terms of Service and Data Use Policy; or \n When you register we’ll need at least a valid email address and a password from you. \n If you log in with any of the third party services you need to be cool with their Terms and Privacy as well. \n 4. Upgrading Account to Toshl Pro \n At any time, users may opt to upgrade their account to become a Toshl Pro Member, which will enable additional and improved features (“Member Services”) not available to Free Toshl Account holders. \n You can register for free and use your free account as long as you want. \n We also offer an upgrade to Toshl Pro membership to get some nice extra features. \n Toshl Pro is a subscription. You can sign up for a monthly, yearly or 3-yearly one. If it expires and you haven’t renewed, you’re back to the free account. \n The subscription will usually automatically renew after the period is up. We’ll send you an email to warn you before it does. You can cancel the automatic renewal at any time in the Settings. \n Sometimes we offer discounts, they’re only valid for the first purchase, not the later renewals. \n To become a Toshl Pro Member:\n Toshl Pro Members must first pay a monthly, annual or 3-year subscription fee (“Subscription Fee”), which allows Toshl Pro Member’s use of the Services during the applicable subscription period. \n Payment of the Subscription Fee creates a recurring payment obligation.  Toshl Pro Member subscriptions will be automatically renewed, unless the Toshl Pro Member terminates the Member Services prior to its expiration.  Toshl will notify the Toshl Pro Member of the impending subscription renewal and fee by email prior to the subscription renewal date. \n When upgrading to Toshl Pro, Toshl may offer promotional discounts on the price of its Subscription Fee. Such discounts are valid only for the first subscription period .  Subsequent subscriptions will be subject to Toshl’s standard Toshl Pro Member Subscription Fee for the applicable subscription period. \n 30-Day Money Back Guarantee:  Toshl Pro Members may terminate their initial subscription at any time during the first 30 days following payment of the Subscription Fee (“Trial Period”).  In the event of termination during the Trial Period, Toshl Pro Members who subscribe on a monthly or annual subscription basis are entitled to a full refund of the Subscription Fee. Toshl Pro Members who subscribe to a 3-year subscription will receive a refund of the Subscription Fee, less the cost of the Toshl T-shirt and related shipping costs. \n If you cancel within the first 30 days and it’s your first time with Toshl Pro we’ll refund your money automatically. \n With iOS and Windows Phone in-app purchases, we sadly don’t get the direct control over the refunds, so their support service needs to be contacted too. They usually comply just fine, if not we’ll work something out. \n If you get the 3-year plan with the T-shirt, you can’t get the same 30-day refund, because we already sent you the T-shirt. If you want the refund, we’ll deduct the T-shirt price and shipping. \n 5. Account Integrity and Security \n In establishing either a Toshl Free or Toshl Pro Member account, you represent that all registration information is truthful and accurate, and you agree to maintain the accuracy of such information. \n You acknowledge and agree that you are responsible for maintaining the confidentiality of any passwords associated with your account.   You must notify Toshl immediately if you believe your password or account has been obtained or may be accessed or used by any unauthorized person or entity. \n You acknowledge and agree that you are solely responsible for all use and activities that occur under your account. \n You’re responsible to keep your password secret and follow good security practices. \n If the shit hits the fan, let us know right away so we can try to help you. \n 6. Terminating Subscriptions \n Toshl Pro Members may choose to terminate their subscription to Member Services by: \n Terminating the automatic subscription renewal.  By exercising this option, Toshl Pro Members will be able to continue to use the Member Services until the expiration of their subscription.  At the expiration of the subscription, Toshl Pro Members will then revert to a Free Toshl Account, and will no longer have access to additional features and improvements provided to Toshl Pro Members; or \n Deleting your account.  Deleting your existing account will cancel the subscription to Member Services, the automatic renewal and all data associated with the Toshl Pro Member Account.  To access Services offered through a Toshl Free Account, users will have to register for a new account. \n You can cancel the automatic subscription renewal whenever you want. Toshl Pro will still be valid until the original expiration date. \n You can also delete the account, which will also stop the automatic renewal and also delete all your data. \n If a user terminates their account after the 30-Day Trial Period, Toshl Pro Members will not be entitled to a refund of any portion of the Subscription Fee paid. \n We won’t give you partial refunds if you cancel after the 30-day trial period. \n 7. Software and Services: Use and Restrictions of Use \n Toshl grants you a personal, worldwide, royalty-free, non-assignable and non-exclusive license for the term of these Terms of Service to use the Services provided on the Site.  The sole purpose of this license is to enable you to use and enjoy the benefit of the Services in the manner permitted by these Terms of Service. \n You can cancel the automatic subscription renewal whenever you want. Toshl Pro will still be valid until the original expiration date. \n You may not, directly or indirectly: Copy, modify, create a derivative work of, the Services; or \n Unless otherwise permitted by law, reverse engineer, decompile, disassemble or otherwise attempt to extract the source code of the Services, or any part thereof, unless you have been specifically granted permission in writing from an authorized Toshl representative. \n 8. Content Submission Requirements \n Toshl offers users the opportunity to interact with the Toshl Community and Toshl employees by sharing ideas, posting questions about existing and future services, and providing answers to user inquiries regarding Services. \n We like to talk to the nice people using Toshl. But when you talk with us and the community on our boards, don’t be a douchebag to people or even post something illegal. \n If you do we’ll delete the post, ban you or do whatever necessary to keep things sane and friendly. \n Toshl encourages its users to interact with the Toshl Community.  However, when submitting or posting any Content, you may not: \n Post false, inaccurate, misleading, defamatory or harassing Content; \n Violate any law, statute, ordinance or regulation; \n Infringe upon any patent, copyright, trademark, trade secret, right of publicity or other third party rights; \n Impersonate another person or entity, misrepresent your affiliation with a person or entity, or create or use a false identity; or \n Toshl may remove or restrict Content and/or take any technical or legal steps necessary if we believe you are infringing the rights of third parties or violating any of these Terms of Service. \n 9. Content Warranties \n Proprietary Rights:  By uploading, submitting and posting Content to the Site, you represent and warrant that you have all right, title, license and authority to upload, submit and post the Content, including the right to publish and distribute by electronic and digital means. \n We welcome your comments, ideas and all the great feedback. Just don’t try to charge us for it or upload something you’re not allowed to. \n Non-Infringing:  By uploading, submitting and posting Content on the Site, you represent and warrant that the Content does not (i) violate, infringe or misappropriate on the rights associated with any third parties, including, but not limited to, privacy rights, copyright, trademark, trade secrets, or patents, or (ii) violate any statute, law, ordinance or regulation. \n License:  By uploading, submitting, or posting any Content on the Site, you grant to Toshl a perpetual, worldwide, non-exclusive, royalty-free right and license to use, copy, display, perform, create derivative works from, distribute, transmit and sublicense such Content in any form, in all media now known or hereinafter created, anywhere in the world.  You hereby irrevocably waive any claims based on moral rights, if any. \n 10. Objectionable Content \n We are not responsible for, and do not endorse, any Content posted on the Site.  We do not have any obligation to prescreen, monitor, edit or remove any Content.  If your Content violates any of these Terms of Service, you bear legal responsibility for that Content. \n If you post stupid shit, it’s your fault. \n We shall not be liable for any damage or harm resulting from the uploading, posting or submission of any Content or your interactions with other users on the Site.  We reserve the right, but have no obligation, to take any action to restrict or remove access to any Content that we deem, in our sole and absolute discretion, to be a violation of these Terms of Service. \n 11. Idea Submissions \n Non-Proprietary:  We consider any suggestions, ideas, proposals or other material submitted by users, whether solicited or unsolicited (collectively, the \"Material\"), to be non-confidential and non-proprietary.  We shall not be liable for the disclosure, use or exploitation of such Material. \n Really, we won’t pay for your idea, we have tons of our own. We like hearing what’s important to you, but when you share an idea, you’re putting it out in the open for anyone to use. How you make it happen is what matters most anyway. \n License:  You hereby grant to Toshl a worldwide, non-exclusive, perpetual, irrevocable, royalty-free and transferable right and license to incorporate, use, publish and exploit the Material for any purpose whatsoever, commercial or otherwise, without compensation or accounting. \n 12. Prohibited Conduc \n In your use of the Site, you may not: \n Modify, adapt or hack the Site or modify another website so as to falsely imply that it is associated with the Site; \n Distribute or transmit any code, virus or any other technologies, whether now known or yet to be developed, that may harm the Site or its users; \n Distribute or post spam, unsolicited or bulk electronic communications to Site users; \n Except for Developer API’s expressly permitted by Toshl, use any robot, spider, scraper or other automated means to access the user data on the Site for any purpose whatsoever; \n Take any action that imposes, or may impose, an unreasonable or disproportionately large load on the Site’s infrastructure; \n Interfere or attempt to interfere with the proper working of the Site, its services or tools; or \n Bypass the Site’s robot exclusion headers or other measures we may use to prevent or restrict access to the Site. \n Again, don’t try to hack us. \n If you want to work with us and the data that the users are individually willing to share with your service, we have a great API for you. Check out the developer section. \n 13. Availability of Services \n Due to the continuing development and improvement of Toshl’s Services, the availability of Services is subject to change.  You acknowledge and agree that the form and nature of the Services may change from time to time without prior notice to you. \n Toshl will do its best to keep its Services available at all times.  However, Toshl cannot guarantee that the Services will be continuously available without interruption.  You acknowledge and agree that the Services may be temporarily unavailable for causes beyond Toshl’s control. \n Toshl shall not be liable to you for any disruptions of Services as a result of interruptions arising from the foregoing. \n We’ll do our best to keep everything running smoothly. You can’t sue us if there’s a hiccup. \n 14. Termination \n Termination by You.  You may stop using the Services at any time by either deleting your account or ceasing to use the Services. Termination of your Toshl Pro Account does not relieve you of any obligation to pay any outstanding Subscription Fees after the expiration of the 30-Day Trial Period. \n You can stop using Toshl anytime you want. \n If you do some seriously stupid shit like some of  the examples mentioned, we’ll stop you from using Toshl. We don’t like doing that though. \n If it all goes tits up we reserve the right to stop operating Toshl. \n We’ll tell you by email in the unlikely event that any of this happens. \n If we terminate your account for anything stupid you did, that doesn’t mean you’re off the hook for any past dues. \n Termination by Toshl.  We may terminate your Free Toshl or Toshl Pro accounts: \n For Cause if: \n You breach any provision of these Terms of Service; or \n You fail to pay any recurring Subscription Fees due for Member Services received. \n If Required by Law  (for example, where the provision of Services is, or becomes, unlawful). \n Commercial or Technical Unavailability:  Toshl may elect to discontinue Services when it is no longer commercially or technically viable to do so. \n In the event of Termination by Toshl, Toshl will provide written electronic notification to you of its decision to deactivate any accounts.  \n In the event of termination for cause, you will be liable to Toshl for any outstanding Subscription Fees due to Toshl up to the date of deactivation of Toshl Pro Member Services. \n Survival:  The following Sections shall survive termination of these Terms of Use: Content License, Objectionable Content, Idea Submissions License, Individual Arbitration, Disclaimers, Exclusions and Limitations, Release, Indemnification and Choice of Law. \n Even if the whole agreement if no longer in force, you still agreed to the parts mentioned here. \n 15. Privacy \n We respect your privacy and will only use personal information in accordance with our  Privacy Policy . \n We respect your privacy and will only use personal information in accordance with our Privacy Policy. \n 16. Customer Support \n Customer support is available on our Site at:  Support . Most concerns can be quickly resolved in this manner. \n Customer support is available on our website. Ask, we don’t bite. Unless you’re into that. \n 17. Individual Arbitration \n EXCEPT AS OTHERWISE STATED HEREIN, any claim or controversy with Toshl arising out of or relating to the Site and/or these Terms of Service (including its formation, interpretation, performance and breach) shall be settled by binding arbitration administered by the International Centre for Dispute Resolution in accordance with its International Arbitration Rules, excluding any rules or procedures governing or permitting class actions. Any judgment on the award rendered by the arbitrator(s) may be entered in any court having jurisdiction thereof. \n If we get into a disagreement with any of this legal stuff let’s solve it with arbitration on an individual basis. \n The parties acknowledge that these Terms of Service evidences a transaction involving interstate commerce. Notwithstanding the provision in paragraph 25 with respect to applicable substantive law, the Federal Arbitration Act, 9 U.S. C. §§ 1-16, shall govern any arbitration conducted pursuant to these Terms of Service. \n This is interstate commerce. For more details on how arbitration works in such cases, see the federal law mentioned here. \n ANY ARBITRATION UNDER THIS AGREEMENT WILL BE ON AN INDIVIDUAL BASIS ONLY.  THE PARTIES EXPRESSLY WAIVE THEIR RIGHT TO FILE OR JOIN A CLASS ACTION OR PRIVATE ATTORNEY GENERAL ACTION, OR TO CONSOLIDATE THEIR ARBITRATION WITH OTHER ARBITRATIONS.  YOU ARE WAIVING YOUR RIGHTS TO HAVE YOUR CASE DECIDED BY A JUDGE OR JURY.  IF ANY PROVISION OF THIS ARBITRATION AGREEMENT IS FOUND UNENFORCEABLE, THE UNENFORCEABLE PROVISION SHALL BE SEVERED AND THE REMAINING PROVISIONS SHALL REMAIN ENFORCEABLE. \n Disputes go to arbitration. On an individual basis only, don’t try to gang up on us with class action. \n The ICDR’s rules, as well as forms for initiating arbitration proceedings, are available at  www.icdr.org .  When initiating a request to arbitrate, you  must  also send a copy of the competed form to either:  Toshl Inc, 795 Folsom Street, 1st Floor, San Francisco 94017 or Toshl Europe: Ljubljanska 24d, 4000 Kranj, Slovenia, EU or by email at info@toshl.com \n If you have a problem with us, contact us at support first, we generally like to work things out in a civil manner. If we really can’t work things out, send a request to arbitrate to ICDR and us as well. \n Unless otherwise agreed to in writing by the parties, any dispute arising from these Terms of Service shall be conducted in English at either one of the following locations: San Francisco, California, United States or London, Great Britain. \n If we need to work things out by arbitration, let’s do it in English, either in San Francisco or London. \n 18. The Site’s Intellectual Property \n Copyright:  Toshl and its logos, design, text, graphics, and other files, and the selection arrangement and organization thereof, are owned by Toshl.  You may not use such materials without permission.  © 2017 Toshl, Inc. ALL RIGHTS RESERVED. \n Don’t steal our stuff. We’re generally reasonable about using the graphics in blog posts and the like. Just don’t abuse it. If you’re in doubt about any of this, ask. \n Trademarks:  Toshl and its logos, page headers, custom graphics, button icons and scripts are trademarks or trade dress of Toshl, Inc. \n Ownership and Use:  Nothing in these Terms of Service or your use of the Site gives you a right or license to use any of our copyrights, trade names, trademarks, service marks, logos, domain names, or any other intellectual property rights. \n You can usually use our stuff, but we still own it. \n 19. Disclaimers, Exclusions and Limitations \n DISCLAIMER OF WARRANTIES : TO THE EXTENT PERMITTED BY APPLICABLE LAW, WE PROVIDE THE SITE ON AN “AS IS” AND “AS AVAILABLE” BASIS. WE DO NOT REPRESENT OR WARRANT THAT THE SITE, CONTENT, OR SECURITY OF THE TRANSMISSION OF CONTENT ON THE SITE (I) WILL BE UNINTERRUPTED, (II) WILL BE FREE OF DEFECTS, INACCURACIES OR ERRORS, (III) WILL MEET YOUR REQUIREMENTS OR (IV) WILL OPERATE IN THE CONFIGURATION OR WITH OTHER HARDWARE OR SOFTWARE YOU USE. WE MAKE NO WARRANTIES OTHER THAN THOSE MADE EXPRESSLY IN THESE TERMS OF SERVICE, AND HEREBY DISCLAIM ANY AND ALL IMPLIED WARRANTIES INCLUDING, WITHOUT LIMITATION, WARRANTIES OF FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY AND NON-INFRINGEMENT. \n We don’t claim everything will work ALL the time and you can’t sue us if it doesn’t. We’ll do our best though. \n Portions of the Site are available as a forum for the display of Content. Toshl shall not be considered a publisher of any Content.  We do not control any links, services, goods, resources and information displayed on the Site by third parties.  ACCORDINGLY, TO THE EXTENT PERMITTED BY APPLICABLE LAW, WE (i) EXPRESSLY DISCLAIM ANY LIABILITY FOR CONTENT POSTED BY THIRD PARTIES, AND (ii) MAKE NO WARRANTIES REGARDING THIRD PARTY SERVICES, GOODS, RESOURCES AND INFORMATION INCLUDING, WITHOUT LIMITATION, WARRANTIES OF FITNESS FOR A PARTICULAR PURPOSE, MERCHANTABILITY AND NON-INFRINGEMENT AND WILL NOT BE LIABLE FOR YOUR USE OF OR RELIANCE ON SUCH THIRD PARTY SERVICES, GOODS, RESOURCES OR INFORMATION. \n Again, if people post stupid shit, it’s their fault, don’t sue us. \n EXCLUSION OF DAMAGES :  TO THE EXTENT PERMITTED BY APPLICABLE LAW, WE WILL NOT BE LIABLE TO ANY USER OF THE SITE FOR ANY CONSEQUENTIAL, INCIDENTAL, INDIRECT, PUNITIVE OR SPECIAL DAMAGES (INCLUDING DAMAGES FOR LOST PROFITS, LOST DATA OR LOSS OF GOODWILL) ARISING OUT OF, RELATING TO OR CONNECTED WITH THE USE OF THE SITE BASED ON ANY CAUSE OF ACTION, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. \n You can’t sue us for damages if something goes wrong. \n Statutory Rights :  Nothing in the Terms of Service shall affect those statutory rights which you are entitled to as a consumer as a matter of law and that you cannot contractually alter or waive.\n The consumer protection laws that cannot be waived are not waived. Honestly, we play fair and we’re not trying to cheat you out of anything here, just making sure we don’t get hit with some frivolous lawsuit. \n 20. Release \n If you have a dispute arising from, related to, or connected with your use of the Site or its Services, you hereby release Toshl, Inc. and its subsidiaries, affiliates, officers, directors, shareholders, employees, representatives, agents, volunteers, attorneys, managers, licensors, business partners and each of their respective successors and assigns from all claims, demands, causes of action, liabilities, legal fees and costs, and damages (actual and consequential) of every kind and nature, known and unknown, suspected or unsuspected, arising out of or in any way connected with such disputes.  IF YOU ARE A CALIFORNIA RESIDENT, YOU WAIVE CALIFORNIA CIVIL CODE SECTION 1542, WHICH SAYS: “A GENERAL RELEASE DOES NOT EXTEND TO CLAIMS WHICH THE CREDITOR DOES NOT KNOW OR SUSPECT TO EXIST IN HIS OR HER FAVOR AT THE TIME OF EXECUTING THE RELEASE, WHICH IF KNOWN BY HIM OR HER MUST HAVE MATERIALLY AFFECTED HIS OR HER SETTLEMENT WITH THE DEBTOR.” \n If you’re from California and have a dispute with use, you can’t use the civil code section 1542 to argue. \n 21. Indemnification \n To the maximum extent permitted by law, you agree to indemnify, defend and hold harmless Toshl, Inc. and its subsidiaries, affiliates, officers, directors, shareholders, employees, representatives, agents, volunteers, attorneys, managers, licensors, business partners and each of their respective successors and assigns (the “Indemnified Parties”) from and against all damages, losses, liabilities, claims, expenses, fees or costs (including, without limitation, attorneys’ fees and costs) incurred in connection with any claim, demand or action brought or asserted against any of the Indemnified Parties (i) alleging facts or circumstances that would constitute a breach of any provision of these Terms of Service by you, or (ii) arising from, related to, or connected with your use of the Site or its Services. \n If someone sues us because of something you did, you must reimburse us for any legal claims against us. \n 22. Severability \n The validity or unenforceability of any provision of these Terms of Service shall not affect the validity or enforceability of any other provision of these Terms of Service. \n If you find that one of this articles is unenforceable, that doesn’t mean that the other articles are too. \n 23. Modifications \n Our employees, volunteers or agents are not authorized to vary our Terms of Service.  Authorized modifications will be in writing and posted by Toshl on the Site. \n This to the left here is the legal stuff, the rest is hearsay. \n 24. Choice of Law \n These Terms of Service shall be governed by and construed and enforced in accordance with the laws of the State of California, without regard to or application of California’s conflict of law principles. \n California law rules! \n 25. No Waiver \n No failure or delay by a party exercising any right, power or privilege under these Terms of Service will operate as a waiver thereof. \n If we don’t use the powers given by these Terms of Service, it doesn’t mean we don’t have them anymore. \n 26. Interpretation \n Headings are for reference purposes only and do not limit the scope or extent of such section.  Any explanations provided are for reference only and shall not be used to interpret or construe the meaning or interpretation of the corresponding paragraphs. \n Don’t get hung up on the section titles or these side notes. The legal text is what matters. \n 27. Notices \n All notices required or permitted to be given under these Terms of Service will be in writing and delivered to either: \n If you have something legal to tell us, here’s how and where to do it. \n Toshl, Inc. 795 Folsom Street, 1st Floor, San Francisco, California or by email at: info@toshl.com; or \n Toshl Europe: Ljubljanska 24d, 4000 Kranj, Slovenia, EU or by email at: info@toshl.com. \n All notices will be sent to you by email or will be conspicuously posted on the Site. \n If we have something legal to tell you, we’ll send you an email, or post it clearly on the site. \n   28. Entire Agreement \n These Terms of Service comprise the entire agreement between the parties and supersede all prior or contemporaneous agreements, written or oral, between the parties regarding the subject matter contained herein. \n This agreement supersedes other agreements we might have. \n 29. Complaints - California Residents \n If you are a California resident, in accordance with California Civil Code Section 1789.3, you may report complaints to the Complaint Assistance Unit of the Division of Consumer Affairs of the California Department of Consumer Affairs by contacting them in writing at 400 R Street, Sacramento, California 95814, or by telephone at (800) 952-5210. \n If you’re from California and have some beef with us, you can also write to consumer affairs. Check out the address. \n Congratulations on battling through the entire Terms of Service! We try to play fair, if you do too, we hopefully won’t have to use them."}