{"url": "https://dbaron.org/views/", "content": "David Baron's Views \n My Views \n I wanted to have a page containing  information about me  (which I have since\nwritten), but really the only interesting thing to put on such a page\nis what I think about various issues.  Thus I won't even pretend that\nthis page is about my house or friends, because it isn't.  The topics\ncovered on this page span the range of topics in which I am\ninterested.  However, there is a bias towards topics in which there is\nmore debate.  This page is, of course, a work in progress.  I expect to\nadd more to it as time progresses. \n To start, I will introduce you to  some\nof my favorite quotes .  I also have lists of  some\nof my favorite movies  and a few of  my favorite\npoems . \n Politics and Economics \n I have compiled  some of my favorite\nquotes , and these tend to show my political views quite well.  I\nconsider myself moderate to liberal, although my views on some issues\nwould not be considered to fit that description.  I have put online\nsome arguments I wrote about the theoretical issues of  redistribution of income  and  religion's place in modern society .  I also\nhave some  thoughts on the living wage\ncampaign  at Harvard. \n I am a believer in government, and I think that  we should have a stronger national\ngovernment .  I have many strong opinions about what this government\nshould do.  These include  my views on\nenvironmental issues relating to automobiles  and my views on  healthcare in the United States . \n Also: \n Marginal income tax rates for a single\nCalifornia resident with only wage income, 2007 \n Computers & Technology \n I am a believer in UNIX.  I think that it remains the best set of operating\nsystems for servers and for many other Net-related tasks, as well as many\nprogramming and data handling tasks.  Hovever, I also used to be a big\nfan of the PC, as I explained in  a letter about the\nsuperiority of the PC over the Macintosh .  However, recently (2001),\nas more and more of what one can do with a computer is done over the\nInternet, I think Macintosh computers are better than PCs because of\ntheir better user interface (which is better not only because it is\nclearer how to do things but also because it more clearly shows how\nfiles on the computer are arranged “behind the scenes.” \n I also think the  WWW  is a great\ninvention.   Standards  are a\ngood thing, and I think browsers should work to implement them and page\nauthors should comply with them to make information more accessible to\neveryone. \n  My pages comply with the the  HTML  and  CSS  standards.  Many of my\n  pages use the  W3C Core Styles .  They\n  have been validated by the  W3C 's  HTML Validator  or\n  by the  Web Design Group 's  HTML Validator .\n  I support the  Best Viewed With\n  Any Browser  campaign because the purpose of the web was to allow\n  more people to have access to information, not to be able to see that\n  there is information that they can't access.  I use  Cascading Style\n  Sheets  because they allow the author to describe design\n  preferences.  These preferences can be overridden by the user, but they\n  do not make the page harder to use on systems that the author couldn't\n  imagine when he wrote the page.  Device independence and more user control\n  are badly needed on the web.  I support the  Web Standards Project  because\n  it is very important for browsers to support the standards as\n  written, so those making web pages don't have to worry about which\n  tags will display correctly and which tags will crash which browsers,\n  etc.  For example, when I added ACRONYM and ABBR elements to this\n  page to indicate acronyms and abbreviations (helpful to users with\n  disabilities or those who don't know what the acronyms are), the page\n  crashed Netscape Navigator, so I had to remove those elements.\n  P.S.  Is your software  2038\n  January 18 compliant ?  This may be more serious than 2000 January\n  1, since C stores times as seconds since 1970 January 1.  This number\n  will reach 2 to the 31st on Monday, 2038 January 18, after which it\n  will roll back to 1901 December (12th?).\n Recent\n  developments  have made me somewhat concerned about Microsoft's\n  attempts to destroy some very good programs and get them replaced\n  with stuff that isn't as good.  It's clear that they wouldn't need\n  such advanced strategy if their products were better.\n Statistical Errors \n I am interested in many fields of science, and the main issue about\nwhich I\n argue  is errors in probability and statistics.  I wrote\n an article on the errors in the National Hurricane\nCenter probability forecasts , and also\n a letter about errors in probability calulations\nrelating to the crash of TWA flight 800 . \n Education \n I also have, because I want it published somewhere, an  article criticizing the school  that I wrote in\neighth grade, but was censored from the school paper. \n LDB ,\n dbaron@dbaron.org"}