{"url": "https://tr.wikipedia.org/wiki/Z%C3%BCmr%C3%BCd%C3%BCanka_Yolda%C5%9Fl%C4%B1%C4%9F%C4%B1", "content": "Zümrüdüanka Yoldaşlığı - Vikipedi \n Zümrüdüanka Yoldaşlığı   \n Vikipedi, özgür ansiklopedi   \n\t\t\t\t\tŞuraya atla:\t\t\t\t\t kullan , \t\t\t\t\t ara \n Zümrüdüanka Yoldaşlığı \n Aktif \n 1970'ler-1998 \n Liderler \n Albus Dumbledore [HP5] [HP6] \n Merkez(ler)i \n Grimmauld Meydanı 12 [HP5] [HP6] \n Kovuk [HP7] \n Müttefikler \n Sihir Bakanlığı   ·  Seherbazlık Bürosu  ·   Dumbledore'un Ordusu \n Karşıtlar(ı) \n Lord Voldemort   ·   Ölüm Yiyenler   · \n Sihir Bakanlığı [HP7] \n Savaşlar(ı) \n Büyücü Savaşları \n Zümrüdüanka Yoldaşlığı ,  J.K. Rowling  tarafından yazılmış olan  Harry Potter  serisinin kurgusal gizli bir örgütüdür.  Lord Voldemort  ve onun takipçileri olan  Ölüm Yiyenler 'e karşı mücadele eden, serinin beşinci kitabı olan  Harry Potter ve Zümrüdüanka Yoldaşlığı 'na da adını veren yoldaşlık  Albus Dumbledore  tarafından kuruldu. \n İçindekiler \n 1   Özet \n 2   Üyeler \n 2.1   İlk üyeler \n 2.2   Yeniden oluşturulan yoldaşlık üyeleri \n 3   Yoldaşlık üyeleri \n 3.1   Sirius Black \n 3.2   Fleur Delacour \n 3.3   Aberforth Dumbledore \n 3.4   Arabella Figg \n 3.5   Mundungus Fletcher \n 3.6   Remus Lupin \n 3.7   Alastor Moody \n 3.8   James Potter \n 3.9   Lily Potter \n 3.10   Kingsley Shacklebolt \n 3.11   Nymphadora Tonks \n 3.12   Arthur Weasley \n 3.13   Bill Weasley \n 3.14   Charlie Weasley \n 3.15   Molly Weasley \n 4   Kaynakça \n Özet [ değiştir  |  kaynağı değiştir ] \n Albus Dumbledore  tarafından  Lord Voldemort 'a karşı kurulmuş bir örgüttür. Amacı  Voldemort 'a karşı savaşmaktır. Örgütün karagahı Grimmauld Meydanı 12 Numara'dır. King's Cross'a bir mil uzaklıkta, Londra'nın harap bir bölgesinde bulunan bu eski ev Fidelius Büyüsü ile gizleniyor. \n Zümrüdüanka Yoldaşlığı üyeleri kişinin kendi isteğine bağlı olarak seçilir. Kişinin mümkünse tam bir eğitim almış ve reşit olması gereklidir. Kişinin kişisel ve fiziksel özelikleri, güvenilirliği, kabiliyetleri ve sağlık durumları önemlidir. Yoldaşlığa katılan kişiler asıl yoldaşlık üyelerinin verdiği görevlere hazırlıklı olmalıdırlar. \n Üyeler [ değiştir  |  kaynağı değiştir ] \n İlk üyeler [ değiştir  |  kaynağı değiştir ] \n Aşağıda bulunan Zümrüdüanka Yoldaşlığı üyeleri Lord Voldemort'un ilk yükseliş yıllarından sonra ve serinin içinde geçen geçmiş yıllardaki önemli olayların içinde yer almışlardır. Birçok karakter daha sonraki olayların içinde de bulunmuştur. \n Karakter \n Başarıları ve Operasyonları \n Sirius Black \n Azkaban 'dan kaçmış ve Yeniden toplanan Yoldaşlık'ta görev almaya devam etmiştir. Esrar Dairesi içindeki savaşta, kuzeni  Bellatrix Lestrange  tarafından öldürülmüştür.  Harry 'nin vaftiz babası ve  James Potter 'ın en iyi arkadaşıdır. Köpek şekline dönüşebilen kayıtsız bir  animagustur . Öldükten sonra Harry'ye evini ve ev cini  Kreacher  bırakmıştır. \n Edgar Bones \n Voldemort 'a karşı ilk savaşta karısı ve çocuklarıyla beraber öldürülmüştür. Sihir Bakalığı Sihirsel Hukuk ve Uygulama Bölümü Başkanı Amelia Bones, Edgar Bones'un kardeşidir. Amelia Bones'un kızı Susan Bones, Harry Potter'ın döneminde bir  Hufflepuff  öğrencisidir. \n Caradoc Dearborn \n Voldemort'a karşı ilk savaşta kaybolmuştur.  Ölüm Yiyenler  tarafından öldürüldüğü düşünülmektedir. \n Dedalus Diggle \n Yoldaşlık üyesi olduğunu söylemeden önce  Harry Potter  ile pek çok kez karşılaşmıştır. Beşinci kitabın başında Harry Potter'ı  Grimmauld Meydanı 'na götüren ekibin üyesidir. Yedinci kitabın başında Hestia Jones'la birlikte Dursleylerin Privet Drive 4 numaradan ayrılmasına eşlik etmiştir. Daha sonra Ölüm Yiyenler Dedalus Diggle'ın evini yakmıştır fakat Dedalus zarar görmemiştir. \n Elphias Doge \n Dumbledore 'un  Hogwarts 'ta okuduğu sırada sınıf arkadaşıdır. Dumbledore'un ölümünden sonra Gelecek Postası'nda açıkça Dumbledore'u savunan bir anı yazısı yazmıştır. Beşinci kitabın başında Harry Potter'ı Grimmauld Meydanı'na götüren ekibin üyesidir. \n Aberforth Dumbledore \n Albus Dumbledore un kardeşi.  Hogsmeade 'deki Domuz Kafası barının barmeni. Devamlı olarak Yoldaşlık'ı Hogsmeade'de olanlar hakkında bilgilendirmiştir. Yedinci kitapta, Harry Hogwarts'a giderken Ölüm Yiyenler tarafından yakalanmasını engellemiştir. Ayrıca Harry ve arkadaşlarına Malfoy Malikesinden kurtulmasına yardımcı olması için Dobby'i göndermiştir. Hogwarts Savaşında bulunmuştur. \n Albus Dumbledore \n Hogwarts Cadılık ve Büyücülük Okulu'nun Müdürüdür. Yoldaşlığı kurmuştur. Voldemort'un dirilişinden sonra Yoldaşlık'ı tekrar toplamıştır. Zamanının en büyük büyücüsüdür. Ayrıca Voldemort'un korktuğu tek büyücü olduğu söylenir.  Severus Snape  tarafında öldürülmüştür, fakat ölümünü daha önce Snape ile planlamıştır. \n Benjy Fenwick \n İlk Savaş sırasında Ölüm Yiyenler tarafında öldürülmüştür. \n Arabella Figg \n Bir  Kofti 'dir. Dumbledore tarafından Harry'i kontrol etmesi için Privet Drive'da bulundu. \n Mundungus Fletcher \n Bir hırsızdır. Zamanında Dumbledore onu hapse girmekten son anda kurtarmıştır. Dumbledore'un bu iyiliğine karşı sihir dünyasının kirli işler tarafında neler döndüğü hakkında Yoldaşlığı bilgilendirmiştir. Yedinci kitapta Harry'nin Dursleylerden Kovuk'a taşınmasına yardımcı olmuştur fakat Voldemort yaklaşınca panikleyip cisimlenmiş ve  Alastor Moody 'i yalnız bırakıp Moody'nin Voldemort tarafından ölümüne sebep olmuştur. \n Rubeus Hagrid \n Hogwarts'ta Sihirli Yaratıkların Bakımı dersinin öğretmeni, bekçi ve anahtar koruyucusudur. Voldemort'un saldırısı sonucu  Godric's Hollow 'daki yıkılan evden Harry'i çıkarmış ve Sirius'un uçan motosikletiyle  Dursleylere  götürmüşütür. Yeniden kurulan Yoldaşlık'a hizmet etmiştir. Yedinci kitapta Harry'nin Dursleylerden Kovuk'a taşınmasına yardımcı olmuştur. \n Frank ve Alice Longbottom \n Neville Longbottom 'un ebebeynleridir. Önemli seherbazlardandır. Voldemort'un düşüsünden sonra  Bellatrix Lestrange  başta olmak üzere bir grup Ölüm Yiyen tarafından yakalanmış ve Voldemort'un nerede olduğunu öğrenmek için Cruciatus Laneti ile işkenceye uğramışlardır. İşkence sonunda zihincel sağlıklarını kaybedip St. Mungo Sihirsel Hastalıklar ve Sakatlıklar hastanesine yatırılmışlardır. \n Remus Lupin \n Bir kurtadamdır. İlk Yoldaşlık'ın üyesidir. Yoldaşlık yeniden toplandıktan sonra önemli üyelerinden biridir. Üçüncü kitapta Hogwarts'ta Karanlık Sanatlara Karşı Savunma dersini vermiştir fakat Severus Snape'in Lupin'in kurtadam olduğunu ağzından kaçırmasından sonra istifa etmek zorunda kalmıştır. Beşinci kitabın başında Harry Potter'ı Grimmauld Meydanı'na götüren ekibin üyesidir. Yedinci kitapta Harry'nin Dursleylerden Kovuk'a taşınmasına yardımcı olmuştur. Voldemort yeniden yükseldikten sonra yeraltı kurtadamlar birliğine gitmiş ve hangi tarafta bulunacaklarını öğrenmiştir. Daha sonra  Nymphadora Tonks  ile evlenmiş ve Teddy Lupin adında bir oğulları olmuştur. Hogwarts Savaşı sırasında Antonin Dolohov tarafından öldürülmüştür. [1] \n Minerva McGonagall \n Hogwarts Cadılık ve Büyücülük Okulu müdür yardımcısı, Biçim değiştirme öğretmeni ve Griffindor Binası sorumlusudur. Yeniden toplanan Yoldaşlık'ta bulunmuştur. Dumbledore'un fikirlerine büyük destek vermiştir.  Hogwarts Savaşı  sırasında şatonun savunulmasını yönetmiştir. Savaşın sonunda Kingsley Shacklebolt ve Horace Slughorn ile birlikte Voldemort'a karşı düello etmiştir. \n Marlene McKinnon \n Ailesiyle birlikte Ölüm Yiyenler tarafından öldürülmüştür. \n Dorcas Meadowes \n İlk Yoldaşlık'ın bir üyesidir. Lily Potter dışınde Voldemort'un bizzat kendisi tarafından öldürülmüş bilinen tek cadıdır. \n Alastor \"Deli-Göz\" Moody \n İlk savaş'tan beri Yoldaşlık üyesidir. Bir  seherbazdır . Dördüncü kitapta Dumbledore'un isteğiyle  Karanlık Sanatlara Karşı Savunma  dersini vermeyi kabul etmiştir fakat Bartemius Crouch Jr. tarafından saldırıya uğramış, esir alınmış ve İmperius laneti ile kendisi hakkında bilgileri vermeye zorlanmıştır. Beşinci kitabın başında Harry Potter'ı Grimmauld Meydanı'na götüren ekibin üyesidir. Yedinci kitapta Harry'nin Dursleylerden Kovuk'a taşınmasına yardımcı olmuştur fakat Voldemort yaklaştığında Mundungus Fletcher panikleyip kaçınca yalnız kalmış ve Voldemort tarafından öldürülmüştür. Sihirli gözü Ölüm Yiyenler tarafından alınmış fakat daha sonra Harry Potter gözü geri almıştır. \n Peter Pettigrew \n Lakabı Kılkuyruk'tur. Kayıt altında olmayan fare şekline girebilen bir Animagus'tur. James Potter, Sirius Black ve Remus Lupin'in yakın arkadaşıdır. Daha sonra Ölüm Yiyenlere katılmış ve James ve Lily Potter'a ihanet edip onların yerini Voldemort'a söylemiştir. Voldemort'un yeniden dirilmesine yardımcı olmuştur. Voldemort'un geri dönüşü için yaptığı iksirde kendi elini kesmiş sonrasında voldemort ona ödül olarak sihirli el yapmıştır. 7. kitapta Harry Potter'a az da olsa minnetinden ötürü Voldemortun hediye ettiği elle intihar etmiştir \n Sturgis Podmore \n Beşinci kitabın başında Harry Potter'ı Grimmauld Meydanı'na götüren ekibin üyesidir. Esrar Dairesi'nin kapısında Kehanet'i koruyan üyelerden biridir. Daha sonra Bakanlık güvenliği tarafından Esrar Dairesi'ne girdiği için yakalanmış ve altı ay boyunca Azkaban'a gönderilmiştir. Fakat Harry, Ron ve Hermione onun Lucius Malfoy'un yaptığı bir İperius Laneti altında olduğunu iddia etmiştir. bir görünmezlik pelerinine sahip olduğu bilinir. \n Lily  ve  James Potter \n Harry Potter'ı öldürmek isteyen Voldemort'u engellemeye çalışırken öldürülmüşlerdir. \n Fabian and Gideon Prewett \n Molly Weasley'nin kardeşleridir. İlk Savaş sırasında öldürülmüşlerdir. İkisini öldürmek için beş tane Ölüm Yiyen'e ihtiyaç olmuştur. Bu Ölüm Yiyenler arasında Antonin Dolohov da vardır. Molly daha sonra Fabian'ın saatini Harry'ye hediye olarak vermiştir. \n Severus Snape \n Hogwarts Cadılık ve Büyücülük Okulu'nda 6. yıla kadar İksir 6. yıl Karanlık Sanatlara Karşı Savunma dersini vermiştir. Dumbledore öldükten sonra müdürlük görevini de yapmıştır. Eski bir Ölüm Yiyen'dir fakat Voldemort'un Lily Potter'ı öldürme planını öğrendikten sonra Ölüm Yiyenlere karşı Dumbledore'a casusluk yapmaya başlamıştır. Voldemort dirildikten sonra çift taraflı casusluk yapmaya devam etmiştir. Lily Potter'ın olduğu gibi onunda patronusu bir maral şeklini alır. Patronusunu kullanarak Dean Ormanı'nda Harry Potter'a Godric Gryffindor'un kılıcını vermiştir. Hogwarts Savaşı sırasında Voldemort'un yılanı Nagini tarafından öldürülmüştür. \n Emmeline Vance \n Beşinci kitabın başında Harry Potter'ı Grimmauld Meydanı'na götüren ekibin üyesidir. 1996 yazında Ölüm Yiyenler tarafından öldürülmüştür.--> \n Yeniden oluşturulan yoldaşlık üyeleri [ değiştir  |  kaynağı değiştir ] \n Buradaki karakterler  Harry Potter ve Ateş Kadehi 'nin sonunda Lord Voldermort'un geri dönüşüyle Dumbledore yoldaşlığı tekrar aktif etmesi ile yoldaşlığa katılmışlardır. \n Karakter \n Başarıları ve Operasyonları \n Fleur Delacour \n Daha çok  Bill Weasley  ile evlendikten sonra Yoldaşlık'ta etkin olmaya başlamıştır. Yedinci kitapta  Harry 'nin  Dursleylerden   Kovuk 'a taşınmasına ve  Dobby 'nin ölümünden sonra Denizkabuğu Kulübesi'nde Harry ve arkadaşlarının yaralarının bakımına yardımcı olmuştur. Üç Büyücü Şampiyonası'nın tek kadın şampiyonudur. Şampiyona'da ikinci görevi tamamlayamamıştır.  Hogwarts Savaşı 'nda bulunmuştur. \n Hestia Jones \n Beşinci kitapta Harry'nin Dursleylerden kaçmasına yardımcı olmuştur. Yedinci kitabın başında Dedalus Diggle'la birlikte Dursleylerin Privet Drive 4 numaradan ayrılmasına eşlik etmiştir. Hestia, Dursleylerin  Voldemort 'a karşı harekette Harry'nin önemine aldırış etmemesine çok şaşırmıştır. \n Kingsley Shacklebolt \n Bir  Seherbaz 'dır.  Muggle  başbakanı bilgilendirme ve koruma görevi vardır. Beşinci kitapta  Sirius Black 'i arayan ekibin başındadır. Kitabın sonunda  Bakanlık 'ta  Ölüm Yiyenler 'e karşı savaşmıştır. Yedinci kitapta Harry'nin Dursleylerden Kovuk'a taşınmasına yardımcı olmuştur. Kitabın sonundaki Hogwarts Savaşı'nda Yoldaşlık üyelerini organize etmeye yardımcı olmuştur. Savaşın sonlarına doğru Voldemort ile düello etmiştir. Voldemort'un ölümünde sonra Sihir Bakanı seçilmiştir. \n Nymphadora Tonks \n Bir  Metamorfmagus  ve  Seherbaz 'dır. Beşinci kitapta Bakanlık'ta Ölüm Yiyenlere karşı savaşmıştır.  Remus Lupin  ile evlenmiş ve Teddy adında bir çocukla olmuştur. Teddy de annesi gibi bir Metamorfmagusdur. Dumbledore'un ölümünden sonra Hogwarts'a saldıran Ölüm Yiyenlere karşı savaşmıştır. Yedinci kitapta Harry'nin Dursleylerden Kovuk'a taşınmasına yardımcı olmuştur. Hogwarts Savaşı sırasında teyzesi  Bellatrix Lestrange  tarafından öldürülmüştür. \n Arthur Weasley \n Beşinci kitapta insanları Harry ve Dumbledore'un hikâyesine inandırmaya çalışmıştır. Esrar Dairesi'nin kapısında koruma görevi sırasında Nagini tarafından ısırılmıştır. Yedinci kitapta Harry'nin Dursleylerden Kovuk'a taşınmasına yardımcı olmuştur. Hogwarts Savaşı'nda bulunmuş ve  Pius Thicknesse 'a karşı üçüncü oğlu  Percy Weasley  ile savaşmıştır. \n Bill Weasley \n Gringotts Büyücü Bankası 'nda lanet bozucu olarak çalışmıştır. Bu yüzden Yoldaşlık ve Cincüceler arasındaki bağlantı kurmaya çalışmıştır. Dumbledore'un ölümünden sonraki Hogwarts saldırısında kurtadam  Fenrir Greyback  tarafından ısırılmıştır. Yedinci kitapta Harry'nin Dursleylerden Kovuk'a taşınmasına yardımcı olmuştur. Hogwarts Savaşı'nda bulunmuştur. \n Charlie Weasley \n 1995 yazında yabancı Yoldaşlık üyeleri ile bağlantı kurmaya yardımcı olmuştur. Hogwarts Savaşı'nda bulunmuştur. \n Molly Weasley \n Beşinci kitapta Esrar Dairesi'nin korunması yardımcı olmuştur. Yedinci kitapta Yoldaşlık'ın Kovuk'u karargâh olarak kullanmasına izin vermiştir. Hogwarts Savaşı'nda bulunmuş ve  Bellatrix Lestrange  ile düello etmiş ve onu öldürmüştür. \n Yoldaşlık üyeleri [ değiştir  |  kaynağı değiştir ] \n Zümrüdüanka yoldaşlarının önemli üyelerinin bir listesidir. Albus Dumbledore, Severus Snape ve Rubeus Hagrid kendi sayfaları bulunmakta. Minerva McGonagall Hogwarts kadrosu altında listelenir. \n Sirius Black [ değiştir  |  kaynağı değiştir ] \n Sirius Black ,  Harry Potter 'ın Vaftiz Babası olan Sirius Black, Black ailesinin son torunudur. Kardeşi Regulus Blacktir. Sirius Black (1959)  Harry Potter 'ın babası  James Potter  'ın en yakın arkadaşlarından birisidir. Diğer arkadaşları  Remus Lupin  ve  Peter Pettigrew 'dir.Sirius arkadaşlarıyla birlikte \" Çapulcu Haritası \", nı yapmıştır. Sirius bir  Animagus 'tur.Takma adı Padfoot, yani Patiayak'tır.Aile üyelerinin tümü  Slytherin  binasında olmasına rağmen sadece o  Gryffindor  binasına seçilmiştir.Son kitapta  Severus Snape 'in anısında bu olaydan bahsedilmektedir. İşlemediği bir suç yüzünden  Azkaban 'a götürülmüş fakat kaçmayı becermiştir. Herkes tarafından katil olarak bilinen,  Harry Potter 'ın da anne ve babasının yakın arkadaşı olmasına rağmen onlara ihanet ederek yerlerini  Lord Voldemort 'a söylediğini düşündüğü, ancak gerçek ortaya çıktıktan sonra Harry'nin babası yerine koyarak bağlandığı bir  Zümrüdüanka Yoldaşlığı  üyesidir. Sirius, Profesör  Albus Dumbledore  tarafından en çok güvenilen isimlerin başında gelir. Ancak Sirius gençliğinde okuldan arkadaşı olan Yoldaşlık Üyesi ve  Ölüm Yiyen  casusu  Severus Snape 'in neredeyse ölmesine neden olacağından dolayı aralarında büyük bir gerginlik vardır. Sirius, Black ailesinin son üyesi olarak  Grimmauld Meydanı 12 Numara 'daki evinin Zümrüdüanka Yoldaşlığı 'nın buluşma noktası olarak kullanılmasına izin vermiştir. Bu ev Sirius'un  Bellatrix Lestrange  ile yaptığı düelloda ölmesinin ardından isteği üzerine tek varisi olan Harry'ye kalmış ve o da evi yeniden Yoldaşlık üyelerinin kullanımına bırakmıştır. Bu evin sır tutucusu Dumbledore'da öldüğü için şimdilik yeni bir sır tutucu seçilene kadar ev artık yoldaşlık üyeleri için güvenli değildir.Sirius'un ölümüne Bellatrix'le yaptığı düello sebep olmuştur. Esrar Dairesi'nde Bellatrix'le düello yaparken göğsüne kırmızı bir ışık çakıp tülün arkasına düşmüştür. \n Fleur Delacour [ değiştir  |  kaynağı değiştir ] \n Fleur Delacour  ( 1977 )  Harry Potter serisindeki  kurgusal karakterlerden biri. İlk olarak serinin dördüncü kitabı olan \"Harry Potter ve Ateş Kadehi\"nde göründü. Serinin altıncı kitabı olan \"Harry Potter ve Melez Prens\"te ise Bill Weasley'nin nişanlısıydı. \n Fransa 'da bulunan Beauxbatons Sihir Akademisi'nin şampiyonu olarak okulunu  Üçbüyücü Turnuvasında  temsil etti. İngilizce'sini ilerletmek için Gringotts'da iş bulmuş ve Bill Weasley'den özel ders almaya başlamıştır. \n Kız kardeşi Gabrielle Delacour, büyükannesi ise bir veeladır. Fleur'un asasında büyükannesinin saç tellerinden bulunduğu bilinmektedir. \n Dördüncü filmde bu karakteri  Clémence Poésy  canlandırdı. \n Aberforth Dumbledore [ değiştir  |  kaynağı değiştir ] \n Aberforth \"Abe\" Dumbledore   Albus Dumbledore 'un kardeşidir.  Domuz Kafası  barının sahibidir ve Zümrüdüanka Yoldaşlığı'ndadır. Patronus'u keçidir. Kendisi Kendra ile Percival Dumbledore'un oğludur. Ağabeyi  Albus Dumbledore  ve kardeşi  Ariana Dumbledore  ile yaşamaktadır. Her zaman kardeşine iyi davranmıştır. Fakat ağabeyini pek sevmemektedir. Babası Percival öldüğünde çok üzülmüştür ki annesi Kendra'yı Ariana yanlışlıkla öldürmüştür. Albus hiç kardeşine bakmıyor diye annesinin cenazesinde Albus'un burnunu kırmıştır. Ayrıca ağabeyinin arkadaşı olan  Elphias Doge 'dan da nefret etmektedir. Sonra  Gellert Grindelwald  adında birisi  Godric's Hollow 'a  Ölüm Yadigârları 'nı araştırmaya gelmişti. Ağabeyi de  Grindelwald  gibiydi. Aynı amaçları vardı. Fakat  Grindelwald  ile kendisi arasında bir tartışma çıkmıştır. Bu tartışma üçlü kavgaya dönüşür ve düello yaparlar. Sonra Ariana gelir üçünden birinin Öldüren Lanet'i onu öldürmüştür. Hangisi bilinmiyordur. Ariana öldükten sonra Aberforth Albus'la hiç konuşmamaya karar verir ve Hogsmade'e taşınmıştır. Orada  Domuz Kafası  adında bir bar açmış ve orada yaşamaya karar vermiştir. Daha sonra Albus'tan ayrı olarak Zümrüdüanka Yoldaşlığı'na katılmıştır. Ağabeyi  Severus Snape  tarafından öldürüldüğüne ne çok üzülmüş, ne de çok sevinmiştir. Son savaşta yer almış ve  Augustus Rookwood 'u yenmiştir. \n Arabella Figg [ değiştir  |  kaynağı değiştir ] \n Arabella Figg ,  Privet Drive 'da oturan, Petunia Teyze ile Vernon Enişte'nin komşusudur. Aynı zamanda o bir  Koftidir .  Dumbledore  tarafından  Harry 'ye göz kulak olması için görev verilmiştir. Tam bir kedi düşkünüdür.  Zümrüdüanka Yoldaşlığı  üyesidir. Kendisi bir  kofti  olduğundan bakanlık kayıtlarında yer almaz. Arabella  Harry Potter 'ın okuldan atılması için düzenlenen mahkemedeki tek şahittir. \n Mundungus Fletcher [ değiştir  |  kaynağı değiştir ] \n Mundungus Fletcher , ilk olarak  Harry Potter ve Sırlar Odası  kitabında adı görülür. Güvenilmez bir yoldaşlık üyesidir ama  Albus Dumbledore 'a sadıktır. Ruh Emiciler Little Whinging'e geldiği gece  Harry 'i korumakla görevlidir. Ancak görevini tam anlamıyla yerine getirmez.  Sirius Black  öldükten sonra evine girer ve  Kreacher 'a rağmen bazı değerli eşyaları çalar. \n Remus Lupin [ değiştir  |  kaynağı değiştir ] \n John Remus Lupin ,  J.K. Rowling 'in  Harry Potter serisi 'nde yer alan kurgusal karakter. Remus Lupin adını, mitolojide ikiz kardeşi Romulus ile birlikte kurtlar tarafından yetiştirilen Remus karakterinden almıştır. \n Harry Potter 'ın babasının en iyi arkadaşlarından biridir.  Fenrir Greyback  tarafından küçükken ısırılıp bir  kurtadam  olmuştur. Harry üçüncü sınıftayken onun Karanlık Sanatlara Karşı Savunma hocalığını yapmıştır.  Zümrüdüanka Yoldaşlığı  'nın bir üyesidir.  Dumbledore 'un güvendiği biridir.  Peter Pettigrew ,  Sirius Black  ,  James Potter  ve  Lily Potter  onun  Hogwarts 'ta sahip olduğu tek arkadaşlarıdır. Üçü de onun kurtadam olduğunu öğrendiklerinde Lupin'in sandığının aksine onu bırakmamış hatta onu yalnız bırakmamak için birer  animagus  olmuşlardır. Lupin,  James Potter ,  Peter Pettigrew  ve  Sirius Black  ile beraber kendilerine \"Çapulcular\" dedikleri bir çete kurmuş ve  Harry Potter 'ın  Hogwarts 'taki 3. yılında ilk olarak kullandığı,  Fred ve George Weasley  tarafından bulunmuş ve Harry'ye verilmiş olan  Çapulcu Haritası 'nı oluşturmuşlardır.  Çapulcu Haritası  \"Hiçbir işe yaramadığıma yemin ederim.\" cümlesi söylendiğinde  Hogwarts  haritasına dönüşen ve o anda  Hogwarts  arazisindeki herkesi gösteren bir parşömendir. \n Harry'nin üçüncü yılında  Hogwarts 'ta Karanlık Sanatlara Karşı Savunma Profesörü olduğu dönemde Dolunay çıktığında İksir profesörü  Severus Snape  tarafından hazırlanan kurtboğan iksirini alarak ve saklanarak bu özelliğini saklamaya çalışmıştır.  Sirius Black  ve  Dumbledore 'un ölümünden sonra Weasley'ler ile birlikte Harry'nin en çok güvenebileceği yetişkinin Lupin olduğu söylenebilir. \n Nymphadora Tonks  ile evlenmiş ve Teddy Remus Lupin adında bir çocuğu olmuştur. \n Kurt boğan iksirinden önce Lupin her dolunayda canavarlaşıyordu. Dumbledore gerekli önlemleri alarak Lupin'in Hogwarts'ta okuyabilmesini sağladı. O geldiği yıl Şamarcı Söğüt dikildi ve onun Hogsmeade'deki Bağıran Baraka'ya ulaşabilmesi için Söğüt yanından girişi olan gizli geçit yapıldı. Her dolunayda Lupin okuldan bu geçit ile Bağıran Baraka'ya getirilir ve dönüşümünü tamamlaması sağlanırdı. Hogwarts'ta ders verdiği zamanlarda Böcürt'ler konusunu anlatırken karşısındaki kişinin en çok korktuğu şeye bürünen bu yaratıklar Lupin'i gördükleri zaman dolunay şekline dönüşürlerdi. Şamarcı Söğüt, dönüşümde Kurtadam ile kimsenin karşılaşmamasını sağlardı. \n Kurtadama dönüşmek çok acı verir ve bu dönüşümde insanları ısırmak ister. Bağıran Baraka'da kimseyi ısıramayan Lupin kendini ve eşyaları ısırır, tırmalardı. Bundan dolayı çıkan sesleri, gürültüyü ve çığlıkları köylüler vahşi ruhlardan ötürü duyduklarını sanıyorlardı.  Dumbledore  da bu iddiaları destekliyordu. Lupin'in en çok korktuğu şey en iyi arkadaşlarını animagus olduğu için kaybetmekti. Kurtadamlar sadece insanlar için tehlikelidir. Bu yüzden en çok sevdiği arkadaşları uzun uğraşlar sonucunda  animagus  oldular. \n Hogwarts 'ta Karanlık Sanatlara Karşı Savunma dersinin üçüncü öğretmenidir. Hogwarts Ekspresi'nde Harry ile aynı kompartmandaydı ve Harry'yi Ruh Emici'lere karşı korudu. James Potter’ın en iyi arkadaşlarından ve  Çapulcu Haritası 'nın dört yaratıcısından biridir. Kendi dönemlerinde; 5. sınıfta sınıf başkanlığı da yapmıştır. Karanlık Sanatlara Karşı Savunma eğitiminde babadan oğula geçen sisteme inanır. Yıl sonunda ailelerden gelecek baskılardan korktuğu için istifa etmiştir. \n Severus Snape  \"kazayla\" ağzından kurtadam olduğunu kaçırmasıyla birlikte okuldan istifa etmesine rağmen Lupin Severus'a karşı hiçbir şey hissetmez. Bu yüzden de okulda ders verdiği dönemlerde yapmış olduğu Kurtboğan İksiri sayesinde de Dolunay dönemlerini acısız geçirdiğini de unutmaz. \n Okuldaki döneminden sonra  Dumbledore 'un Kurtadamlar arasında bir casusa ihtiyacı olması üzerine yeraltında onlarla birlikte yaşamaya başladı. Çünkü Kurtadamlar,  Voldemort  tarafında yer alıyorlardı. \n Önceleri kurtadamların büyücüler arasında yaşamasından dolayı taşıdığı izler yüzünden Lupin'i kabul etmeleri oldukça zor oldu. Çünkü kurtadamlar sadece yiyecek için normal insanların yanlarına yaklaşıyorlardı.  Voldemort  yönetiminde daha iyi bir hayatlarının olacağını düşündükleri için de destekliyorlar. \n 1997 'nin başlangıcında  Tonks  ile evlenmişlerdi ve bir bebek beklemektedirler. Ancak Lupin bu olaydan son derece rahatsızdır. Doğacak bebeğin de bir kurtadam olacağı fikri onu üzmektedir. Bu yüzden de evliliğine pişmanlık olarak bakmaktadır. Kendi türündekilerin genellikle üremediğini söyler, doğacak çocuğunun onu bu özelliğini almasından veya almazsa da babasından utanmasından kaygılanır. Ancak Harry'nin bu düşüncesinden dolayı kendisine yönelik suçlamalarından etkilenen Lupin olayı kabullenmeyi ve mutlu olmayı başarmıştır. Doğan çocuk Lupin'in düşündüğü gibi bir kurtadam değildir bir  Metamorfmagustur . Erkektir ve adı Ted olmuştur. Bu,  Nymphadora Tonks 'un babasının adıdır. Vaftiz babasının Harry Potter olmasını ister. Lupin  Voldemort 'tan korkmayan sayılı kişilerdendir. Onun adını korkmadan söyleyebilir. Bu onun korkusuz olduğunun ve  Voldemort 'la dahi savaşabileceği anlamına gelmektedir. Esrar dairesindeki savaşta tüm Zümrüdüanka Yoldaşlığı üyeleri devrilmişken Lupin halen ayaktadır.  Voldemort , onu ve karısı  Nymphadora Tonks 'u öldürme görevini özellikle bizzat en güvendiği müriti olan  Bellatrix Lestrange 'a vermiştir. Ama Bellatrix bunu başaramayacağını anlayınca  Hogwarts Savaşı 'nda  Nymphadora Tonks 'u arkasından vurmuş ve onu öldürmüştür. Ancak Lupin'i öldürmeyi başaramamıştır. Lupin  Hogwarts Savaşı 'nda en büyük komutan olarak kulelerde savaşmıştır. \n Remus Lupin Ölüm Yadigarların'nda okuldaki savaşta hayatını kaybetmiştir. Asıl nedeni ise tam  Antonin Dolohov 'u devirmiş başka bir  Ölüm Yiyen 'le savaşmaya giderken  Antonin Dolohov  onu arkadan Öldüren Lanet ile vurmuştur. \n Alastor Moody [ değiştir  |  kaynağı değiştir ] \n Alastor \"Deli-Göz\" Moody  ilk olarak  Harry Potter ve Ateş Kadehi  kitabında adı geçmiştir.  Hogwarts 'ta  Karanlık Sanatlara Karşı Savunma dersi 'ne girmek üzere görevlendirilmiştir.(Ancak derslere çok özlü iksirle ona benzeyen ve kendisini bir sandığa kapatan Barty Crouch girmiştir.) Kitapta eski bir seherbaz olduğu söylenmiştir. Yüzündeki yaraları ile çok dikkat çekicidir. Ağzı küçük bir kesik biçimindedir ve yüzü sanki tahtadan oyulmuş gibidir.  Azkaban 'a en fazla  Ölüm Yiyen  koyan seherbaz olarak bilinmektedir. Bir gözü anormal olduğu ve görünmezlik pelerini dahil çok fazla şey görebildiği için ona Deli-Göz Moody de denir.  Zümrüdüanka Yoldaşlığı  üyesidir. Son kitap olan Harry Potter ve Ölüm Yadigarları'nda Harry'yi kaçırma eylemi sırasında Voldemort'un Avada kedavra laneti yüzüne gelmiştir. Bunu Fleur ve Bill söylemiştir. Ardından çok büyük yükseklikten yere düştüğü için lanetle ölmese bile yere düşerek ölmüştür. Remus Lupin ve Bill Weasley cesedi bulmak için yola çıkmışlardır fakat cesedi bulamamışlardır. 5. kitap olan Zümrüdüanka Yoldaşlığı 'nda da yoldaşlık üyeleriyle beraber Harry ve arkadaşlarını kurtarmaya gelmiştir. Çok güçlü bir büyücüdür.  Ölüm Yiyenler  onun büyü gücünden daima korkmuşlardır.  Evan Rosier  ile düello ederken burnundan büyük bir parçası kopmuştur. \n James Potter [ değiştir  |  kaynağı değiştir ] \n James Potter  (d.  1960  - ö.  1981 ),  Safkan   büyücü . Siyah saçlı, ela gözlü ve Harry gibi yuvarlak gözlüklü, zeki bir çocuktur.  1971  yılında  Hogwarts Cadılık ve Büyücülük Okulu 'na başladı. Hogwarts'ta üç yakın arkadaş edindi. Bunlarla Çapulcular Grubunu kurdu. Bu Kişiler  Sirius Black  (Patiayak),  Remus Lupin  (Aylak),  Peter Pettigrew  (Kılkuyruk), Kendi lakabı ise Çatalak'tı. Bu lakapların anlamı, Sirius'un animagusunun köpek, Lupin'in kurtadam (Remus animagus değildir), Peter'in animagusunun fare, kendisininkinin ise çatalboynuzlu geyik olmasıydı. Sirius, Peter ve James Remus ile beraber olabilmek için  animagusa  dönüştüler. James'in animagusa dönüştüğünde aldığı şekil \"çatalboynuzlu geyik\"tir. \n Hogwarts'ta  Gryffindor  öğrencisiydi. Çok yetenekli bir öğrenciydi. Kitaplarda da belirtildiği gibi sınıf başkanı olmasa da son yılında öğrenci başı olmuştur. Okul yıllarında  Severus Snape 'ten nefret ederdi. Bu nefreti karşılıksız değildi. Snape de James'den nefret ederdi. Bu nefretleri daha okullarındaki ilk yılda başlamıştı. James ilk olarak Snape'i Hogwarts Ekspresi'nde gördü. Snape, Lily'e \" Umarım Slytherin'e seçilirsin\"  derken James Sirius ile birlikte kompartımana girip küçümser bir ifadeyle \" Slytherin mi?\"  dedi . Snape \" Sen hangi binaya girmek istiyorsun?\"  deyince James hayali bir kılıç çıkarmış ve \" Yiğittir Gryffindor'da kalan çocuklar! \" diye haykırdı. Bunun üzerine Snape, \" Zeka yerine kası mı tercih ediyorsun? \" diye sordu. Sirius araya girip \" Sende ikisi de olmadığına göre sen nereye gireceksin? \" dedi. James, Snape'ten nefret ettiği için onunla sık sık dalga geçerdi. Ve okuldaki tüm öğrencilerin içinde onu küçük düşürürdü. Bu küçük düşürmesinde en yakın arkadaşı  Sirius Black  de ona yardım ederdi.  Remus Lupin  bu olaylara katılmasa da sınıf başkanı olmasına rağmen bu olayları engellemedi.  Peter Pettigrew  ise bu olayları izlemekten zevk alırdı. \n James Snape'e Sümsükus lakabını takmıştı. James ve Sirius okulun en çalışkan ve en yaramaz öğrencileriydi. James'in kardeşi gibi sevdiği Sirius'a güveni tamdı. Bu iki arkadaş en zorlu büyüleri bile öğrenci olmalarına karşın yapabiliyor ve bütün öğretmenleri şaşkına düşürüyordu. James kızlarla pek ilgilenir ve onlara gösteriş yapmayı severdi. Özellikle Lily Evans ile çok ilgilenirdi. Ancak Lily Evans ondan nefret ederdi. Okul sonrasında ise Lily Evans ile evlenmiş ve  Harry Potter  adlı bir çocukları olmuştur. Okulda  Gryffindor   Quidditch  Takımında kovalayıcı pozisyonunda oynardı. Çok iyi bir oyuncuydu. Bu yeteneği  Harry Potter 'a da geçmiştir. \n Okuldan sonra  Lord Voldemort 'a karşı olan  Zümrüdüanka Yoldaşlığı 'na katılmıştır.  Voldemort 'un elinden üç kez kaçmayı başarmıştır. Seherbaz olmasa da seherbaz sayılabilir.  Voldemort 'a karşı duran en ünlü ve güçlü büyücülerin başında gelir.  Godric's Hollow  adlı kasabada Lily Evans ile yaşamaya başlamışlardır. Ancak Voldemort'un peşlerinde olduğunu anlayınca kendilerini Fidelius büyüsü ile saklamıştır. James sır tutucularının Sirius olmasını ister; ama Sirius, Peter sır tutucusu olursa bunun Voldemort'un kafasını karıştırcağını düşünür ve Sır Tutucuyu Peter yapar. Ancak Peter çift taraflı bir ajandır ve Voldemort'a Potterların kaldığı yeri söyler.  Lord Voldemort  buraya gelir ve ilk önce James'i öldürür. İlk başta  Severus  Snape'in isteği üzerine Lily'i öldürmek istemez, ancak Lily çok ısrar edince onu da öldürür. Ve Harry'i öldürmeye kalkar. Ancak Lily Potter ölmeden önce hayatını feda ederek yaptığı sevgi büyüsüyle Harry'e Voldomert'un dokunmasını engellemiş, bu nedenle ölümcül  Avada Kedavra  laneti geri tepmiştir. James Potter, Harry Potter'ın içinde sevgi olarak yaşamaktadır. Ve bu sevgi Harry'nin Patronus Büyüsünün Çatal Boynuzlu Geyik şeklini almasıyla da anlaşılır. \n J.K Rowling bir televizyon programında yaptığı açıklamada filmdeki en beğenmediği rolün James Potter rolü olduğunu söylemiştir. Nedenini de şöyle açıklamıştır: \"James öldüğünde 21 yaşındaydı ve Harry'e benziyordu saçları aynı onun gibi gür ve dağınıktı. Ancak filmde gördüğümde hayal kırıklığına uğradım. Çünkü 35-40 yaşlarında gösteriyordu ve benim hayalimdeki kadar yakışıklı değildi. Onu kesinlikle Sirius ile birlikte çok yakışıklı hayal etmiştim.\" \n Lily Potter [ değiştir  |  kaynağı değiştir ] \n Lily Potter  muggle doğumludur. Harry Potter 'in annesidir ve ölmeden önce  Harry  için cesurca hayatını feda ederek Harry'ye  Lord Voldemort 'a karşı sihirli bir koruma sağlamıştır. James'in eşidir ve  Hogwarts 'ta iken tanışmışlardır. Başta James'ten nefret etmesine rağmen, James kibirini bir yana bırakınca 7. sınıfta çıkmaya başlamış ve okul bittikten 2 yıl sonra evlenmişlerdir. Herkesin Harry'yi gördüğünde dediği bir cümleden (\"Gözlerin aynı anneninkiler gibi.\") yola çıkarak gözlerinin çok güzel olduğunu (Şaşırtıcı derecede yeşil ve badem şeklinde.) ve 6. kitaptan anladığımız kadar İksir dersinde çok yetenekli olduğu kesin olarak bildiklerimiz arasındadır. Okuldayken  Horace Slughorn 'un gözdesi, son derece yenetekli ve mugglelardan doğmadır. Bu yönünden ve başka yönlerinden  Hermione Granger 'a benzemektedir. \n Onun bir cadı olduğunu çocukken Severus Snape keşfetmiştir. Ayrıca Snape ömrünün sonuna kadar Lily'e aşık kalmış (Lily'nin patronusu Gümüş Maral'dır ve çok güçlü duygular sonucunda patronus bir çeşit trans'a uğrayıp değişebilir. Severus Snape'in patronusu da Lily'e olan aşkından Kartal iken Gümüş Maral olmuştur.) ve Harry'i korumaya yemin etmiştir. Snape'in ölüm yiyen olmaktan vazgeçme sebebi de Lily'nin öldürülmesidir. \n Kingsley Shacklebolt [ değiştir  |  kaynağı değiştir ] \n Kingsley Shacklebolt   Harry Potter  serisinde,  Zümrüdüanka Yoldaşlığı  üyesi olan bir Büyücüdür. Kingsley, bakanlıkta çalışan üst düzey bir seherbazdır. Siyahidir ve kulağına altın bir küpe takar. Tok ve güven veren bir sesi vardır. Seride ilk kez  Harry Potter ve Zümrüdüanka Yoldaşlığı  kitabında, Harry'yi Privet Drive'dan almak için gelenler arasında görünmüştür. Harry ve arkadaşları Esrar Dairesi'nde tuzağa düşürüldükten sonra onları kurtarmak için gelen Zümrüdüanka Yoldaşlığı üyelerinden biridir. Kitapta Esrar Dairesi'ndeki çarpışmada iki tane  Ölüm Yiyen 'e karşı savaştığından söz edilir. Ölüm Yadigarları kitabında Bill ve Fleur'ün düğünü sırasında bir vaşak olan patronusunu gönderip Sihir Bakanlığı'nın düştüğünü ve  Ölüm Yiyenler 'in gelmekte olduğunu “Bakanlık düştü. Scrimgeour öldü. Geliyorlar.” sözü ile belirtir. Önceden uyararak düğündeki misafirleri kurtarmıştır.  Hogwarts Savaşı  sırasında  Voldemort 'a karşı  Minerva McGonagall  ve  Horace Slughorn  ile birlikte savaşmıştır. Sonradan Sihir Bakanı olur. \n Nymphadora Tonks [ değiştir  |  kaynağı değiştir ] \n Nymphadora Tonks ,  J.K. Rowling  tarafından yazılmış  Harry Potter serisinde  bir karakter. Kendisine Nymphadora denilmesinden nefret eder. \n Tonks Harry Potter serisinin 5. si olan  Harry Potter ve Zümrüdüanka Yoldaşlığında  ortaya çıkan bir seherbaz aynı zamanda bir yoldaşlık üyesidir. Tonks bir  Metamorfmagus 'tur. Yani kendini değiştirebilme yeteneğine sahiptir. Örneğin farklı duygular yaşadığı zaman saç rengini değiştirebilmektedir. Metamorfmagus olduğu için çaba harcamadan ve çalışmadan Biçim Değiştirme Sınavları'ndan her zaman en yüksek notları alırdı. Ayrıca çok sakar olmasıyla tanınır. \n Annesi cadı olan  Andromeda Tonks 'tur. Andromeda,  Sirius Black 'in en sevdiği kuzenidir. Babası ise muggle doğumlu büyücü  Teddy Tonks 'tur. Bu yüzden safkan Black ailesi tarafından kabul görmezler. Teyzeleri Bella ve Cissy onu asla kabul etmediler. Bizzat  Voldemort ,  Bellatrix Lestrange 'e hem Nymphadora hem Lupin'i öldürme görevini vermiştir. \n Tonks  Remus Lupin 'e aşıktır.  Remus Lupin  Nymphadora'yı sevdiği halde onun iyiliği için onunla birlikte olmaz; çünkü kurtadam olduğu için hem onun hem de doğacak çocuklarının kurtadam olma tehlikesi olup onun da hayatını mahvetmekten korkar. Ama sonra bu tutumdan vazgeçer ve onunla evlenir.  Teddy Lupin  adında bir çocukları olur. Bu çocuk korkulduğu gibi bir Kurtadam değil, bir Metamorfmagus'tur.  Teddy Lupin 'in vaftiz babası Harry'dir. \n Remus Lupin'e aşık olduğu için nadir gerçekleşen olaylardan birini yaşar ve  Patronus 'u kurtadam şeklini alır. Tonks ve Lupin tam mutluluğu yakalamışken Lupin ve Tonks savaş sırasında ölür. Kocasını ararken  Bellatrix Lestrange  ile karşılaşan Tonks,  Bellatrix Lestrange 'nin yaptığı oyunlar sayesinde Hogwarts'taki savaşta teyzesi tarafından öldürülür. Gornuk ve Griphook adındaki cincüceler ile biri  Harry Potter 'ın binasından yakın arkadaşı  Dean Thomas  olmak üzere iki muggle ile beraber kaçarken  Bellatrix Lestrange  tarafından öldürülmüştür. \n Arthur Weasley [ değiştir  |  kaynağı değiştir ] \n Arthur Weasley , Weasley'lerin babası.  Sihir Bakanlığı ’nda,  Muggle  Eşyalarının Kötüye Kullanımı Dairesi Başkanı iken 1997 yılında  Rufus Scrimgeour  tarafından Sahte Savunma Büyüleri ve Koruyucu Nesneleri Bulma ve El Koyma Bürosu bürosunun başına getirilmiştir. Şu anda kendisine bağlı on adamı bulunmaktadır. \n Elektrik fişleri ve pil kolleksiyonu yapar. Bir Ford Anglia'ya büyü yaparak uçurması nedeniyle Muggle Eşyalarının Kötüye Kullanımı konusunda yargılanmıştır. Biraz tuhaf biridir ve Muggle dünyasına olan düşkünlüğü onun bakanlıkta yükselmesini engellemektedir. Muggle Koruma Yasası'nı hazırlamıştır. Harry'nin 5. yılında Sihir Bakanlığı Esrar Dairesi'nde  Lord Voldemort 'un yılanı  Nagini  tarafından saldırıya uğramış ve St.Mungo Sihirsel Hastalıklar Hastanesi'ne nakledilerek iyileşmiştir. Burada yılan tarafından yapılmış yarasını düzeltmek için yardımcı doktora kendisine muggle tarzı dikiş tedavisi yapmasını istemiştir. Sirius Black ile kan yoluyla akraba olduğu sanılır. \n Bill Weasley [ değiştir  |  kaynağı değiştir ] \n Bill Weasley , İngiliz yazar  J.K. Rowling 'in roman serisi olan  Harry Potter 'da bir kurgusal karakter. \n Molly ve Arthur Weasley'in en büyük oğlu, Charlie, Percy, Fred, George, Ron ve Ginny'nin kardeşidir. \n Bill Weasley,  Hogwarts 'ta,  Gryffindor  binasında,  1982  ve  1989  yılları arasında eğitim gördü. Ayrıca sınıf başkanlığı da yaptı. Ardından  Mısır 'a gitti ve oradaki Grignotts Bankası'nda lanet kırıcı olarak çalıştı. \n Bill, Zümrüdüanka Yoldaşlığı adlı serinin beşinci kitabında  İngiltere 'ye iş için geri döndü. Sonra bir yıl boyunca,  Fleur Delacour  ile herkesten gizli olarak İngilizce çalıştı. Dersler sırasında Fleur'a yakınlık hissetti ve beraber olmaya başladılar. Harry Potter ve Melez Prens 'de ise Bill ve Fleur nişanlandılar. Ayrıca Ron ve Harry'nin Hogwarts'taki altıncı yılının başlamasından önceki yaz Bill, nişanlısını ailesi ile tanıştırdı. 6. kitabın sonunda Fenrir Greyback tarafından yaralanmıştır, neyse ki o sırada dolunay değildir. 1996'nın Ağustos'nda Fleur'le evlenmişlerdir. Ron gruptan ayrıldıktan sonra DenizKabuğu Kulubesinde kalmıştır. Daha sonradan Victoire, Louis ve Dominuque isimli üç çocuğu olmuştur. \n 6. kitapta kendisi iyi görünümlü genç bir adam olarak tanımlanmıştır. Hatta Fleur Delacour, onu serinin 4. kitabı olan Ateş Kadehi'nde gördüğünde, gözlerinden çok etkilendiği yazmaktadır. \n Bu karakteri filmlerde  Richard Fish  canlandırmıştır. Seride ilk kez  Harry Potter ve Azkaban Tutsağı 'nda görünmüştür. \n Charlie Weasley [ değiştir  |  kaynağı değiştir ] \n Charlie Weasley , İngiliz yazar  J.K. Rowling 'in roman serisi olan  Harry Potter 'da yer alan kurgusal bir karakter. \n Molly ve Arthur Weasley'i ikinci oğlu, Bill, Percy, Fred, George, Ron, ve Ginny'nin kardeşidir. Serinin dördüncü kitabı olan  Harry Potter ve Ateş Kadehi 'nde ılımlı, iyimser ve yüzünde birçok çil olan bir kişi olarak tasvir edilmiştir. Vücut yapısı ise kendinden küçük ikiz kardeşleri olan Fred ve George'a benzemektedir. Fakat boyu Ron ve Percy'den kısadır. \n Charlie, 1984 ve 1991 yılları arasında  Hogwarts 'ta öğrencilik yapmıştır. Harry Potter'ın okula başlamasından bir yıl önce okuldan mezun olmuştur. Hogwarts'ta iken  Gryffindor  binasının  quidditch  takımında arayıcılık yapmıştır. Hatta  Efsane Arayıcı  olarak da bilinmektedir. Bundan başka, Harry'nin de arayıcı olmasından dolayı ilk yılında Harry sık sık Charlie ile kıyaslanmıştır. Charlie daha sonra  Romanya 'ya giderek ejderha bakıcılığı yapmaya başlamıştır. Hagrid onun her zaman hayvanlar ile arasının kardeşi Percy gibi iyi olduğunu söylemiştir. Hagrid, ejderhası Norbert'ı 1. kitapta Charlie'ye göndermiştir. Bundan başka 4. kitapta yer alan üç büyücü turnuvasındaki dört ejderhayı da Charlie'nin takımı getirmiştir. \n Lord Voldemort 'un ikinci kez güçlenmesiyle birlikte Charlie, Zümrüdüanka Yoldaşlığında önemli görevlerde bulunmuştur. Topluluğa daha çok yurtdışından destek vermiştir. İngiltere'ye Ateş Kadehi'nden beri dönmemiştir. \n Molly Weasley [ değiştir  |  kaynağı değiştir ] \n Molly Weasley  (kızlık soyadı  Prewett ),  Harry Potter serisindeki  kurgusal karakterlerden biri. Ron'un, Harry'nin daha sonra evleneceği Ginny'nin ve diğer Weasley çocuklarının annesidir. \n Weasley kardeşlerin annesi ve Arthur Weasley'nin eşi. Sabırlı bir ev kadını, mükemel bir aşçı ve tüm ev işlerini halletmede uzman bir eş. Aynı zamanda yetenekli bir cadı ve  Albus Dumbledore ’a sadık eski kuşaklardandır. Percy’yi biraz daha kayırma eğilimindedir. O da kızıl saçlıdır. Biraz tombul ve kısa boyludur. Bu nedenle kocası Arthur ile başbaşa iken ona Mollytombik denmesini sever. Ron'un en yakın arkadaşı olan Harry'yi çok sever. Fabian ve Gideon adlarında iki erkek kardeşi vardır. Sirius Black ile hısım olduğu sanılıyor. Fred'i öldürmesi ve Ginny'e öldüren lanet yollaması üzerine \" kızımın üstünden elini çek seni kaltak! \" diyerek Bellatrix Lestrange'i öldürdü. \n Kaynakça [ değiştir  |  kaynağı değiştir ] \n ^   \"J.K. Rowling Web Chat Transcript\" . The Leaky Cauldron. 30 July 2007 .  http://www.the-leaky-cauldron.org/2007/7/30/j-k-rowling-web-chat-transcript . Erişim tarihi: 30 July 2007 .   \n G \n T \n D \n J. K. Rowling 'in  Harry Potter  serisi \n Felsefe Taşı \n Sırlar Odası \n Azkaban Tutsağı \n Ateş Kadehi \n Zümrüdüanka Yoldaşlığı \n Melez Prens \n Ölüm Yadigârları \n Film \n Oyun \n Film müzikleri \n Film \n Oyun \n Film müzikleri \n Film \n Oyun \n Film müzikleri \n Film \n Oyun \n Film müzikleri \n Film \n Oyun \n Film müzikleri \n Film \n Oyun \n Film müzikleri \n Film 1 / 2 \n Oyun 1 / 2 \n Film müzikleri 1 / 2 \n Karakterler \n Ana \n Harry Potter \n Ron Weasley \n Hermione Granger \n Lord Voldemort \n Albus Dumbledore \n Severus Snape \n Rubeus Hagrid \n Draco Malfoy \n Yardımcı \n Hogwarts kadrosu \n Zümrüdüanka Yoldaşlığı \n Dumbledore'un Ordusu \n Ölüm Yiyenler \n Kurgusal evren \n Hogwarts \n Büyü \n Büyülü yaratıklar \n Büyülü nesneler \n Sihir Bakanlığı \n Muggle \n Mekânlar \n İksirler \n Quidditch \n Büyüler \n İlgili çalışmalar \n Fantastik Canavarlar Nelerdir, Nerede Bulunurlar? \n film \n film müzikleri \n Çağlar Boyu Quidditch \n Ozan Beedle'ın Hikâyeleri \n Önbölüm \n Pottermore \n Cursed Child \n Hogwarts: An Incomplete and Unreliable Guide \n Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists \n Short Stories from Hogwarts of Heroism, Hardship and Dangerous Hobbies \n Film serisi \n Oyuncular \n Müzik \n Ölüm Yadigârları 'nın yapımı \n Oyunlar ve oyuncaklar \n Quidditch World Cup \n Lego Creator: Harry Potter \n Lego Harry Potter: Years 1-4 \n Lego Harry Potter: Years 5-7 \n Book of Spells \n Book of Potions \n Trading Card Game \n Lego  Harry Potter \n Lunaparklar \n The Wizarding World of Harry Potter \n Orlando \n Japonya \n Hollywood \n Dragon Challenge \n Flight of the Hippogriff \n Harry Potter and the Escape from Gringotts \n Harry Potter and the Forbidden Journey \n Hogwarts Express \n Harry Potter Movie Magic Experience \n Warner Bros. Studio Tour London \n Hayranlık \n Harry Potter Alliance \n The Leaky Cauldron \n MuggleNet \n LeakyCon \n Wizard rock \n Wrockstock \n İlgili konular \n Etkiler ve analoglar \n Hukuki uyuşmazlıklar \n Parodiler \n Siyaset \n Dinsel tartışmalar \n Çeviriler \n A Very Potter Musical \n The Harry Potter Lexicon \n   Kategori \n   Portal \n\t\t\t\t\t\t\" https://tr.wikipedia.org/w/index.php?title=Zümrüdüanka_Yoldaşlığı&oldid=19294784 \" adresinden alındı.\t\t\t\t\t \n 3 kategori :  Harry Potter karakterleri Kurgusal İngilizler Kurgusal kuruluşlar   \n Gezinti menüsü \n Kişisel araçlar \n Oturum açık değil Mesaj Katkılar Hesap oluştur Giriş yap   \n Ad alanları \n Madde Tartışma   \n Türevler \n Görünüm \n Oku Değiştir Kaynağı değiştir Geçmişi gör   \n Diğer \n Ara \n Gezinti \n Anasayfa Hakkımızda İçindekiler Rastgele madde Seçkin içerik   \n Katılım \n Bağış yapın Deneme tahtası İş birliği projesi Köy çeşmesi Son değişiklikler Topluluk portali Wikimedia dükkânı Yardım   \n Yazdır/dışa aktar \n Bir kitap oluştur PDF olarak indir Basılmaya uygun görünüm   \n Araçlar \n Sayfaya bağlantılar İlgili değişiklikler Özel sayfalar Kalıcı bağlantı Sayfa bilgisi Vikiveri öğesi Sayfayı kaynak göster   \n Diğer diller \n العربية Български বাংলা Brezhoneg Bosanski Català Čeština Dansk English Español Eesti فارسی Suomi Français Hrvatski Magyar Bahasa Indonesia Íslenska İtaliano 日本語 ქართული Қазақша 한국어 Latina Lietuvių Македонски Bahasa Melayu Nederlands Norsk nynorsk Norsk Polski Português Română Русский Srpskohrvatski / српскохрватски Slovenčina Српски / srpski Svenska ไทย Українська Tiếng Việt 中文   \n Bağlantıları değiştir   \n  Bu sayfa son olarak 4 Kasım 2017 tarihinde ve 19:35 saatinde düzenlenmiştir. \n Metin  Creative Commons Atıf-BenzerPaylaşım Lisansı  altındadır; ek koşullar uygulanabilir. Bu siteyi kullanarak,  Kullanım Şartlarını  ve  Gizlilik Politikasını  kabul etmiş olursunuz. Vikipedi® (ve Wikipedia®) kâr amacı gütmeyen kuruluş olan  Wikimedia Foundation, Inc.  tescilli markasıdır. \n Gizlilik politikası \n Vikipedi hakkında \n Sorumluluk reddi \n Geliştiriciler \n Çerez bildirgesi \n Mobil görünüm"}