{"url": "https://www.NameBright.com/", "content": "NameBright - Next Generation Domain Registration\r\n Create a  New Account  Today \n secure \n Forgot? \n My Cart  (0) \n Do you want to  Create a NameBright Account ? \n   LOGIN \n CREATE ACCOUNT \n SEARCH \n BULK CHECK \n PREMIUM DOMAINS \n                            Click here for the Advanced Search of my domain names.\r\n                            Hints on searching...  If you own \"example.com\", typing \"example\" will take you straight to manage your domain.\r\n                            If you want to search for a domain to register, use the search box to search for \"blue red\".  If you want to search your account,\r\n                            click on the down arrow to get to the advanced search of my domains.\r\n Refreshing Page... \n Processing... \r\n                Please note, your browser might freeze for a short period of time while it processes this request.\r\n Simple and secure domain registration \n Manage domains with ease \n Domain registration made easy \n Bulk Search  |  WhoIs Search \n\t\t\t\t\t            .com  from: \n $ \n 8 \n .03 \n /yr \n See details \n Easy checkout, great pricing, advanced domain management tools. Get your domain today! \n Buy your domains at  wholesale pricing. * \n .com    from\r\n                $8.03  /yr. \n .net    from\r\n                $9.13  /yr. \n .info    only\r\n                $11.91  /yr. \n Save money by using NameBright. \n Learn More \n        'At Cost' Pricing \r\n        Regular prices for domain registrations are: \r\n        .COM: $8.53/yr. per domain \r\n        .NET: $9.67/yr. per domain \r\n        Save with 'at cost' pricing: \r\n        .COM: $8.03/yr. per domain \r\n        .NET: $9.13/yr. per domain \r\n        To get ‘at cost’ pricing on your domain registrations, simply pre-fund your NameBright  account via bank wire or check, \r\n        then select the “Bill My Funded NameBright Account” in the payment method at checkout. To learn more,  click here .\r\n Transfer a domain to NameBright. \n Bulk Transfers \n            Transfer with ease! Use our  transfer wizards  to transfer up to 5,000 domains.\r\n                We’ve built NameBright from the ground up to make transfers easier than they have ever been before! Our transfer wizards help you by telling you exactly what’s going on, what is needed next, and letting you know how long each step of the process will take.\r\n Scalable and secure domain products. \n Email Forwarding   $FREE \n Privacy Protection   1yr  $FREE  * \n Domain History   $FREE  * \n Get your domain online in minutes. \n See All Features \n        Privacy Protection is free for the first year of registration.  Regular privacy charges, which are $2.95 per year, will apply in subsequent years unless you remove privacy protection from the domain within the first 365 days.\r\n        Domain History is free for the last 30 days.  To see more data you will have to  upgrade your domain .  With an upgraded domain you will see domain history as far back as it has been registered with NameBright.com\r\n The NameBright Advantage \n            'At Cost' Pricing \r\n            Regular prices for domain registrations are: \r\n            .COM: $8.53/yr. per domain \r\n            .NET: $9.67/yr. per domain \r\n            Save with 'at cost' pricing: \r\n            .COM: $8.03/yr. per domain \r\n            .NET: $9.13/yr. per domain \r\n            To get ‘at cost’ pricing on your domain registrations, simply pre-fund your NameBright  account via bank wire or check, \r\n            then select the “Bill My Funded NameBright Account” in the payment method at checkout. To learn more,  click here .\r\n 1 yr FREE Whois Privacy    |   \r\n                     'At Cost' Pricing    |   \r\n                     Bulk Domain Management Tools    |   \r\n                     and a whole lot more... \n © 2017 NameBright.com. All Rights Reserved. Get your domain name today! \n Products: \n Domain Search \n Bulk Search \n Transfer \n SSL \n WhoIs \n Email \n Support: \n Knowledge Base \n Features \n API \n Company: \n Terms of Service \n Privacy \n Contact Us \n Committed to Being the Most Advanced Registrar in the World! \n -\r\n Submit Feedback \r\n        Have something to share with us? \r\n        A suggestion? \r\n        A comment?\r\n        Find something that is not working right?\r\n        Share this with our team so we can know what we should focus on!\r\n Like Us On Facebook! \r\n        We would really appreciate your support.\r\n        If you find NameBright useful please like us on Facebook to help spread the word.\r\n        Click the blue icon to like us.\r\n Become a Follower! \r\n        You can follow us on Twitter to get special promotions, deals and offers we will put out there from time to time.\r\n Read Our Blog! \r\n        Our blog covers everything from features, has news stories about domain names and domain management.\r\n        It is also the one place we will post information about downtimes or service outages.\r\n Helpful NameBright Hints \r\n        Click this link to learn how to use NameBright better.\r\n        We will share information and tips on features of NameBright and how you can get more out of the system!\r\n    This date/time is currently being displayed in the following TimeZone: \n Click to change this setting \n Cancel \n Hide Help \n What Does \"Copy\" Do? \nThis is a feature that helps you manage domain names in bulk.  By copying a list of domains you can easily import into Excel, or send yourself a list as a reminder.  It is a convenience for people that manage multiple domain names."}