{"url": "http://www.concordia.ca/artsci/scpa/programs/ced-graduate-diploma.html", "content": "Community Economic Development \n Concordia University \n http://www.concordia.ca/content/concordia/en/artsci/scpa/programs/ced-graduate-diploma.html \n Study resources \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links   \n Webmail \n Library \n Cspace \n Study resources    \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services    \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new    \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges    \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links  \n The Campaign for Concordia \n MyConcordia \n Cspace \n Webmail \n Library \n Directories \n A-Z \n Maps \n Concordia University \n Concordia University \n School of Community & Public Affairs  \n About the School \n                                                                Staff\n                                                                External board of advisors\n                                                                Community outreach\n                                                                Alumni\n                                                                Faculty members and fellows\n Programs \n                                                                Community, Public Affairs and Policy Studies\n                                                                First Peoples Studies\n                                                                Community Economic Development\n Student life \n QUESCREN \n                                                                About QUESCREN\n                                                                Resources\n                                                                Events\n fr \n The Campaign for Concordia \n Study resources \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links   \n Webmail \n Library \n Cspace \n Study resources    \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services    \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new    \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges    \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n                    Concordia\r\n                    Directories\r\n Search \n Concordia University \n School of Community & Public Affairs  \n                    Concordia.ca\r\n\t         / \r\n                    Faculty of Arts and Science\r\n\t         / \r\n                    School of Community & Public Affairs\r\n\t         / \r\n                    Programs\r\n\t         / \r\n                    Community Economic Development\r\n Facebook \n Twitter \n LinkedIn \n GooglePlus \n Community Economic Development \n Graduate Diploma (GrDip) \n Why pursue a Graduate Diploma in Community Economic Development? \n The need to develop effective social policies, programs and communities with the power to confront complex challenges has never been more urgent. As we continue to witness large-scale climate change, as well as political and economic crises worldwide, we require scholars and community sector professionals to reflect on how they can contribute to progressive change and lead projects that inspire civic engagement. \n The Graduate Diploma in Community Economic Development provides you with an environment to investigate Quebec and Canada’s social and solidarity economy in a broader context. Our  faculty members  are actively involved in the community and social economy sector, allowing you to benefit from their scholarship and practical knowledge as you explore the evolution of community economic development, community organizing and different theories of economic change. In today’s context this includes the new and growing interest in social innovation as it generates uncharted paths for community based social and economic transformation. \n Our diverse student body is comprised of community sector professionals and students with volunteer experience in a variety of organizations. Many courses in our curriculum are participatory and enriched by the collective experiences of our cohort.  Montreal’s own history of community-based activism and economic development will serve as a backdrop as you participate in a field project with a community organization. \n Program Details \n                    Degree requirements\r\n Requirements for the Diploma \n To obtain the Graduate Diploma in CED, students will have to obtain a minimum of 30 course credits and a minimum GPA of 2.70. Courses offered by the program are divided between required core courses, open sessions, a project, as well as elective courses. A typical progression through the program takes one year (three semesters): \n Fall Semester: three required courses (9 credits) and one open session (1 credit); \n Winter Semester: two required courses (6 credits), first four months of the student’s project course (3 credits), and one open session (1 credit); \n Summer Semester: two elective courses from the areas of concentration (6 credits)*, the last four months of the student’s project course (3 credits), and one open session (1 credit). \n * Students may take either two courses (Part I and Part II) in a single area of concentration, or one course (Part I) in two areas of concentration, subject to available resources. (All Part II courses require successful completion of Part I in the same area of concentration). \n                    Admission requirements\r\n Admission Requirements.  To be admitted into the program, applicants will generally be expected to have completed an undergraduate degree with a GPA of 2.70 and must be able to read, write, and express themselves in either English or French. \n Each applicant’s background, practical experience and learning goals will be fully considered. Applicants are required to submit a two-to-four page personal statement in which they outline their particular field(s) of interest, their strengths and weaknesses, what they expect or hope from their studies, how these expectations tie into their personal or professional goals, and what they expect to contribute to a better understanding of CED. \n Proficiency in English.  Applicants whose primary language is not English must demonstrate that their knowledge of English is sufficient to pursue graduate studies in their chosen field. Please refer to the  Graduate Admission page  for further information on the Language Proficiency requirements and exemptions. \n                    Application process\r\n Your completed application will include: \n Application form and Fee \n Curriculum Vitae (CV) \n Letters of Reference  and  Academic Assessment forms   \n Students applying with an undergraduate degree: Two Confidential Letters of Reference and Academic Assessment forms \n Students applying without an undergraduate degree: Three Confidential Letters of Reference and Academic Assessment forms \n Statement of Purpose should outline (2 to 4 pages): \n your particular field(s) of interest \n what you expect or hope from your studies within the program \n how your expectations or hopes tie into your professional or personal goals \n your strengths and weaknesses \n what you expect to contribute to a better understanding of CED \n Transcripts  for all post-secondary institutions attended \n Proof of Canadian citizenship  (if applicable) \n Applicants whose primary language is not English or French, are required to submit  official language test scores , unless exempted. \n Please apply  online . Read the  how-to guide  for application procedures. \n                    Application deadlines\r\n   \n DEGREE \n   \n FALL \n(September) \n WINTER \n(January) \n SUMMER \n(May/June) \n Community Economic \nDevelopment \n Diploma \n Feb. 1 \n n/a \n n/a \n                    Courses\r\n Core courses (3 credits) include: \n Introduction to Community Economic Development \n Comparative Approaches and Models in CED \n Fundamental Skills for CED Practice \n Community Organizing and CED \n Social Enterprise Development and Social Entrepreneurship \n Specialisation courses (3 credits) are offered as well (decided by the student cohort). The following courses have been offered in the past: \n Financing CED Initiatives \n Housing and Land Use from a CED Perspective \n Communications, Technology and CED \n International Development and CED \n Aboriginal CED \n Open session courses (1 credit) offered in the past have included \n Feminist approaches to CED \n Arts and CED \n Participatory economics \n Using the social media for community development purposes \n Courses are dynamic, and include a variety of teaching methods: site visits, guest speakers, workshops, films, discussion of texts, group work, etc. \n Consult the graduate calendar  for a complete list of courses and learn more about the  program and our approach .  \n                    Funding\r\n We are committed to providing you the support you need to focus on your studies. A limited number of scholarships are available for students based on financial need, ranging from $1,000-$5,000. \n Please also consult Concordia’s  graduate funding  page and  Financial Aid and Awards . \n                    Field project\r\n You will dedicate between 80 to 120 hours to a field project that addresses an aspect of community development. This field project can be based within your present work, new paid work or in a new or current volunteer context. \n The project is an opportunity for you to address a specific challenge you are passionate about and which is also seen as important by the collaborating organization. You are responsible for defining, finding and negotiating your field project, with the support and assistance of our program. You will critically analyze your project and submit a written report that summarizes and evaluates your experience. \n Examples of recent past field projects include students collaborating with groups on issues related to immigration, housing, urban agriculture, youth etc. Students are responsible for negotiating the tasks within the field placement with the organization based on organizational needs and student learning interests. Running a conference, providing training, facilitating workshops, supporting inter-organizational collaborations, doing research are examples of tasks that students have taken on as part of their field placement. \n                    Program Structure\r\n The Graduate Diploma in Community Economic Development is structured to enable practitioners to continue work while studying. \n Offers all courses during one extended weekend a month (all day Friday, all day Saturday and all day Sunday once a month, as well as a Thursday afternoon every once per term) \n Includes a practical project related to a participant’s work or volunteer activity \n Alternates annually between English (starting in fall of even years) and French (starting in fall of odd years) \n On a full-time basis, takes one year to complete over three consecutive semesters: Fall, Winter and Summer. As the functional language of courses will be different in the following year, a strong motivation usually exists to complete the Program within its framework of three consecutive terms \n On a half-time basis, takes two years to complete: two consecutive years if a participant can take courses in both English and French or two non-consecutive years if a participant can take courses in only one language \n                    Your professional future\r\n A Graduate Diploma in Community Economic Development prepares you for careers in various community organizations, including anti-poverty, urban and housing development, women’s rights, and immigration. Many of our  alumni  have started their own social enterprises, like alternative daycares, laundromats, consumer cooperatives, cafés, as well as the importation and sale of equitable fruits to major distributors. Other career opportunities are available in government and local community economic development agencies, health clinics, education, and unions. \n Meet some of our alumni \n                    Accordion panel header\r\n Community Economic Development Program content and approach Course requirements CED faculty Alumni \n The Graduate Diploma in CED is offered in  English beginning in the Fall of even-numbered years  and in French beginning in the Fall of odd-numbered years.  The upcoming year's program (2018-19) will be offered in English.   \n How to apply \n Key resources \n Tuition calculator \n Graduate funding \n Graduate calendar \n Class schedule \n Download the current year's class schedule \n Join the conversation \n Concordia Recruitment\r\n Community Economic Development\r\n Contact us \n Email :  Perry.Calce@concordia.ca \n Tel .: 514-848-2424 ext. 2579 \n Location:  \n 2149 MacKay \n Montreal, Quebec, Canada \n H3G 2J2 \n Concordia Grad \n Community Economic Development \n Back to top \n © Concordia University \n Concordia University  - Call us at 514-848-2424 \n About the department \n Programs \n Student life \n News & events \n Contact us \n School of Community and Public Affairs \n Sir George William Campus \n 1455 De Maisonneuve Blvd. W. \n Montreal ,  Quebec ,  Canada \n H3G 1M8 \n See SGW Campus map \n 2149 Mackay Street \n CI Building \n See building map \n facebook \n twitter \n google \n youtube \n linkedin \n pinterest \n instagram \n flickr \n Concordia social \n © Concordia University \n Terms \n Privacy \n Accessibility \n Website feedback \n Share this page \n Concordia.ca \n Call us at \n 514-848-2424 \n Sir George Williams Campus \n 1455 De Maisonneuve Blvd. W. \n Montreal ,  Quebec ,  Canada \n H3G 1M8 \n See SGW Campus map  \n Loyola Campus \n 7141 Sherbrooke Street W. \n Montreal ,  Quebec ,  Canada \n H4B 1R6 \n See Loyola Campus map  \n Website feedback \n Terms \n Privacy \n Accessibility \n © Concordia University"}