{"url": "https://www.snap.com/en-US/supplier-responsibility/conduct-code/", "content": "Supplier Responsibility – Supplier Code of Conduct – Snap Inc. \n Snap Inc. Jobs News Investors Supplier Responsibility Supplier Code of Conduct Anti-Slavery Conflict Minerals Supplier Code of Conduct \n SUPPLIER CODE OF BUSINESS CONDUCT \n This Supplier Code of Business Conduct applies to Snap Inc. suppliers and their subsidiaries, affiliates, and subcontractors (each a “Supplier”) providing goods or services to Snap Inc. or for use in or with Snap Inc. or other Snap Inc. products. It sets out legal and social responsibility requirements for our Suppliers. These requirements are in addition to any requirements imposed by contract. References to Snap Inc. in this Code also include Snap Inc. subsidiaries and affiliates, to the extent a Supplier does business with them. \n 1.    GENERAL RULES \n Supplier will fully conform with the laws, rules, and regulations (collectively, “laws”) of the countries where it operates, will conform to the requirements of this Supplier Code of Business Conduct, and will communicate these requirements in writing to its own suppliers and subcontractors. Supplier must be able to demonstrate compliance with the Supplier Code of Business Conduct on request. Snap Inc. will assess conformance to these requirements and will consider a Supplier’s conformance in making sourcing and procurement decisions. \n 2.    SOCIAL RESPONSIBILITY STANDARDS  \n Overview \n Our Social Responsibility Standards are drawn from industry codes of conduct, International Labor Organization Conventions, the Universal Declaration of Human Rights, and the UN Guiding Principles on Business and Human Rights. They require all Suppliers to ensure that working conditions in their operations and supply chains are safe, that all workers are treated with respect and dignity, and that operations are environmentally responsible and conducted ethically. \n Labor & Human Rights \n Supplier must uphold the human rights of workers and treat them with dignity and respect. This applies to all workers, including without limitation temporary, migrant, student, and contract workers as well as direct employees. \n No Forced Labor \n Supplier will not use forced, bonded (including debt bondage), indentured, or involuntary prison labor, and will not engage in slavery or trafficking of any person. Supplier will ensure that workers have access to their personal documentation (e.g., government-issued identification, passports,  or work permits), and will pay any agency recruitment/employment fees and expenses. \n No Child Labor \n Supplier will not use child labor. We consider child labor to be anyone under 15, unless local law sets a higher threshold. Supplier agrees that workers under 18 will not work overtime or perform night work or physically demanding labor. \n Working Hours \n Supplier will comply with applicable work hours and overtime laws, will set the maximum at 60 hours/week except in emergencies, and will guarantee at least one full day off per 7-day period. \n Wages & Benefits \n Supplier will comply with all applicable wages and benefits laws. \n No Abuse \n Supplier will comply with all applicable laws on abuse of employees. Supplier will not engage in any harsh or inhumane treatment, including but not limited to sexual harassment, sexual abuse, corporal punishment, mental or physical coercion, or verbal abuse. \n No Discrimination \n In its hiring and employment practices, Supplier will not discriminate based on race, color, age, gender, sexual orientation, ethnicity, disability, pregnancy, religion, political affiliation, union membership, marital status, or any other category protected under applicable law. \n Freedom of Association \n Supplier will comply with all applicable laws on freedom of association and collective bargaining. Workers’ right to associate freely, seek representation, and join worker councils will be respected. \n Health & Safety \n Supplier recognizes that a safe and healthy work environment minimizes work-related injury and illness, enhances the quality of products and services, and boosts consistency of production and worker retention and morale. Supplier will comply with all applicable health-and-safety requirements and ensure that the following requirements are met: \n Occupational Safety.  Supplier will control worker exposure to potential safety hazards through proper design, engineering and administrative controls, preventative maintenance and safe work procedures, and ongoing safety training. \n Emergency Preparedness.  Supplier will implement emergency plans and procedures including: emergency reporting, employee notification and evacuation procedures, worker training and drills, appropriate fire detection and suppression equipment, adequate exit facilities, and recovery plans. \n Occupational Injury and Illness.  Supplier will implement procedures and systems to prevent, manage, track, and report occupational injury and illness. \n Industrial Hygiene.  Supplier will identify, evaluate, and control worker exposure to chemical, biological, and physical agents. \n Physically Demanding Work.  Supplier will identify, evaluate, and control worker exposure to the hazards of physically demanding tasks, including manual material handling and heavy or repetitive lifting, prolonged standing, and highly repetitive or demanding assembly tasks. \n Machine Safeguards.  Supplier will provide physical guards, interlocks, and barriers where machinery presents a hazard, and will ensure these protections are properly maintained. \n Sanitation and Food.  Supplier will ensure that workers are provided with ready access to clean toilet facilities, potable water, and sanitary food preparation, storage, and eating facilities. \n Housing.  Any worker dormitories or other housing provided by Supplier or Supplier’s agent will be well-maintained, clean, and safe. Any such housing will feature appropriate emergency egress and fire protection/suppression, hot water for bathing and showering, adequate heat and ventilation, and reasonable personal space along with reasonable entry and exit privileges. \n Environment \n Supplier will take steps to eliminate any adverse (and potentially adverse) effects on the community, environment, and natural resources and to safeguard health and safety. Specifically: \n Environmental Permits.  Supplier will obtain, maintain, and keep current all required environmental permits, approvals, and registrations and will follow their operational and reporting requirements. \n Pollution Prevention and Resource Reduction.  Supplier will work to reduce or eliminate waste of all types, including water and energy, by practices such as modifying production, maintenance and facility processes, materials substitution, conservation, and recycling and reusing materials. \n Hazardous Substances.  Supplier will identify and manage chemicals (and other materials that would pose a hazard if released to the environment) to ensure their safe handling, movement, storage, use, recycling and reuse, and disposal. \n Wastewater & Waste.  Supplier will characterize, monitor, control, and treat wastewater and solid waste generated by its operations as required by applicable law before discharge or disposal. \n Air Emissions.  Supplier will characterize, monitor, control, and treat air generated by its operations as required by applicable law before discharge. \n 3.    ETHICS REQUIREMENTS \n Suppliers will uphold the highest standards of ethics in their operations, including: \n Business Integrity \n Supplier will uphold the highest standards of integrity in business interactions. All dealings will be transparently performed and accurately reflected on Supplier’s books and records. Supplier will have a zero-tolerance policy that prohibits all forms of bribery (covering promising, offering, giving, or accepting any bribes), corruption, extortion, fraud, and embezzlement, and will implement monitoring and enforcement procedures to ensure conformance with anti-corruption laws. \n Conflicts of Interest \n Snap Inc. forbids both actual and apparent conflicts of interest. Supplier must not directly engage with any Snap Inc. employee whose spouse, domestic partner, relative or other family member is employed by or holds a significant financial interest in the Supplier.  \n Gifts \n Do not give gifts, regardless of value, to any Snap Inc. employee working in procurement or supply chain management. Moreover, avoid gifts to any Snap Inc. employee when the circumstances create or appear to create a conflict of interest.  For example, do not offer anything of value during a bid process or contract negotiation. Gifts offered or given at such times may appear as attempts to improperly influence Snap Inc. employees. Any gifts, meals, or entertainment must comply with applicable laws, must not exceed $100 in value and must be consistent with local custom and practice. Cash and cash equivalents, such as gift cards, are never acceptable.  \n Intellectual Property & Confidential Information \n Supplier will respect intellectual-property rights. Supplier will transfer technology and know-how in a manner that protects intellectual property rights and conforms to the most stringent information protection requirements under the applicable agreements between Snap Inc. and Supplier. Supplier will use appropriate means to safeguard customer information, in accordance with the most stringent information-protection requirements under the applicable agreements between Snap Inc. and Supplier. \n Disclosure of Information \n Supplier will disclose information regarding business activities and structure, financial situation, and performance in accordance with applicable law and prevailing industry practices. Falsifying records and misrepresenting conditions or practices in the supply chain are prohibited. \n Fair Business, Advertising & Competition \n Supplier will obey applicable laws and uphold industry and regulatory standards of fair business, advertising, and competition. \n    \n Training and Communication \n Supplier must implement training and communication programs to educate its employees regarding the requirements of this Code and Supplier’s own related policies. Supplier must maintain a process for communicating clear and accurate information about its practices, policies, and expectations to its workers, next-tier supplier(s), and customers. \n Whistleblower Protection \n Supplier will provide an anonymous complaint mechanism for its employees to report possible violations of this Code and Supplier’s own Code of Conduct. Supplier will protect whistleblower confidentiality and prohibit retaliation. \n Reporting Questionable Conduct \n Supplier and its employees should report possible violations of the Supplier Code of Conduct or other questionable behavior. Report by email at  compliance@snap.com , or telephone our compliance helpline at 1-844-432-1975, or access our compliance portal at  www.snapchat.ethicspoint.com . \n 4.    RESPONSIBLE SOURCING OF MINERALS \n Snap Inc. complies with the provisions of the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank) and corresponding enabling regulations regarding conflict minerals, including regulations promulgated by the Securities and Exchange Commission. \n Supplier must exercise all due diligence required by Dodd-Frank to enable accurate reporting on the source and chain of custody of conflict minerals. Supplier must source only from certified conflict-free smelters, must adhere to the OECD Due Diligence Guidance, must exercise diligence on the source and chain of custody of minerals used in their products, and must provide details of their diligence measures on request. \n If Supplier produces goods containing tantalum, tin, tungsten, or gold, Supplier must adopt a conflict-minerals policy that is consistent with this Supplier Code of Conduct and the OECD Guidance. Supplier must distribute its conflict-minerals policy to all of its subcontractors and suppliers that provide materials for the manufacture of goods and must obtain agreements from those subcontractors and suppliers that they will also comply with the policy. Supplier may only use tantalum, tin, tungsten, or gold in goods if Supplier can reasonably demonstrate that it has exercised due diligence in accordance with the OECD Guidance regarding the source and chain of custody of such metals, and satisfied the reporting and sourcing requirements of this policy. If Supplier cannot reasonably demonstrate such compliance, then Supplier must not use tantalum, tin, tungsten, or gold in any goods. Supplier must maintain reasonable documentary evidence of Supplier’s reporting, sourcing, and due-diligence activities, and must make such records available to Snap Inc. on request. \n 5.    SUPPLIER QUALITY \n Snap Inc. requires that its suppliers provide quality components. We believe quality is best optimized by ensuring that Suppliers have appropriate quality assurance processes and controls. \n Supplier must therefore comply with industry standards for manufacturing goods and providing of services to Snap Inc., including a commitment to the philosophy of continuous quality improvement. Supplier will collaborate with Snap Inc. to identify quality issues, risks, and costs, and develop plans for improvement where warranted. Supplier will timely resolve any deficiencies. \n Supplier’s commitment to continuous quality improvement will necessarily involve changes to manage cost, quality, delivery, and technology. However, implementation of unapproved changes can have unintended effects on our products. Supplier accordingly will notify Snap Inc. of changes made to materials, products, or  processes. \n Supplier will make supplier management a part of its quality system. Supplier will actively manage its suppliers, alert Snap Inc. if it becomes aware of any quality (or other) risks posed by a particular supplier, and collaborate with Snap Inc. to agree on how to mitigate and manage any such issues. \n 6.    ASSESSMENTS \n Supplier will periodically evaluate its operations and those of its subsidiaries, affiliates, and subcontractors to ensure compliance with this Code. Supplier will let Snap Inc. or a Snap Inc. agent assess any operations that are providing goods or services for Snap Inc. or for Snap Inc.’s benefit. Supplier will commit to timely correct any deficiencies identified by an assessment, inspection, or other review. \n © 2017 Snap Inc. Privacy Policy Terms of Service Other Terms & Policies Impressum Dansk Deutsch English (US) English (UK) Español Français Italiano 日本語 Nederlands Norsk Polish Português (Brasil) Suomi Svenska"}