{"url": "http://www.w3.org/WAI/GL/new-charter.html", "content": "Web Content Guidelines Charter \n   \n  Revised Charter: Web Content Guidelines Working Group\n  (GL WG)\nPreviously known as \"WAI Markup Guidelines Working Group\" and \"WAI Page Author\nGuidelines Working Group\"\n Mission statement \n Scope \n Duration of work items \n Deliverables to be produced \n Dependencies of this group on other groups \n Dependencies of other groups on this \n Intended degree of Confidentiality \n Relation to other groups \n Milestones for work items & deliverables \n Meeting mechanisms & schedules \n Communication mechanisms \n Level of involvement of Team \n Estimate of time commitment a group member would have\n    to make in order to participate. \n 1. Mission statement \nThis revised charter extends the duration of the\n Web Content Guidelines Working Group \n(GL WG) to allow it to complete the Web Content Accessibility Guidelines\nand to do initial post-Recommendation analysis of implementation issues and\nappropriate next steps in this area. The Web Content Accessibility Guidelines\nfocus on HTML, CSS, and XML, and provide guidance to Web content developers\non how to make Web sites accessible to users with disabilities. This Working\nGroup was originally chartered and a Call for Participation issued in\n October,\n1997 , and the group is within the duration, scope and resources of the\n WAI Activity Proposal and\nannouncement . The  Web\nContent Accessibility Guidelines Working Draft  completed Last Call on\nMarch 19, 1999.\n 2. Scope \n  2.1 Scope of work items:\n    producing a set of guidelines which is coordinated with other WAI guidelines;\n    collecting, creating, and testing techniques which satisfy checkpoints and\n    guidelines, and compiling these into a techniques document;\n    promoting implementation of accessibility improvements in technology of the\n    Web;\n    analyzing implementation and impact of guidelines and recommending next steps;\n    coordinating with related W3C activities as appropriate.\n  2.2 Criteria for success:\n    wide adoption of Web Content Accessibility Guidelines and Techniques;\n    demonstration of increase in Web accessibility resulting from implementation\n    of guidelines.\n 3. Duration of work items \nThe expected duration of the renewed Web Content Guidelines Working Group\nis eight months, through November 30, 1999.\n 4. Deliverables to be produced \n    Web Content Accessibility Guidelines: A set of guidelines that clearly outlines\n    the major principles for creating accessible Web content, and includes verifiable\n    checkpoints for each guideline.\n    List of Checkpoints from the Web Content Accessibility Guidelines: A list\n    of the verifiable checkpoints, arranged as a checklist.\n    Techniques for Web Content Accessibility Guidelines: A set of specific\n    techniques, coordinated with the guidelines, which explain how to satisfy\n    each checkpoint. The Techniques document will be an on-going compilation,\n    to be published as a Note rather than a Recommendation.\n 5. Dependencies of this group on other groups \nThis group develops guidelines which address how to implement HTML 4.0, CSS1\nand CSS2, XML, SMIL, etc., in a manner that results in Web sites that are\naccessible. Coordination with W3C groups producing these specifications is\nthrough the WAI CG and through the WAI's participation in the Hypertext CG.\n 6. Dependencies of other groups on this \n    WAI  Education & Outreach Working\n    Group : uses Web Content Accessibility Guidelines as basis for most of\n    WAI promotion and dissemination work.\n    WAI  Authoring Tools Guidelines Working\n    Group : uses Web Content Accessibility Guidelines as core of Authoring\n    Tools Accessibility Guidelines.\n    WAI  User Agent Guidelines Working Group :\n    must ensure that User Agent Accessibility Guidelines address how to render\n    accessibility content specified in Web Content Accessibility Guidelines.\n    WAI  Evaluation & Repair Interest and\n    Working Groups : develops evaluation & validation tools synchronized\n    with Web Content Accessibility Guidelines.\n    WAI  Protocols & Formats Working\n    Group : takes requirements for accessibility identified in this working\n    group and negotiates these with the relevant W3C groups where appropriate.\n 7. Intended degree of Confidentiality \nGroup procedings, e-mail list, archives, charter, and deliverables are all\npublic, as are the other WAI guidelines working groups.\n 8. Relation to other groups \nThe GL WG is related to other W3C groups as described in (5) and (6) above.\nIn addition, external organizations such as ISO, IEEE, national governments,\ncorporations, etc., may reference the Web Content Accessibility Guidelines;\nand externally developed tools such as CAST's \"Bobby\" may use the guidelines\nas the basis for their site evaluation protocols. Coordination with external\ngroups referencing the guidelines is primarily through the WAI International\nProgram Office. Coordination with CAST around implementation of the guidelines\nin site evaluation protocols is shared between this group and the WAI Evaluation\nand Repair Interest and Working Groups.\n 9. Milestones for work items & deliverables \n    March, 1999: Proposed Recommendation expected for Web Content Accessibility\n    Guidelines and List of Checkpoints. (Last Call ended March 19, 1999).\n    May, 1999: Recommendation expected for Web Content Accessibility Guidelines\n    and List of Checkpoints. Techniques document to be available as a draft Note\n    at the same time.\n    November, 1999: Analysis of implementation and recommendation for next steps.\n 10. Meeting mechanisms & schedules \n    Primary meeting mechanism:\n     w3c-wai-gl \n    mailing list.\n    Phone meetings weekly during Proposed Recommendation and bi-weekly during\n    Post-Rec stage (has been weekly).\n    Face-to-face meetings quarterly.\n 11. Communication mechanisms \n    Communication within the group: as above at (10), and through WG home page\n    Communication with W3C: coordination through WAI CG and Hypertext CG\n    Communication with W3C Member organizations through Member newswire &\n    newsletter\n    Communication with the public through WAI Education & Outreach WG\n 12. Level of involvement of Team \n    15% Ian Jacobs - co-editor\n    5% Daniel Dardailler - staff contact\n    5% Judy Brewer\n    5% Charles McCathieNevile\n 13. Estimated time commitment a group member would have\n  to make in order to participate \n    minimum 4 hours per week\n    must remain current on w3c-wai-gl list & respond in timely manner to\n    postings\n    must participate in bi-weekly phone meetings as scheduled or regrets to chair\nMarch 22,  Judy Brewer ,\n Wendy Chisholm \n Copyright  \n©  1999  W3C \n( MIT ,\n INRIA ,\n Keio  ), All Rights Reserved. W3C\n liability, \n trademark ,\n document\nuse  and\n software\nlicensing  rules apply. Your interactions with this site are in accordance\nwith our\n public \nand\n Member \nprivacy statements."}