{"url": "http://chicagoradioandmedia.com/news/7862-chicago-tribune-raising-weekday-newspaper-price-again", "content": "Chicago Tribune Raising Weekday Newspaper Price Again                                       Register        Login          Home Return Home News Opinions Message Board Features What's Included Memory Lane Logos Music Surveys Buttons & Stickers Classic Ads Personalities Interviews Multimedia Streaming Radio Podcasts Audio Video CRM-TV Classes Links & Info Media Links FAQs About Us Contact Us Advertise On CRM Donate To CRM Search   You are here:  Home     News     Chicago Tribune Raising Weekday Newspaper Price Again      Chicago Tribune Raising Weekday Newspaper Price Again                   Details  Published on Sunday, 27 December 2015 09:00\t The Chicago Tribune has announced that the price of its Monday through Saturday editions is being raised from $1.50 per copy to $1.99 per copy, an increase of nearly 33%. The pricing increase takes effect on Monday December 28th.     A small announcement was printed in its newspapers this weekend (the announcement was not posted online), which read: The Chicago Tribune is committed to producing the exclusive investigative reporting, suburban news coverage and thought-leading editorials that our audience expects from us. Our pricing reflects the value associated with these product benefits. Effective with the Dec. 28 edition, the retail price of a copy of the Monday-Saturday Chicago Tribune will increase to $1.99. Subscriptions are available at a discount to the cover prices and can be set up by calling 800-TRIBUNE.    We thank you for your readership and look forward to continuing to provide you with the most extensive and in-depth coverage of Chicago and its surrounding communities across all platforms.  The last time the Chicago Tribune raised its weekday newspaper prices was just over two and a half years ago. On April 1, 2013, the Monday through Saturday cover prices were raised 50% from $1.00 to $1.50. This means the Chicago Tribune's weekday cover price has doubled in cost in under three years.     The cost of the Sunday paper remains the same for now at $2.99 per copy.  That price was increased on April 6, 2014, rising from $1.99 per copy to its current $2.99 per copy -- an increase of just over 50%.   UPDATE: With no advance announcement to readers or subscribers, the Chicago Tribune also chose to raise the cost of the Sunday edition of the newspaper by 34%. The Sunday Chicago Tribune will now cost $3.99, up from its previous $2.99.    While the increase will certainly impact those who purchase from newsstands, the bigger impact will be to subscribers when it comes time to resubscribe (barring any subscription sales and/or promotions). Only about 5% of the Chicago Tribune's sales come from newsstands, with the rest coming from customer subscriptions.    The Chicago Tribune's price increase is to be expected. With falling adverting revenue from both local and national advertisers), shrinking circulation of the physical newspapers, and printing cost increases, the financial burden is getting passed down to its readers. The Chicago Tribune had a total weekday print circulation of just over 307,000 at the start of 2015, but print circulation rates have been falling at approximately 10% per year, as readers continue to abandon printed reading to instead flock online for their news.   Twitter                 < Prev       Next >             Place your ad here   Loading...                 The CHICAGOLAND RADIO & MEDIA website is the #1 resource for news, information, discussions and celebrations of all things related to Chicago radio, television, newspapers and more. Please help support the website by clicking on the \"Donate\" button below! THANK YOU for your backing!                                                               CRM   Website Information  The Chicagoland Radio & Media website (abbreviated as CRM) is a celebration of all things relating to Chicago-area media matters. CRM is a news source, a location for fans to voice their opinions, and an online museum of Chicago media's past and present, with a hopeful eye to its future. For the visitors, readers, and fans of the website, CRM is a both a resource and a release, both educational and an escape, and both factual and fun.    If it has a connection to Chicago area radio, television, print, and/or other forms of media -- information on it can be found here at ChicagolandRadioAndMedia.com!   CRM   Quick Links   Message Board News Section News Feeds Jobs Section Audio Section Memory Lane Media Links Newest   Additions     A Goodbye Note From CRM &amp; Larz       News &amp; Notes: Linda MacLennan; Spiegel &amp; Parkins; Julie DiCaro; Tom Waddle; Byron Miranda; CSN; More       WCGO Being Purchased By William Pollack       News &amp; Notes: Tribune Media; FOX 32; Steve Harvey; MeTV; Mike North; Jimmy Mac; W276BM; Ebony/Jet; More       Tribune Media Sold To Sinclair Broadcasting          Copyright © 2017 - Chicagoland Radio & Media.      Login    User Name       Password       Remember Me                    Forgot your password?        Forgot your username?        Create an account       Register     Name:       *     Username:       *     E-mail:       *     Verify E-mail:       *     Password:       *     Verify Password:       *   Fields marked with an asterisk (*) are required.    Register         Home About Us FAQs News Search Contact Advertise"}