{"url": "https://donate.wikimedia.org/w/index.php?title=Special:LandingPage&country=CA&uselang=kbp&utm_medium=sidebar&utm_source=donate&utm_campaign=kbp.wikipedia.org", "content": "Faites un don maintenant — Donate \n Faites un don maintenant   \n\t\t\t\t\tWolo:\t\t\t\t\t tʋʋzɩtʋ , \t\t\t\t\t ñɩnɩ \n Un message de la part de Jimmy Wales, fondateur de Wikipédia \n Un message de la part de Jimmy Wales, fondateur de Wikipédia \n Wikipédia est l’un des sites internet les plus visités au monde. \n Le commerce n'est pas un monstre et la publicité n’est pas un mal en soi. Mais ni l'un ni l'autre n’ont leur place ici. Nous n'en voulons pas sur Wikipédia.\n Wikipédia est un outil particulier. À la manière d'une bibliothèque ou d'un jardin public, il s'agit d'un refuge pour l’esprit. C’est un endroit que chacun peut visiter pour l'aider dans sa réflexion, y apprendre ou partager ses connaissances.\n En fondant Wikipédia, j’aurais pu créer une entreprise commerciale et y vendre des espaces publicitaires, mais j’ai décidé d’en faire quelque chose de différent. Nous avons travaillé dur au fil des ans pour que notre organisation soit efficace et économe. Aujourd’hui, nous remplissons notre mission. \n Si chaque personne lisant ce message donnait, notre levée de fonds serait achevée en une heure.\n Cette année, je vous remercie d’envisager de faire un don de  $5, $20, $50  ou de tout autre montant à votre portée, afin de protéger et de préserver Wikipédia.\n Merci,\n Jimmy Wales   \nFondateur de Wikipédia\n “ \n  Imaginez un monde dans lequel chaque personne, où qu’elle soit, dispose d’un libre accès à la somme de tout le savoir humain.\n ” \n — Jimmy Wales, fondateur de Wikipédia\n Il semble que JavaScript ne soit pas activé sur votre navigateur, ou que ce dernier ne le prenne pas en charge.\nAfin de vous fournir un processus sûr, sécurisé et agréable, notre formulaire de don nécessite JavaScript. \n                Loading… \n (If the form does not load, your web browser may not be supported. Please try a more modern browser.) \n        Montant du don (CAD)\n Don ponctuel \n Don mensuel \n 3 $ \n 5 $ \n 10 $ \n 20 $ \n 30 $ \n 50 $ \n 100 $ \n Autre \n Où va votre don :\n Infrastructure  : serveurs, bande passante, maintenance, développement ;  Wikipédia est l’un des sites internet les plus visités au monde et il fonctionne avec une infime fraction de ce que dépensent d’autres grands sites web.\n Personnel  : les 10 principaux sites web emploient des milliers de salariés ; nous en avons environ 300, ce qui fait de votre don un très bon investissement dans une organisation non lucrative hautement efficace.\n En faisant ce don, vous acceptez de partager vos données personnelles avec la Fondation Wikimédia, l’organisation à but non lucratif qui gère Wikipédia, les autres projets de Wikimédia, ainsi que les prestataires de services conformément à notre  politique de confidentialité en matière de donation . La Fondation Wikimédia et ses prestataires sont situés aux États-Unis et dans d’autres pays dont les lois sur la confidentialité des données peuvent différer des vôtres. Nous ne vendons ni échangeons vos informations avec qui que ce soit. Pour plus d’informations, nous vous demandons de bien vouloir lire notre  politique de confidentialité en matière de donation .\n Pour les donateurs mensualisés, un montant fixe vous sera prélevé chaque mois par la Wikimedia Foundation à la même date de chaque mois que celle de votre premier don et ce jusqu’à ce que vous nous informiez que vous souhaitez y mettre fin. Pour les dons démarrés le 29, 30 ou 31 du mois, les prélèvements suivants seront effectués le dernier jour du mois pour les mois les plus courts, à la date la plus proche possible de celle du premier don. Pour toutes questions, veuillez contacter donate@wikimedia.org. \n Problèmes pour faire un don ? \n Autres moyens de donner \n Foire aux questions \n Informations sur les conditions de déductibilité fiscale \n\t\t\t\t\t\tPɩɖaɣna mʋʋna \" https://donate.wikimedia.org/wiki/Special:LandingPage \"\t\t\t\t\t \n Ɖiwoɖe tʋʋzʋʋ \n Man-kɩlabɩnaʋ \n Kabɩyɛ Kpɩtɩna   \n Hɩla loniye \n Takayahayʋʋ ndɩ   \n Ndɩ ndɩ \n Taaɖɩtʋ \n Sɔzʋʋ \n Ñɩnɩ \n Tʋʋzɩtʋ \n Talɩ ɖeu Ŋgbɛyɛ Sɔnɔ tɔm Wayɩ wayɩ ñɔɔzɩtʋ Takayɩhayʋʋ nakʋyʋ yem Sɩnaʋ Ha haɖɛ   \n Kɩlabɩnaʋ \n Takayɩhatʋ ndɩ Ñɔɔzɩtʋ kɩlɛɣzɩtʋ kɩlɩʋ lone   \n Mɛsaɣ tɛɛ tɔm ɖɔkʋʋ paɣtʋ \n pɩlɩɩna Donate \n Paɣʋ \n Leɣtʋ tɩlɩyaa \n Déclaration sur les témoins (cookies) \n Nesi tɛɛ kaŋgalafʋ taaɖʋʋ"}