{"url": "http://www.985fm.ca/nouvelles/politique/59263/vente-dimmeubles-gouvernementaux-la-vrificatrice-gnrale-en-contact-avec-lupac", "content": "Vente d'immeubles gouvernementaux: la Vérificatrice générale en contact avec l'UPAC - 98,5 fm Montréal \n nc-logo-fb-simple nc-logo-twitter nc-logo-pinterest nc-logo-instagram     nc-logo-youtube nc-logo-google-plus nc-logo-rss     nc-zoom-2 nc-calendar-grid-61   nc-simple-remove nc-button-play nc-button-pause   nc-button-stop nc-curved-next nc-tail-right nc-tail-left nc-volume-ban     nc-volume-97     nc-volume-93 nc-sun-cloud-hail       nc-sun-cloud-light   nc-sun-cloud           nc-sun-cloud-fog     nc-email-84 nc-headphone nc-ic_photo_library_24px nc-flash-21 nc-single-02   nc-bars                 \n          Connexion\n Vente d'immeubles gouvernementaux: la Vérificatrice générale en contact avec l'UPAC \n Par Cogeco Nouvelles \n 24 novembre 2017 07:47 \n Facebook \n  Twitter \n  Courriel \n La Presse Canadienne \n        La Vérificatrice générale du Québec, Guylaine Leclerc\n Entrevue Guylaine Leclerc \n il y a 9 heures \n Partager \n La Vérificatrice générale du Québec, Guylaine Leclerc, était l'invitée de Paul Arcand au  98,5 FM , vendredi matin. \n Elle y a abordé notamment la vente d'immeubles gouvernementaux entachée d'irrégularités, sous le règne de Jean Charest. \n «Nous travaillons avec l’UPAC», a-t-elle confirmé à l'animateur. \n Elle estime que les concessions financières faites aux acheteurs totalisent près de 60 millions de dollars. \n Le président du Conseil du trésor, Pierre Arcand, assure également que le gouvernement Couillard entend faire le suivi de ce que la Vérificatrice qualifie d'opérations «empreintes de déficiences du début jusqu'à la fin». \n Contenu relié \n        Oscar Pistorius: le juge double sa sentence de prison\n        Paul Arcand se laisse inviter au Musée Grévin (photos)\n        À quelques heures de l’ouverture du congrès libéral, Philippe Couillard se lance dans une défense passionnée de Jean Charest....\n        Travaux majeurs à l'édifice du centre\n        Le salaire minimu à 15$ de l'heure en Ontario aura un impact dans la région. Marc Clément est propriétaire du Home Hardware à Aylmer et du Capital Home Hardware à Ottawa.\n Nous joindre \n Carrières \n Termes & conditions \n Politique de confidentialité \n Ventes \n Communiqués de presse \n ©2017 Cogeco Média. Tous droits reservés \n Téléchargez notre nouvelle application mobile Cogeco Live ! \n          Connexion\n              Réseau parlé\n FM93 \n 104,7 fm Outaouais \n 106,9 fm Mauricie \n 107,7 fm Estrie \n Actualités \n Sports \n Politique \n Économie \n Culturel \n Techno \n Émissions \n Animateurs \n Concours \n Évènements \n      Connexion\n 3°C \n      Drainville PM\n      En direct de 12:00 à 14:59\n      12:00\n 1743 \n 14:59 \n 100 \n  Drainville PM \n  avec\n           Bernard Drainville \n    Votre version d'internet explorer est trop basse. Utilisez au moins la version 11 ou un navigateur récent comme Google Chrome."}