{"url": "https://en.wikipedia.org/wiki/Theodore_Nott", "content": "List of Harry Potter characters - Wikipedia \n List of  Harry Potter  characters   \n From Wikipedia, the free encyclopedia     (Redirected from  Theodore Nott ) \n This is the  latest accepted revision ,  reviewed  on  25 November 2017 . \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This is a  list of characters in the  Harry Potter  series . They are all characters who have appeared in a  Harry Potter -related book by  J. K. Rowling . \n Contents \n Sorted by  surname :  A   B   C   D   E   F   G   H   I   J   K   L   M   N   O   P   Q   R   S   T   U   V   W   X   Y   Z \n  No or unknown surname :  A   B   C   D   E   F   G   H   I   J   K   L   M   N   O   P   Q   R   S   T   U   V   W   X   Y   Z \n     References     External links   \n Characters by surname [ edit ] \n A [ edit ] \n Hannah Abbott  – Hufflepuff student in Harry Potter's year, prefect of Hufflepuff house in fifth year, member of  Dumbledore's Army \n B [ edit ] \n Ludo Bagman  – Head of the  Department of Magical Games and Sports  within the  Ministry of Magic \n Bathilda Bagshot  – author of  A History of Magic , great aunt of  Gellert Grindelwald . \n Katie Bell  – Gryffindor student one year above Harry Potter;  Chaser  on the Gryffindor Quidditch team. \n Cuthbert Binns  – ghost, History of Magic professor. \n Phineas Nigellus Black  – great-great-grandfather of  Sirius Black  and former headmaster of Hogwarts, whose painting hangs in the office and helps out the current headmaster. \n Sirius Black  – Harry Potter's godfather, a member of the Order of the Phoenix and prisoner on the run. \n Amelia Bones  – Head of the  Department of Magical Law Enforcement , aunt of Susan Bones. \n Susan Bones  – Hufflepuff student in Harry's year, a member of Dumbledore's Army. \n Terry Boot  – Ravenclaw student in Harry's year, a member of Dumbledore's Army. \n Lavender Brown  –  Gryffindor student  in Harry's year, a member of  Dumbledore's Army , briefly  Ron Weasley 's girlfriend. \n Millicent Bulstrode  – Slytherin student in Harry's year, a member of Umbridge's Inquisitorial Squad. \n Charity Burbage  – Professor of  Muggle Studies  at Hogwarts during Harry's time at school. \n Frank Bryce  – Muggle gardener for the  Riddle family . \n C [ edit ] \n Alecto Carrow  – sister of  Amycus Carrow ,  Death Eater  and professor of  Muggle Studies  for one year, Deputy Headmistress of  Hogwarts  under  Severus Snape \n Amycus Carrow  – brother of  Alecto Carrow ,  Death Eater  and professor of  Defence Against the Dark Arts  for one year and Deputy Headmaster of  Hogwarts  under  Severus Snape \n Reginald Cattermole  – employee of the Magical Maintenance Department for the  Ministry of Magic , impersonated by  Ron Weasley \n Mary Cattermole – Muggle-born wife of  Reginald Cattermole , saved by  Harry Potter  from the Muggle-born Registration Commission. \n Cho Chang  –  Ravenclaw  student one year above Harry,  Quidditch  Seeker, member of  Dumbledore's Army  and Harry's first love interest. \n Penelope Clearwater  –  Ravenclaw   prefect  and girlfriend of  Percy Weasley \n Mrs. Cole – Matron of the orphanage where  Tom Marvolo Riddle  lived \n Michael Corner  –  Ravenclaw  student in Harry's year, member of  Dumbledore's Army ,  Ginny Weasley 's first boyfriend \n Vincent Crabbe, Sr. –  Death Eater , father of  Vincent Crabbe \n Vincent Crabbe  –  Slytherin  student in Harry's year, son of  Death Eater , Slytherin  Quidditch  team Beater, a member of the  Inquisitorial Squad , a friend of  Draco Malfoy . \n Colin Creevey  – Muggle-born  Gryffindor  student one year below Harry, brother of  Dennis Creevey , member of  Dumbledore's Army , killed during the  Battle of Hogwarts , after sneaking away from the younger evacuated students in the seventh book \n Dennis Creevey  – Muggle-born  Gryffindor  student three years below Harry, brother of  Colin Creevey , and member of  Dumbledore's Army \n Dirk Cresswell  – Muggle-born Head of the  Goblin Liaison Office , went on the run in Deathly Hallows with fellow muggle-born  Ted Tonks ,  Dean Thomas  and goblins Gornuk and  Griphook \n Bartemius (Barty) Crouch, Sr.  – Head of the  Department of International Magical Cooperation , killed by his son  Barty Crouch Jr , Transfigurated into a bone before being buried \n Bartemius (Barty) Crouch, Jr.  –  Death Eater , credited with facilitating the return of  Lord Voldemort , received a  Dementor's Kiss , used  Polyjuice Potion  to impersonate  Alastor Moody * \n D [ edit ] \n Roger Davies – Ravenclaw student who was Captain and Chaser on the Ravenclaw Quidditch team. Went to Yule Ball with Fleur Delacour. \n Dawlish  – an Auror \n Fleur Delacour  – French student who participated in the Triwizard Tournament representing  Beauxbatons , later married Bill Weasley. \n Gabrielle Delacour  – younger sister of Fleur Delacour, saved by Harry in the Triwizard Tournament \n Dedalus Diggle  – member of the Order of the Phoenix who took the Dursleys into hiding \n Amos Diggory  – works for the Department for the Regulation and Control of Magical Creatures, father of Cedric Diggory \n Cedric Diggory  – Hufflepuff student two years above Harry, school prefect, Quidditch Seeker and captain, co-winner of the  Triwizard Tournament \n Elphias Doge  – School friend of  Albus Dumbledore \n Antonin Dolohov  – Death Eater who killed  Fabian Prewett ,  Gideon Prewett , and  Remus Lupin . \n Aberforth Dumbledore  – Brother of Albus and Ariana Dumbledore, owner of the  Hog's Head \n Albus Dumbledore  – Hogwarts Headmaster in Harry Potter's time, Transfiguration professor in Tom Riddle's time, founder of the Order of the Phoenix. \n Dudley Dursley  – Muggle son of Vernon Dursley and Petunia Evans, first cousin of Harry Potter \n Marjorie (Marge) Dursley  – Muggle sister of Vernon Dursley, breeds bulldogs, her favourite one named Ripper. \n Petunia Dursley  (née Evans) – Harry's aunt, the sister of his mother Lily. Married to Vernon Dursley and mother of Dudley Dursley \n Vernon Dursley  – Harry Potter's muggle uncle, married to his aunt Petunia and father of Dudley Dursley. \n E [ edit ] \n Marietta Edgecombe  – Ravenclaw student one year above Harry, member of Dumbledore's Army's and also betrays Dumbledore's Army to Dolores Umbridge \n F [ edit ] \n Arabella Figg  – Squib neighbour of the Dursleys', member of the Order of the Phoenix. \n Argus Filch  – Squib caretaker of Hogwarts \n Justin Finch-Fletchley  – Muggle-born Hufflepuff student in Harry's year, a member of Dumbledore's Army. \n Seamus Finnigan  – Irish Gryffindor student in Harry's year, a member of Dumbledore's Army, best friend of Dean Thomas. \n Marcus Flint  – Slytherin sixth year Quidditch captain \n Mundungus Fletcher  – Common thief and shifty member of the Order of the Phoenix \n Filius Flitwick  – Charms professor at Hogwarts and Head of Ravenclaw \n Florean Fortescue  – Ice cream vendor at Diagon Alley, supplied free ice creams to Harry, kidnapped and killed by Death Eaters \n Cornelius Fudge  – Minister for Magic in the first five books, sacked when he denied Lord Voldemort's return for a year. \n G [ edit ] \n Marvolo Gaunt  – Pure-blood Father of Merope and Morfin Gaunt, grandfather of Tom Marvolo Riddle. \n Merope Gaunt  – The mother of Tom Marvolo Riddle/Lord Voldemort, died after childbirth. \n Morfin Gaunt  – Son of Marvolo Gaunt, brother of Merope Gaunt, uncle of Tom Marvolo Riddle, framed by his nephew for Muggle killings. \n Anthony Goldstein  – Ravenclaw student in Harry's year, member of Dumbledore's Army \n Goyle Sr  – Death Eater, father of Gregory Goyle \n Gregory Goyle  – Large Slytherin student in Harry's year, Slytherin Quidditch Beater, a member of the Inquisitorial Squad. \n Hermione Granger  – Muggle-born Gryffindor student in Harry's year, one of Harry's best friends, founder of Dumbledore's Army and S.P.E.W., Gryffindor Prefect. \n Astoria Greengrass  – Wife to Draco and mother to  Scorpius Malfoy . She mysteriously dies in  Harry Potter and the Cursed Child , which leaves her son greatly depressed at Hogwarts. \n Gregorovitch – highly regarded  East European  wand-maker. \n Fenrir Greyback  – Werewolf working for the Death Eaters \n Gellert Grindelwald  – Dark Wizard, jailed since Albus Dumbledore defeated him in the 1940s. \n Wilhelmina Grubbly-Plank  – Substitute Care of Magical Creatures professor during Harry's fourth and fifth years. \n Godric Gryffindor  - founder of Gryffindor, owned and enchanted the Sorting Hat. \n H [ edit ] \n Rubeus Hagrid  – Half-giant Keeper of Keys and Grounds at Hogwarts, Care of Magical Creatures professor starting from Harry's third year, a member of the Order of the Phoenix. Once a Hogwarts student, Hagrid was expelled in his third year. \n Rolanda Hooch  – Hogwarts flying instructor, Quidditch referee \n Mafalda Hopkirk  – Witch who works in the Ministry of Magic, impersonated by Hermione Granger in  Deathly Hallows . \n Helga Hufflepuff  - Founder of Hufflepuff. \n J [ edit ] \n Angelina Johnson  – Gryffindor student two years above Harry, Quidditch Chaser and later captain. \n Lee Jordan  – Gryffindor student two years above Harry, Hogwarts Quidditch commentator, good friend of Fred and George Weasley at Hogwarts \n Bertha Jorkins  – witch from the Ministry of Magic who was murdered by Voldemort. \n K [ edit ] \n Igor Karkaroff  – Reformed Death Eater, Headmaster of Durmstrang. \n Viktor Krum  – Durmstrang student, Bulgarian Quidditch Seeker, participated in the Triwizard Tournament. \n Silvanus Kettleburn  - Care of Magical Creature teacher until Harry's third year. \n L [ edit ] \n Bellatrix Lestrange  (née Black) – Death Eater who tortured Frank and Alice Longbottom into insanity. \n Rabastan Lestrange  – Death Eater, brother of Rodolphus Lestrange \n Rodolphus Lestrange  – Death Eater, brother of Rabastan Lestrange, husband of Bellatrix Lestrange \n Gilderoy Lockhart  – Fraudulent celebrity author, Defence Against the Dark Arts teacher. \n Alice Longbottom  – Wife of Frank Longbottom, mother of Neville Longbottom, member of the original Order of the Phoenix, Auror, tortured into insanity by Bellatrix Lestrange along with her husband \n Augusta Longbottom  – Mother of Frank Longbottom and grandmother of Neville Longbottom \n Frank Longbottom  – Father of Neville Longbottom, a member of the original Order of the Phoenix, Auror, tortured into insanity by Bellatrix Lestrange along with his wife. \n Neville Longbottom  – Gryffindor student in Harry's year, a member of Dumbledore's Army. \n Luna Lovegood  – Ravenclaw student one year below Harry, a member of Dumbledore's Army. \n Xenophilius Lovegood  – Father of Luna Lovegood, and editor of  The Quibbler . \n Remus Lupin  – Gryffindor student before Harry's time, a friend of James Potter, werewolf, Professor of Defence Against the Dark Arts in Harry's third year, and member of the Order of the Phoenix. \n Edward Remus Lupin  – Son of Remus Lupin and Nymphadora Tonks. Hufflepuff student. Also known as Teddy Lupin. \n M [ edit ] \n Walden Macnair  – The Committee of Disposal of Dangerous Creatures's executioner, also a Death Eater \n Draco Malfoy  – Slytherin student in Harry's year, Slytherin Quidditch Seeker, school prefect, member of the Inquisitorial Squad. \n Lucius Malfoy  – Draco Malfoy's father, an influential Death-Eater, and, early in the series, governor of Hogwarts \n Narcissa Malfoy  (née Black) – Lucius Malfoy's wife and Draco Malfoy's mother, sister of Bellatrix Lestrange and Andromeda Tonks. \n Scorpius Malfoy  - Son of Draco Malfoy and Astoria Greengrass, friend of Albus Potter. \n Madam Malkin – Clothes shop owner at  Diagon Alley \n Griselda Marchbanks – Governor of the Wizarding Examinations Authority which ran the O.W.L, N.E.W.T., and W.O.M.B.A.T. exams, Wizengamot elder \n Olympe Maxime  – Half-giantess, Headmistress of Beauxbatons \n Ernie Macmillan  – Hufflepuff student in Harry's year, school prefect, member of Dumbledore's Army \n Minerva McGonagall  – Hogwarts Transfiguration professor, Head of Gryffindor House, Deputy Headmistress of Hogwarts, a member of the Order of the Phoenix. \n Cormac McLaggen – Gryffindor student one year above Harry Potter, in love with  Hermione Granger  member of the  Slug Club  and went with Hermione to the Slug Club Christmas Party \n Graham Montague –  Slytherin  student who played Chaser on the Slytherin Quidditch Team \n Alastor (Mad-Eye) Moody  – Retired  Auror , member of the  Order of the Phoenix , impersonated by  Barty Crouch Jr.  in 'The Goblet of Fire' \n N [ edit ] \n Theodore Nott  –A Slytherin student in the same year as Harry Potter. Theodore Nott is one of the few students who can see  Thestrals , suggesting that he has witnessed a death at some point. His father is a Death Eater and described as an elderly widower. \n O [ edit ] \n Bob Ogden – Wizard in the Department of Magical Law Enforcement, led the Magical Law Enforcement Squad in the 1920s. He went to the Gaunts' home after Morfin Gaunt used magic in front of a muggle and subsequently turned the Gaunts over to the Wizengamot. \n Garrick Ollivander  – Wandmaker, owner of the  Ollivanders  shop. \n P [ edit ] \n Pansy Parkinson  – Slytherin student in Harry's year, school prefect, a member of the Inquisitorial Squad, Draco Malfoy's girlfriend for some time. \n Padma Patil  – Ravenclaw student in Harry's year, identical twin sister of Gryffindor Parvati Patil, a member of Dumbledore's Army. \n Parvati Patil  – Gryffindor student in Harry's year, identical twin sister of Ravenclaw Padma Patil, a member of Dumbledore's Army. \n Peter Pettigrew  – Former school friend of James Potter, Sirius Black and Remus Lupin. Betrays James and Lily Potter. Death Eater, an unregistered animagus, Pettigrew is first introduced as a rat known as Scabbers. \n Antioch Peverell  – Original owner of The Elder Wand in  The Tale of the Three Brothers . \n Cadmus Peverell  – Original owner of The Resurrection Stone in  The Tale of the Three Brothers . \n Ignotus Peverell  – Original owner of The Invisibility Cloak in  The Tale of the Three Brothers . \n Irma Pince  – Hogwarts librarian \n Sturgis Podmore  – Member of the Order of the Phoenix, imprisoned in Azkaban \n Poppy Pomfrey  – Hogwarts  school nurse \n Harry Potter  – The main character of the series, orphaned son of James Potter and Lily Evans and student at Hogwarts \n James Potter  – Harry Potter's father, a member of the Order of the Phoenix, murdered by Lord Voldemort before the series begins. \n Lily Potter  (née Evans) – Harry Potter's mother, a member of the Order of the Phoenix, murdered by Lord Voldemort before the series begins. \n Q [ edit ] \n Quirinus Quirrell  – Defence Against the Dark Arts professor in Harry's first year, possessed by Lord Voldemort, and was killed in  Philosopher's Stone . \n R [ edit ] \n Helena Ravenclaw/The Grey Lady  – Daughter of Rowena Ravenclaw, stole her mother's diadem and hid it, killed by the Bloody Baron and became Ravenclaw's house ghost. \n Rowena Ravenclaw  - Founder of Ravenclaw, mother of  Helena Ravenclaw \n Tom Marvolo Riddle – see  Lord Voldemort . \n Demelza Robins  – a student at Hogwarts School of Witchcraft and Wizardry, sorted into Gryffindor House. She was a Chaser for the Gryffindor Quidditch team, and was noted to be particularly skilled at dodging Bludgers. \n Augustus Rookwood  – Death Eater, spy working in the Department of Mysteries \n Albert Runcorn  – was a Ministry of Magic employee of high rank during the administration under Pius Thicknesse. His chief function was as an investigator of alleged Muggle-borns. \n S [ edit ] \n Newt Scamander  – Author of  Fantastic Beasts and Where to Find Them . Was a Hufflepuff and great with making cures for different sicknesses. \n Rufus Scrimgeour  – Head of the Auror Office, replaces Cornelius Fudge as Minister for Magic. \n Kingsley Shacklebolt  – Auror, replaces Pius Thicknesse as Minister for Magic, member of the Order of the Phoenix \n Stanley Shunpike – Conductor of the Knight Bus, later jailed in Azkaban on suspicions of being a Death Eater. \n Aurora Sinistra  – Professor and member of the Astronomy Department at Hogwarts, a witch with dark skin, hair, and eyes. \n Rita Skeeter  – Reporter for the  Daily Prophet , author of  The Life and Lies of Albus Dumbledore , unregistered animagus. \n Horace Slughorn  – Former Potions professor at Hogwarts and Head of Slytherin House who taught Tom Marvolo Riddle and returns to Hogwarts in Harry's sixth year. \n Salazar Slytherin  - Founder of  Slytherin , creator of the Chamber of Secrets. \n Hepzibah Smith  – Elderly, wealthy antique collector, descendant of Helga Hufflepuff, murdered and robbed by Tom Marvolo Riddle \n Zacharias Smith  – Hufflepuff student, a member of Dumbledore's Army. \n Severus Snape  – Hogwarts, Potions and later Defence Against the Dark Arts professor, Head of Slytherin House, a member of both the Death Eaters and the Order of the Phoenix to spy for Dumbledore. \n Alicia Spinnet  – Chaser on the Gryffindor Quidditch team, two years above Harry Potter at Hogwarts. Member of Dumbledore's Army. \n Pomona Sprout  – Hogwarts Herbology professor, Head of Hufflepuff house. \n T [ edit ] \n Pius Thicknesse  – Minister for Magic while under the Imperius Curse, later replaced by Kingsley Shacklebolt. \n Dean Thomas  – Gryffindor student in Harry's year, a member of Dumbledore's Army, briefly Ginny Weasley's boyfriend, Gryffindor Quidditch Chaser. \n Andromeda Tonks  (née Black) – Sister of Bellatrix Lestrange and Narcissa Malfoy, disowned by her family for marrying Muggle-born Ted Tonks, mother of Nymphadora Tonks. \n Nymphadora Tonks  – Daughter of Ted and Andromeda Tonks, Auror and member of the Order of the Phoenix. She marries Remus Lupin, and becomes the mother of Teddy Lupin. \n Ted Tonks  – Muggle-born husband of Andromeda and father of Nymphadora Tonks. \n Travers  – was a wizard and a Death Eater. Escaped from Azkaban after Lord Voldemort's return. \n Sybill Trelawney  – Hogwarts Divination professor, predicted the prophecy that prompted Lord Voldemort to go after the Potters \n Wilkie Twycross – The apparition instructor in  Harry Potter and the Half-Blood Prince \n U [ edit ] \n Dolores Jane Umbridge  – Senior Undersecretary to the Minister for Magic, Defence Against the Dark Arts professor, Hogwarts High Inquisitor, Headmistress of Hogwarts, who enthusiastically joins in the persecution of half-bloods under Voldemort. \n V [ edit ] \n Emmeline Vance  – a member of the party that brings Harry to Grimmauld Place, a member of the Order of the Phoenix. Described as \"A stately looking witch in an emerald green shawl\". \n Romilda Vane – Hogwarts student who tried to romance Harry with Chocolate Cauldrons containing a love potion from  Weasley's Wizard Wheezes \n Septima Vector  –  Arithmancy  professor at Hogwarts. \n Lord Voldemort  – The villain of the series, the murderer of Harry Potter's parents and many others in his quest for immortality and absolute power. \n W [ edit ] \n Arthur Weasley  – Muggle-obsessed Ministry of Magic employee. Husband of Molly Weasley, father of Bill, Charlie, Percy, Fred, George, Ron, and Ginny Weasley, member of the Order of the Phoenix \n Bill Weasley  – Oldest son of Arthur and Molly Weasley, Gringotts employee, marries Fleur Delacour \n Charlie Weasley  – Second son of Arthur and Molly Weasley, and a member of the Order of the Phoenix, works with dragons in Romania \n Fred Weasley  – Son of Arthur and Molly Weasley and identical twin brother of George Weasley, a member of Dumbledore's Army, Gryffindor Quidditch Beater, co-owner of Weasleys' Wizard Wheezes, killed in an explosion caused by Augustus Rookwood in the Battle of Hogwarts \n George Weasley  – Son of Arthur and Molly Weasley and identical twin brother of Fred Weasley, member of Dumbledore's Army, Gryffindor Quidditch Beater, co-owner of Weasleys' Wizard Wheezes \n Ginny Weasley  – Only daughter and youngest child of Arthur and Molly Weasley, Gryffindor student one year below Harry, Gryffindor Quidditch Seeker and Chaser, a member of Dumbledore's Army \n Molly Weasley  (née Prewett) – Wife of Arthur Weasley, mother of Bill, Charlie, Percy, Fred, George, Ron and Ginny Weasley, a member of the Order of the Phoenix \n Percy Weasley  – Third son of Arthur and Molly Weasley, Gryffindor prefect and Head Boy then Ministry of Magic employee, long estranged from his family before joining them against the Death Eaters in  Deathly Hallows \n Ron Weasley  – Best friends with Harry Potter and Hermione Granger, youngest Son of Arthur and Molly Weasley, Gryffindor Quidditch Keeper, school prefect, a member of Dumbledore's Army \n Oliver Wood  – Hogwarts student, Gryffindor Quidditch Keeper and captain \n Y [ edit ] \n Corban Yaxley  – Death Eater, Head of Magical Law Enforcement under Voldemort's regime. \n Z [ edit ] \n Blaise Zabini – Slytherin student in Harry's year, friends with Draco Malfoy. \n Characters with no or unknown surname [ edit ] \n A [ edit ] \n Aragog  – Giant spider raised by Rubeus Hagrid, lives in the Forbidden Forest. \n B [ edit ] \n Bane  – Centaur, not very wizard-friendly. \n Beedle the Bard  – Author of several Wizarding  fairy tales , including  The Tale of the Three Brothers \n The Bloody Baron  – Slytherin House ghost, suitor and killer of Helena Ravenclaw, killed himself in remorse \n Bogrod – Goblin, Bank teller at Gringotts Wizarding Bank. Put under the Imperius curse when Harry, Ron, and Hermione broke into Gringotts. \n Buckbeak  (a.k.a. Witherwings) –  Hippogriff  belonging at various times to Rubeus Hagrid, Sirius Black and Harry Potter \n C [ edit ] \n Sir Cadogan – Armoured and somewhat mad knight occupying a painting in Hogwarts \n Crookshanks  – Intelligent cat belonging to Hermione Granger. \n D [ edit ] \n Dobby  –  House-elf  originally belonging to the Malfoy family, which Harry helps set free in  Chamber of Secrets . He becomes the only paid house-elf at Hogwarts. \n E [ edit ] \n Errol  –  Owl  belonging to the Weasley family. \n F [ edit ] \n Fang  –  Boarhound  belonging to Rubeus Hagrid. \n The Fat Friar  – Hufflepuff House ghost. \n The Fat Lady  – Witch in the painting that conceals the entrance to the Gryffindor common room. \n Fawkes  –  Phoenix  belonging to Albus Dumbledore, saved Harry Potter from Basilisk in the Chamber of Secrets. \n Firenze  – Centaur, professor of Divination at Hogwarts. \n Fluffy  –  Three-headed dog  belonging to Rubeus Hagrid, protector of the Philosopher's Stone. \n G [ edit ] \n Gornuk – A goblin like  Griphook  who worked at  Gringotts  and later teamed up with Griphook,  Dean Thomas ,  Ted Tonks , and  Dirk Cresswell  to hide away during  Deathly Hallows \n Grawp  – Giant, half-brother of Rubeus Hagrid \n Griphook  – Goblin, works at Gringotts Bank which he helps Harry and his friends steal the cup from within the Lestrange vault. \n H [ edit ] \n Hedwig  – Harry Potter's pet owl \n Hokey  – House-elf belonging to Hepzibah Smith \n K [ edit ] \n Kreacher – House-elf belonging to the Black family, and later Harry Potter. Though at first preferring to serve the pureblood line (including Regulus Black, Narcissa Malfoy, Bellatrix Lestrange, and Draco Malfoy), he eventually likes serving under Harry as he treats him better. \n M [ edit ] \n Magorian  – Centaur. \n Moaning Myrtle  – Muggle-born Ravenclaw student during Tom Marvolo Riddle's time at Hogwarts, killed by the Basilisk in a girl's bathroom, which she continues to haunt. \n Great Aunt Muriel  – Great aunt of the Weasley children \n N [ edit ] \n Nagini  – Lord Voldemort's giant pet  snake , which does his bidding. She is one of Voldemort's Horcruxes. \n Nearly Headless Nick  – Sir Nicholas de Mimsy-Porpington, the Gryffindor House ghost. He is known for being nearly headless. \n Norbert/Norberta  –  Dragon  belonging to Rubeus Hagrid, later secretly moved to the Dragon Reserve in Romania by friends of Charlie Weasley. \n P [ edit ] \n Peeves  – Hogwarts  poltergeist , a mischievous magical being. \n Pigwidgeon  (Pig) – Named by Ginny Weasley, a tiny mischievous  owl  belonging to Ron Weasley. \n R [ edit ] \n Madam Rosmerta  – Proprietor of the Three Broomsticks in Hogsmeade \n Ronan  – Centaur living in the Forbidden Forest \n S [ edit ] \n Scabbers – Ron Weasley's pet rat in the first three stories. He is revealed at the end of  Prisoner of Azkaban  to be a wizard in animal form:  Peter Pettigrew . \n Scabior – Snatcher who captures Harry Potter, Ron Weasley and Hermione Granger in  Deathly Hallows . \n T [ edit ] \n Travers – was a wizard and a Death Eater who escaped from Azkaban after Lord Voldemort's return. \n Trevor – The toad belonging to Neville Longbottom that always gets lost \n W [ edit ] \n Winky – A female house elf who originally belonged to Bartemius Crouch Sr., but was sacked by him when evidence emerged that she had used magic at the Quidditch World Cup, then worked in the Hogwarts kitchen. \n External links [ edit ] \n Book: Harry Potter \n Wizards and Witches A to Z  from the  Harry Potter Lexicon  (fansite) \n J.K. Rowling...A Day in the Life documentary from ITV \n v \n t \n e \n The  Harry Potter  series by  J. K. Rowling \n Books \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows \n Film series \n Films \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Music \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Related \n Cast members \n Production of  The Deathly Hallows \n Characters \n Main \n Harry Potter \n Ron Weasley \n Hermione Granger \n Lord Voldemort \n Albus Dumbledore \n Severus Snape \n Rubeus Hagrid \n Draco Malfoy \n Supporting \n Hogwarts staff \n Order of the Phoenix \n Dumbledore's Army \n Death Eaters \n Fictional universe \n Hogwarts \n Magic \n Magical creatures \n Magical objects \n Ministry of Magic \n Muggle \n Places \n Potions \n Quidditch \n Related works \n Fantastic Beasts and Where to Find Them \n Quidditch Through the Ages \n The Tales of Beedle the Bard \n Prequel \n Pottermore \n The Cursed Child \n Hogwarts: An Incomplete and Unreliable Guide \n Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists \n Short Stories from Hogwarts of Heroism, Hardship and Dangerous Hobbies \n Games and toys \n Quidditch World Cup \n Lego Creator: Harry Potter \n Lego Harry Potter: Years 1–4 \n Lego Harry Potter: Years 5–7 \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Book of Spells \n Book of Potions \n Trading Card Game \n Lego  Harry Potter \n Attractions \n The Wizarding World of Harry Potter \n Orlando \n Japan \n Hollywood \n Dragon Challenge \n Flight of the Hippogriff \n Harry Potter and the Escape from Gringotts \n Harry Potter and the Forbidden Journey \n Hogwarts Express \n Harry Potter Movie Magic Experience \n Warner Bros. Studio Tour London \n Fandom \n Harry Potter Alliance \n The Leaky Cauldron \n MuggleNet \n LeakyCon \n Wizard rock \n Wrockstock \n Voldemort: Origins of the Heir \n Related \n Influences and analogues \n Legal disputes \n Parodies \n Politics \n Religious debates \n Translation \n A Very Potter Musical \n The Harry Potter Lexicon \n The Magical Worlds of Harry Potter \n Potter Puppet Pals \n   Book \n   Category \n   Portal \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=List_of_Harry_Potter_characters&oldid=812055686#N \"\t\t\t\t\t \n Categories :  Harry Potter characters Speculative fiction film characters lists Lists of literary characters Hidden categories:  Wikipedia pending changes protected pages (level 1) Use dmy dates from November 2013   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons   \n Languages \n العربية বাংলা Български Bosanski Català Čeština Dansk Deutsch Eesti Emiliàn e rumagnòl Español فارسی Français Galego 한국어 Հայերեն Hrvatski Bahasa Indonesia Italiano Қазақша Lëtzebuergesch Lietuvių Magyar Македонски मराठी Bahasa Melayu Nederlands 日本語 Norsk Norsk nynorsk Português Русский Српски / srpski Srpskohrvatski / српскохрватски Suomi Svenska ไทย Türkçe Tiếng Việt 中文   \n Edit links   \n  This page was last edited on 25 November 2017, at 18:45. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}