{"url": "https://en.wikipedia.org/wiki/User_talk:KirrVlad", "content": "User talk:KirrVlad - Wikipedia \n User talk:KirrVlad   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Welcome! \n Hello, KirrVlad, and  welcome  to Wikipedia! Thank you for your contributions. I hope you like the place and decide to stay. Here are a few good links for newcomers: \n The five pillars of Wikipedia \n How to edit a page \n Help pages \n Tutorial \n How to write a great article \n Manual of Style \n I hope you enjoy editing here and being a  Wikipedian ! Please  sign your name  on talk pages using four tildes (~~~~); this will automatically produce your name and the date. If you need help, check out  Wikipedia:Where to ask a question , ask me on my talk page, or place  {{helpme}}  on your talk page and someone will show up shortly to answer your questions. Again, welcome!   Edgar181  12:43, 1 March 2006 (UTC) \n Contents \n 1   Fernanda Seno \n 2   Phil McGraw \n 3   Suspected Sockpuppet \n 4   December 2010 \n 5   August 2012 \n 5.1   Edit Summaries \n 5.2   All edits marked as minor? \n 6   Disambiguation link notification for November 4 \n 7   Disambiguation link notification for November 11 \n 8   Administratively united parishes \n 9   WP:ES \n 10   Disambiguation link notification for February 7 \n 11   Portuguese in the United Kingdom \n 12   Disambiguation link notification for November 6 \n 13   ArbCom elections are now open! \n 14   ArbCom Elections 2016: Voting now open! \n 15   Confidence and supply does not exist in Portugal, it is a non existing concept in non-Westminster governments \n Fernanda Seno [ edit ] \n You posted the following to  Wikipedia:Articles for deletion/Fernanda seno : \n \"Sorry, I was unable to find the inexistent article's talk page. Nor do I know what a deletion review looks like or what the rules for posting there are. Please don't kick me out, I just wanted to express that the \"we agree with the portuguese wikipedia! argument is no longer valid. She did exist, was a recognized, acclaimed and toponymical-ubiquitious poet, as the Portuguese and German wikipedias now acknowledge. So maybe someone could help me with the uphill effort of keep submitting(no other term for it) articles on Portuguese language poets only to see them deleted as vanity-something-or-other, which is almost funny as almost all of those I have tried to add to the English language wikipedia have been long dead. Post-mortem vanity? No such thing. Right?...  —Preceding  unsigned  comment added by  KirrVlad  ( talk  •  contribs ) 13:47, 15 April 2008 (UTC)  \" \n The deletion review process is described at  Wikipedia:Deletion review , including steps to list a new deletion review. -- Geniac  ( talk ) 18:06, 16 April 2008 (UTC) \n Phil McGraw [ edit ] \n  Please refrain from making unconstructive edits to Wikipedia, as you did to  Phil McGraw . Your edits appeared to constitute  vandalism  and have been  reverted . If you would like to experiment, please use the  sandbox . Thank you.  Ward3001  ( talk ) 16:15, 21 May 2008 (UTC) \n Suspected Sockpuppet [ edit ] \n  You have been accused of  sockpuppetry , which means that someone suspects you of using multiple Wikipedia accounts for prohibited purposes. Please make yourself familiar with the  notes for the suspect , then respond to the evidence at  Wikipedia:Suspected sock puppets/Domaleixo‎ . Thank you.  Kman543210  ( talk ) 15:18, 1 November 2008 (UTC) \n December 2010 [ edit ] \n  Welcome to Wikipedia. Everyone is welcome to contribute to the encyclopedia, but when you add or change content, as you did to the article  Status of religious freedom by country ,  please cite a  reliable source  for the content of your edit. This helps maintain our policy of  verifiability . Take a look at  Wikipedia:Citing sources  for information about how to cite sources and the  welcome page  to learn more about contributing to this encyclopedia. Thank you.  I've redone your change re Portugal. The previously cited source was a dead link; I've replaced that with a live link and reconformed the article assertion to info in that source.   Wtmitchell   (talk)   (earlier  Boracay Bill )  21:37, 2 December 2010 (UTC) \n August 2012 [ edit ] \n Edit Summaries [ edit ] \n Hi there. When  editing an article on Wikipedia  there is a small field labeled \" Edit summary \" under the main edit-box. It looks like this: \n The text written here will appear on the  Recent changes  page, in the  page revision history , on the  diff page , and in the  watchlists  of users who are watching that article. See  m:Help:Edit summary  for full information on this feature. \n Filling in the edit summary field greatly helps your fellow contributors in understanding what you changed, so please always fill in the edit summary field. If you are adding a section, please do not just keep the previous section's header in the Edit summary field – please fill in your new section's name instead. Thank you. -  220   of   Borg  18:27, 1 August 2012 (UTC) \n All edits marked as minor? [ edit ] \n  Thank you for  your contributions . Please remember to mark your edits as \"minor\" only if they truly are minor edits. In accordance with  Help:Minor edit , a minor edit is one that the editor believes requires no review and could never be the subject of a dispute. Minor edits consist of things such as typographical corrections, formatting changes, or rearrangement of text without modification of content. Additionally, the  reversion  of clear-cut  vandalism  and test edits may be labeled \"minor\". Thank you. -  220   of   Borg  19:02, 1 August 2012 (UTC) \n -  Final 'nag', did you mean to put the text at the top of the  Kellie Waymire  page  here ? (I reverted your edit btw.   ) -  220   of   Borg  19:02, 1 August 2012 (UTC) \n Disambiguation link notification for November 4 [ edit ] \n Hi. Thank you for your recent edits. Wikipedia appreciates your help. We noticed though that when you edited  Ignatius of Loyola , you added a link pointing to the disambiguation page  Basque Country  ( check to confirm  |  fix with Dab solver ). Such links are almost always unintended, since a disambiguation page is merely a list of \"Did you mean...\" article titles.  Read the  FAQ  •  Join us at the  DPL WikiProject . \n It's OK to remove this message. Also, to stop receiving these messages, follow these  opt-out instructions . Thanks,  DPL bot  ( talk ) 11:11, 4 November 2012 (UTC) \n Disambiguation link notification for November 11 [ edit ] \n Hi. Thank you for your recent edits. Wikipedia appreciates your help. We noticed though that when you edited  List of the first female holders of political offices in Europe , you added a link pointing to the disambiguation page  Assembly of the Republic  ( check to confirm  |  fix with Dab solver ). Such links are almost always unintended, since a disambiguation page is merely a list of \"Did you mean...\" article titles.  Read the  FAQ  •  Join us at the  DPL WikiProject . \n It's OK to remove this message. Also, to stop receiving these messages, follow these  opt-out instructions . Thanks,  DPL bot  ( talk ) 12:38, 11 November 2012 (UTC) \n Administratively united parishes [ edit ] \n Before you continue to alter civil parish names, please be aware that I will challenge those names. As much as the political name may include \"União de freguesias\", this is likely a temporary term. Until a final decision has been made by the IGP, there is no clear indication that those names are valid beyond the legality of the politico-administrative context. As you should be aware, most of the  freguesia  articles refer to the geographic context and not the political alone. People are not going to be using that affectation when referring to merged regions: these civil parishes will continue to exist as separate geographic areas, even if the political evolution continue. Since the IGP is the arbitrator of geographic context, the use of  União de freguesia  in article namespaces implies a subject matter that does not exist. I realize that Wikipedia PT has not arbitrated on this subject (and they themselves do not arbitrate on Wikipedia EN), but it is premature to start creating long-winded names, when they will likely change with the IGP ruling. Even then, Wikipedia EN (and I refer you to  Wikipedia:Article titles ) states that article names should be natural, concise and consistent. Further, the intended creation of  União de  article names has the affect of creating non-existent pages or  red-link  pages for items that may never result in article in the foreseeable future. Regardless, I apologize for reverting in total, since changes to the presidents and party affiliations are naturally important to content (a bug exists in the Rollback functionality). Regarding this subject (administratively united parishes) I suggest continuing the conversation on  Wikipedia:WikiProject Portuguese geography  in the appropriate sub-heading.  ruben jc   ZEORYMER  ( talk ) 20:07, 8 December 2013 (UTC) \n WP:ES [ edit ] \n Hi there. When  editing an article on Wikipedia  there is a small field labeled \" Edit summary \" under the main edit-box. It looks like this: \n Edit summary   (Briefly describe your changes) \n   \n The text written here will appear on the  Recent changes  page, in the  page revision history , on the  diff page , and in the  watchlists  of users who are watching that article. See  m:Help:Edit summary  for full information on this feature. \n Filling in the edit summary field greatly helps your fellow contributors in understanding what you changed, so please always fill in the edit summary field. If you are adding a section, please do not just keep the previous section's header in the Edit summary field – please fill in your new section's name instead. Thank you.-- Jetstreamer   Talk  11:50, 24 August 2014 (UTC) \n Disambiguation link notification for February 7 [ edit ] \n Hi. Thank you for your recent edits. Wikipedia appreciates your help. We noticed though that when you edited  Oceanic climate , you added a link pointing to the disambiguation page  Galicia . Such links are almost always unintended, since a disambiguation page is merely a list of \"Did you mean...\" article titles.  Read the  FAQ  •  Join us at the  DPL WikiProject . \n It's OK to remove this message. Also, to stop receiving these messages, follow these  opt-out instructions . Thanks,  DPL bot  ( talk ) 09:25, 7 February 2015 (UTC) \n Portuguese in the United Kingdom [ edit ] \n Hi. Thanks for your edits to  Portuguese in the United Kingdom . Sometimes I feel like I'm the only editor maintaining most of those immigrant group articles, so it's good to get some help.  Cordless Larry  ( talk ) 06:55, 27 May 2015 (UTC) \n Disambiguation link notification for November 6 [ edit ] \n Hi. Thank you for your recent edits. Wikipedia appreciates your help. We noticed though that when you edited  2010 Northern Hemisphere summer heat waves , you added a link pointing to the disambiguation page  Rebordelo . Such links are almost always unintended, since a disambiguation page is merely a list of \"Did you mean...\" article titles.  Read the  FAQ  •  Join us at the  DPL WikiProject . \n It's OK to remove this message. Also, to stop receiving these messages, follow these  opt-out instructions . Thanks,  DPL bot  ( talk ) 12:32, 6 November 2015 (UTC) \n ArbCom elections are now open! [ edit ] \n Hi, \nYou appear to be eligible to vote in the current  Arbitration Committee election . The  Arbitration Committee  is the panel of editors responsible for conducting the Wikipedia  arbitration process . It has the authority to enact binding solutions for disputes between editors, primarily related to serious behavioural issues that the community has been unable to resolve. This includes the ability to impose  site bans ,  topic bans , editing restrictions, and other measures needed to maintain our editing environment. The  arbitration policy  describes the Committee's roles and responsibilities in greater detail. If you wish to participate, you are welcome to  review the candidates' statements  and submit your choices on  the voting page . For the Election committee,  MediaWiki message delivery  ( talk ) 13:41, 23 November 2015 (UTC) \n ArbCom Elections 2016 : Voting now open! [ edit ] \n Hello, KirrVlad. Voting in the  2016 Arbitration Committee elections  is open from Monday, 00:00, 21 November through Sunday, 23:59, 4 December to all unblocked users who have registered an account before Wednesday, 00:00, 28 October 2016 and have made at least 150 mainspace edits before Sunday, 00:00, 1 November 2016.\n The  Arbitration Committee  is the panel of editors responsible for conducting the  Wikipedia arbitration process . It has the authority to impose binding solutions to disputes between editors, primarily for serious conduct disputes the community has been unable to resolve. This includes the authority to impose  site bans ,  topic bans , editing restrictions, and other measures needed to maintain our editing environment. The  arbitration policy  describes the Committee's roles and responsibilities in greater detail. \n If you wish to participate in the 2016 election, please review  the candidates' statements  and submit your choices on  the voting page .  MediaWiki message delivery  ( talk ) 22:08, 21 November 2016 (UTC) \n Confidence and supply does not exist in Portugal, it is a non existing concept in non-Westminster governments [ edit ] \n Furthermore it does not fit the agreements signed which include no guarantees or promises of either confidence or supply. \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=User_talk:KirrVlad&oldid=805225244 \"\t\t\t\t\t \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n User page Talk   \n Variants \n Views \n Read Edit New section View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes User contributions Logs View user groups Upload file Special pages Permanent link Page information   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n  This page was last edited on 13 October 2017, at 22:18. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}