{"url": "https://en.wikipedia.org/wiki/Talk:Clothed_male,_naked_female", "content": "Talk:Clothed male, naked female - Wikipedia \n Talk:Clothed male, naked female   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This is the  talk page  for discussing improvements to the  Clothed male, naked female  article. \nThis is  not a forum  for general discussion of the article's subject. \n Put new text under old text.  Click here to start a new topic . \n Please sign and date your posts  by typing four tildes ( ~~~~ ). \n New to Wikipedia?  Welcome !  Ask questions, get answers . \n Be polite , and  welcoming to new users \n Assume good faith \n Avoid personal attacks \n For disputes,  seek dispute resolution \n Article policies \n No original research \n Neutral point of view \n Verifiability \n Wikipedia is not censored . \nImages or details contained within this article  may be graphic or otherwise objectionable  to ensure a quality article and complete coverage of its subject matter. For more information, please refer to Wikipedia's  content disclaimer  regarding objectionable content and  options to not see an image . \n This page was nominated for  deletion  on 2006 August 4. The result of the discussion was  no consensus . \n WikiProject Nudity \n (Rated Start-class, Low-importance) \n Nudity Wikipedia:WikiProject Nudity Template:WikiProject Nudity nudity articles \n Nudity portal \n v \n t \n e \nThis article is within the scope of  WikiProject Nudity , which collaborates on articles related to  nudity  and  naturism  topics. If you would like to participate, you can edit the article attached to this page, or visit the  project page , where you can join the project and/or contribute to the  discussion . \n   Start   \n This article has been rated as  Start-Class  on the project's  quality scale . \n   Low   \n This article has been rated as  Low-importance  on the project's  importance scale . \n   \n WikiProject Pornography \n (Rated Start-class, Low-importance) \n Pornography Wikipedia:WikiProject Pornography Template:WikiProject Pornography Pornography articles \n Pornography portal \n v \n t \n e \nThis article is within the scope of  WikiProject Pornography , a collaborative effort to improve the coverage of  pornography -related topics on Wikipedia. If you would like to participate, please visit the project page, where you can join the  discussion  and see a list of open tasks. \n   Start   \n This article has been rated as  Start-Class  on the project's  quality scale . \n   Low   \n This article has been rated as  Low-importance  on the project's  importance scale . \n   \n Contents \n 1   Older comments (2006-2008) \n 2   How relevant is the phenomenon really to classical art? \n 3   Some possible examples \n 4   Some clean-up needed \n 5   A better image is needed \n 6   Wikinfo fork \n 7   Ferengi reference \n 8   Clothed female, naked female \n 9   Wikipedia articles are not image galleries \n 9.1   objection \n 10   External links modified \n Older comments (2006-2008) [ edit ] \n This article needs expanding, with appropriate references, and much more work to make it encyclopedic. At the moment, it's a rather lengthy stub. --  Karada  21:25, 18 February 2006 (UTC) \n LOL at the Star Trek reference! Wasn't expecting to find that here!  88.110.88.75  08:34, 11 April 2006 (UTC) \n Somebody put abbreviation CFNM instead of CMNF (don't know why) so I repaired that. \n Quote: \"The establishment of CMNF as a specific form of erotic interest did not occur until the creation of the Internet at which time the concept was explored in various discussion forums, and then named.\" This sentence is problematic. While it is plausible that the fetish was not widely recognized, named, and given specific attention from a community of like-minded individuals, it is extremely unlikely that erotic interest in clothed males paired with naked females (specifically) did not develop until the creation of the Internet. Should the article remain in Wikipedia, this line needs to be revised.  —Preceding  unsigned  comment added by  98.160.97.128  ( talk ) 23:02, 18 February 2008 (UTC) \n That´s right. Striptease is definetely a form of CMNF and it´s much older than the internet. I suggest to delete the line. Gardenparty  ( talk ) 06:18, 9 March 2008 (UTC) \n How relevant is the phenomenon really to classical art? [ edit ] \n \"The archetypal example of this type of scene is Jean-Léon Gérôme's The Slave Market, in which a nude female slave is examined by a potential buyer. The odalisque was also a popular subject for depicting one-sided female nudity, although the clothed figures in the scene were not always male.\" \n The latter sentence seems to fall prey to the fallacy of  overwhelming exception , and I am struck how our article on  Jean-Léon Gérome  has as the first image his painting of a cock-fight, where the nude is a man, and the clothed one (although not heavily clothed) is a woman. There may be a case for CMNF in art, but the quoted sentences are not the strongest case that perhaps could be made for it as a relevant phenomenon. --  Cimon Avaro; on a pogostick.  ( talk ) 17:51, 3 July 2008 (UTC) \n It plays a certain role in Orientalist paintings (harem scenes etc.), and also in cases where an allegorical female figure is juxtaposed to historical male figures, but I'm not sure it's really a major theme in itself. The slave auction is actually a rather minor theme in 19th-century academic art as a whole (one sub-niche of the Orientalist niche).  AnonMoos  ( talk ) 08:57, 16 December 2008 (UTC) \n Some possible examples [ edit ] \n thumb|Bow Wow Wow's take on  Le déjeuner sur l'herbe \n I don't know if this will help the article, but here they are: \n Video for  Black Velveteen  here's the link to the You tube video  http://www.youtube.com/watch?v=jxT9lgaTueE \n Video for  Thank U   http://www.youtube.com/watch?v=b1WJlxjxAZE \n Mona on the  The Chris Isaak Show \n Concert Champetre (Holiday in the Country) by  Giorgione   http://www.abcgallery.com/T/titian/titian81.html \n Ferengi \n The Artist's Studio \n also the painting \"Romans of the Decadence\" \n PETA Demonstrators \n varying Godiva commemorations \n Spinal Tap Smell the glove cover \n Lsa Stansfeild Never gonna give you up \n Most book covers of Gor or Conan the Barbarian \n —Preceding  unsigned  comment added by  Yartett  ( talk  •  contribs ) 22:18, 8 December 2008 (UTC) \n Oops. \nSorry about that folks!  Yartett  ( talk ) 22:29, 8 December 2008 (UTC) \n It's certainly a theme in the Gor books (\"She was naked, before clothed men... It is hard for [a woman] in such circumstances, not to see them as her masters and herself, before them, as an exposed slave.\" -  Explorers of Gor ), though kajirae in the Gor books generally wear some clothing in public in most situations...  AnonMoos  ( talk ) 09:38, 16 December 2008 (UTC)\n That and maledom foot fetishism ;-) I think a link to Gor is warranted give how little space is needed for it. What say you? Yartett  ( talk ) 00:25, 18 December 2008 (UTC) \n I'm surprised nobody's suggested Marvin Gaye's \"Blurred Lines\" video yet.  Muzilon  ( talk ) 09:21, 12 March 2015 (UTC) \n Some clean-up needed [ edit ] \n This article should be devoted more to explaining and documenting the phenomenon than indulging in it. Also, redlinks to articles which are unlikely to be created anytime soon, or which are doubtful candidates for separate article status, should be avoided in most cases.  AnonMoos  ( talk ) 08:48, 16 December 2008 (UTC) \n A better image is needed [ edit ] \n The current one is a classical nude and not real CMNF. The Luncheon on the grass was better. 192.30.202.13  ( talk ) 15:53, 5 February 2010 (UTC) \n I kind of liked  Image:Thomas_Rowlandson_(8).jpg  -- it shows up pretty clearly in a reduced size view (which  File:Manet,_Edouard_-_Le_Déjeuner_sur_l'Herbe_(The_Picnic)_(1).jpg  doesn't, and  Image:Robert_Wilson_Shufeldt_10.jpg  (which someone just now replaced it with) is slightly problematic _(being in black and white).  AnonMoos  ( talk ) 16:12, 5 February 2010 (UTC) \n I started to categorize a few of the pics  Category Clothed male, nude female . Say, whats the better way to write that: [[WC:Category:Clothed male, nude female]]? Thanks. 70.54.181.70  ( talk ) 21:11, 3 March 2010 (UTC) \n The interwiki link to the commons is \"Commons:\" -  Commons:Category:Clothed male, nude female . Although shouldn't it be \"Clothed male,  naked  female\"?  Thryduulf  ( talk ) 23:36, 3 March 2010 (UTC) \n On Commons, they've been replacing \"naked\" in category names with \"nude\"; they'd probably like it better if we leave it as is.  AnonMoos  ( talk ) 02:55, 4 March 2010 (UTC) \n Thanks to both. People seem to have a hang-up on the interchangeable use of the word. I'll go with \"nude\" and see how I can put a link to the article in the category there. 70.54.181.70  ( talk ) 18:12, 4 March 2010 (UTC) \n Seems it wasn't necessary. I'm larnin'.:) 70.54.181.70  ( talk ) 18:14, 4 March 2010 (UTC) \n Looks like the image was changed again. As for Rowlandson's image and Shufeldt's, each has a problem. The first is in color, but is not a photo; the latter is a photo, but not in color. However, the latter doesn't look like a strip-tease either. True, he may be a photographer perhaps setting up the model's pose, but there's no camera veiwable. 70.54.181.70  ( talk ) 15:30, 12 March 2010 (UTC) \n Don't know why the lead image has to be a photo.  AnonMoos  ( talk ) 14:57, 13 March 2010 (UTC) \n Wikinfo fork [ edit ] \n Clothed male, naked female \n Shoed male, barefoot female \nIt might help  this  article.:-) 206.130.173.55  ( talk ) 19:21, 26 February 2010 (UTC) \n Seems to have been deleted...  AnonMoos  ( talk ) 15:07, 21 December 2010 (UTC) \n Ferengi reference [ edit ] \n If it's true and verifiable, it should be left in...  AnonMoos  ( talk ) 14:55, 13 March 2010 (UTC) \n Try these: \n Star Trek Ferengi Female 1:31  \"You're mother..,is wearing clothes.\" \"Mother, get undressed this instant!\", \n The Last Outpost (4 of 5) , 4:52-5:22 of the 8:52 video, and \n The Last Outpost (5 of 5) , 2:17-2:44 of the 8:40 video. \n 70.54.181.70  ( talk ) 19:58, 23 March 2010 (UTC) \n Clothed female, naked female [ edit ] \n I'm surprised there is no mention of this?-- X sprainpraxisL  ( talk ) 22:33, 17 July 2011 (UTC) \n It has it's own article, which is linked as the last sentence of the lead and in the see also section.  Thryduulf  ( talk ) 17:33, 18 July 2011 (UTC)\n You did not read me correctly.  Clothed female, naked female  does not exist as an article.  Clothed female, naked male  exists but that wasn't what I was referring to.-- X sprainpraxisL  ( talk ) 16:23, 7 August 2011 (UTC) \n Probably because the concept of CFNF is anathema to that of both CFNM and CMNF - which is to focus on the one sided nakedness, ie; one gender is completely nude, whilst the other is still clothed. That doesn't happen in CFNF, and whilst I'm not saying it doesn't exist, I'm saying that as a genre it is sufficiently removed from that of CFNM/CMNF to be unconnected, hence isn't mentioned in the article.  a_man_alone  ( talk ) 21:32, 7 August 2011 (UTC) \n X_sprainpraxisL -- if it's not a more-or-less recognized genre somewhat distinct from general lesbian femdom (or whatever), then it probably doesn't qualify for a separate Wikipedia article...  AnonMoos  ( talk ) 23:45, 7 August 2011 (UTC) \n Wikipedia articles are not image galleries [ edit ] \n Per  WP:NOTGALLERY  I have removed the gallery at the end of the article and drastically trimmed the gallery in the art section to the first four images. This selection was completely arbitrary without reference to what the images actually show or how relevant they are to the text, so feel free to chose better ones. Images on Wikipedia need to illustrate the text they accompany and should normally have a caption giving information about the image and its link to the subject. Galleries of large numbers of images belong on Commons and a gallery there should be linked from the article like the category is.  Thryduulf  ( talk ) 18:00, 28 April 2013 (UTC) \n Bravo. You beat me to it.  Jschnur  ( talk ) 01:34, 29 April 2013 (UTC) \n objection [ edit ] \n Well here we have it. During the last couple of weeks half of the article was stripped. I guess it's easier to delete stuff that others created than to actually add / create something. The result is this: the value of this article for the end user has been diminished by half. This niche is very small and has only 3-5 web resources worth mentioning, and all external links (there were only 3) were removed. Several paragraphs of text were removed, including references to books, local culture references, and explanation of the feelings that people with this fetish experience. All this was removed according to some, as I personally see it, bureaucratic parts of policies. The content should always prevail over form. Too bad too many people find how easy it is to become a \"warden\", or \"cleaner\" of Wikipedia, indeed, it's not as hard as to actually write something (and it will be harder due to these people and these policies). I view these actions (I am entitled to my opinion, this is a Talk page) as the next thing to vandalism. Or possibly even a form of \"obsession\" with cleanliness: \"let's delete everything that can be deleted!\". I particularly state that I mean nobody in particular, I am speaking about a worrying tendency. I don't know how to contact any Wikipedia \"authorities\", but if they're reading this, I urge them to pay close attention not only to what is added, but also to what is removed and lost. The ultimate goal is to provide useful information to the end user, and I think this goal is sometimes simply forgotten. P.S. I'd like to remind everybody that this is a Talk page. If you disagree, add your comment, but do not delete other people's opinions.  128.68.85.106  ( talk ) 05:42, 7 May 2013 (UTC) \n I investigated the problem further and it appears much worse than I thought, just google \"wikipedia bureaucracy\". For example, read this article in the Boston Review:  \"Is it the end of Wikipedia?\"  Given all this information, I have decided to stop donating and thus supporting the current policies of Wikipedia, which I was doing during the last three or four donation campaigns, until situation improves. I understand that editors don't care, but maybe the people responsible for actually running the hardware and paying the bills eventually will.  128.68.85.106  ( talk ) 14:13, 8 May 2013 (UTC)\n You talking about  this stuff ? \n(Revision as of 19:41, 30 April 2013) \n 24.36.54.238  ( talk ) 03:45, 18 June 2015 (UTC)\n No, it is about entire series of edits (deletions) which occurred around the date of the comment you're responding to. Read the first line carefully: \"During the last couple of weeks...\"  95.28.219.174  ( talk ) 15:30, 17 September 2015 (UTC) \n External links modified [ edit ] \n Hello fellow Wikipedians, \n I have just modified one external link on  Clothed male, naked female . Please take a moment to review  my edit . If you have any questions, or need the bot to ignore the links, or the page altogether, please visit  this simple FaQ  for additional information. I made the following changes: \n Added archive  https://web.archive.org/web/20090628061654/http://www.louvre.fr/llv/oeuvres/detail_notice.jsp?CONTENT%3C%3Ecnt_id=10134198673225139&CURRENT_LLV_NOTICE%3C%3Ecnt_id=10134198673225139&FOLDER%3C%3Efolder_id=9852723696500816&bmUID=1185639440044&bmLocale=en  to  http://www.louvre.fr/llv/oeuvres/detail_notice.jsp?CONTENT%3C%3Ecnt_id=10134198673225139&CURRENT_LLV_NOTICE%3C%3Ecnt_id=10134198673225139&FOLDER%3C%3Efolder_id=9852723696500816&bmUID=1185639440044&bmLocale=en \n When you have finished reviewing my changes, please set the  checked  parameter below to  true  or  failed  to let others know (documentation at  {{ Sourcecheck }} ). \n You may set the  |checked= , on this template, to  true  or  failed  to let other editors know you reviewed the change. If you find any errors, please use the tools below to fix them or call an editor by setting  |needhelp=  to your help request. \n If you have discovered URLs which were erroneously considered dead by the bot, you can report them with  this tool . \n If you found an error with any archives or the URLs themselves, you can fix them with  this tool . \n If you are unable to use these tools, you may set  |needhelp=<your help request>  on this template to request help from an experienced user. Please include details about your problem, to help other editors. \n Cheers.— InternetArchiveBot   ( Report bug )  19:25, 26 November 2016 (UTC) \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Talk:Clothed_male,_naked_female&oldid=804191224 \"\t\t\t\t\t \n Categories :  Wikipedia objectionable content Start-Class nudity articles Low-importance nudity articles WikiProject Nudity articles Start-Class Pornography articles Start-Class Low-importance Pornography articles Low-importance Pornography articles WikiProject Pornography articles   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit New section View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n  This page was last edited on 7 October 2017, at 10:57. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}