{"url": "http://www.britainexpress.com/attractions.htm?attraction=1520", "content": "Portsmouth Cathedral, History & Visiting | Historic Hampshire Guide \n Passionate about British Heritage \n Toggle navigation \n Attractions  \n England \n Scotland \n Wales \n London \n History  \n England \n Scotland \n Wales \n Accommodation  \n B&Bs \n Historic Hotels \n Self Catering \n England  >  Hampshire  >  Historic Churches  > Portsmouth Cathedral \n Portsmouth Cathedral \n History, tourist information, and nearby accommodation \n BY  DAVID ROSS , EDITOR \n Historic Connections   Nearby attractions \n Accommodation \n HERITAGE RATING:      ? \n HERITAGE HIGHLIGHTS:     12th century chancel and transepts \n Portsmouth Cathedral \n Portsmouth Cathedral is a 12th-century church that became elevated to cathedral status in the 20th century. The core of the building was completed in only 16 years, to a cruciform plan with a crossing tower. The style is transitional Gothic. \n History \n In 1180 Jean de Gisors granted land to the Augustinian canons of Southwick Priory to build a chapel dedicated to Thomas Becket, whose murder by 4 knights in Canterbury Cathedral just a decade before must have been fresh in Gisor's mind. The chapel served as a chantry, with priests to say mass for Gisors and his family, and became in time a parish church, expanded over time as Gisor's new town of Portsmouth grew in importance. \r\n The church was built to a cruciform plan, with a central tower rising over the crossing. Aside from its ecclesiastical function as a bell tower, the chapel tower also served a practical purpose as a lighthouse and a lookout point for ships in the channel. \r\n A devastating French raid on Portsmouth in 1337 spared St Thomas' Church, but worse was to follow. In 1449 a group of local sailors murdered the Bishop of Chichester In retribution the entire population of Portsmouth was excommunicated by the Pope. This meant that no services could legally be held in the town, so the church was forced to close. \r\n Civil War Damage \n Thankfully, the closure was not permanent, and Elizabeth I worshipped in St Thomas' during a visit in 1591. During the Civil War, the Royalist garrison of Portsmouth used the church tower as a lookout point to watch troop movements of Parliamentary soldiers besieging the town. Parliamentary gunners fired on this makeshift lookout post and caused huge damage to the nave and tower, though surprisingly no one in surrounding buildings was harmed. In the north ambulatory is a cannonball from Cromwell's guns, discovered in 1938 when foundations for the new nave were being dug. \r\n When Charles II took the throne in 1660 one of his actions was to call upon churches across the country to contribute the 9000 pounds needed to restore St Thomas. The medieval nave and tower were rebuilt from 1683, replacing the medieval furnishings with neoclassical decoration. A mark of the growing congregation during these years is the early 18th century galleries, added in 1708 and enlarged in 1750. \r\n In 1927 the Diocese of Portsmouth was formed, and St Thomas was raised to temporary cathedral status. Even then, it was not the first cathedral in Portsmouth, but the second, for the Catholic Cathedral of St John the Evangelist was built in 1882. St Thomas became a full cathedral in 1932. The church was enlarged to a scale thought more appropriate to a cathedral, though the work ceased during WWII, and the ambitious plans had to be scaled back. The cathedral was finally consecrated in the presence of Her Majesty Queen Elizabeth, the Queen Mother in 1991. \r\n Though much of the interior furnishings are comparatively recent, there are some very interesting historic features, including a pulpit dated to 1693. This is a cut-down version of the original, which had three decks. The organ case dates to 1718 and was crafted by Francis Bird, who decorated the exterior with carvings of King David surrounded by cherubs. The chancel and transepts remain from the 12th-century church. \r\n One poignant memorial is a reminder of Portsmouth's greatest naval disaster, the sinking of the  Mary Rose . In the Navy aisle is an inscribed stone marking the place where bones recovered from the wreck were interred, carved with the words 'May they rest in peace 19 July 1984'. \r\n The oldest memorial in the cathedral; is a colourful wall monument to Charles Blount, a knight, who died in 1600. Blount sailed with the Earl of Essex on a 1596 raid to capture Cadiz. When the assault succeeded, Essex knighted the young Blount on board ship. He also knighted so many others of his men that Elizabeth I later complained that he should not have rewarded so many. \r\n The cathedral is usually open daily to visitors.   \n   About Portsmouth Cathedral \n Address:   High Street,\nOld Portsmouth,\nHampshire,\nEngland, PO1 2HH \n               Attraction Type: Cathedral                      \n  Location: Off the A3/A288     \nWebsite:  Portsmouth Cathedral \n  Email:  info@portsmouthcathedral.org.uk \n Phone: 02392 823 300         \n Location\n    map \nOS: SZ631992     \n  Photo Credit: Colin Smith, licensed for reuse under the Creative Commons Licence   \n HERITAGE \n We've 'tagged' this attraction information to help you find related historic attractions and learn more about major time periods mentioned. \n Find other attractions tagged with: \n   12th century   (Time Period)  -\n NEARBY HISTORIC ATTRACTIONS \n Heritage Rated  from 1- 5 (low-exceptional) on historic interest \n Royal Garrison Church  -\n                         0                         miles (Historic Church)  \n Landport Gate  -\n                         0.3                         miles (Historic Building)  \n King James Gate  -\n                         0.5                         miles (Historic Building)  \n Mary Rose  -\n                         0.9                         miles (Museum)  \n Fort Brockhurst  -\n                         2.8                         miles (Historic Building)  \n Fort Cumberland  -\n                         3.2                         miles (Historic Building)  \n Portchester Castle  -\n                         3.3                         miles (Castle)  \n Appley Tower  -\n                         4.5                         miles (Historic Building)  \n Nearest Accommodation to Portsmouth Cathedral: \n Self Catering     -     B&Bs/Guesthouses    -     Hotels \n Nearest Self Catering Cottages \n Bury Villa, Gosport  - \n             1.6 \n             miles \n Gosport, Hampshire              \n Sleeps:   19   \n Stay from:   £1348.00 - 3563.00 \n Coach House, Gosport  - \n             1.6 \n             miles \n Gosport, Hampshire              \n Sleeps:   8   \n Stay from:   £533.00 - 1648.00 \n Burford House, Ryde  - \n             4.8 \n             miles \n Ryde, Isle of Wight              \n Sleeps:   12   \n Stay from:   £700.00 - 2437.00 \n    More\n            self catering near Portsmouth Cathedral >> \n Nearest Hotels \n Queen's Hotel   - \n             0.6 \n             miles \n Portsmouth, Hampshire  \n Stay from:   £85.00 \n The Royal Maritime Club   - \n             0.7 \n             miles \n Portsmouth, Hampshire  \n Stay from:   £83.00 \n Express By Holiday Inn Portsmouth Gunwharf Quays   - \n             0.7 \n             miles \n Portsmouth, Hampshire  \n Stay from:   £85.95 \n       More Hotels near Portsmouth Cathedral >> \n Nearest Bed and Breakfasts \n                Abbey Lodge Guest House   -\n                  1.3                  miles \n Portsmouth, Hampshire  From:  £45.00 \n                The Boat House   -\n                  4.6                  miles \n Seaview, Isle of Wight  From:  £45.00 \n                Dorset House   -\n                  4.8                  miles \n Ryde, Isle of Wight  From:  £47.50 \n    More\n            bed and breakfasts near Portsmouth Cathedral >> \n Attraction search \n Find \n Select Attraction type \n All Attractions \n Medieval Abbey or Monastery \n Castle \n Historic Church \n Garden \n Historic House \n Historic Building \n Museum \n Prehistoric site \n Roman site \n Town / Village \n Cadw \n Churches Conservation Trust \n English Heritage \n Historic Scotland \n National Trust \n National Trust for Scotland \n           in\n --Select County-- \n Find \n Hampshire \n Attractions \n All attractions \n Attractions map \n Abbeys \n Ancient sites \n Castles \n Churches \n Gardens \n Historic Buildings \n Historic Houses \n Broadlands \n Museums \n Roman sites \n Towns and villages \n Featured \n The Test Valley \n Winchester \n Travel Resources \n Tourist Information Centres \n Travel links \n Accommodation \n Hampshire Hotels \n Portsmouth \n Southampton \n Winchester \n Bed & Breakfast \n Self Catering \n HISTORY CORNER \n Name the Historic attraction \n See larger image \n Select an attraction: \n Belton House \n Blickling Hall \n Erddig House \n Ightham Mote \n Mirehouse \n Sulgrave Manor \n Thirlestane Castle  \n British History Quiz \n This revolutionary artist, architect, and landscape gardener helped develop the peculiarly English style of landscape gardening \n Select: \n William Kent \n William Rousham \n William Stowe \n William Surrey \n William Sussex \n   Clue \n His most famous works included Holkham Hall, and the Horse Guards in WhitehallHis son in law, Capability Brown, became the leading landscape gardener in English history Another clue \n This Day in British History \n 25 November, 1120 \n Prince William, son of Henry I, dies in the sinking of the White Ship off Harfleur Henry's daughter Matilda (Queen Maud) becomes his heir \n Monarch Mayhem \n This monarch was the first Plantagenet king \n Select: \n Edward I \n Edward II \n Edward IV \n Henry I \n Henry II \n Stephen \n William II \n   Clue \n His titles included Duke of Normandy and Aquitaine, and Count of Anjou Another clue \n He was the son of Queen Matilda \n Brockenhurst   (Hotel) \n   New Park Manor - A Von Essen Hotel \n                            The New Forest, Britains newest National Park, was created by William the Conqueror in 1079 as a hunting area. In 1666, King Charles II made New Park Manor, in the heart of this ancient forest, his favourite hunting lodge on his return from exile in France, and his royal coat …  more  >> \n More hotels in   Hampshire  >> \n Alresford   (Hotel) \n   The Woolpack Country Inn \n                            The Woolpack Inn in Totford, Hampshire, has re-opened after an extensive refurbishment and the proud new owners of this Grade 1 listed, picturesque pub, Brian and Jarina Ahearn, look forward to welcoming you. The Woolpack Inn is within easy reach of Alresford, Basingstoke, Winchester and Southampton.  more  >> \n More hotels in   Hampshire  >> \n Passionate about British Heritage! \n Connect \n     \n    Britain Express is a labour of love by David Ross, an avid  historian, photographer, and 'Britain-ophile'. Connect with us on Facebook and (soon) Google Plus \n Fun stuff \n Heritage Traveller Blog \n British History Quiz \n Historic Attraction Quiz \n Monarch Mayhem \n This Day in British History \n Useful stuff \n Contact Us \n Privacy \n About Britain Express \n  TOP\n ‹ \n › \n × \n × \n                        Previous\n                        Next"}