{"url": "http://www.hmswarrior.org/history/homecoming", "content": "Homecoming | HMS Warrior   \n Home Your Visit Find Us Prices & Booking Families Access For All What's On History Origins Construction Commission Obsolescence In Battle Life On Board Armament Technology Restoration Homecoming Collection & Archive Old Warriors Weddings Food & Drink Wedding Questions Trusted Suppliers Venue Hire Christmas Parties Corporate Events Private Parties Learning Plan & Book A Visit Discovery Visits Workshops Resources Outreach Activity Days About Job Vacancies Support Us Become A Member Volunteers Donations Legacies Community Outreach Talks News Media Contact \n Webcam \n   Menu \n Origins Construction Commission Obsolescence In Battle Life On Board Armament Technology Restoration Homecoming Collection & Archive Old Warriors   \n Homecoming \n There were mixed emotions in Hartlepool as the town bid farewell to the ship that had spent seven years in its care. \n In the afternoon of Friday 12th June 1987,  Warrior  was pulled by tugs from her moorings and she began the four day journey back to Portsmouth. Tankers, ferries and trawlers turned out all along the east coast to salute her. In the English Channel, she had a memorable encounter with HMS London, the Royal Navy's newest vessel.  London  signalled the message  \"The Navy's newest ironclad is in company with the oldest... I hope we look as good as you at your age\" \n On June 16th 1987, 58 years after she left Portsmouth in a terrible state,  Warrior  made her triumphant return. As she came slowly towards the narrow entrance to Portsmouth Harbour an armada of small boats greeted her, guns fired, klaxons sounded, crowds cheered, fireworks exploded, and thousands of red, white and blue balloons filled the air. \n It could have been when, as the pride of the fleet, she had first stirred the country's imagination. \n After an hour of careful manoeuvring, she entered her berth. At 5:45pm the tow rope was dropped and  Warrior  was home to stay - taking her place within Portsmouth Historic Dockyard. \n Stay connected \n CONTACT US \n Tel:  +44 (0) 23 9283 9766 \n Email:  enquiries@historicdockyard.co.uk \n © 2015 HMS Warrior Preservation Trust - Registered in England No. 936870. \nRegistered Charity Number 256756. Patron: Her Royal Highness Princess Alexandra Victory Gate, HM Naval Base Portsmouth, Hampshire PO1 3QX \n Website Credits"}