{"url": "http://www.boxofficemojo.com/reviews/?id=137&p=.htm", "content": "Movie Review: Uptown Girls \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n > REVIEWS \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n UPTOWN GIRLS \n U.S. Release Date: \n August 15, 2003 \n Distributor:  MGM \n Director:   Boaz Yakin Cast:   Brittany Murphy ,  Dakota Fanning Running Time:  1 hour and 33 minutes MPAA Rating:  PG-13 (sexual content and language) \n Breakfast at J.C. Penney's \nby  Scott Holleran   \nMolly Gunn is an impulsive Manhattan heiress who spends money like there's no tomorrow—until tomorrow comes, and Molly discovers she's broke. In order to make money and support herself, Molly Gunn has to get a job.  \n Uptown Girls , starring Brittany Murphy as Molly, is a modern fairy tale centered around the job Molly gets: nanny to a neurotic little girl Ray (Dakota Fanning,  I Am Sam ), who pops pills and worries about germs. As the movie's tag line says: \"They're about to teach each other how to act their age.\"  \n Directed by Boaz Yakin ( A Price Above Rubies ,  Remember the Titans ),  Uptown Girls  was inspired by writer and producer Allison Jacobs, whose notion that adults can learn from children is fine, though hardly original. There's nothing wrong with a simple plot, and the movie is a sweet and tender tale of loss and recovery.  \n But  Uptown Girls  struts its stuff much too late, though it creates a happy, harmonious glow buoyed by a strong cast.  \n Everyone in Molly's life—including Molly—could use a little harmony. There's young Ray, whose mother (Heather Locklear, looking too Melrose Place for the Upper East Side) pays for private school tuition but pays no attention to her little girl. There's fresh-faced songwriter Neal (Jesse Spencer), who struggles to create music that people want to hear. There's prim Ingrid (an impressive Marley Shelton), who obsesses over fixing Molly's messes, and there's smooth-talking Huey (Donald Faison, reuniting with  Clueless  co-star Murphy), who's a party boy and not much else.  \n They supply  Uptown Girls  with its sparkle, and director Yakin integrates each character and plot point with a storyteller's touch. Unfortunately, Molly's self-improvement story doesn't provide much to tell. Since Molly regards paying the phone bill as a major accomplishment, watching her rise is like seeing someone tie their shoelaces.  \n Molly's a mess and Murphy is too forced to pull off a 21st century Holly Golightly, the carefree character from  Breakfast at Tiffany's  she's obviously intended to emulate.  \n It's not entirely Ms. Murphy's fault. The scene in which Molly attempts to jump off a footbridge when she's at her lowest point completely undercuts whatever progress her character has made. Somebody—whether Yakin or the writers—confused kooky with loony.  \n As a makeover project, Molly belongs much farther downtown, making  Uptown Girls —despite its grand and charming finale—one fairy tale that fails to make us believe.  \n MORE REVIEWS: Freddy Vs. Jason The Horror, the Horror... Igby Goes Down Richie Glitch So Close Charlie's Angels Hong Kong Style Once Upon a Time in Mexico A Fistful of Pesos Matchstick Men A Caper with Character Lost in Translation Sleepless in Tokyo \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n ADVERTISEMENT \n  \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}