{"url": "http://www.osc.gov.on.ca/en/30353.htm", "content": "Form 52-109F2R - For periods relating to financial years beginning on or after January 1, 2011 \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   Securities Law & Instruments   /   Electronic Filing   /   Reporting Issuer and Issuer Forms   /   Form 52-109F2R - For periods relating to financial years beginning on or after January 1, 2011 \n   Section Menu \n Form 52-109F2R - Certification of Refiled Interim Filings \nFor periods relating to financial years beginning  on or after  January 1, 2011 \n Helpful tips on completing this form for submission to SEDAR \n            This form is being provided to you for your convenience in HTML only. Please follow the steps below when completing this form.  \n Step #1 \n            Copy the text of the form between the two lines provided. \n Step #2 \n            Paste the text of the form into your word processing software.  \n            Step #3 \n            Complete the form. Once the form has been completed you may want to save a copy for your records before submission. \n Step #4 \n            Once the form has been completed and is ready for submission to SEDAR, SEDAR requires the form to be converted into an \"Acceptable Electronic Format\". To achieve this the completed form must be converted into .pdf format using Adobe Acrobat. Please refer to the  SEDAR Filer Manual  (Chapter 7 - Preparation of Documents for Electronic Filing) before submission to complete this process.  \n Start to copy after the line provided below   \n FORM 52-109F2R \nCERTIFICATION OF REFILED INTERIM FILINGS \nThis certificate is being filed on the same date that  < identify the issuer >  (the “issuer”) has refiled  < identify the filing(s) that have been refiled > . \nI,  < identify (i) the certifying officer, (ii) his or her position at the issuer, (iii) the name of the issuer and (iv) if the certifying officer’s title is not “chief executive officer” or “chief financial officer”, indicate in which of these capacities the certifying officer is providing the certificate > , certify the following: \n Review:  I have reviewed the interim financial report and interim MD&A (together, the “interim filings”) of the issuer for the interim period ended  < state the relevant date > .  \n < Insert all paragraphs included in the interim certificates originally filed with the interim filings, other than paragraph 1. If the originally filed interim certificates were in Form 52-109FV2 or Form 52-109F2 – IPO/RTO, include the “note to reader” contained in Form 52-109FV2 or Form 52-109F2 – IPO/RTO, as the case may be, in this certificate. > \nDate:  < insert date of filing > \n_______________________ \n[Signature] \n[Title]  \n < If the certifying officer’s title is not “chief executive officer” or “chief financial officer”, indicate in which of these capacities the certifying officer is providing the certificate. >   \n Stop copying before the line provided below   \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}