{"url": "https://en.wikipedia.org/wiki/Polycarbonate", "content": "Polycarbonate - Wikipedia \n Polycarbonate   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Polycarbonate \n Repeating chemical structure unit of \n Polycarbonate  made from  bisphenol A \nTransmission spectrum of polycarbonate \n Physical properties \n Density (ρ) \n 1.20–1.22 g/cm 3 \n Abbe number (V) \n 34.0 \n Refractive index (n) \n 1.584–1.586 \n Flammability \n V0-V2 \n Limiting  oxygen  index \n 25–27% \n Water absorption — Equilibrium   (ASTM) \n 0.16–0.35% \n Water absorption —over 24 hours \n 0.1% \n Radiation resistance \n Fair \n Ultraviolet (1–380 nm)   resistance \n Fair \n Mechanical properties \n Young's modulus (E) \n 2.0–2.4  G Pa \n Tensile strength  (σ t ) \n 55–75  M Pa \n Elongation (ε)  at  break \n 80–150% \n Compressive strength (σ c ) \n >80 MPa \n Poisson's ratio (ν) \n 0.37 \n Hardness — Rockwell \n M70 \n Izod impact strength \n 600–850  J /m \n Notch test \n 20–35  k J/m 2 \n Abrasive resistance  ASTM  D1044 \n 10–15  m g /1000  cycles \n Coefficient of friction (μ) \n 0.31 \n Speed of sound \n 2270 m/s \n Thermal properties \n Glass transition temperature (T g ) \n 147 °C (297 °F) \n Heat deflection temperature \n 0.45 MPa: 140 °C (284 °F) \n 1.8 MPa: 128–138 °C (262–280 °F) \n Vicat softening point  at 50  N \n 145–150 °C (293–302 °F) [1] \n Upper working temperature \n 115–130 °C (239–266 °F) \n Lower working temperature \n −40 °C (−40 °F) [2] \n Thermal conductivity (k)  at 23 °C \n 0.19–0.22  W /(m·K) \n Thermal diffusivity (a)  at 25 °C \n 0.144 mm²/s [3] \n Linear thermal expansion coefficient (α) \n 65–70 × 10 −6 / K \n Specific heat capacity (c) \n 1.2–1.3 kJ/( kg ·K) \n Electrical properties \n Dielectric constant (ε r )  at 1 M Hz \n 2.9 \n Permittivity (ε) \n 2.568 × 10 −11   F /m \n Relative permeability (μ r )  at 1 MHz \n 0.866(2) \n Permeability (μ)  at 1 MHz \n 1.089(2)  μ N/ A 2 \n Dissipation factor  at 1  MHz \n 0.01 \n Surface  resistivity \n 10 15   Ω /sq \n Volume  resistivity (ρ) \n 10 12 –10 14   Ω ·m \n Chemical resistance \n Acids — concentrated \n Poor \n Acids — dilute \n Good \n Alcohols \n Good \n Alkalis \n Good-Poor \n Aromatic hydrocarbons \n Poor \n Greases  and  oils \n Good-fair \n Halogenated hydrocarbons \n Good-poor \n Halogens \n Poor \n Ketones \n Poor \n Gas   permeation  at 20 °C \n Nitrogen \n 10–25 cm 3 ·mm/(m 2 ·day· Bar ) \n Oxygen \n 70–130 cm 3 ·mm/(m 2 ·day·Bar) \n Carbon dioxide \n 400–800 cm 3 ·mm/(m 2 ·day·Bar) \n Water vapour \n 1–2 gram·mm/(m 2 ·day) @ 85%–0%  RH   gradient \n Economics \n Price \n 2.6–2.8  € /kg [4] \n Polycarbonates  ( PC ) are a group of  thermoplastic  polymers containing  carbonate groups  in their chemical structures. Polycarbonates used in engineering are strong,  tough  materials, and some grades are optically transparent. They are easily worked,  molded , and  thermoformed . Because of these properties, polycarbonates find many applications. Polycarbonates do not have a unique  resin identification code (RIC)  and are identified as \"Other\", 7 on the RIC list. Products made from polycarbonate can contain the precursor monomer  bisphenol A  (BPA). \n Contents \n 1   Structure \n 2   Production \n 3   Properties and processing \n 4   Applications \n 4.1   Electronic components \n 4.2   Construction materials \n 4.3   Data storage \n 4.4   Automotive, aircraft, railway, and security components \n 4.5   Niche applications \n 4.5.1   Medical applications \n 4.6   Phones \n 5   History \n 6   Potential hazards in food contact applications \n 7   Environmental impact \n 7.1   Disposal \n 7.2   Photo-oxidation of polycarbonate \n 7.3   Photo-aging reaction \n 7.4   Thermal degradation \n 7.5   Effect of fungi \n 8   See also \n 9   References \n 10   External links \n Structure [ edit ] \n Polycarbonates received their name because they are  polymers  containing  carbonate groups  (−O−(C=O)−O−). A balance of useful features, including temperature resistance, impact resistance and optical properties, positions polycarbonates between  commodity plastics  and  engineering plastics . \n Production [ edit ] \n The main polycarbonate material is produced by the reaction of  bisphenol A  (BPA) and  phosgene   COCl \n2 . The overall reaction can be written as follows: \n The first step of the synthesis involves treatment of bisphenol A with  sodium hydroxide , which  deprotonates  the  hydroxyl groups  of the bisphenol A. [5] \n (HOC 6 H 4 ) 2 CMe 2  + 2 NaOH → Na 2 (OC 6 H 4 ) 2 CMe 2  + 2 H 2 O \n The di phenoxide  (Na 2 (OC 6 H 4 ) 2 CMe 2 ) reacts with phosgene to give a  chloroformate , which subsequently is attacked by another phenoxide. The net reaction from the diphenoxide is: \n Na 2 (OC 6 H 4 ) 2 CMe 2  + COCl 2  → 1/n [OC(OC 6 H 4 ) 2 CMe 2 ] n  + 2 NaCl \n In this way, approximately one billion kilograms of polycarbonate is produced annually. Many other  diols  have been tested in place of bisphenol A, e.g. 1,1-bis(4-hydroxyphenyl)cyclohexane and  dihydroxybenzophenone . The cyclohexane is used as a comonomer to suppress crystallisation tendency of the BPA-derived product.  Tetrabromobisphenol A  is used to enhance fire resistance.  Tetramethylcyclobutanediol  has been developed as a replacement for BPA. [5] \n An alternative route to polycarbonates entails  transesterification  from BPA and  diphenyl carbonate : \n (HOC 6 H 4 ) 2 CMe 2  + (C 6 H 5 O) 2 CO → 1/n [OC(OC 6 H 4 ) 2 CMe 2 ] n  + 2 C 6 H 5 OH \n The diphenyl carbonate was derived in part from  carbon monoxide , this route being greener than the phosgene method. [5] \n The ring-opening polymerization of cyclic carbonates has been investigated. [6] \n Properties and processing [ edit ] \n Polycarbonate is a durable material. Although it has high impact-resistance, it has low scratch-resistance. Therefore, a hard coating is applied to polycarbonate  eyewear   lenses  and polycarbonate exterior automotive components. The characteristics of polycarbonate compare to those of  polymethyl methacrylate  (PMMA, acrylic), but polycarbonate is stronger and will hold up longer to extreme temperature. Polycarbonate is highly  transparent  to  visible light , with better light transmission than many kinds of glass. \n Polycarbonate has a  glass transition temperature  of about 147 °C (297 °F), [7]  so it softens gradually above this point and flows above about 155 °C (311 °F). [8]  Tools must be held at high temperatures, generally above 80 °C (176 °F) to make strain-free and stress-free products. Low  molecular mass  grades are easier to mold than higher grades, but their strength is lower as a result. The toughest grades have the highest molecular mass, but are much more difficult to process. \n Unlike most thermoplastics, polycarbonate can undergo large plastic deformations without cracking or breaking. As a result, it can be processed and formed at room temperature using  sheet metal  techniques, such as bending on a  brake . Even for sharp angle bends with a tight radius, heating may not be necessary. This makes it valuable in prototyping applications where transparent or electrically non-conductive parts are needed, which cannot be made from sheet metal.  PMMA/Acrylic , which is similar in appearance to polycarbonate, is brittle and cannot be bent at room temperature. \n Main transformation techniques for polycarbonate resins: \n extrusion  into tubes, rods and other profiles including multiwall \n extrusion with cylinders ( calenders ) into sheets (0.5–20 mm (0.020–0.787 in)) and films (below 1 mm (0.039 in)), which can be used directly or manufactured into other shapes using  thermoforming  or secondary  fabrication  techniques, such as bending, drilling, or routing. Due to its chemical properties it is not conducive to laser-cutting. \n injection molding  into ready articles \n Polycarbonate may become  brittle  when exposed to ionizing radiation above  25  kGy  (J/kg). [9] \nA bottle made from polycarbonate \n Applications [ edit ] \n Electronic components [ edit ] \n Polycarbonate is mainly used for electronic applications that capitalize on its collective safety features. Being a good electrical insulator and having heat-resistant and flame-retardant properties, it is used in various products associated with electrical and telecommunications hardware. It can also serve as a  dielectric  in high-stability  capacitors . [5]  However, commercial manufacture of polycarbonate capacitors mostly stopped after sole manufacturer  Bayer AG  stopped making capacitor-grade polycarbonate film at the end of year 2000. [10] [11] \n Construction materials [ edit ] \nPolycarbonate sheeting in a greenhouse \n The second largest consumer of polycarbonates is the construction industry, e.g. for domelights, flat or curved glazing, and  sound walls , which all use extruded flat solid or multiwall sheet, or corrugated sheet. \n Data storage [ edit ] \nCDs and DVDs \n A major application of polycarbonate is the production of  Compact Discs ,  DVDs , and  Blu-ray Discs . These discs are produced by  injection molding  polycarbonate into a mold cavity that has on one side a metal stamper containing a negative image of the disc data, while the other mold side is a mirrored surface. \n Automotive, aircraft, railway, and security components [ edit ] \n In the automotive industry, injection-molded polycarbonate can produce very smooth surfaces that make it well-suited for  sputter deposition  or  evaporation deposition  of aluminium without the need for a base-coat. Decorative bezels and optical reflectors are commonly made of polycarbonate. Due to its low weight and high impact resistance, polycarbonate is the dominant material for making automotive headlamp lenses. However, automotive headlamps require outer surface coatings because of its low scratch resistance and susceptibility to ultraviolet degradation (yellowing). The use of polycarbonate in automotive applications is limited to low stress applications. Stress from fasteners,  plastic welding  and molding render polycarbonate susceptible to  stress corrosion cracking  when it comes in contact with certain accelerants such as salt water and  plastisol . It can be laminated to make  bullet-proof \"glass\" , although \"bullet-resistant\" is more accurate for the thinner windows, such as are used in bullet-resistant windows in automobiles. The thicker barriers of transparent plastic used in teller's windows and barriers in banks are also polycarbonate. \n So-called \"theft-proof\" large plastic packaging for smaller items, which cannot be opened by hand, is uniformly made from polycarbonate. \nLockheed Martin F-22 cockpit canopy \n The cockpit canopy of the  Lockheed Martin F-22 Raptor  jet fighter is made from a piece of high optical quality polycarbonate, and is the largest piece of its type formed in the world. [12] [13] \n Kereta Api Indonesia , the major railway operator in Indonesia, uses polycarbonate solid sheet for their engine and passenger cars fleet since 2016 due to high train stone throwing frequency. [14] \n Niche applications [ edit ] \n Polycarbonate, being a versatile material with attractive processing and physical properties, has attracted myriad smaller applications. The use of injection molded drinking bottles, glasses and food containers is common, but the use of BPA in the manufacture of polycarbonate has stirred serious controversy (see  Potential hazards in food contact applications ), leading to development and use of \"BPA-free\" plastics in various formulations. \nLaboratory safety goggles \n Polycarbonate is commonly used in eye protection, as well as in other projectile-resistant viewing and lighting applications that would normally indicate the use of  glass , but require much higher impact-resistance. Polycarbonate lenses also protect the eye from  UV  light. Many kinds of lenses are manufactured from polycarbonate, including automotive headlamp lenses, lighting lenses,  sunglass / eyeglass   lenses , swimming goggles and SCUBA masks, and safety glasses/goggles/visors including visors in sporting helmets/masks and police  riot gear  (helmet visors, riot shields, etc.). Windscreens in small motorized vehicles are commonly made of polycarbonate, such as for motorcycles, ATVs, golf carts, and small planes and helicopters. \n Typical products of sheet/film production include applications in advertisement (signs, displays, poster protection). [5]  But also applications as automotive safety glazing (ECE R 43). \n The light weight of polycarbonate as opposed to glass has led to development of electronic display screens that replace glass with polycarbonate, for use in mobile and portable devices. Such displays include newer  e-ink  and some LCD screens, though CRT, plasma screen and other LCD technologies generally still require glass for its higher melting temperature and its ability to be etched in finer detail. \n As more and more governments are restricting the use of glass in pubs and clubs due to the increased incidence of  glassings , polycarbonate glasses are becoming popular for serving alcohol because of their strength, durability, and glass-like feel. [15] [16] \n Other miscellaneous items include durable, lightweight luggage,  MP3/digital audio player cases ,  ocarinas , computer cases,  fountain pens ,  riot shields , instrument panels, tealight candle containers and blender jars. Many toys and hobby items are made from polycarbonate parts, like fins, gyro mounts, and flybar locks in  radio-controlled helicopters , [17]  and transparent  LEGO  ( ABS  is used for opaque pieces). [18] \n Standard Polycarbonate resins are not suitable for long term exposure to UV radiation. To overcome this the primary resin can have UV Stabilisers added. These grades are sold as UV Stabilized Polycarbonate to Injection Moulding and Extrusion companies. Other applications including Polycarbonate sheet may have the anti-UV layer added as a special coating or a  coextrusion  for enhanced weathering resistance. \n Polycarbonate is also used as a printing substrate for  nameplate  and other forms of industrial grade under printed products. The polycarbonate provides a barrier to wear, the elements, and fading. \n Medical applications [ edit ] \n Many polycarbonate grades are used in medical applications and comply with both ISO 10993-1 and USP Class VI standards (occasionally referred to as PC-ISO). Class VI is the most stringent of the six USP ratings. These grades can be sterilized using steam at 120 °C,  gamma radiation , or by the  ethylene oxide  (EtO) method. [19]  However, scientific research indicates possible problems with  biocompatibility . [ citation needed ]  Dow Chemical strictly limits all its plastics with regard to medical applications. [20] [21]  More recently, scientists at the  IBM Almaden Research Center  have developed aliphatic polycarbonates with improved biocompatibility and degradability for nanomedicine applications. [22] \n Phones [ edit ] \n Some major smartphone manufacturers use polycarbonate. Nokia has used polycarbonate in their phones starting with the  N9 's unibody case in 2011. This practice continues with various phones in the  Lumia  series. Samsung has started using polycarbonate with  Galaxy S III 's battery cover in 2012. This practice continues with various phones in the  Galaxy  series. Apple started using polycarbonate with the  iPhone 5C 's unibody case in 2013. \n History [ edit ] \n Polycarbonates were first discovered in 1898 by  Alfred Einhorn , a German scientist working at the  University of Munich . [23]  However, after 30 years of laboratory research, this class of materials was abandoned without commercialization. Research resumed in 1953, when Hermann Schnell at  Bayer  in Uerdingen, Germany patented the first linear polycarbonate. The brand name \"Merlon\" was registered in 1955, Later changed to Makrolon in the 1980s. [24] \n Also in 1953, and one week after the patent was submitted by Bayer,  Daniel Fox  at  General Electric  in Schenectady, New York, independently submitted a closely related patent on a  branched  polycarbonate. Both companies filed for U.S. patents in 1955, and agreed that the company lacking priority would be granted a license to the technology. [25] [26]  Once patent priority was resolved, in Bayer's favor, Bayer began commercial production under the trade name Merlon in 1958 and GE began production under the name Lexan in 1960. The production of Lexan was taken over by  SABIC  in 2007. [27] \n After 1970, the brownish original polycarbonate tint was improved to \"glass-clear.\" \n Potential hazards in food contact applications [ edit ] \n Main articles:  Bisphenol A  and  Endocrine disruptor \n The use of polycarbonate containers for the purpose of food storage is controversial. The basis of this controversy is their hydrolysis (degradation by water, often referred to as leaching) occurring at high temperature, releases  bisphenol A : \n 1/n [OC(OC 6 H 4 ) 2 CMe 2 ] n  + H 2 O → (HOC 6 H 4 ) 2 CMe 2  + CO 2 \n More than 100 studies have explored the bioactivity of bisphenol A derived from polycarbonates. Bisphenol A appeared to be released from polycarbonate animal cages into water at room temperature and it may have been responsible for enlargement of the reproductive organs of female mice. [28]  However, the animal cages used in the research were fabricated from industrial grade polycarbonate, rather than FDA food grade polycarbonate. \n An analysis of the literature on bisphenol A leachate low-dose effects by vom Saal and Hughes published in August 2005 seems to have found a suggestive correlation between the source of funding and the conclusion drawn. Industry-funded studies tend to find no significant effects whereas government-funded studies tend to find significant effects. [29] \n Sodium hypochlorite bleach and other alkali cleaners catalyze the release of the bisphenol A from polycarbonate containers. [30] [31]   Alcohol  is one recommended  organic solvent  for cleaning grease and oils from polycarbonate. \n Environmental impact [ edit ] \n Disposal [ edit ] \n Studies have shown that at high temperatures between 70 o C – 80 o C, and high humidity, polycarbonates will hydrolyze to  Bis-phenol A  (BPA). This condition is similar to that observed in most incinerators. After about 30 days under such conditions, surface crystals were formed. Measurements indicated that about 70 wt% of the surface crystals were bisphenol A (BPA). [32]  BPA is a compound that is currently on the list of potential environmental hazardous chemicals. It is on the watch list of many countries, such as United States and Germany. [33] \n -(-OC 6 H 4 ) 2 C(CH 3 ) 2 CO-)- n  + H 2 O   \n ⟶ \n {\\displaystyle \\longrightarrow } \n   (CH 3 ) 2 C(C 6 H 4 OH) 2  + CO 2 \n The leaching of BPA from polycarbonate can also occur at environmental temperature and normal pH (in landfills).The amount of leaching increases as the material becomes older. A study found that the decomposition of BPA in landfills (under anaerobic conditions) will not occur. [33]  It will therefore be persistent in landfills. Eventually, it will find its way into water bodies and contribute to aquatic pollution. [33] [34] . There is now a recycled polycarbonate product known as  BORG polycarbonate , that is helping to cut down on some of the environmental impact of polycarbonate disposal. \n Photo-oxidation of polycarbonate [ edit ] \n In the presence of UV light, oxidation of this polymer yields compounds such as ketones, phenols, o-phenoxybenzoic acid, benzyl alcohol and other unsaturated compounds. This has been suggested through kinetic and spectral studies. The yellow color formed after long exposure to sun can also be related to further oxidation of phenolic end group [35] \n (OC 6 H 4 ) 2 C(CH 3 ) 2 CO ) n  + O 2  , R* → (OC 6 H 4 ) 2 C(CH 3 CH 2 )CO) n \n This product can be further oxidized to form smaller unsaturated compounds. This can proceed via two different pathways, the products formed depends on which mechanism takes place. \n Pathway A \n (OC 6 H 4 ) 2 C(CH 3 CH 2 )CO + O 2 , H*  \n ⟶ \n {\\displaystyle \\longrightarrow } \n  HO(OC 6 H 4 )OCO + CH 3 COCH 2 (OC 6 H 4 )OCO \n Pathway B \n (OC 6 H 4 ) 2 C(CH 3 CH 2 )CO) n  + O 2 , H*  \n ⟶ \n {\\displaystyle \\longrightarrow } \n  OCO(OC 6 H 4 )CH 2 OH + OCO(OC 6 H 4 )COCH 3 \n Photo-oxidation reaction. [36] \n Photo-aging reaction [ edit ] \n Photo-aging is another degradation route for polycarbonates. Polycarbonate molecules (such as the aromatic ring) absorb UV radiation. This absorbed energy causes cleavage of covalent bonds which initiates the photo-aging process. The reaction can be propagated via side chain oxidation, ring oxidation or photo-fries rearrangement. Products formed include phenyl salicylate, dihydroxybenzophenone groups, and hydroxydiphenyl ether groups. [35] [37] [38] \n n(C 16 H 14 O 3 )  \n ⟶ \n {\\displaystyle \\longrightarrow } \n  C 16 H 17 O 3  + C 13 H 10 O 3 \n Polycarbonate Phenyl salicylate 2,2-dihydroxybenzophenone \n Thermal degradation [ edit ] \n Waste polycarbonate will degrade at high temperatures to form solid, liquid and gaseous pollutants. A study showed that the products were about 40–50 wt.% liquid, 14–16 wt.% gases, while 34–43 wt.% remained as solid residue. Liquid products contained mainly phenol derivatives (∼75wt.%) and bisphenol (∼10wt.%) also present. [37]  Therefore, burning of these discs is also not a viable method of disposal. \n Phenol derivatives are environmental pollutants, classified as Volatile Organic Compounds (VOC). Studies show they are likely to facilitate ground level ozone formation and increase photo-chemical smog. [39]  In aquatic bodies, they can potentially accumulate in organisms. They are persistent in landfills, do not readily evaporate and would remain in the atmosphere. [40] \n Effect of fungi [ edit ] \n In 2001 a species of fungus,  Geotrichum candidum , was found to consume the polycarbonate found in  compact discs  (CD). [41]  This has prospects for  bioremediation . \n See also [ edit ] \n CR-39 , allyl diglycol carbonate (ADC) used for eyeglasses \n Organic electronics \n Mobile phone accessories \n Thermoplastic polyurethane \n Vapor polishing \n References [ edit ] \n ^   \"Lexan sheet technical manual\"   (PDF) .  SABIC . 2009.   \n ^   Parvin, M. & Williams, J. G. (1975). \"The effect of temperature on the fracture of polycarbonate\".  Journal of Materials Science .  10  (11): 1883.  Bibcode : 1975JMatS..10.1883P .  doi : 10.1007/BF00754478 .   \n ^   Blumm, J. and Lindemann, A. (2003).  \"Characterization of the thermophysical properties of molten polymers and liquids using the flash technique\"   (PDF) .  High Temperatures-High Pressures . 35/36 (6): 627.  doi : 10.1068/htjr144 .   CS1 maint: Multiple names: authors list ( link ) \n ^   CES Edupack 2010, Polycarbonate (PC) specs sheet \n ^  a   b   c   d   e   Volker Serini \"Polycarbonates\" in Ullmann's Encyclopedia of Industrial Chemistry, Wiley-VCH, Weinheim, 2000.  doi : 10.1002/14356007.a21_207 \n ^   Donald J. Darensbourg (2007). \"Making Plastics from Carbon Dioxide: Salen Metal Complexes as Catalysts for the Production of Polycarbonates from Epoxides and CO2\".  Chem. Rev .  107 : 2388–2410.  doi : 10.1021/cr068363q .   \n ^   Answers to Common Questions about Bayer Polycarbonate Resins . bayermaterialsciencenafta.com \n ^   \"Polycarbonate\" . city plastics . Retrieved  2013-12-18 .   \n ^   David W. Plester, B.SC., A.R.I.C. (1973).  \"The Effects of Radiation Sterilization on Plastics\"   (PDF) . p. 9 . Retrieved  2016-04-22 .  Polycarbonate can satisfactorily be given a single-dose sterilization exposure (22) but tends to become brittle much above 2.5 Mrad.   CS1 maint: Multiple names: authors list ( link ) \n ^   \"Film\" .  execpc.com .   \n ^   \"WIMA\" .  wima.com .   \n ^   Egress technicians keep raptor pilots covered . Pacaf.af.mil. Retrieved on 2011-02-26. \n ^   F-22 Cockpit . Globalsecurity.org (2008-01-21). Retrieved on 2011-02-26. \n ^   Tempo: Antisipasi Lemparan Batu, PT Kereta Api Ganti Kaca Lokomotif . Tempo.co (2016-06-05). Retrieved on 2017-03-22. \n ^   Alcohol restrictions for violent venues . The State of Queensland (Department of Justice and Attorney-General) \n ^   Ban on regular glass in licensed premises . The State of Queensland (Department of Justice and Attorney-General) \n ^   \"RDLohr's Clearly Superior Products\"   (PDF) .  wavelandps.com . Archived from  the original   (PDF)  on 1 April 2010.   \n ^   {{cite web|url= http://info.craftechind.com/blog/which-plastic-material-is-used-in-lego-sets \n ^   Powell, Douglas G. (September 1998).  \"Medical Applications of Polycarbonate\" .  Medical Plastics and Biomaterials Magazine . Archived from  the original  on 23 February 1999.   \n ^   \"Dow Plastics Medical Application Policy\" .   \n ^   \"Makrolon Polycarbonate Biocompatibility Grades\" .   \n ^   Chan, Julian M. W.; Ke, Xiyu; Sardon, Haritz; Engler, Amanda C.; Yang, Yi Yan; Hedrick, James L. (2014). \"Chemically Modifiable N-Heterocycle-Functionalized Polycarbonates as a Platform for Diverse Smart Biomimetic Nanomaterials\".  Chemical Science .  5  (8): 3294–3300.  doi : 10.1039/C4SC00789A .   \n ^   \"Polycarbonate (PC)\" .  UL  Prospector . Retrieved  5 May  2014 .   \n ^   Philip Kotler; Waldemar Pfoertsch (17 May 2010).  Ingredient Branding: Making the Invisible Visible . Springer Science & Business Media. pp. 205–.  ISBN   978-3-642-04214-0 .   \n ^   \"Polycarbonate is Polyfunctional\" . Chemical Institute of Canada . Retrieved  5 May  2014 .   \n ^   Jerome T. Coe (27 August 2010). \"Lexan Polycarbonate: 1953–1968\".  Unlikely Victory: How General Electric Succeeded in the Chemical Industry . John Wiley & Sons. pp. 71–77.  ISBN   978-0-470-93547-7 .   \n ^   Grigorii L. Soloveichik1 (2016). \"Oxidative Carbonylation: Diphenyl Carbonate\". In Shannon S. Stahl, andPaul L. Alsters.  Title Liquid Phase Aerobic Oxidation Catalysis: Industrial Applications and Academic Perspectives: Industrial Applications and Academic Perspectives . Wiley-VCH.  doi : 10.1002/9783527690121.ch12 .   CS1 maint: Uses editors parameter ( link ) \n ^   Howdeshell, KL; Peterman PH; Judy BM; Taylor JA; Orazio CE; Ruhlen RL; Vom Saal FS; Welshons WV (2003).  \"Bisphenol A is released from used polycarbonate animal cages into water at room temperature\" .  Environmental Health Perspectives .  111  (9): 1180–7.  doi : 10.1289/ehp.5993 .  PMC   1241572   .  PMID   12842771 .   \n ^   vom Saal FS, Hughes C (2005).  \"An extensive new literature concerning low-dose effects of bisphenol A shows the need for a new risk assessment\" .  Environ. Health Perspect .  113  (8): 926–33.  doi : 10.1289/ehp.7713 .  PMC   1280330   .  PMID   16079060 .   \n ^   Hunt, PA; Kara E. Koehler; Martha Susiarjo; Craig A. Hodges; Arlene Ilagan; Robert C. Voigt; Sally Thomas; Brian F. Thomas; Terry J. Hassold (2003). \"Bisphenol A Exposure Causes Meiotic Aneuploidy in the Female Mouse\".  Current Biology .  13  (7): 546–553.  doi : 10.1016/S0960-9822(03)00189-1 .  PMID   12676084 .   \n ^   Koehler, KE; Robert C. Voigt; Sally Thomas; Bruce Lamb; Cheryl Urban; Terry Hassold; Patricia A. Hunt (2003).  \"When disaster strikes: rethinking caging materials\" .  Lab Animal .  32  (4): 24–27.  doi : 10.1038/laban0403-24 .  PMID   19753748 .   \n ^   Bair, H. E.; Falcone, D. R.; Hellman, M. Y.; Johnson, G. E.; Kelleher, P. G. (1981-06-01).  \"Hydrolysis of polycarbonate to yield BPA\" .  Journal of Applied Polymer Science .  26  (6): 1777.  doi : 10.1002/app.1981.070260603 .   \n ^  a   b   c   Morin, Nicolas; Arp, Hans Peter H.; Hale, Sarah E. (2015). \"Bisphenol A in Solid Waste Materials, Leachate Water, and Air Particles from Norwegian Waste-Handling Facilities: Presence and Partitioning Behavior\".  Environmental Science & Technology .  49  (13): 7675–7683.  doi : 10.1021/acs.est.5b01307 .   \n ^   Chin, Yu-Ping; Miller, Penney L.; Zeng, Lingke; Cawley, Kaelin; Weavers, Linda K. (2004).  \"Photosensitized Degradation of Bisphenol A by Dissolved Organic Matter †\" .  Environmental Science & Technology .  38  (22): 5888–5894.  doi : 10.1021/es0496569 .   \n ^  a   b   T., Chow, Jimmy (2007-08-06).  \"Environmental assessment for bisphenol-a and polycarbonate\" .   \n ^   Carroccio, Sabrina; Puglisi, Concetto; Montaudo, Giorgio (2002). \"Mechanisms of Thermal Oxidation of Poly(bisphenol A carbonate)\".  Macromolecules .  35  (11): 4297–4305.  doi : 10.1021/ma012077t .   \n ^  a   b   Collin, S.; Bussière, P. -O.; Thérias, S.; Lambert, J. -M.; Perdereau, J.; Gardette, J. -L. (2012-11-01). \"Physicochemical and mechanical impacts of photo-ageing on bisphenol a polycarbonate\".  Polymer Degradation and Stability .  97  (11): 2284–2293.  doi : 10.1016/j.polymdegradstab.2012.07.036 .   \n ^   Tjandraatmadja, G. F.; Burn, L. S.; Jollands, M. J. (1999).  \"The effects of ultraviolet radiation on polycarbonate glazing\"   (PDF) .   CS1 maint: Multiple names: authors list ( link ) \n ^   \"Pollution Database\" .  pollution.unibuc.ro . Retrieved  2016-11-14 .   \n ^   \"Pollutant Fact Sheet\" .  apps.sepa.org.uk . Retrieved  2016-11-14 .   \n ^   Bosch, Xavier (2001-06-27).  \"Fungus eats CD\" .  Nature News .  doi : 10.1038/news010628-11 .   \n External links [ edit ] \n Wikimedia Commons has media related to  Polycarbonate . \n v \n t \n e \n Plastics \n Chemical types \n Acrylonitrile butadiene styrene (ABS) \n Cross-linked polyethylene (PEX, XLPE) \n Ethylene vinyl acetate (EVA) \n Poly(methyl methacrylate) (PMMA) \n Polyacrylic acid (PAA) \n Polyamide (PA) \n Polybutylene (PB) \n Polybutylene terephthalate (PBT) \n Polycarbonate (PC) \n Polyetheretherketone (PEEK) \n Polyester (PEs) \n Polyethylene (PE) \n Polyethylene terephthalate (PET, PETE) \n Polyimide (PI) \n Polylactic acid (PLA) \n Polyoxymethylene (POM) \n Polyphenyl ether (PPE) \n Polypropylene (PP) \n Polystyrene (PS) \n Polysulfone (PES) \n Polytetrafluoroethylene (PTFE) \n Polyurethane (PU) \n Polyvinyl chloride (PVC) \n Polyvinylidene chloride (PVDC) \n Styrene maleic anhydride (SMA) \n Styrene-acrylonitrile (SAN) \n Mechanical types \n Thermoplastic \n Duroplast \n Corrugated plastic \n Polymeric foam \n High performance plastics \n Additives \n Polymer additive \n Colorants \n Plasticizer \n Stabilizer for polymers \n Biodegradable additives \n Products \n Plastic industry \n Commodity plastics \n Engineering plastics \n Plastic film \n Plastic bottle \n Plastic bag \n Plastic shopping bag \n Plastic cutlery \n Blister pack \n Foam food container \n Construction \n Geosynthetics \n Category:Plastics applications \n Environment and health \n v \n t \n e \n Health issues of  plastics  and  polyhalogenated compounds  (PHCs) \n Plasticizers :  Phthalates \n DIBP \n DBP \n BBP  (BBzP) \n DIHP \n DEHP  (DOP) \n DIDP \n DINP \n Miscellaneous plasticizers \n Organophosphates \n Adipates  ( DEHA \n DOA ) \n Monomers \n Bisphenol A  (BPA, in  Polycarbonates ) \n Vinyl chloride  (in  PVC ) \n Miscellaneous additives incl. PHCs \n PBDEs \n PCBs \n Organotins \n PFCs \n Perfluorooctanoic acid \n Health issues \n Teratogen \n Carcinogen \n Endocrine disruptor \n Diabetes \n Obesity \n Obesogen \n Polymer fume fever \n Pollution \n Plastic pollution \n Great Pacific garbage patch \n Persistent organic pollutant \n Dioxins \n List of environmental health hazards \n Regulations \n California Proposition 65 \n European REACH regulation \n Japan Toxic Substances Law \n Toxic Substances Control Act \n Waste \n Plastic pollution \n Great Pacific garbage patch \n Persistent organic pollutant \n Dioxins \n List of environmental health hazards \n Plastic recycling \n Biodegradable plastic \n Identification codes \n Authority control \n LCCN :  sh85104594 \n GND :  4175128-0 \n BNF :  cb13332080p   (data) \n NDL :  00569157 \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Polycarbonate&oldid=811635486 \"\t\t\t\t\t \n Categories :  Polycarbonates Commodity chemicals Dielectrics Optical materials Plastics Thermoplastics Transparent materials German inventions 1898 in science Hidden categories:  CS1 maint: Multiple names: authors list CS1 maint: Uses editors parameter All articles with unsourced statements Articles with unsourced statements from March 2015 Wikipedia articles with LCCN identifiers Wikipedia articles with GND identifiers Wikipedia articles with BNF identifiers   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons   \n Languages \n العربية Български Bosanski Català Čeština Dansk Deutsch Eesti Español فارسی Français 한국어 Bahasa Indonesia Íslenska Italiano עברית Magyar മലയാളം Bahasa Melayu Nederlands 日本語 Nordfriisk Norsk Polski Português Русский Simple English Suomi Svenska தமிழ் Türkçe Українська Tiếng Việt 中文   \n Edit links   \n  This page was last edited on 22 November 2017, at 22:20. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}