{"url": "https://thelinknewspaper.ca/article/this-is-all-we-have-to-give-you", "content": "“This Is All We Have to Give You.” | News – The Link \n  \n News \n\t\tConcordia University, Security Firm to Head to Quebec Human Rights Tribunal \n\t\tReggie’s Set to Recover After 6-Figure Loss \n\t\tConcordia Englympics Come to a Close \n\t\tDissecting Quebec’s Far-Right \n Sports \n\t\tConcordia 3, UdeM 2 (SO): Stingers Win Clash of Top Teams in Shootout \n\t\tConcordia 70, McGill 58: Stingers Silence the Pots and Pans \n\t\tMcGill 93, Concordia 66: Stingers Blown Out of the Gym \n\t\t#5 McGill 3, Concordia 2 (OT): Stingers Play Better But Still Can’t Beat Their Rivals \n Fringe Arts \n\t\tTiny Flame Pop-Up Market Offers Cozy Shopping Experience \n\t\tConcert Review: Val Thomas Emerges From the Cave \n\t\tConcert Review: STARS Shined Brighter Than Ever in Montreal \n\t\tTaking a Trip to the Montreal Jazz Festival’s Médiathèque \n Letters \n\t\tLetter: Julia Sutera Sardo Addresses Arts and Science Students \n\t\tLetter: Concordia President Alan Shepard Thanks Open House Volunteers \n\t\tLetter: Participate in Collective Gardens Around the City \n\t\tLetter: Residential Services for Disabled Individuals: Great Shortcomings Persist \n Opinions \n\t\tSatire: Six Uses For a Tiffany & Co Sterling Silver Can \n\t\tFundraising Brings $125 million to Concordia \n\t\tEditorial: Journalism Department’s Hopeful Start at Teaching Indigenous Reporting \n\t\tBike Safety Is in the City’s Hands \n Special Issue \n\t\tMen Need to Talk About Their Mental Health \n\t\tWhy Don’t Men Cry? \n\t\tDiscover Different Forms of Art Therapy and Where To Find Them in Montreal \n\t\tCommunity Group CACTUS Strives for Harm-Reduction With Newly-Opened Safe Injection Site \n Blogs \n\t\t\t\t\t\t\tComics \n\t\t\t\t\t\t\tFringe Calendar \n\t\t\t\t\t\t\tFringeBlog \n\t\t\t\t\t\t\tFrom the Archives \n\t\t\t\t\t\t\tHyperlink \n\t\t\t\t\t\t\tLink Live Sessions \n\t\t\t\t\t\t\tLinkBlog \n\t\t\t\t\t\t\tMedia File \n\t\t\t\t\t\t\tPic Picks \n\t\t\t\t\t\t\tPressbox Hat Trick \n\t\t\t\t\t\t\tSex & Pancakes \n\t\t\t\t\t\t\tThat Transsexual Guy \n\t\t\t\t\t\t\tThe Download \n\t\t\t\t\t\t\tThe Scratch \n Archives \n About Us \n Advertise \n Contribute \n RSS \n Twitter \n Facebook \n Instagram \n YouTube \n Search \n “This Is All We Have to Give You.” \n A Look at Concordia’s Growing Labour Pains \n News  by  Riley Sparks  — Published March 27, 2012 |  Comments \n Follow @sparksriley \n Photo Pierre Chauvin \n It’s been a rough few weeks for unionized workers in Canada.  \n Montreal police tear-gassed workers picketing outside newly-bankrupt aircraft maintenance firm Aveos.  \n Mass layoffs at printing company Transcontinental wiped out 500 jobs in Montreal and Dartmouth, NS.  \n The House of Commons denied Air Canada workers the right to strike.  \n But Concordia’s unionized workers say they’ve had more than a few rough weeks. \n “Whether you’re formally at the table or not, one never stops negotiating around this joint,” said Maria Peluso, president of the Concordia University Part-Time Faculty Association.  \nShe was chief negotiator for  CUPFA  during a record-setting seven-year period of negotiations that finally ended in 2008 after the union began rotating strikes. \n “Concordia has a reputation of delaying negotiations, protracting negotiations, seemingly forever. It’s extremely unprofessional,” said Peluso.  \n Bob Sonin, president of the Graduate Students’ Association and VP Bargaining for the Teaching and Research Assistants of Concordia, agreed.  \n “They delay and delay and delay. It’s become a joke that they delay one union because they’re too busy delaying the other unions.” \n “Delay and Delay and Delay” \n “We have the distinction of having the largest period of negotiations,” Peluso noted wryly. But many other unions have similar stories.  \n Almost three years after their collective agreement expired, the Concordia University Library Employees Union is still negotiating with the university.  CULEU  deposited their demands in January 2010, but negotiations have been moving slowly since then, explained union president Irene Fernandez.  \n “We’d like to do this in six months, a year, max. And we said that when we made the deposit. We said it the last time we negotiated. This institution just isn’t moving,” she said.  \n “We’re told by our technical advisers [from the Confédération des syndicats nationaux] that nowhere else do negotiations take as long as they do at Concordia. But we’re told by Concordia, ‘Well, you know Concordia; this is how long it takes here.’” \n Concordia’s 96 maintenance workers are in a similar situation. Represented by the United Steelworkers Local 9538, they have been embroiled in an acrimonious and much-publicized dispute with the university for years.  \n Workers at the downtown campus have been without a collective agreement since June 2008, and their colleagues at Loyola haven’t had one since June 2009. \n “We’ve been at it since 2009, and [Concordia] couldn’t care less,” said Eddie Ginocchi, vice-president of the  USW  Local 9538. Ginocchi said his members are underpaid and need more staff to keep up with an increasing workload, but the university has so far refused to consider the union’s demands.  \n “We haven’t ever seen such long negotiations,” said  USW  Quebec spokesperson Clairandrée Cauchy. \n The Concordia University Faculty Association’s current collective agreement won’t run out until this May. But their last agreement took two years to negotiate, and they’re already predicting that this round, which began in November 2011, could be just as lengthy.  \n “Your guess is as good as mine. More than four months have passed and we have not signed a single article that we have agreed on,” explained Ian Rakita, CUFA’s chief negotiator. They still have more than two dozen issues to discuss, he said. “At the rate we’re going, it could very well take two years plus. We’re not at all happy with that.” \n The Link contacted Concordia two weeks prior to publication to ask for a comment. Concordia Associate VP Human Resources Carolina Willsher told The Link that the university was negotiating with several unions and that “negotiations are proceeding well.” \n Willsher referred The Link to Concordia’s website and Frequently Asked Questions section for more information. Further interview requests were directed to the university’s media relations, but were not returned by press time. \n More Delays \n Unless any major breakthroughs are made, all but two of Concordia’s unions will be negotiating with the university by this August. This backlog won’t speed up the already-slow bargaining process, said Sonin.  \n “You just get fed into the hopper. So if it’s a first-come, first-served kind of thing, [admin] can always say, ‘This other union here, they’ve been negotiating for five years.’” \n It’s not an encouraging sign for unions like  TRAC  who have yet to begin their negotiations.  \n “I don’t really have any confidence that the university will do anything but delay,” said Sonin. “That’s what they’ve done with all the other unions.” \n Fernandez noted that her colleagues in the Concordia University Professional Employees Union had even considered holding off negotiations because of the backlog.  \n CUPEU  could not be reached for comment, but Fernandez explained that “they knew everybody else was negotiating, so what time would they get? And they don’t want to spend two, three, four, five years negotiating.”  \n To avoid delaying their negotiations,  CUFA  offered to set aside all non-monetary demands. Their previous collective agreement wasn’t “all that bad” according to Rakita, so the union was prepared to leave it as-is.  \n “We really need to focus on what is really important,” he explained, adding that Concordia Provost David Graham, who was present for initial discussions with  CUFA , had expressed support for the idea. But the university’s negotiation team has been less interested, instead insisting on “the change of a word here, a word there, wording that has been present for many agreements.” \n “Change for the sake of change” was the university’s response when asked why these issues were only being raised now, Rakita said.  \n Other unions noted that such long negotiations meant that they often had to restart discussions or go over the same issues again.  \n “We saw four different university presidents, three different directors of human resources,” said Peluso. And the university’s negotiators also keep changing, according to several union reps.  \n “There’s always new people, so most people find themselves training the very people they’re negotiating with,” Peluso said.  \n CULEU  is also dealing with a new negotiator and there’s been a significant learning curve. “Someone who has just come in will not know the culture and how things are done here,” said Fernandez. \n Toil and Toilets \n “The money is the main demand,” Ginocchi explained.  \n “The university has the same old story: there is no money and we can’t pay […] Yet we see plenty of money being thrown out the window,” he said, referencing the millions of dollars Concordia has spent on severance packages for departing senior administrators in recent years. \n Graphic Vivien Leung \n He also noted that in 2010 the university gave a 2.5 per cent raise to senior administrators, whose average salary—not including benefits—is almost $200,000. The university hasn’t been so generous with the unions, Ginocchi said.  \n “Well, we can’t have it. We’re not allowed.” \n CULEU  has asked for a two per cent wage increase, plus cost-of-living adjustments.  \n “Things have gone up tremendously cost-wise, from bus fares to gas to whatever, and our salaries have not gone up in the past three years at all,” explained Fernandez. \n It’s been five years since the Steelworkers had a raise, and the university hasn’t budged on salaries during the current negotiations, Ginocchi said.  \n “‘This is all we have to give you. This is all we have to give you. This is all we have to give you.’ No matter how many examples we bring in, ‘This is all we have to give you.’” \n In the meantime, the university campus has grown hugely, and his members can’t keep up with the work.  \n “We do pride ourselves. We do want to work hard. We strive to do our best,” he said. “But [we’re told,] ‘You’re being paid for the thirty-eight-and-three-quarter hours—if the toilets are broken today, screw it! Do it tomorrow!’ But we don’t do that, because we have the students at heart.” \n Hiring more maintenance workers would help, but it’s difficult to find people because qualified workers can usually earn more elsewhere. A unionized electrician making $23 per hour at Concordia would be paid about $34 per hour for the same job at Bombardier, Ginocchi said. \n The university has so far refused to compare the Steelworkers’ wages to their colleagues’ wages at other universities.  \n “When McGill’s tradespeople got a certain amount, [admin] told us, ‘Well, they’re gonna go broke, because they cannot afford to pay that much,’” Ginocchi recalled.  \n He noted that the McGill maintenance workers now report to Concordia’s former VP Services, Michael Di Grappa. “Well hang on, Di Grappa found the goddamned paper, and he was our boss before!” \n “There’s No Respect” \n Shortly before the Steelworkers left the table after years of unproductive bargaining, the workers’ representative “used colourful language toward the spokesperson at the university,” Ginocchi remembered.  \n “I removed myself from the negotiation table,” he said, “because it gets to the point that they aggravate you, they drive you crazy, you want to jump over the table and use your fists.” \n Many other union reps stressed the need for a more conciliatory, less adversarial approach to negotiations.  CULEU  tried interest-based bargaining—which encourages parties to present broad interests, rather than demands, in order to find a win-win solution—but quit in November 2011 after the provincially-appointed conciliator decided the sessions weren’t going anywhere. \n “You can’t negotiate on interest-based bargaining and have Joseph Stalin across the table,” said one union representative. The tone in the Steelworkers’ negotiations has been similarly difficult, according to Ginocchi.  \n “It’s gotten to the point that no matter what we say, they have a stone face, they couldn’t care less,” he said. “There’s no respect.” \n Radicalization \n Many union representatives claimed that the less-than-amicable tone and slow pace of negotiations have pushed them to consider other options, including striking. \n The Steelworkers were supposed to meet with the university on March 30, but that meeting has since been pushed back to April 17. Ginocchi expressed hope that they will make some progress at the next meeting, but the union still has a strike mandate and could stop work if things don’t go well.  \n “We have to make a decision—either we go ahead or we blow up again,” he said, alluding to his union’s one-day strike in September 2011. \n It took rotating strikes to break the stalemate in CUPFA’s seven-year-long negotiations. An agreement was finally signed, but the bitter dispute didn’t help employee-employer relations.  \n “It simply cemented our resolve, that’s one thing that it did, which I don’t think is very productive,” said Peluso. \n “Negotiations lasting over two years are definitely the exception in Canada, not the rule. And we don’t want to follow that tradition,” explained Rakita.  \n At other universities, he noted, some faculty associations take a strike vote before negotiations begin, in case discussions drag for too long.  \n “Maybe something like that does force the hand of administrations to come to a conclusion in short order, rather than to talk for years on end.” \n CULEU  is facing similar problems.  \n “There will come a time when people will be fed up, and… who knows?” Fernandez said. “I’m hoping that doesn’t happen […] I’d like to be able to reason and do things in a normal fashion, because there’s nothing in our demands that’s astronomically different.”  \n But after almost three years, it’s becoming increasingly difficult.  \n “I keep hearing now, every time I see someone, ‘Do we have an agreement, do we have an agreement?’ What can I say?” \n Validation \n “A collective agreement should be implemented. It’s not a contract that’s either/or, but a contract of mutual agreement. There should be harmony. That’s not the case with any of them,” said Peluso.  \n Ideally, she said, a collective agreement should be positive.  \n “You’ve arrived at an understanding. Inevitably conflict will always be there, but it should be minimal, it shouldn’t be a chronic pattern.” \n “Certainly we feel that the salary and benefits that we pay to all of our employees are fair and comparable to other universities and similar institutions,” Concordia’s VP institutional Relations Bram Freedman told The Link in November.  \n “We feel that employees are paid comparably [and] we feel that administrators are paid comparably.” \n But the issue isn’t specific demands, Peluso explained.  \n “It’s not, ‘Okay, what is it the library workers want, and what do the maintenance workers want, and what do I want?’ I can give you a list—we can all give you a list—but there’s something fundamentally wrong with how Concordia handles labour relations. \n “An employer should be validating their employees. There are great people at Concordia. Great secretaries, labour workers, teachers, maintenance workers, professionals, managers.  \n “There are really great people. That’s the soul of the community. We make it happen. So you should be validating these people. None of us feel validated.” \n By commenting on this page you agree to the terms of our  Comments Policy . \n Please enable JavaScript to view the  comments powered by Disqus. \n Related Reading \n News \n Obstructing or Disrupting \n Corey Pool \n News \n Anti-Austerity: A Non-United Front? \n Noelle Didierjean \n News \n CSU Off The Hook \n Corey Pool \n Opinions \n Could an Illegal Drug Change the Way We Treat Psychological Trauma? \n Gonzo Nieto \n Most Popular \n La Meute and Storm Alliance Rally to Take Place Nov. 25 \n News  – 11/17/17 \n Kunlun 3, Montreal 1: Les Canadiennes Face First Defeat at the Hands of the Red Star \n Sports  – 11/12/17 \n Concordia Senate Denounces Bill 62 \n News  – 11/13/17 \n Thousands March Against Racism in Montreal \n News  – 11/12/17 \n Concordia University Warns Students of Dangerous Social Media Campaign \n News  – 11/13/17 \n Current Issue \n Volume 38, Issue 3 November 7th, 2017 \n Download PDF \n Podcast \n Archives \n About Us \n Advertise \n Contribute \n RSS \n All content © 2017 The Link Publication Society Inc.  Top of Page"}