{"url": "https://en.wikipedia.org/wiki/User_talk:Helper201", "content": "User talk:Helper201 - Wikipedia \n User talk:Helper201   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Contents \n 1   Welcome! \n 2   Helper201, you are invited to the Co-op! \n 3   March 2015 \n 4   You're invited to the Teahouse. \n 5   March 2015 \n 6   April 2015 \n 7   Reference errors on 8 May \n 8   May 2015 \n 9   Infobox stats \n 10   Wales Green Party \n 11   ArbCom elections are now open! \n 12   SP polling page \n 13   Disambiguation link notification for April 7 \n 14   Signing your talkpage comments \n 15   ArbCom Elections 2016: Voting now open! \n 16   Trade Unionist and Socialist Coalition \n 17   Political Orientation of Tabloid Newspapers \n 18   New Wikiproject! \n 19   January 2017 \n 20   redirect proposal \n 21   UK Newspapers \n 22   Cram101 \n 23   For Justice Party (South Korea) \n 24   Wikiproject! \n 25   March 2017 \n 26   CPC Infobox Ideology \n 27   Ultra \n 28   Life Is Strange \n 29   Pirate Party UK \n 30   Party for Socialism and Liberation \n 31   July 2017 \n 32   Workers' Party of Belgium \n 33   MOS:TIES \n 34   August 2017 \n 35   Your edits \n 36   Question \n 37   Democratic Progressive Party \n 38   CfD nomination of Category:British Eurosceptics \n 39   September 2017 \n 40   NPD article revert \n 41   Harry Kane \n 42   Radical leftist \n 43   Minor parties on election pages \n 44   Broadsheet and former broadsheet newspapers - Updated The Guardian political stance \n 45   Your disruptive editing on Socialist Party (Ireland) \n Welcome! \n Hello, Helper201!  Welcome  to Wikipedia!  Thank you for  your contributions . You may benefit from following some of the links below, which will help you get the most out of Wikipedia. If you have any questions you can ask me on my talk page, or place  {{helpme}}  on your  talk page  and ask your question there. Please remember to  sign your name  on talk pages by clicking   or by typing four tildes \"~~~~\"; this will automatically produce your name and the date. If you are already excited about Wikipedia, you might want to consider being \" adopted \" by a more experienced editor or joining a  WikiProject  to collaborate with others in creating and improving articles of your interest. Click  here  for a directory of all the WikiProjects. Finally, please do your best to always fill in the  edit summary  field when making edits to pages. Happy editing!  I dream of horses   If you reply here, please leave me a {{ Talkback }} message on  my talk page .  @ 19:17, 5 March 2015 (UTC) \n Getting Started \n Contributing to Wikipedia \n The five pillars of Wikipedia  •  Tutorial  •  Your first article \n How to:  edit a page  •  upload an image \n Getting Help \n Frequently Asked Questions \n New contributors' help page \n Where to:  ask questions  •  make requests \n Request administrator attention \n Policies and Guidelines \n Neutral point of view  •  Reliable sources \n Verifiability  •  Citing sources  •  No original research \n What Wikipedia is not  •  Biographies of living persons \n Simplified Manual of Style  •  Three-revert rule \n Copyrights  •  Policy for non-free content  •  Image use policy \n External links  •  Spam  •  Vandalism  •  Sock puppetry \n Deletion policy  •  Conflict of interest  •  Notability \n The Community \n Community Portal  •  Adopt-a-user program \n Assume good faith  •  Civility  •  Etiquette \n No personal attacks  •  Resolving disputes \n Build consensus  •  Village pump \n IRC channels  •  Mailing lists \n Discover what's going on in the Wikimedia community ( The Signpost ) \n Things to do \n Be bold in editing  •  Help develop an article \n Maintenance  •  Peer review  •  Requested articles \n Join a WikiProject  •  Translating articles \n Cleaning up:  General  •  Spam  •  Vandalism \n Miscellaneous \n Categories  •  Disambiguity  •  Stubs \n User pages  •  Talk pages \n Useful templates  •  Tools  •  User scripts \n Helper201, you are invited to the  Co-op ! [ edit ] \n Hi there!  Helper201 , you are invited to  The Co-op , a gathering place for editors where you can find mentors to help you build and improve Wikipedia. If you're looking for an editor who can help you out, please  join us !  I JethroBT  ( I'm a Co-op mentor ) \n This message was delivered automatically by your robot friend,  HostBot  ( talk ) 22:44, 5 March 2015 (UTC) \n March 2015 [ edit ] \n Hello, and welcome to Wikipedia. This is a message letting you know that one or more of your recent edits to  Green Party of the United States  has been undone by an automated computer program called  ClueBot NG . \n ClueBot NG makes very few  mistakes , but it does happen. If you believe the change you made was constructive, please  read about it ,  report it here , remove this message from your talk page, and then make the edit again. \n For help, take a look at the  introduction . \n The following is the log entry regarding this message:  Green Party of the United States  was  changed  by  Helper201   (u)   (t)  ANN scored at 0.885024 on 2015-03-23T21:01:49+00:00 . Thank you.  ClueBot NG  ( talk ) 21:01, 23 March 2015 (UTC) \n You're invited to the  Teahouse . [ edit ] \n Hello  Helper201 , thanks for contributing to Wikipedia! I want to invite you to the  Teahouse , a forum on Wikipedia for new editors to ask questions about editing Wikipedia, and get support from peers and experienced editors. I hope you see you there!  I dream of horses   If you reply here, please  ping me  by adding  {{ U |I dream of horses}}  to your message.  @ 02:29, 29 March 2015 (UTC) \n March 2015 [ edit ] \n Hello, and welcome to Wikipedia. This is a message letting you know that one or more of your recent edits to  Plaid Cymru  has been undone by an automated computer program called  ClueBot NG . \n ClueBot NG makes very few  mistakes , but it does happen. If you believe the change you made was constructive, please  read about it ,  report it here , remove this message from your talk page, and then make the edit again. \n For help, take a look at the  introduction . \n The following is the log entry regarding this message:  Plaid Cymru  was  changed  by  Helper201   (u)   (t)  ANN scored at 0.853388 on 2015-03-31T23:36:06+00:00 . \n Thank you.  ClueBot NG  ( talk ) 23:36, 31 March 2015 (UTC) \n April 2015 [ edit ] \n  Please do not use styles that are unusual, inappropriate or difficult to understand in articles, as you did in  Green Party of the United States . There is a  Manual of Style , and edits should not deliberately go against it without special reason. Thank you.  ☾Loriendrew☽   ☏ (ring-ring)  00:53, 1 April 2015 (UTC) \n Reference errors on 8 May [ edit ] \n  Hello, I'm  ReferenceBot . I have  automatically detected  that an edit performed by you may have introduced errors in referencing. It is as follows: \n On the  Green Party of England and Wales  page,  your edit  caused a  broken reference name   ( help ) . ( Fix  |  Ask for help ) \n Please check this page and fix the errors highlighted. If you think this is a  false positive , you can  report it to my operator . Thanks,  ReferenceBot  ( talk ) 00:38, 9 May 2015 (UTC) \n May 2015 [ edit ] \n You can't just go around changing the ideology of Labour Party articles based on your own opinion. Please read up on  WP:BRD  and use the talk page if you want to propose changes, But if you do then you will need to source it and you should check out previous discussions. Whatever you are verging on edit warring ---- Snowded   TALK  18:27, 10 May 2015 (UTC) \n The changes were made in equal proportion to the current information supplied. Another perspective of Labour's political position was included and then when rejected a citation was asked for the current statement of centre-left. The current information on the parties political position is based off historical values and there is insufficient evidence provided to claim The UK Labour party is currently and categorically (as of May 2015) centre-left and encompasses no other position on the political scale. If people wish to claim the party is of that position (and no other), recent credible evidence must be supplied, otherwise the position given is as much of an opinion as others that change its status to other positions which are just as credible e.g. centre-left to centre. \n Infobox stats [ edit ] \n League stats only in infobox.  Mattythewhite  ( talk ) 07:33, 4 July 2015 (UTC) \n Wales Green Party [ edit ] \n There is a discussion at  Talk:Green Party of England and Wales#Should Wales Green Party become a standalone article?  to establish if  Wales Green Party  (which currently redirects to a section inside  Green Party of England and Wales ) is notable enough to be restored as a standalone article. As you either took part in the AfD, or are a significant contributor to either  Wales Green Party  or  Green Party of England and Wales , you are being contacted to see if you have input to the discussion.  SilkTork   ✔Tea time  16:39, 4 November 2015 (UTC) \n ArbCom elections are now open! [ edit ] \n Hi, \nYou appear to be eligible to vote in the current  Arbitration Committee election . The  Arbitration Committee  is the panel of editors responsible for conducting the Wikipedia  arbitration process . It has the authority to enact binding solutions for disputes between editors, primarily related to serious behavioural issues that the community has been unable to resolve. This includes the ability to impose  site bans ,  topic bans , editing restrictions, and other measures needed to maintain our editing environment. The  arbitration policy  describes the Committee's roles and responsibilities in greater detail. If you wish to participate, you are welcome to  review the candidates' statements  and submit your choices on  the voting page . For the Election committee,  MediaWiki message delivery  ( talk ) 17:10, 24 November 2015 (UTC) \n SP polling page [ edit ] \n Hi  Helper201 , I've reversed your edit to  Opinion polling in the Scottish Parliament election, 2016 . You explained your edit: \"as [the SSP] is running under the organization of RISE for this election, its polling figures are not independent of RISE.\" This is not true. YouGov continue to prompt for \"Scottish Socialist Party\" in polling intention rather than \"RISE\". Therefore, it would be inaccurate to report the latest poll from YouGov as showing 1% for RISE. That is why I combined the columns and included the logo for both organisations. \n Zcbeaton  ( talk ) 18:08, 17 March 2016 (UTC) \n Disambiguation link notification for April 7 [ edit ] \n Hi. Thank you for your recent edits. Wikipedia appreciates your help. We noticed though that when you edited  Respect Party , you added a link pointing to the disambiguation page  Socialist Workers Party . Such links are almost always unintended, since a disambiguation page is merely a list of \"Did you mean...\" article titles.  Read the  FAQ  •  Join us at the  DPL WikiProject . \n It's OK to remove this message. Also, to stop receiving these messages, follow these  opt-out instructions . Thanks,  DPL bot  ( talk ) 11:27, 7 April 2016 (UTC) \n Signing your talkpage comments [ edit ] \n Hi, I'd just like to remind you to sign your talkpage comments using ~~~~ at the end of the post. {{u|ABC}} is used to alert other users that you are mentioning them or replying to them. When you used {{u|Helper201}} on  Talk:Japanese Communist Party  the other day it looked like someone was replying to you, not you replying to someone else. Regards,  AtHomeIn神戸  ( talk ) 05:53, 17 August 2016 (UTC) \n ArbCom Elections 2016 : Voting now open! [ edit ] \n Hello, Helper201. Voting in the  2016 Arbitration Committee elections  is open from Monday, 00:00, 21 November through Sunday, 23:59, 4 December to all unblocked users who have registered an account before Wednesday, 00:00, 28 October 2016 and have made at least 150 mainspace edits before Sunday, 00:00, 1 November 2016.\n The  Arbitration Committee  is the panel of editors responsible for conducting the  Wikipedia arbitration process . It has the authority to impose binding solutions to disputes between editors, primarily for serious conduct disputes the community has been unable to resolve. This includes the authority to impose  site bans ,  topic bans , editing restrictions, and other measures needed to maintain our editing environment. The  arbitration policy  describes the Committee's roles and responsibilities in greater detail. \n If you wish to participate in the 2016 election, please review  the candidates' statements  and submit your choices on  the voting page .  MediaWiki message delivery  ( talk ) 22:08, 21 November 2016 (UTC) \n Trade Unionist and Socialist Coalition [ edit ] \n Hi. All of the political parties which made up the TCSC alliance are explicitly Trotskyist ( Socialist Party ,  Socialist Party Scotland ,  Socialist Workers Party  and  Solidarity ). The TCSC have been described as far-left by The Times and the International Business Times, [1] [2]  so it seems reasonable to include them and categorise them under the Trotskyist section.  Claíomh Solais  ( talk ) 10:28, 16 December 2016 (UTC) \n References \n ^   Fisher, Lucy (7 August 2015).  \"Revealed: Labour's hard-left infiltrators\" .  The Times . Retrieved  25 March  2016 .  (Subscription required ( help )) .   \n ^   Silvera, Ian (14 September 2015).  \"Far-left TUSC seeks anti-austerity electoral pact with Jeremy Corbyn's Labour\" .  International Business Times . Retrieved  25 March  2016 .   \n Yes, but just because all the parties that make up TUSC identify Troksyism as one of their ideologies, does not mean the group itself has adopted the ideology. All the parties that make up TUSC have other ideologies besides Trotskyism. It doesn't mean they choose to promote or espouse that ideology, just because they have it in common. The group has also been described as left-wing by other media outlets, please read the introduction on the page.  Helper201  ( talk ) 10:35, 16 December 2016 (UTC) \n I think you're missing the point. We have mainstream media describing the TUSC as far-left, literally each and every one of it's constituent parties are explicitly Trotskyists. In our article on the TUSC it is mentioned with references that they are a far-left group, so they are evidently of interest to a template and article on the wider British far-left in general. The same cam be said of the  Respect Party . In our own article on the topic, it is mentioned that they are described as far-left by mainstream academia, in books published by the likes of Palgrave Macmillan. So they too are of interest to such an article/template. If you disagree with those descriptions themselves then it would make sense for you to attempt to get consensus to remove the description of far-left from those specific articles themselves.  Claíomh Solais  ( talk ) 10:50, 16 December 2016 (UTC) \n As I said,  please read the introduction  on the TUSC page. There are citations for left-wing too, one of which is BBC news (as seen in the introduction), of which you could not get more mainstream of media. I'm pretty sure I left the far-left tag on that article, because yes, it is seen that way but some, but also left-wing by others, the coalition itself sits somewhere between the two. However the other tags you've been making have been absolute nonsense and extremely aggravating, many of these parties, such as the Respect Party were or are either left-wing or in other cases there are simply no citations supporting they are far-left. If you look at the info box on the right hand side of the Respect Party's page it clearly says 'left-wing' with multiple supporting citations. \n Yes, there are citations presented from reliable sources for both left-wing and far-left. Being also described by some sources as left-wing doesn't cancel out sources describing them as far-left. These parties are to the left of the most left-wing part of mainstream British politics - ie, the left-wing of the Labour Party and the Green Party. While Respect probably only just make the grade as far-left, we have sources describing them as such and they openly stood as part of an electoral alliance with the SWP (which is Trotskyist) and in Europe were part of the  European Anti-Capitalist Left , which is predominantly Trotskyist. So they are part of the history of the British far-left movement, whichever way it is looked at.  Claíomh Solais  ( talk ) 11:13, 16 December 2016 (UTC) \n I know, hence why I left the tag on the TUSC page, because it had citations for far-left. TUSC is more to the left than Labour or the Green's, yes. However being left of these parties does not automatically make you far-left, that is nonsense. There can be a centre-left party that is more left than another centre-left party without being left-wing, same for left-wing without being far-left. You can be out of the main political parties and still be left-wing, which most definitely is different to being far-left. Before adding this tag it should be clear in the info box on the right hand side of the page that the party is at least partially far-left and be supported by citations. Don't just go mass placing it around on pages with no supporting citations. Just because a party is on the left and not mainstream, have anyone elected or in the media spotlight does not make it far-left. You're acting like anything to the left of Labour and not a main political party is somehow far-left. Also parties can be anti-capitalist and not be far-left. You can't automatically assume a certain ideology defines a party's whole political position. Look at  Syriza  for instance, they are anti-capitalist, yet as seen in the info box on the right hand side of the page (supported by citations), they are a left-wing party.  Helper201  ( talk ) 11:34, 16 December 2016 (UTC) \n Also, you shouldn't use citations that require a subscription. All citations should be freely and easily accessible.  Helper201  ( talk ) 11:51, 16 December 2016 (UTC)\n Sorry to butt in here, but please read  WP:PAYWALL . Sources do not have to be freely accessible on Wikipedia at all.  HelgaStick  ( talk ) 15:56, 17 December 2016 (UTC) \n Political Orientation of Tabloid Newspapers [ edit ] \n Please see the  talk page  for 'List of newspapers in the United Kingdom'  Sylar78  ( talk ) 22:09, 21 January 2017 (UTC) \n New Wikiproject! [ edit ] \n Hello, Helper201! I saw you recently edited a page related to the  Green party  and green politics. There is a new WikiProject that has been formed -  WikiProject Green Politics  and I thought this might be something you'd be interested in joining! So please head on over to the  project page  and take a look! Thanks for your time.  Me-123567-Me  ( talk ) 18:27, 22 January 2017 (UTC) \n January 2017 [ edit ] \n  Please do not add inappropriate  external links  to Wikipedia, as you did to  Caroline Lucas .  Wikipedia is not a collection of links , nor should it be used for advertising or promotion. Inappropriate links include, but are not limited to, links to personal websites, links to websites with which you are affiliated (whether as a link in article text, or a citation in an article), and links that attract visitors to a website or promote a product. See  the external links guideline  and  spam guideline  for further explanations. Because Wikipedia uses the  nofollow  attribute value, its external links are disregarded by most search engines. If you feel the link should be added to the page, please discuss it on the associated talk page rather than re-adding it. Thank you.  Charles  ( talk ) 19:40, 22 January 2017 (UTC) \n redirect proposal [ edit ] \n There is a proposal to redirect the recently created  Far-left politics in the United Kingdom . As you previously commented on it you may want to [Talk:Far-left politics in the United Kingdom contribute] ---- Snowded   TALK  06:03, 1 February 2017 (UTC) \n UK Newspapers [ edit ] \n Hello, thank you for assisting me in citing Newspaper ISSN 2396-9520. \n I understand you wanted the websites for the paper that verify the print circulation: TheInternational.org.uk - Online versions of the media group's papers can be found: archives.theinternational.org.uk and alsahawat.com. The Company The International Press and Media Group is showing on Company's House as Active with SICC codes indicating newspaper printing and uk distribution. In addition I emailed the company for proof of license and received evidence of such, I am sure anyone can do the same. \n From what I can find out the Paper is in national circulation, just not evenly distributed with a much larger distribution in London. \n The company shows up as printing in the uk on UK 250, Companies House, Linked In, Twitter, Instagram, it's own websites etc. \n Happy to try and help more if I can. \n EU News  ( talk ) 15:07, 7 February 2017 (UTC) \n Cram101 [ edit ] \n You  added  a reference to  Christian Democratic Appeal  from Cram101. However, Cram101 is not reliable as it copies and paraphrases from Wikipedia. I've removed the source.  Fences & Windows  20:43, 12 February 2017 (UTC) \n For  Justice Party (South Korea) [ edit ] \n Already discussion is finishied. See the  [1]  and  [2] . Thanks. -- Idh0854  ( talk ) 10:21, 13 March 2017 (UTC) \n Wikiproject! [ edit ] \n Hello, Helper201! I saw you recently edited a page related to the  Green party  and  green politics . There is a new WikiProject that has been formed -  WikiProject Green Politics  and I thought this might be something you'd be interested in  joining!  So please head on over to the  project page  and take a look! Thanks for your time.  Me-123567-Me  ( talk ) 16:41, 18 March 2017 (UTC) \n March 2017 [ edit ] \n  Hello. Thank you for  your contributions  to  Wikipedia . \n When editing an article on Wikipedia, you will see a small field labeled \" Edit summary \" shown under the main edit box. It looks like this: \n Edit summary   (Briefly describe your changes) \n   \n I noticed your recent edit to  List of federal political parties in Canada  does not have an  edit summary . Please be sure to provide a summary of every edit you make, even if you write only the briefest of summaries. The summaries are very helpful to people browsing an article's history. \n Edit summary content is visible in: \n User contributions \n Recent changes \n Watchlists \n Revision differences \n IRC channels \n Related changes \n New pages list \n Article editing history \n Please use the edit summary to explain your reasoning for the edit, or a summary of what the edit changes. You can give yourself a reminder to add an edit summary by setting  Preferences  →  Editing  →   Prompt me when entering a blank edit summary . Thanks!  Me-123567-Me  ( talk ) 21:17, 30 March 2017 (UTC) \n CPC Infobox Ideology [ edit ] \n Hi, I noticed you were involved in the debate over infobox ideology in the article  Conservative Party of Canada . The page is currently locked because of an edit war, and no attempt has been made on the talk page to resolve this. I would to thus invite you to contribute to the discussion at  Talk:Conservative_Party_of_Canada#Ideology  so the page can be unlocked and constructive editing can continue.-- Jay942942  ( talk ) 22:43, 15 June 2017 (UTC) \n Ultra [ edit ] \n I see you find the concept ultranationalism useful as a description, which I completely disagree with. Any ideology can exist in an extreme form, that doesn't warrant specific articles or inserting it as a description in other articles. Especially not in a context where its obvious that the party in question are unlikely to be moderate.-- Batmacumba  ( talk ) 08:35, 1 July 2017 (UTC) \n I really can't see your problem here. Yes ideologies exist in extreme forms, and is it not important to distinguish those extreme forms? The more accurate or specific an article can be, the better.  Helper201  ( talk ) 02:33, 2 July 2017 (UTC) \n Life Is Strange [ edit ] \n Hi. Before you go back and make the good-faith removal of a category in this article, I'd like to ask where your source is for the characters' ages? if you would like, we can take this discussion over to the article's  talk page .  jd22292   (Jalen D. Folf)  ( talk ) 19:00, 12 July 2017 (UTC) \n Hi. I did not seek to change what you did when you reverted my edit as I assumed the evidence I have would be regarded as unreliable. I removed the catagory off of personal experience having completed the game and having read through Wiki's but thought they would likely be regarded as unreliable. I did find one character to be under 18, but the main characters are well evidenced of being over 18 (Max being 18 and Chloe being 19). The story does mainly focus on these two characters and thus I would not regard it as coming-of-age.  Helper201  ( talk ) 19:06, 12 July 2017 (UTC) \n Actually it was  Lordtobi  that reverted you the second time. Just FYI, Wikipedia does not accept  original research . Please be prepared to cite a source for your edits where applicable.  jd22292   (Jalen D. Folf)  ( talk ) 17:19, 13 July 2017 (UTC) \n I know, I've been on Wikipedia quite a while. It was only a removal of a catagory, of which a claim (such as a catagory claim) should have evidence to be there in the first place, I couldn't see any. Removal of uncited content is by no means breaking any rules.  Helper201  ( talk ) 00:06, 14 July 2017 (UTC) \n Pirate Party UK [ edit ] \n Hello. The accounts submitted to the EC actually have this membership figure on them. There used to be a citation on the page showing this but it has since been removed - apparently the citation isn't open to the general public yet, but it should be shortly (it's actually over-due but the snap general election has slowed down the electoral commission some what). It's a bit of a waste of time to edit the graph only to change it back in a week or two - especially when I know the information to be valid. \n Party for Socialism and Liberation [ edit ] \n Here is a direct quote from the party's  official program : \n Achieving fully developed socialism, a goal that has not yet been achieved anywhere, will open the way to communism and the end of class society. Communism will also mean the “withering away” of the repressive state, which only came into being with the rise of class society. \n This political party is Leninist, supports the Cuban Communist Party, is sympathetic historically with the former Soviet Union, and is an offshoot from the Worker's World Party, long known as a communist party. It has never repudiated communism. \n This justifies categorizing it as a communist party.  Cullen 328   Let's discuss it  04:30, 27 July 2017 (UTC) \n 'Will open the way to communism'. There is no explicit statement here the party would implement communism. I can understand how it could be interrupted as this being implied, but unless its directly stated, it can't be placed here as if it is fact. Please see  WP:SYNTHESIS  (especially in regarded to the split). As said before, a lot of this information you give appears to be original research, which is not applicable by Wikipedia's standards.  Helper201  ( talk ) 04:38, 27 July 2017 (UTC) \n Please explain why you have removed a direct quotation from the party platform, properly referenced, from the article. Can you cite any sources that say this is not a communist party?  Cullen 328   Let's discuss it  04:54, 27 July 2017 (UTC) \n This party makes it  crystal clear  that it is a  Marxist-Leninist  organization, which is the ideology of communism. To refuse to include their overt self identification in the article is unencyclopedic, in my opinion.  Cullen 328   Let's discuss it  05:07, 27 July 2017 (UTC) \n Please read up on communism and Marxism-Leninism. While they are often implemented simultaneously and are relevant to one another, they are not the same. There's still a lot of reading between the lines here.  Helper201  ( talk ) 05:14, 27 July 2017 (UTC) \n No, I will not stop, although I will discuss to try to reach consensus with you. With all due respect, I have been \"reading up\" on communism and Marxism-Leninism for 50 years and have studied the history of many such parties. Communism is their ultimate goal and Marxism-Leninism is the current ideology. This particilar party openly embraces Marxism-Leninism and describes communism as the ultimate goal of socialist revolution carried out by the armed working class, which they openly favor. I have read their newspaper, attended one of their street demonstrations, and listened to speeches by leading members. I am absolutely certain that they are a communist, Marxist-Leninist party and I have referenced public party documents readily available online. Why do you resist descriptions that are verifiable and neutral?  Cullen 328   Let's discuss it  05:39, 27 July 2017 (UTC) \n That's exactly what you are not doing. You have been going and making changes mid-discussion regardless, totally ignoring and overruling what's being talked about here. As I have outlined, a lot of what you are saying falls exactly under  Wikipedia:No original research . As regard to your last question, I have answered this numerous times as falling under  WP:SYNTHESIS . This is just circling now.  Helper201  ( talk ) 05:46, 27 July 2017 (UTC) \n Please explain how it is synthesis to describe a party as Marxist-Leninist when its own party publications openly describe it that way?  Cullen 328   Let's discuss it  06:05, 27 July 2017 (UTC) \n I saw nothing in that source that explicitly said the party is Marxist-Leninist.  Helper201  ( talk ) 06:10, 27 July 2017 (UTC) \n Please suggest alternate wording, then. In my opinion, you are splitting hairs and denying the obvious. We can get a third opinion or formulate an RFC. Which do you prefer?  Cullen 328   Let's discuss it  06:26, 27 July 2017 (UTC) \n Do you mean Request For Comments? If you want to take this through an official Wikipedia body then OK. I think that would be much better than just a third opinion, which doesn't hold anywhere near as much weight.  Helper201  ( talk ) 06:35, 27 July 2017 (UTC) \n ┌ ──────────────────────────────────────────────────────────────────────────────────────────────────── ┘ Please suggest alternate wording that accurately summarizes the party documents that I have linked to. Thank you. I am the one providing possible wording and you are proposing no alternatives. If you cannot suggest any wording that we can agree on, then I will formulate a Request for Comment, but I need to get some sleep now.  Cullen 328   Let's discuss it  07:04, 27 July 2017 (UTC) \n Apologies but I have no desire to seek to add to the page. I think it is largely alright the way it is.  Helper201  ( talk ) 07:12, 27 July 2017 (UTC) \n July 2017 [ edit ] \n  Hello. Everyone is welcome to contribute constructively to Wikipedia. This means that editors  do not own articles , including ones they create, and should respect the work of their fellow contributors on  Party for Socialism and Liberation . If you create or edit an article, remember that others are free to change its content. Take a look at the  welcome page  to learn more about contributing to this encyclopedia. Thank you.  TM  10:49, 27 July 2017 (UTC) \n Likewise, I've noticed that you have made more than  3 reverts  to this article in the last 24 hours. Please refrain from further reverts or I will report this incident.-- TM  10:50, 27 July 2017 (UTC) \n First of all, why could we not discuss this prior to you making mass changes? Secondly, I am fine with the article being changed if reliable sources support this. I see the new article you have added does support the party by specifically stating it as Marxist-Leninist. I'm just about to look into the source to check its credibility. I don't see why you couldn't have talked to me first or contributed to the discussion on the talk page. You are making a lot of changes without giving reason, such as reinstating it being communist etc. Also the the other source provided breaks Wikipedia's synthesis, so should not be re-included.  Helper201  ( talk ) 10:57, 27 July 2017 (UTC) \n With six reverts in the last 24 hours, it seems as though you are well beyond talking. You've decided what can and cannot be in the article. I've added a third party source which backs up the common sense argument contrary to the one you've been making.-- TM  11:04, 27 July 2017 (UTC) \n I gave good reason for why I made those changes. I would also like to point out the other editor was the one making changes mid-discussion, in most cases before I had even had a chance to reply to their comment. Also as I said, I accepted the third-party source, yet you give no good reason for re-instating the other source, or why you have included it among the list of communist parties. Your ridicule in terms of implying my argument is not \"common sense\" as opposed to yours I find unpleasant and unhelpful.  Helper201  ( talk ) 11:15, 27 July 2017 (UTC) \n Workers' Party of Belgium [ edit ] \n I have noticed that three times already you have undone an edit by me on the article  Workers' Party of Belgium . More specifically it's about whether the WPB is communist party or not. I see no evidence to conclude that the current party is communist, the party itself doesn't claim to be communist either. So I wonder why you keep insisting to describe the party as a communist party, instead of opting for the much wider accepted label of socialism, a label the WPB itself uses. I'm going to revert it to socialist again, if you want to put it back to communist, then you should provide a source that shows that the WPB in its current form can be classified as a communist party. \n Sincerely HistorXIII \n Hey, HistorXIII. Apologies, I shouldn't have done so. I shall have a look into evidence for both socialism and communism and see what has supporting evidence. I appreciate that you took the time to come to my talk page and talk to me about this without being hostile. I'm going through a lot of really bad stuff right now, not that that's any excuse, just that it means more to me that you came and respectfully put across your point of view. Thank you.  Helper201  ( talk ) 13:59, 29 July 2017 (UTC) \n MOS:TIES [ edit ] \n The game developer's nationality does not constitute  strong national ties , especially such that you should feel emboldened to drive-by engvar-war across multiple articles. Please form a consensus for widespread changes before embarking on a crusade, against the recommendations of policy.    czar  22:53, 9 August 2017 (UTC) \n There was no reason given for using US dating systems. Wikipedia dating systems are usually down to the discretion of editors, as for most page types there is no specific required format. I gave good reason as to why this version is more appropriate. There seems to be large amount of Americanisation of Wikipedia pages for no good reason. Unless the page is related to something to do with the US I see no reason to use the MDY format, as the US is the only country in the world to use this format. \n Date format by country .  Helper201  ( talk ) 23:00, 9 August 2017 (UTC) \n Why could you not even give me a first minutes to reply before reverting all my edits?  Helper201  ( talk ) 23:01, 9 August 2017 (UTC) \n Since you are not a new editor, you know about the  Wikipedia:BOLD, revert, discuss cycle  and how, when your proposed edits are contested (read: reverted), your next step is taking the proposal to discussion, not to wantonly revert the revert, which is  edit warring . That warning aside, as I already said, there is no  strong national tie  to the subject to warrant any mass action on dates, and even if you thought there was, the relevant policy is  to retain the existing date/engvar format  until some consensus overturns it. Which isn't even to mention the disreputable practice of making large, drive-by changes (on articles you haven't edited), changes explicitly against our common guidelines, leaving no  edit summaries  and then edit warring those changes. So no, there is no need to wait to revert those changes. (On a more common sense note, I have no idea how you think that  Donkey Kong 64 , a featured article reviewed several times, would change its date format on your whim...) Please do not make systematic drive-by edits without consensus. The policy on changing date formats exists precisely to stop your type of unilateral action. If you don't like it, take it up with the community, whereupon you'll find why the policy is what it is.    czar  05:06, 10 August 2017 (UTC) \n I wouldn't call a handful of pages \"mass action\". Yes there is no strong national tie, which works both ways, it means there is no strong justification for using the US dating system either. As I said, there is more reason for using this dating system, as these games have no connection with the US and the US is the only country to use this dating system, so I don't see what reason you have for being so protective of keeping it as it is. Just because something hasn't been changed in a long time does not make it any more correct. I've seen plenty of stuff on Wikipedia that hasn't been cited in years (sometimes going back to 2012 from 2017) even when its been edited multiple times. This in no way justifies its inclusion. And I wouldn't call making dating format changes \"large drive by\" edits. I honestly don't see why you are being so protective of keeping things as they are (and not giving any good reason why using the US dating system is appropriate in any way). As said, the vast majority of the world does not use the US dating system, so why if the page has no connection to the US should this be maintained?  Helper201  ( talk ) 18:34, 10 August 2017 (UTC) \n Yes, six unrelated pages in succession is systemic. I already linked  WP:DATERET  above—can't be any clearer that the existing format is retained when there is no reason (e.g., a strong national tie) to change the English/date variation. Strong national ties are physical places and battles that take place in a specific region/nation. If you have a problem with the policy, take it up with the policy page, but don't think that your edits against that consensus will go unchecked.  czar  22:49, 10 August 2017 (UTC) \n Well they are all video game related aren't they? So Rome Total War, that game certainly represents battles in a specific region, by specific nations, in Europe, does it not? There is no perfect clarity on what does and does not constitute a strong national tie. I plan to take this to further discussion, please could you give me the link? Also I have been trying to discuss this. The only \"consensus\" I've broken is Wikipedia ruling, which since reverting your reverts I haven't reverted again, nor made any more date changes and have been trying to discuss with you, despite being mainly just being dictated Wikipedia rules. May I also point out the MOS:TIES does also state \"or consensus on the article's talk page\", which as I said, I've been trying to make, despite only being rejected by you, and just because of Wikipedia ruling. You haven't been open to discussing this and I really don't see the point in this \"don't think that your edits against that consensus will go unchecked\", as like I've said, I haven't done so and I really think this hostile and threatening manner is highly unhelpful.  Helper201  ( talk ) 02:48, 13 August 2017 (UTC) \n August 2017 [ edit ] \n  Please refrain from making unconstructive edits to Wikipedia, as you did at  Portuguese Communist Party . Your edits appear to constitute  vandalism  and have been  reverted . If you would like to experiment, please use the  sandbox . Repeated vandalism can result in the  loss of editing privileges .  B.Lameira  ( talk ) 22:26, 25 August 2017 (UTC) \n So what you disagree with constitutes to vandalism, despite not even getting a supporting opinion when resorting to contacting another editor to support you against me? Why could you not use the talk page as I asked to discuss this reasonably, rather than just reverting my edits without evidence to support your argument? You have provided no evidence to prove you are right and you have no right to call my edits vandalism or claim to be any more correct than I am. What you are doing is basically edit warring and what you have changed has stood for a long time without rejection from other editors.  Helper201  ( talk ) 22:32, 25 August 2017 (UTC) \n Also, another point. Threats on Wikipedia get you no where, so please don't use them. I noted that The Guardian piece was an opinion piece after you mentioned it and I did not notice this when I added it (hence why I did not reverse that edit). Second, you have no consensus for your edits either and you have been the one removing the label of far-left, which has long stood on the page, you are the one seeking the change. And we were both giving points as to where the party stands, I regard neither yours nor mine as \"bias\", hence why I wished to take the discussion to talk, as when a conflict arises this is how things should be sorted, not by reverting and re-reverting constantly or making threats to other users.  Helper201  ( talk ) 22:44, 25 August 2017 (UTC) \n You have quite a long history of edit warring, your actions are not new. Without rejection? Did you happen to think most editors do not have a clue about what the party's positions are? Your edits are not encyclopaedic and you make yourself look bad with your persistent history of conflicts in here, you inserted an op-ed article as reference, how can you say your behaviour is not disruptive, with the only goal of forcing your biased POV on other editors who do not happen to agree with you? -- B.Lameira  ( talk ) 22:39, 25 August 2017 (UTC) \n That is your judgment from scanning my page. I would disagree, there has been a lot of vandalism going on by certain editors and people that have not been willing to discuss via talk page, regardless that is not relevant to this matter. I was the one that offered to go to talk. You are the one who has only reverted and re-reverted and threatened.  Helper201  ( talk ) 22:52, 25 August 2017 (UTC) \n I am not threatening you, do not play as so defensive, I am only warning that your disruptive behaviour does not match the spirit of consensus that makes up Wikipedia, any user can issue such message as I did. Try to seek consensus, if possible, as up for now, you do not have. I am not always in here, hence I did not notice it at first. Cheers!  B.Lameira  ( talk ) 22:54, 25 August 2017 (UTC) \n Exactly, that is why I wished to discuss it via the talk page, as your changes to what had long been on the page had no supporting evidence, nor consensus.  Helper201  ( talk ) 23:01, 25 August 2017 (UTC) \n Your edits [ edit ] \n Hello, please stop making unconstructive edits on pages of political parties. Party ideology can be sourced by proper citations, but by the wiki policy, it is not necessary. Only questioned source request of proper information can be later removed. Thank you. -- ThecentreCZ  ( talk ) 17:44, 15 September 2017 (UTC) \n Question [ edit ] \n Another question, why are you obsessed with capital letters? -- ThecentreCZ  ( talk ) 18:14, 15 September 2017 (UTC) \n Obsessed? Not at all. The section within the info box that says e.g. \"Right-wing to far-right\", this is a sentence, so then why should the second position be capitalised? This is not correct grammar as a political position should not be capitalised unless it begins a sentence. Only the first letter of the first word needs to be a capital in this case. As to your other point made above this one, I really don't see what you are getting at. I have been editing political pages on Wikipedia for a long time and it's primarily what I do on here. Any content unsourced can be removed, claims should always be made using reliable sources.  WP:USI . If you want to make constructive criticism please be specific. Thank you.  Helper201  ( talk ) 01:24, 17 September 2017 (UTC) \n Democratic Progressive Party [ edit ] \n Hi Helper201, how is the information in the infobox a sentence? Thanks,  Ezhao02  ( talk ) 01:29, 20 September 2017 (UTC) \n Hmm, I'm not sure how it isn't. If it's a list or just one word, like a bullet point, then I wouldn't say so. However if it appears to form a sentence (i.e. it's more than one word and isn't a list), such as something is \"from here to here\" then I would say its safe to assume its a sentence and should follow standard grammar rules for sentences. Otherwise if there are no grammar rules, anything could go, every word could be a capital, or other such things that wouldn't appear to show any reason. Cheers, and thank you for taking the time to message me.  Helper201  ( talk ) 12:07, 21 September 2017 (UTC) \n CfD nomination of  Category:British Eurosceptics [ edit ] \n Category:British Eurosceptics  has been nominated for deletion, merging, or renaming. You are encouraged to join the  discussion  on the  Categories for discussion  page.  AusLondonder  ( talk ) 01:16, 25 September 2017 (UTC) \n September 2017 [ edit ] \n Just a note - you failed to sign your comment at  Wikipedia:Categories for discussion/Log/2017 September 25   AusLondonder  ( talk ) 03:43, 25 September 2017 (UTC) \n NPD article revert [ edit ] \n Hey. I'm a little confused by your revert on the NPD article. Brown is generally accepted as the customary colour of the NPD by Wikipedia itself, hence the template colour being a dark brown. As for a citation; the CDU article doesn't have one, and all Die Linke has is a link to some election results.  JackWilfred  ( talk ) 22:06, 26 September 2017 (UTC) \n Hi. The only use of dark brown I can see is the outline of the info box, which as far as I'm aware any editor can change. All the logos and images provided in the article only show the use of a red, white and black colour scheme.  Helper201  ( talk ) 22:18, 26 September 2017 (UTC) \n I've provided a citation for NPD's customary colour being brown. Thanks for your quick response.  JackWilfred  ( talk ) 23:28, 26 September 2017 (UTC) \n Harry Kane [ edit ] \n Thank you for showing me the Kane biography, which indeed comes from the respected sports writer  Frank Worrall . Can that be cited, even though we do not know the page number?  Harambe Walks  ( talk ) 21:27, 6 October 2017 (UTC) \n No problem and I appreciate the thanks. I don't see why not, as you said, its a respected source. I have found the right page before via a Google search, its only a couple of pages in as far as I recall. However, the preview I used on Google Books didn't seem to give the number for each corresponding page. So I'm not sure where exactly page 1 begins (as it can differ for some books) to thereby deduce which page number the quote is on exactly, in order to then reference it properly. Perhaps there is a way to see the page numbers and I just missed it. I saw there are a few more Daily Mail citations on the page that also need replacing (and were marked as such a few months ago). I've managed to replace another one, any help replacing the rest would also be appreciated. Cheers.  Helper201  ( talk ) 02:58, 7 October 2017 (UTC) \n Radical leftist [ edit ] \n If you would like a community consensus on this redirect, please take it to  WP:RFD . Blanking a redirect is not a solution to removing the target, despite your reasoning being appropriate in the matter. Since I have reverted your blanking, I cannot take the redirect to RFD myself, as it would be bad faith.  jd22292   (Jalen D. Folf)  ( talk  •  contribs ) 01:12, 30 October 2017 (UTC) \n Minor parties on election pages [ edit ] \n Hello. Instead of reverting edits, it is always a good idea to discuss the subject on the article's talk page. I have added reasoning for removing minor parties from the 2017 elections article on  the talk page . I would love to hear your reasonings, so we can come to an agreement instead of ending in an edit war.  Kaffe42  ( talk ) 19:42, 11 November 2017 (UTC) \n Broadsheet and former broadsheet newspapers - Updated The Guardian political stance [ edit ] \n Hi mate. I changed the political leaning of The Guardian from centre-left to left-wing, sourcing this YouGov poll,  https://yougov.co.uk/news/2017/03/07/how-left-or-right-wing-are-uks-newspapers/ . However, you reversed it (without Talk or any further sourcing?) A newspaper, such as the Guardian, may claim to be 'centre-left', but if that is not reflected in it's content, then it's not true. The newspaper (and website) have clearly been moving further to the left in recent years, as evidenced by this poll, no? Thanks mate  John arneVN  ( talk ) 05:17, 17 November 2017 (UTC) \n This is a poll of the opinions of the UK general public, peoples opinions are not what is taken into regard when deciding the position of a paper. What is taken into regard is evidence from reliable sources, especially academics. I would highly recommend you take this to the paper's talk page before making any changes.  Helper201  ( talk ) 11:55, 17 November 2017 (UTC) \n Hi mate - I have taken it to the Talkpage. A Yougov poll is better than nothing, surely? - I have put forward a source for the Guardian being left-wing (particularly socially, rather than politically - if we describe other papers as right-wing, the Guardian, in my opinion, should be left-wing), and so far nothing has been put forward to suggest that it should be centre-left - I would also argue that public opinion is very important with regards to discussing a papers political leaning (given that these spectrums are always moving). Even the Guardians own Wiki page describes it as \"The newspaper's reputation as a platform for liberal and left-wing editorial has led to...\". Also - I saw above that you changed some date formats to the standard format, rather than the American-only format - good on ya - Wiki has been slowly Americanizing lately - and we have to stop it.  John arneVN  ( talk ) 07:54, 20 November 2017 (UTC) \n Thanks for taking it to the talk page. Yeah, evidence is always important, however in this case I wouldn't say public opinion is evidence. For example if 99% of people believed all sand was red, would that make it red? Like that example this is a case where public opinion does not equal fact. I can see a case for the paper potentially being socially left-wing, but definitely not politically or economically, in these cases I'd definitely say centre-left. The quote you mentioned to me almost seems contradictory, being in western Europe and the UK liberalism is largely associated with the centre of the political spectrum. Maybe that is another reason for it being labelled centre-left? As it says liberal and left-wing the in-between of centre and left-wing is centre-left. I believe this has been discussed a lot on The Guardian's talk page over the years (these discussions I'd assume have now mostly been archived, so it may be hard to find them) but I believe the centre-left tag has been developed through consensus over the years. I think it would take quite a bit of evidence to form a consensus on the papers talk page to change this.  Helper201  ( talk ) 20:22, 23 November 2017 (UTC) \n Your disruptive editing on  Socialist Party (Ireland) [ edit ] \n Please end your disruptive editing warring on this page by constantly reverting. You are ignoring plain reason and material that is self-evidently true. You do not have consensus for this behaviour. You have ignored the comments of other editors on similar and related talk pages. This is a clear case of  WP:ICAN'THEARYOU . Your persisntent reverting is extremely disruptive and unhelpful behavior.  Laurel Lodged  ( talk ) 16:19, 24 November 2017 (UTC) \n Excuse me, I have ignored!? You were the one who was asked to take the matter to talk (and simply ignored it entirely), you are the one who is constantly reverting content that has long stood on this page. Your 'self-evident' claim is nonsense. One ideology of a party does not make it self-evidently fit into only one political position. As clearly outlined here  Wikipedia:Edit warring , where there is dispute it should be taken to the talk page.  Helper201  ( talk ) 16:26, 24 November 2017 (UTC) \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=User_talk:Helper201&oldid=811876602 \"\t\t\t\t\t \n Categories :  Wikipedians who have received a Co-op invitation Hidden categories:  Pages containing links to subscription-only content Wikipedians who have received a Teahouse invitation User talk pages with Uw-spam2 notices   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n User page Talk   \n Variants \n Views \n Read Edit New section View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes User contributions Logs View user groups Upload file Special pages Permanent link Page information   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n  This page was last edited on 24 November 2017, at 16:26. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}