{"url": "https://en.wikipedia.org/wiki/Ollivander", "content": "List of supporting Harry Potter characters - Wikipedia \n List of supporting  Harry Potter  characters   \n From Wikipedia, the free encyclopedia     (Redirected from  Ollivander ) \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n The following are  supporting characters in the  Harry Potter  series  written by  J. K. Rowling . For members of the  Order of the Phoenix ,  Dumbledore's Army ,  Hogwarts staff ,  Ministry of Magic , or for  Death Eaters , see the respective articles. \n Contents \n 1   The Dursleys \n 1.1   Vernon Dursley \n 1.2   Petunia Dursley \n 1.3   Dudley Dursley \n 1.4   Marge Dursley \n 2   Others \n 2.1   Bathilda Bagshot \n 2.2   Frank Bryce \n 2.3   Crabbe and Goyle \n 2.4   Gabrielle Delacour \n 2.5   Cedric Diggory \n 2.6   Elphias Doge \n 2.7   Arabella Figg \n 2.8   Gellert Grindelwald \n 2.9   Viktor Krum \n 2.10   Augusta Longbottom \n 2.11   Xenophilius Lovegood \n 2.12   Teddy Lupin \n 2.13   Narcissa Malfoy \n 2.14   Olympe Maxime \n 2.15   Cormac McLaggen \n 2.16   Auntie Muriel \n 2.17   Moaning Myrtle \n 2.18   Garrick Ollivander \n 2.19   Pansy Parkinson \n 2.20   The Peverell brothers \n 2.21   Madam Rosmerta \n 2.22   Stan Shunpike \n 2.23   Rita Skeeter \n 2.24   Hepzibah Smith \n 2.25   Andromeda Tonks \n 2.26   Ted Tonks \n 2.27   Oliver Wood \n 2.28   The Muggle Prime Minister \n 2.29   The Weird Sisters \n 3   Children of the Potter family \n 3.1   James Sirius Potter \n 3.2   Albus Severus Potter \n 3.3   Lily Luna Potter \n 4   Children of the Weasleys \n 4.1   Rose Granger-Weasley \n 4.2   Hugo Granger-Weasley \n 4.3   Victoire Weasley \n 5   References \n 6   External links \n The Dursleys [ edit ] \nFrom left to right:  Fiona Shaw  as Aunt Petunia,  Harry Melling  as Dudley, and  Richard Griffiths  as Uncle Vernon in the film adaptation of  Harry Potter and the Prisoner of Azkaban . \n The  Dursley family  are  Harry Potter's  last living relatives. To ensure Harry's safety,  Albus Dumbledore  placed him in the Dursleys' care when he was a baby. The Dursleys live at Number 4, Privet Drive,  Little Whinging  in Surrey, England. They are all  Muggles , and despise all things related to  magic  – and anything out of the ordinary in general – and the  Wizarding World , especially the Potters. \n Vernon Dursley [ edit ] \n Vernon Dursley is Harry's uncle, Petunia's husband (and therefore  Lily Potter 's brother-in-law), Dudley's father and Marge's brother. Vernon is described as a big, beefy man, the literal human embodiment of a walrus, with hardly any neck, and a large moustache. He is very much the head of his family, laying down most of the rules for Harry and doing most of the threatening, as well as spoiling Dudley. He is also the director of a drill-making firm, Grunnings, and seems to be quite successful in his career. He regularly reads the  Daily Mail . \n Uncle Vernon and his wife have grudgingly raised Harry from an early age. He and Petunia were often hostile to Harry and never informed him about the magical world, including how his parents died; they explained it away as a car crash. Unlike Petunia, who proves to have a slight feeling of familial loyalty to Harry, Vernon seems to hate his nephew so much that in  Harry Potter and the Order of the Phoenix , he is willing to throw him out of the house, knowing that doing so would put him in grave danger. In fact, while discussing the  Dementor  attack with Harry, Vernon actually hopes aloud that Harry will receive the death penalty. Vernon also has an aversion to imagination, to any references to magic, and anything even slightly out of the ordinary; in the first book, when Harry mentions dreaming about a flying motorbike, Vernon responds by angrily bellowing that motorbikes do not fly, despite Harry's protests that it was only a dream. \n When the Dursleys decide to leave Privet Drive to go into hiding, Vernon nearly shakes Harry's hand good-bye, though he ultimately cannot bring himself to do it. In the film version, he leaves without even a word to Harry although a deleted scene showing Dudley and Harry's reconciliation shows him saying \"this is farewell\". \n Vernon is portrayed by  Richard Griffiths  in the film series. \n Petunia Dursley [ edit ] \n Petunia Dursley  is Harry's maternal aunt, Lily Potter's older sister, Vernon's wife, Dudley's mother, and Marge's sister-in-law. She is described as a bony woman with blonde hair that she passed down to her son, a \"rather horsey\" face and a very long neck, and spends most of her time spying on her neighbours. Her eyes are large and pale, quite unlike Lily's. Her entire family, except Lily, is made up of Muggles. According to Petunia, her parents were proud of having a witch in the family, but Petunia saw her sister as a freak. In fact, Petunia was envious and resentful of Lily's magical abilities [1]  and went so far as to write to Dumbledore, pleading to be allowed to enter  Hogwarts . Dumbledore gently denied her enrollment. Afterwards, Petunia grew bitter towards the school and, by extension, towards the wizarding world in general. She had no contact with Lily after her marriage to  James Potter  and the birth of her nephew, Harry, though she did send the family a \"horrible vase\" that baby Harry broke while riding on a toy broom. The gift echoes Harry's Dursley-sent Christmas presents, which are never pretty or welcome. \n Petunia has more knowledge of the wizarding world than she is initially willing to admit. After the Dementors attack Harry and Dudley, Petunia states that she knows Dementors guard the wizard prison,  Azkaban . When Harry and the rest of her family look at her strangely, she explains that she heard \"that awful boy\" telling Lily about them years ago. Harry assumes that the \"awful boy\" was his father, James, but in  Harry Potter and the Deathly Hallows , he learns via flashback memories that it was actually  Severus Snape , who knew both Lily and Petunia when they were children. On one occasion, Petunia, but mostly her husband, almost throws Harry out of their house, but when she receives a Howler from Albus Dumbledore, she decides not to send the boy away due to the agreement she had made with Dumbledore (although she covers by claiming that her decision is based on what the neighbors might think if the Dursleys threw Harry out). \n Before the Dursleys leave Privet Drive to go into hiding, Petunia almost wishes Harry good luck, suggesting that she does feel a tiny sense of familial attachment to her nephew; however her self-imposed dislike of magic prevents her from doing so, and she leaves without a word. In the film version of  Harry Potter and the Deathly Hallows – Part 1 , she leaves Harry without showing any sentiment; however, in a deleted scene on the Blu-ray/DVD release, Petunia shows acknowledgment of the wizarding world, and ultimately deep sadness and remorse for the loss of her younger sister Lily, reminding Harry that she lost a sister as well. [2]  Petunia Dursley dies sometime between The Battle of Hogwarts and 19 years later. \n Actress  Fiona Shaw  portrays Petunia in the films, with Ariella Paradise playing her as a child. \n Dudley Dursley [ edit ] \n Dudley Dursley  is the only child of Vernon and Petunia, Marge's only nephew and Harry's only cousin. Described as a very large, blond boy (though dark-haired in the films), Dudley is generally given his way in almost everything, and shows the symptoms of a spoiled brat. Dudley is a cold-hearted bully and the leader of a gang of thugs with whom he regularly beats up Harry and younger children on the flimsiest of excuses. He is only one month older than Harry, meaning that his birthday must be sometime in late June. The same year Harry starts at Hogwarts, Dudley is enrolled at his father's old private boarding school, Smeltings. \n In  Harry Potter and the Philosopher's Stone , Dudley is given a pig's tail by  Rubeus Hagrid  which has to be removed at a private hospital in London. In  Goblet of Fire , the Smeltings school nurse advises the Dursleys to put him on a strict diet. During the summer when this diet is enforced, the Weasleys arrive at Number 4, Privet Drive to pick Harry up for the  Quidditch  World Cup, and  Fred Weasley  \"accidentally\" drops a  Ton-Tongue Toffee , which enlarges Dudley's tongue to four feet long before his hysterical mother reluctantly allows  Arthur Weasley  to shrink it. \n In the fifth book, two Dementors attack Dudley and Harry in an alley. Dudley collapses, and Harry uses the  Patronus Charm  to drive a group of Dementors away from himself and his cousin. Mrs. Figg then comes running in and reveals she is a Squib by talking about Dementors. Harry and Mrs. Figg carry the shaken Dudley home, though Dudley is convinced that Harry made the dementors appear in the first place. After the confrontation, Harry wonders what sort of bad memories Dudley could have relived, as Dementors force people to relive their worst experiences. Rowling later revealed, in an on-line chat, that Dudley's worst fear was seeing himself for who he really was: a cruel, selfish, violent bully with no feelings whatsoever for others, and this revelation shocked him to the core. [1]  The experience does give Dudley a more favourable impression of Harry, as seen in  Deathly Hallows , when Dudley is the only member of the family to accept Harry: he shakes his hand and thanks him for saving his soul from the Dementor attack, and shows some concern for him when the Dursleys leave to go into hiding. In his appreciation of his cousin's belated gratitude, Harry says good-bye to him using Dudley's former nickname, \"Big D\". In the film version, however, there is no such sentiment as Dudley leaves Harry before he can say any final words; however, on the Blu-ray/DVD release, a deleted scene includes the reconciliation between the two cousins. [3] \n Rowling revealed on her website that many people have asked her to include an adult Dudley with a wizarding child in the epilogue of  Deathly Hallows , and that she herself considered it, but decided upon reflection that any \"latent wizarding genes would never survive contact with Uncle Vernon's DNA\" and thus she did not do so. Rowling says that Harry and Dudley would \"stay on Christmas card\" terms for the rest of their lives, [4]  and that Harry would take his family to visit Dudley's when they were in the neighbourhood, but it was something that James Sirius, Albus Severus and Lily Luna \"would dread\". [5]  However, Dudley's kids and Harry's occasionally would \"get together while the adults sat in awkward silence\". In  Harry Potter and the Cursed Child  it is also mentioned that adult Dudley sent Harry his baby blanket, the only surviving possession of Harry's from his parents. \n Dudley is portrayed by  Harry Melling  in the  Harry Potter  films. Melling had to wear a fat suit, as he lost a considerable amount of weight as the films progressed. [6] \n Marge Dursley [ edit ] \n Marjorie Eileen [7]  \"Marge\" Dursley  is Vernon's sister and described as physically resembling him; a large woman with hardly any neck and even a bit of a moustache, even though it is not as bushy as Vernon's. Though she is not a blood relative of Harry, he has been forced to call her \"Aunt Marge\" throughout his whole life with the Dursleys. Marge lives in the country, where she breeds bulldogs and because of her commitment to her animals, she rarely visits Privet Drive, to Harry's considerable relief. She adores her nephew, Dudley and treats Harry with contempt and cruelty. Owing to Vernon's and Petunia's lies, Aunt Marge believes that Harry is a horrible boy, and delights in insulting both him and his dead parents. In  Harry Potter and the Prisoner of Azkaban  after she insults Harry's parents, Harry loses his temper and accidentally inflates her, thus causing her to blow up like a monstrous balloon and float up to the ceiling. Marge is later rescued, changed back to normal, and the  Ministry of Magic  modifies her memory. She also appeared in a memory in  Harry Potter and the Prisoner of Azkaban : When Harry is chased up a tree by one of Marge's bulldogs named Ripper. \n Pam Ferris  appeared as Marge in the film adaptation of  Harry Potter and the Prisoner of Azkaban , in which she floats out of the house and into the sky after being inflated. \n Others [ edit ] \n Bathilda Bagshot [ edit ] \n Bathilda Bagshot  is a noted historian in the wizarding world, and author of the book  A History of Magic . She lives in the village where Harry was born,  Godric's Hollow , and is an old family friend of Dumbledore, as well as being the Potters' neighbour and friend.  Gellert Grindelwald  is her great-nephew, which is why he comes to live in Godric's Hollow after being expelled from  Durmstrang . Bathilda is a major source of information for  Rita Skeeter 's biography of Dumbledore, who extracts this information under the influence of  Veritaserum ; it is possible her memory is also modified following the \"interview.\" [8]  Harry decides to go to Godric's Hollow to get information from Bathilda, and because he wants to see his parents' grave. Hermione thinks that Dumbledore might have entrusted her with  Gryffindor's Sword . She dies before Harry's arrival in Godric's Hollow, probably at the hand of  Lord Voldemort  (or one of his Death Eaters), who enchants her decaying body to use as an outer skin for his snake,  Nagini  to wait for Harry. The snake is then instructed to subdue Harry when he arrives in Bathilda's house looking for the sword until Voldemort himself can get there to finish him off. \n Hazel Douglas  plays Bathilda in  Harry Potter and the Deathly Hallows – Part 1 . \n Frank Bryce [ edit ] \n Frank Bryce  is a reclusive  Muggle   World War II  veteran who works as the caretaker of the  Riddle family  mansion in  Little Hangleton . In 1942, the Riddles were murdered by  Tom Riddle  (later to become Lord Voldemort), and since Bryce had the keys to the large house where the deaths occurred, he was arrested and questioned in connection with the murders. As there was lack of evidence (because the bodies were unmarked as the  Killing Curse  leaves no sign of violence or damage on the victims) the police could not prove that the Riddles had been murdered, and were forced to release Bryce. However, the community of Little Hangleton was distrustful of Bryce. As a result, he lived out the rest of his life by himself, living on the grounds of the Riddles' estate, while still tending to the grounds. \n In the beginning of  Harry Potter and the Goblet of Fire , Voldemort discreetly returns to the Riddle house. Bryce inadvertently overhears Voldemort's plan to kill Harry, initially thinking that Voldemort and  Wormtail  are spies, but before he can take action,  Nagini  reveals his presence to Voldemort, who kills him with the  Avada Kedavra  curse. He appears once more in the same book, during Harry and Voldemort's graveyard duel. The  Priori Incantatem  effect brings back an \"echo\" of Bryce from the tip of Voldemort's wand. Despite not knowing who he is, Bryce enthusiastically encourages Harry to keep fighting. \n Dumbledore states his belief in  Harry Potter and the Half-Blood Prince  that the murder of Bryce was used to create Voldemort's presumably sixth and final  Horcrux , implanted in Nagini. However, Rowling later said Voldemort used the earlier murder of  Bertha Jorkins  for this. [9] \n Bryce is portrayed by  Eric Sykes  in the film adaptation of  Harry Potter and the Goblet of Fire . Also Chamber of Secrets \n Crabbe and Goyle [ edit ] \nLeft to right: Gregory Goyle, Draco Malfoy, Vincent Crabbe and  Pansy Parkinson  from director  Alfonso Cuarón 's film adaptation of  Harry Potter and the Prisoner of Azkaban . \n Vincent Crabbe  and  Gregory Goyle  are  Slytherin  students in Harry's year; both of their fathers, Crabbe Sr and Goyle Sr, are  Death Eaters . Due to their size and strength, the pair act as  Draco Malfoy 's minions and serve to intimidate fellow students, being mentioned as \"existing to do Malfoy's bidding\". Crabbe and Goyle are both brawn-over-brains type; they are entirely lacking in introspection or curiosity, though Crabbe is shown to be significantly smarter than Goyle. They seem unable to make up their own minds or to see things their own way. \n Crabbe and Goyle make their first appearance as new Slytherin  Quidditch  Beaters in the opening match against Gryffindor in their fifth year; after Harry catches the Snitch, Crabbe vents his frustration by purposely hitting a Bludger into Harry's back and knocking him off his broom, but receives the light punishment of writing lines. They do not return to the team the following year, as they regularly serve as Malfoy's lookouts during his forays into the  Room of Requirement . After Malfoy leaves the school following the death of Dumbledore just before the end of the term, Crabbe and Goyle are left in a state of loneliness. \n The three of them are reunited in  Harry Potter and the Deathly Hallows . Both of them speak for the first time, Crabbe's voice being described as \"oddly soft for someone with his huge frame\" and Goyle's simply as a grunt. Crabbe has sided with the Death Eaters with more conviction than either Goyle or Malfoy, and becomes increasingly independent of Malfoy, well aware of the Malfoy family's falling out of favour with Voldemort. The pair have developed into surprisingly powerful wizards. Crabbe and Goyle are mentioned as having excelled in inflicting the  Cruciatus Curse  on other pupils who had received detentions under  Amycus Carrow 's direction: according to  Neville Longbottom , it was \"the first time they were the best in anything\". During the fight for the Horcrux diadem with Harry,  Ron Weasley  and  Hermione Granger  in the Room of Requirement, Crabbe defies Malfoy's order to not kill Harry and casually throws around the  Avada Kedavra  curse. Finally, he summons  Fiendfyre  and turns the room into a blazing inferno, but it quickly rages beyond his control and ultimately leads to his death and the destruction of the Horcrux. Goyle is knocked unconscious during the ensuing fight, but is rescued along with Draco by Harry, Ron and Hermione. Goyle and Draco are left mourning Crabbe's death. \n Jamie Waylett  portrayed Crabbe and  Joshua Herdman  played Goyle in the first six films of the  Harry Potter  film series; only Herdman appears in  Harry Potter and the Deathly Hallows – Part 1  and  Harry Potter and the Deathly Hallows – Part 2 , with Crabbe's role in the plot being replaced by Goyle, and Goyle being replaced by Blaise Zabini. [10] [11] \n Gabrielle Delacour [ edit ] \n Gabrielle Delacour  is the only younger sister of  Fleur Delacour . Her age in  Goblet of Fire  is estimated by Harry to be no more than eight, and this statement is reinforced when it is stated in  Deathly Hallows  that she is eleven. During the Triwizard Tournament, in which Fleur is the champion for  Beauxbatons , Gabrielle along with Ron, Hermione, and  Cho Chang  is used as underwater \"bait\" for the champions to rescue. Unfortunately Fleur does not manage to rescue Gabrielle in time because she is held back by  Grindylows  and is forced to return to the surface, but Harry goes on to save her as well as his own hostage, Ron. She makes a small appearance later on in the book when the contestants' families are allowed to watch them compete. She is clinging to her mother and gives Harry a smile and a wave when she sees him, which is when he returns. \n Fleur hints in  Half-Blood Prince  that Gabrielle (much like the young  Ginny Weasley ) has developed a crush on Harry, since she \"never stops talking\" about him. Gabrielle and Ginny serve as bridesmaids at  Bill Weasley  and Fleur's wedding in  Deathly Hallows . Her part- Veela  heritage begins to develop as she matures and she is nicknamed \"Fleur in miniature\". She retains the crush on Harry at that time, causing Ginny to clear her throat loudly in mild jealousy when she throws him a flirtatious look. \n Gabrielle was portrayed by Angelica Mandy in the film adaptation of  Goblet of Fire . Mandy reprised her role for  Harry Potter and the Deathly Hallows – Part 1 , but appeared only in background scenes and was uncredited. \n Cedric Diggory [ edit ] \n Cedric Diggory  was a  Hufflepuff  student two years above Harry. A Hufflepuff prefect, he shows a notable streak of modesty, fairness, and loyalty. When he catches the Snitch and wins the match after Harry falls off his broomstick following an encounter with the  Dementors , he believes the circumstances of the match to be unfair and protests that the result should be nullified and the match replayed. He is described as being exceptionally handsome, tall, with chiselled features, a straight nose, dark hair, and bright grey eyes. \n In  Harry Potter and the Goblet of Fire , Diggory is selected as the Hogwarts champion for the Triwizard Tournament. After Harry Potter is also picked to compete, Malfoy makes \"Support Cedric Diggory/Potter Stinks\" badges, which Diggory tries to discourage his housemates from wearing. For the first task, Diggory transfigures a rock into a dog to distract his dragon and successfully finds his golden egg, but he receives a burn on his cheek in the process. He is later  Cho Chang 's date for the Yule Ball. As compensation for Harry's warning about the dragons before the first task, Diggory assists Harry in solving the clue of the second task by telling him to take a bath with the egg in the prefects' bathroom and just \"mull things over in the hot water\". Cedric is the second of the four champions to find the village of the merpeople and rescue his hostage, using a  Bubble-Head Charm , but surfaces one minute over the one-hour time limit. \n During the third task, Harry saves Diggory's life twice while in the maze, and when they find the Triwizard Cup, Harry refuses to take it without Cedric, so they grab hold of it together. The cup turns out to be a  Portkey  which transports them to the Little Hangleton graveyard, where Voldemort and  Peter Pettigrew  await Harry's arrival; Pettigrew murders Diggory on the spot upon Voldemort's order to \"kill the spare\". In the midst of the  Priori Incantatem  effect during Harry's duel with Voldemort, Diggory's spirit appears and asks Harry to take his body back to his parents. Despite an attempted cover-up of the incident by the  Ministry of Magic , Dumbledore candidly reveals the true nature of Cedric's demise to the students at the end-of-term feast, stating that to attribute it to an accident would be \"an insult to his memory\". Cedric Diggory was in his sixth year at Hogwarts in  The Goblet of Fire . \n Robert Pattinson  appeared as Cedric Diggory in  the film adaptation of  Harry Potter and the Goblet of Fire , a clip from which was shown again in  Harry Potter and the Order of the Phoenix  as a flashback. The actor who portrayed him in  Prisoner of Azkaban  is unidentified. \n In the  West End  play  Harry Potter and the Cursed Child  we learn that Cedric also frees Albus and Scorpius from Delphi in the Triwizard maze. Albus must then make the decision to let Cedric go on and finish the maze, knowing this is sending him to his death. \n In  Harry Potter and the Cursed Child , Cedric is portrayed by actor Tom Milligan in the original cast and Rupert Henderson in the second cast. \n Elphias Doge [ edit ] \n Elphias Doge  was a friend of  Albus Dumbledore  who was intending on going on tour with him before Dumbledore's mother died. He is mentioned in an interview with Skeeter and in  The Life and Lies of Albus Dumbledore.  He is described as having a wheezy voice and white hair. \n Doge was part of the Advanced Guard that took Harry to Number 12 Grimmauld Place and is part of the Order of the Phoenix. Doge attended Bill and Fleur's wedding, where he saw Harry and Auntie Muriel and discussed Skeeter's biography. He had to Apparate out of the wedding when the Death Eaters attacked. \n He is portrayed by  David Ryall  in  Harry Potter and the Deathly Hallows Part 1 . \n Arabella Figg [ edit ] \n Arabella Figg  is a squib who lived on Wisteria Walk in Little Whinging. She was a member of the Order of the Phoenix and received orders from  Albus Dumbledore  to keep watch on Harry, who was left under her care by the Dursleys multiple times. She was a dealer of cross-bred cats and kneazles. \n She is portrayed by Kathryn Hunter in  Harry Potter and the Order of the Phoenix . \n Gellert Grindelwald [ edit ] \n Gellert Grindelwald  is a  Dark wizard  who, on a list of \"Most Dangerous Dark Wizards of All Time,\" would be second only to Voldemort, according to Rita Skeeter's book  The Life and Lies of Albus Dumbledore.  His name is first mentioned in  Philosopher's Stone  on a Chocolate Frog card which notes that Dumbledore defeated Grindelwald in 1945. \n Grindelwald attended the wizarding school  Durmstrang , from which he was expelled at age sixteen for his dangerous and evil experiments that nearly resulted in the deaths of some of his fellow students. He left the symbol of the  Deathly Hallows  on one of the walls in Durmstrang before departing. After Durmstrang, he went to live with his great-aunt Bathilda Bagshot in Godric's Hollow, where he met the young Dumbledore. In  Deathly Hallows,  it was revealed that Grindelwald had gone to Godric's Hollow to investigate the grave of the  Peverell brothers  (the original owners of the Hallows), but struck up a close friendship with Dumbledore, and the two planned to establish a new world order, where wizards would rule over Muggles \"for the greater good\". The phrase later became Grindelwald's excuse for the atrocities he committed in his reign of terror. They also planned to work together in their quest for the Hallows. Later Rowling claimed at a Q&A session that she implied Dumbledore being once in love with Grindelwald, and thus he has 'lost his moral compass,' but she did not say whether those feelings were returned. [12] [13] \n However,  Aberforth Dumbledore , Albus' younger brother, argued against these plans, because he feared their grand ambitions would leave his disabled, traumatised sister,  Ariana , abandoned. Later the argument culminated in a three-way duel among Albus, Aberforth, and Grindelwald. Ariana was inadvertently killed by one of them. Grindelwald fled, fearing retribution and Albus ended his friendship with him. Grindelwald became master of one of the Deathly Hallows, the  Elder Wand , by stealing it from the previous owner, the wand-maker Gregorovitch. Gaining the Elder Wand's immense power, he subsequently committed many terrible acts. It is revealed that Grindelwald's actions have caused many deaths that have greatly affected the students of Durmstrang, including  Viktor Krum , whose grandfather was murdered by Grindelwald. \n After Grindelwald's rise to power, Dumbledore delayed meeting him again for several years due to his fear of being confronted with his sister's death and the fact that he himself might have been the one who accidentally killed her. Both wizards were highly intelligent and skilled in battle, and when their battle eventually occurred, those who witnessed it later said that no other wizarding duel ever matched it. Grindelwald, who at the time possessed the supposedly unbeatable Elder Wand, lost to Dumbledore. Since Dumbledore won the duel over Grindelwald, the Elder Wand transferred its allegiance to Dumbledore. After Dumbledore triumphed over Grindelwald, the defeated dark wizard was imprisoned in the top-most cell of  Nurmengard . He remained there, growing emaciated and toothless through the ravages of the prison, until the events of  Deathly Hallows  when Voldemort arrives, seeking the Elder Wand. Grindelwald, showing no fear of Voldemort and welcoming death, tells him that he never owned the wand, and Voldemort kills him in rage. In the chapter \"King's Cross\", Harry suggests to Dumbledore that Grindelwald's last act may have been one of contrition, lying to Voldemort to prevent him from breaking into Dumbledore's tomb and taking the Elder Wand. \n In  Harry Potter and the Deathly Hallows – Part 1 , young Grindelwald is portrayed by  Jamie Campbell Bower [14]  while the older Grindelwald is played by  Michael Byrne . In the film, unlike in the book, Grindelwald reveals to Voldemort the whereabouts of the Elder Wand. \n Grindelwald appears in the film  Fantastic Beasts and Where to Find Them , though he is disguised for most of the story as MACUSA chief  Auror  Percival Graves, played by  Colin Farrell . [15]  Once his disguise is removed, he is briefly portrayed by  Johnny Depp , who is set to return for the rest of the series. [16] \n Viktor Krum [ edit ] \n Viktor Krum  is a Seeker for the Bulgarian national Quidditch team who has entered the International Quidditch League at an early age. Many wizards of his time consider him a prodigy. He has bushy eyebrows and a hooked nose, which he inherited from his father. He is also described as being well coordinated on a broom but slightly unbalanced on land. [17]  Despite his success and fame, Krum appeared to be unhappy and lonely, and was further characterised as being very quiet and reserved, though Hermione says he is a genuinely nice person beneath the sullen exterior. In the Quidditch World Cup title game between Bulgaria and Ireland, he suffers a severe bloody nose during the match and catches the Snitch as quickly as he can to end it, which hands victory to Ireland because Bulgaria was trailing by 160 points at the time. \n Krum is named Durmstrang champion upon entering his name for the prestigious Triwizard Tournament. He is often viewed with suspicion by his peers due to Durmstrang's reputation for teaching the Dark Arts, while looked upon with admiration for his feats, mainly by giggling Hogwarts girls. Whilst competing in the Triwizard Tournament, he takes to visiting the Hogwarts library to try to talk to  Hermione . He eventually gains the courage to ask her to the Yule Ball, a traditional formal dance associated with the Triwizard Tournament. Krum has to rescue her from the merpeople in the Great Lake for the Second Task, revealing his deep affection for her. Immediately afterward, he invited her to stay with him in Bulgaria and stated that he had \"never felt this way about a girl before.\" He becomes jealous of Harry when a slanderous news article by Rita Skeeter falsely states that Hermione is toying with both boys' affections, and confronts him about it. When he learns the truth, he and Harry become friendly, shortly before the appearance of a mentally incapacitated  Bartemius Crouch Sr . Crouch's disguised son stuns Krum shortly afterward, to murder his father unnoticed. In the climax of the book, Krum, under the influence of an  Imperius Curse  cast by  Barty Crouch Jr , uses the  Cruciatus Curse  on Cedric Diggory to eliminate any opposition for Harry to win the tournament, but is not arrested nor punished for this, as he was not in control of his own faculties. \n Krum briefly returns in  Deathly Hallows,  as a wedding guest of Bill and Fleur. He has a heated discussion with Xenophilius Lovegood, after he recognises a symbol that Xenophilius wears around his neck as the mark of Grindelwald; the symbol is later discovered to be the mark of the Deathly Hallows. His attitude suggests that he wants to get back together with Hermione, and he is disgruntled to see her dancing with Ron. Krum then asked Harry (who was disguised as a Weasley) whether or not Ginny Weasley was single, showing that he had his eye on her too. J.K. Rowling later stated that Krum eventually found love in his native Bulgaria. \n Stanislav Ianevski  portrayed Krum in the film adaptation of  Goblet of Fire .  He made a brief appearance in  Deathly Hallows , but his scenes were cut from the film. \n Augusta Longbottom [ edit ] \n Augusta Longbottom  is Neville's paternal grandmother, introduced in  Philosopher's Stone  before Neville leaves for Hogwarts. She raised him from a young age after  Neville's parents  were tortured and permanently incapacitated by a group of Death Eaters led by  Bellatrix Lestrange . Early on, it is established that Neville is terrified of his grandmother, who is a very strict disciplinarian, a perfectionist, a staunch opponent of  Voldemort  and a no-nonsense witch, especially towards Neville, sometimes complaining he is not as gifted a wizard as his father. \n In  Order of the Phoenix , Neville discloses that his grandmother fully supports Harry and Dumbledore's proclamations that Voldemort had returned, even going so far as to cancel her subscription to the  Daily Prophet , because they keep toeing the  Ministry of Magic  line that Harry was lying. Later, Harry and his friends are visiting Arthur Weasley in  St Mungo's Hospital for Magical Maladies and Injuries  and meet Augusta and Neville who are visiting Frank and Alice (Neville's parents); Augusta explains to Harry's friends how Neville's parents got into that state. She reprimands Neville for failing to have already told his friends what happened to his parents, saying he should be \"proud\" to be their son for their bravery. \n In  Half-Blood Prince , Augusta wants Neville to continue studying  Transfiguration  instead of  Charms , which she considers a soft option. It is revealed by  Minerva McGonagall  that Augusta thinks like this because she failed her Charms O.W.L. McGonagall also writes a letter to Augusta telling her it's time that she \"learned to be proud of the grandson she's got, rather than the one she thinks she ought to have\". [18] \n Deathly Hallows  is a definite turning point for the relationship between Augusta and her grandson. Towards the climax of the book, it is revealed that the Death Eaters targeted Augusta when Neville began acting as leader of the reformed Dumbledore's Army. The Ministry official  John Dawlish  is sent to arrest her; according to Neville, he was expecting an old woman living alone to be an easy target. However, the implications are that Augusta is actually an extremely capable witch, easily overpowering Dawlish and evading capture by the Death Eaters. She sends Neville an encouraging letter, which he keeps by his heart. Augusta arrives at the Battle of Hogwarts to assist her grandson. Bolstered by Neville's leadership of the D.A. during his seventh year at Hogwarts, Augusta ultimately becomes extremely proud of him. \n In the 2006 skit for the Children's Party at the Palace, it is revealed Augusta keeps a mousetrap in her bag. Neville explains that his grandfather placed a Fanged Gerbil in Augusta's bag in 1947, believing it would be funny. Augusta didn't agree with this, particularly after the gerbil bit her, and placed a mousetrap in her bag to prevent a repeat of this happening again. \n Augusta is portrayed by  Leila Hoffman  in the first film, appearing only in the background escorting Neville to the express. \n Xenophilius Lovegood [ edit ] \n Xenophilius Lovegood  is Pandora Lovegood's husband,  Luna Lovegood 's father, and the editor of  The Quibbler , a magazine that often publishes stories about wild conspiracy theories or research on seemingly non-existent creatures. \n He is introduced in  Deathly Hallows  as a guest at the wedding of Fleur Delacour and Bill Weasley, and is said to be a friend. He is described as eccentric looking, being slightly cross-eyed, with shoulder-length white hair the texture of  candyfloss  and wearing garishly coloured robes. Xenophilius wears the symbol of the Deathly Hallows around his neck as a way of showing his willingness to help other believers in the Hallows in their quest to obtain them. \n Later in the story, he explains to Harry, Ron, and Hermione the significance of the Deathly Hallows. Although initially one of the staunchest supporters of the anti-Voldemort, pro-Harry Potter movement through his magazine, Xenophilius later betrays the trio's location to the Death Eater-controlled  Ministry of Magic  in a bid to ensure the safe return of his kidnapped daughter. After an ensuing battle with Xenophilius and the Death Eaters, the trio escape and the Death Eaters arrest Xenophilius, which saves his reputation, as he is mentioned on the clandestine \" Potterwatch \" radio broadcast as a persecuted anti-Voldemort dissident, and the issue of  The Quibbler  in which he attacks Harry is buried under the ruins of his home and never distributed. Harry, Ron, and Hermione never reveal his attempted betrayal, which was motivated solely by fear for Luna's life. \n Welsh actor and singer  Rhys Ifans  portrays Xenophilius in the film adaptation of  Harry Potter and the Deathly Hallows – Part 1 . \n Teddy Lupin [ edit ] \n Edward Remus \"Teddy\" Lupin  is the orphaned only son of  Remus Lupin  and  Nymphadora Tonks  and godson of Harry Potter. He is named after Tonks' late father,  Ted Tonks , and his own father, Remus. Teddy is a  Metamorphmagus  like his mother Nymphadora, and is not affected by his father's lycanthropy. [1] [19]  He is mentioned in the final chapter of  Harry Potter and the Deathly Hallows  by Harry, who says that Teddy \"comes round to dinner about four times a week\". He was also seen by James Sirius, Harry's son, kissing Victoire Weasley. \n Narcissa Malfoy [ edit ] \n Narcissa \"Cissy\" Malfoy , born Narcissa Black to Cygnus Black III and Druella Rosier, is the youngest of three sisters, her older sisters being  Bellatrix Lestrange  and  Andromeda Tonks . She is a cousin of  Sirius  and  Regulus Black  and an aunt to  Nymphadora Tonks , Andromeda's daughter. Narcissa attended Hogwarts, where she was in  Slytherin . She later married  Lucius Malfoy , with whom she has one son,  Draco , of whom she is extremely protective. Narcissa is first described as a tall, slim blonde who would have been attractive if not for \"a look that suggested there was a nasty smell under her nose\". Although Narcissa certainly seems to share the Blacks' and her husband's views on blood purity on the outside, [1]  her actions indicate she is far more concerned about the welfare of her family than helping Voldemort. \n Although Narcissa makes her first, very brief appearance in  Goblet of Fire , where she attends the Quidditch World Cup with her husband and son, her role in the series first becomes important in  Harry Potter and the Half-Blood Prince . At the beginning of the book, Narcissa and Bellatrix arrive suddenly at  Snape's home . Narcissa is distraught, almost  hysterical , with her husband imprisoned in  Azkaban  and her son forced to accept a difficult and dangerous assignment by Voldemort. She begs Snape to help Draco and asks him to make an  Unbreakable Vow , to which he agrees. Narcissa also appears later in the novel, shopping with Draco for his new robes at  Madam Malkin's . She and Draco bump into Harry, Ron and Hermione. Harry taunts Narcissa for her husband being sent to Azkaban, and in turn, she mocks his dead godfather, Sirius Black. Narcissa also says that \"Harry will be reunited with dear Sirius before I am reunited with Lucius\", showing that she believes Harry to die soon. Draco defuses the situation by leaving with his mother. \n In  Deathly Hallows,   Narcissa's home  is being used (against her will) as the Headquarters for Voldemort and his Death Eaters and for confining several prisoners, including eventually, Harry, Ron, and Hermione. When this group escapes with the help of  Dobby , Voldemort places Narcissa and her family under house arrest. In the climax of the book, the Malfoys are brought with the other Death Eaters to Hogwarts, when Voldemort invades the castle. When Voldemort casts a Killing Curse on Harry, Narcissa is ordered to verify his death. When she feels Harry's heart beating, she quietly asks him whether Draco is still alive at Hogwarts, a fact that Harry confirms. Knowing that she will not be free to search for her son unless she can return with the Death Eaters as part of a \"conquering army\", Narcissa lies to Voldemort and declares Harry to be dead. She is later seen at the end of the book, with her husband and son, unsure what to do and how to behave amidst the celebration of Voldemort's death. However, thanks to her lie to Voldemort, the Malfoys manage to avoid imprisonment in Azkaban. [1] \n In the film series, Narcissa shows very little to no animosity towards Harry personally, only dueling him after he attacks Draco during the Battle of Malfoy Manor. Narcissa's question to Harry and subsequent lie to Voldemort are preserved in the film. Narcissa's reaction to the final battle is changed dramatically: she utterly ignores it, literally turning her back on the situation and taking Draco with her, with Lucius following after a moment. Narcissa is portrayed by  Helen McCrory  in the film series. McCrory was initially cast as Bellatrix Lestrange, but withdrew due to pregnancy; the role of Bellatrix went to  Helena Bonham Carter . \n Olympe Maxime [ edit ] \n Madame Olympe Maxime  is the headmistress of  Beauxbatons , the French wizarding school. The character is introduced in  Goblet of Fire  when her school is invited to the Triwizard Tournament, with  Fleur Delacour  being elected as Beauxbatons' champion. When Harry is chosen as the fourth champion and second Hogwarts champion, she is angered and is about to leave the tournament, but she eventually agrees to stay. In  Goblet of Fire , she is described as being elegant and wearing black satin robes, and having olive skin and handsome features, but being extremely tall. It is revealed that Madame Maxime's huge size is due to her half-giant background. She fiercely denies this, although she is around the same height as fellow half-giant  Rubeus Hagrid . Upon first sight, Hagrid immediately takes a crush on Madame Maxime, which he shows by attempting to groom himself properly and wearing his hairy brown suit when she is around. \n In  Order of the Phoenix ,  Hagrid tells Harry, Ron, and Hermione that he and Madame Maxime visited the giants during that summer to get them on to the  Order of the Phoenix 's side. Unfortunately, they failed in their mission, because Voldemort also sent a group of Death Eaters to address the giants. When giants attack Hagrid, Madame Maxime defended him by using a conjunctivitis curse. Hagrid describes her spell work as \"brilliant\". She separates from Hagrid during the return journey, however, because he would not abandon his giant half-brother  Grawp , who proves to be a highly taxing travelling companion. She returns to Beauxbatons alone. In  Half-Blood Prince , Madame Maxime is among those paying respects at Dumbledore's funeral. Her last appearance is in  Deathly Hallows , where she attends the wedding of  Bill Weasley  and Fleur Delacour. \n Frances de la Tour  appeared as Madame Maxime in  Goblet of Fire , and reappeared in the role in  Deathly Hallows . [20] \n Cormac McLaggen [ edit ] \n Cormac McLaggen  is a Gryffindor student one year above Harry. He is introduced for the first time during the train journey to Hogwarts in  Half-Blood Prince  as a member of  Horace Slughorn 's Slug Club, due to his uncle's close ties with the Ministry of Magic. Cormac is shown as an unsympathetic Gryffindor character, and his Gryffindor bravery is both a strength and a flaw: he is foolhardy and proud, bordering on arrogant. Cormac tries out for the position of Keeper on the Quidditch team when Harry becomes captain; however, Hermione secretly jinxes him with the Confundus Charm, causing him to miss his last save and thus helping Ron retain his spot on the team. Cormac does not take his loss well, accusing Ginny of nepotism by giving Ron easy shots to block. \n Cormac fills in during Gryffindor's match against Hufflepuff as Keeper when Ron is unable to play due to poisoning, but his debut is disastrous, as he orders the team about instead of focusing on his own position, knocks Harry unconscious with a  bludger , and contributes to Gryffindor's lopsided 320–60 loss, thus earning him universal dislike among his housemates. Cormac also briefly becomes a pawn in the escalating tensions between Ron and Hermione, when he accompanies Hermione to Slughorn's Christmas party as her date, in retaliation for Ron's relationship with  Lavender Brown . The plan backfires when she becomes exasperated with McLaggen's arrogant behaviour, and she leaves him stranded under the mistletoe and avoids him for the remainder of the party. \n In  Harry Potter and the Deathly Hallows – Part 1  he is seen in Hogwarts Express and in  Part 2  he is seen participating in the battle at Hogwarts, which he survives. \n Freddie Stroma  appears as McLaggen in  Harry Potter and the Half-Blood Prince ,  Harry Potter and the Deathly Hallows – Part 1  and  Part 2 . \n Auntie Muriel [ edit ] \n Muriel  is a great-aunt of the Weasley children (on Molly's side). According to Ron, she is rude to just about everyone she meets. Harry first meets her in  Harry Potter and the Deathly Hallows  during Bill and Fleur's wedding. She is described as having bloodshot eyes and a large, feathery pink hat, making her look like a \"badly tempered flamingo\". She lends her beautiful  goblin -made tiara to Fleur for the wedding. During the wedding, she starts an argument with  Elphias Doge  about Dumbledore's past and  Rita Skeeter 's  The Life and Lies of Albus Dumbledore . In spite of her dislike for the late Dumbledore, Muriel offers support to the Order of the Phoenix, providing her house in  The Deathly Hallows  for Harry when the Order removes him from the safety of the  Dursleys' . Later in the book, most of the Weasleys and several others hide in her house because they are targeted as blood traitors or Mudbloods. \n Matyelok Gibbs appears as Muriel in  Harry Potter and the Deathly Hallows – Part 1 , but during the film she is never identified. [21] \n Moaning Myrtle [ edit ] \n Moaning Myrtle  (born  Myrtle Elizabeth Warren [22] ) is a  ghost  that haunts the first floor girls' lavatory at Hogwarts. True to her nickname, she has a tendency to moan, sob, whine, wail and complain, especially when death is mentioned. Her constant moping and wailing causes plumbing problems in the lavatory she haunts. Rowling revealed on her website that Myrtle was in  Ravenclaw  House [23]  and on Twitter that her full name was Myrtle Elizabeth Warren. [24]  Rowling states \"The inspiration for Moaning Myrtle was the frequent presence of a crying girl in communal bathrooms, especially at the parties and discos of my youth.\" [25] \n In  Chamber of Secrets , it is established that the character is the ghost of a Muggle-born witch who died while a student at Hogwarts, fifty years before the events in the book. Myrtle was hiding in the first floor girls' lavatory to elude Olive Hornby, a classmate of hers who perpetually tormented her about her glasses, when the  Chamber of Secrets  was opened and the  basilisk  emerged and killed her. Tom Riddle used her death to create his  second Horcrux : his diary. [9]  After death, Myrtle haunted Olive everywhere she went, until Olive complained to the Ministry of Magic, which ordered Myrtle to return to Hogwarts. Ever since then, Myrtle has sulkily haunted the same lavatory where she died. Despite living up to her name, she is flirtatious with Harry, especially during his bath, and also makes lascivious comments regarding Cedric's bath suggesting  voyeuristic  tendencies. \n Myrtle also helps Harry with his second task in the  Triwizard Tournament , in  Harry Potter and the Goblet of Fire . Myrtle tells Harry how to solve the puzzle of the golden egg that he retrieved in the first task, by opening the egg underwater. She is far less miserable, and enjoys having Harry briefly to herself to boss around. He later meets her in the lake where she directs him to the merpeople's village and says they don't like her. In  Harry Potter and the Half-Blood Prince , she comforts Draco, who is worried about the task Voldemort assigned him. After Harry injures Malfoy using  Sectumsempra , Myrtle quickly spreads the news throughout the school, screaming,  \"Murder! Murder in the bathroom!\" \n Shirley Henderson  portrays Myrtle in the film versions of  Chamber of Secrets  and  Goblet of Fire . \n Garrick Ollivander [ edit ] \n Garrick Ollivander  is the proprietor of  Ollivanders , a prestigious shop which sells magical wands in  Diagon Alley . Although Ollivander is generally presented as a genial elderly man, Harry is unnerved the first two times he meets him in the series because the wandmaker appears to admire what Voldemort could do with his original wand and, later, the  Elder Wand . Despite his wands' popularity, he can easily remember the materials and attributes of every wand he has ever sold, as well as its owner. In  Philosopher's Stone , Ollivander assists 11-year old Harry in selecting his first wand. Finding Harry a particularly difficult customer to match, Ollivander finally selects an eleven-inch-long wand made of  holly  containing a  phoenix  feather (later revealed to have come from Dumbledore's phoenix,  Fawkes ), which is perfectly suited to Harry. Ollivander is intrigued that this particular wand would suit Harry, and reveals that Fawkes contributed only one other feather, to the wand being used by Voldemort. \n Ollivander appears in  Goblet of Fire  during the preliminary ceremonies of the Triwizard Tournament, where he acts as an expert judge for the Weighing of the Wands. In  Half-Blood Prince , his shop has closed and is boarded up, and Ollivander himself is missing. The opening scene of the  Half-Blood Prince  film shows Mr Ollivander hooded and forcibly seized from his shop by three  Death Eaters . In  Deathly Hallows , Ollivander has been captured by Voldemort and imprisoned at  Malfoy Manor  with Luna, with whom he develops an affectionate relationship as the two strive to keep each other's spirits up. He is among those rescued from the manor by  Dobby , after which, at  Shell Cottage , he provides Harry and his friends with some useful information about the  Elder Wand . He later goes into hiding at the home of  Auntie Muriel  and sends Luna a new wand as a gift. \n British actor  John Hurt  appeared as Ollivander in the film adaptation of  Harry Potter and the Philosopher's Stone  and reprised his role in  Harry Potter and the Deathly Hallows – Part 1  and  Part 2 . \n His first name was revealed in  Pottermore . It was also revealed that he is married and has a son and a daughter (the latter deceased). Some of the names of his wandmaker ancestors were also revealed: Geraint Ollivander (ancestor), Gerbold Octavius Ollivander (paternal grandfather), Gervaise Ollivander (father). \n Pansy Parkinson [ edit ] \n Pansy Parkinson  is a Slytherin student who is described as pug-faced and frequently seen with an unnamed gang of Slytherin girls, acting as their leader, or at least spokeswoman. She is first mentioned in the Sorting in  Philosopher's Stone , and makes her first appearance in  Madam Hooch 's flying class, during which she teases  Parvati Patil  for defending  Neville Longbottom  after Draco steals Longbottom's  Remembrall . In  Prisoner of Azkaban,  she cries and follows Malfoy to the hospital wing after he is attacked by  Buckbeak , and continues to fawn over him despite his deliberate exaggeration of the extent of his injury. They attended the Yule Ball together in  Goblet of Fire . \n Throughout the series, Pansy regularly mocks Harry and his companions. She gives false information on Harry, Hermione, and Hagrid to Rita Skeeter, and openly voices criticisms of Hagrid to Umbridge in terms of her displeasure about his  Care of Magical Creatures  class and her difficulty in understanding his voice. She and other Slytherins also taunt the Gryffindor Quidditch players from the stands during a morning practice, notably teasing  Angelina Johnson  about her braided hair. During a Gryffindor-Slytherin match, which is also Ron's debut as the new Gryffindor Keeper, she conducts the Slytherin students as they sing a demeaning song entitled \"Weasley is our King\". \n Pansy has a slightly increased role in  Harry Potter and the Order of the Phoenix . She is made a Slytherin  prefect  along with Malfoy, and later joins  Dolores Umbridge 's Inquisitorial Squad. When  Dumbledore's Army  flees the Room of Requirement following Dobby's revelation of an informant, Pansy searches the girls' bathrooms for escaped members and seizes Hermione's list of names as evidence. However, the Inquisitorial Squad members are jinxed in the midst of a student rebellion following  Fred and George Weasley 's departure from Hogwarts. Pansy is thereafter admitted to the hospital wing and misses a day's worth of lessons after sprouting a pair of antlers. Near the conclusion of  Deathly Hallows,  when Voldemort demands Harry's surrender to prevent the attack on Hogwarts, she advocates handing him to the Death Eaters, only for the other houses to collectively respond by standing up and pointing their wands at her. She eventually evacuates with the other Slytherins. \n Pansy was portrayed by Katherine Nicholson in the  Philosopher's Stone  and in the  Chamber of Secrets ,  Genevieve Gaunt  in  Prisoner of Azkaban , Charlotte Ritchie in the  Goblet of Fire , Lauren Shotton in  Order of Phoenix , by  Scarlett Byrne  in  Half-Blood Prince ,  Harry Potter and the Deathly Hallows – Part 1  and  Part 2 . \n The Peverell brothers [ edit ] \n The  Peverell family  is first mentioned in  Half-Blood Prince  as ancestors of  Marvolo Gaunt , the maternal grandfather of Voldemort. In the final book of the series, they are revealed to be the original owners of the  Deathly Hallows , which, according to  The Tales of Beedle the Bard , they received from Death, although Dumbledore believed it is more likely that they created them themselves. The Peverell lineage continues through its living descendants, including Harry and his children. \n After Hermione saw the symbol of the Deathly Hallows on Ignotus Peverell's grave in Godric's Hollow, Harry recalled Marvolo Gaunt boasting that his ring held the Peverell  coat of arms  on it, thus realising that the three brothers were the Peverells. Harry deduces that he is descended from Ignotus, as the cloak is passed down through his family. Furthermore, Rowling has confirmed that Harry and Voldemort are indeed distant relatives because of their relation to the Peverells, as the majority of wizard families share common ancestry. [1] \n Antioch Peverell was the eldest of the three Peverell brothers, and owner of the  Elder Wand . He was killed in his sleep after bragging about the wand's invincibility, having won a duel with it. The murderer then stole the Elder Wand, thus initiating its bloody history. \n Cadmus Peverell was the middle of the three Peverell Brothers, and owner of the  Resurrection Stone . Using the Stone, he resurrected the girl he had once hoped to marry, who had died an untimely death. Though she had returned to the mortal world, she did not truly belong there and suffered. Driven mad by this, he killed himself to join her. The Stone was later embedded in a ring that ended up belonging to Marvolo Gaunt. \n Ignotus Peverell was the youngest of the three Peverell brothers, described in  The Tales of Beedle the Bard  as \"the humblest and the wisest of the brothers\". He was the owner of the  Cloak of Invisibility , due to which, unlike his brothers, he successfully avoided dying for many years, living a full and long life, and ultimately \"greeting Death as a friend.\" Harry deduces that his invisibility cloak is the original cloak owned by Ignotus. Unlike other cloaks of invisibility, it has never shown any kind of fading or damage despite the cloak being passed down through many generations of the Peverell family and ultimately to Harry. Harry is therefore a descendant of Ignotus Peverell. Both by birthright and by blood relations, Harry Potter is the rightful owner of the three Deathly Hallows, yet he decides to keep the Cloak only, returning the Elder Wand to Dumbledore's tomb after using it only to repair his own holly wand, and leaving the Resurrection Stone lost in the Forbidden Forest. In the film  Deathly Hallows Part 2 , Harry destroys the Elder Wand, snapping it in half and throwing the pieces off a bridge. \n Madam Rosmerta [ edit ] \n Madam Rosmerta  is the landlady of  The Three Broomsticks  pub. She is described in the books as \"a curvy sort of woman\" with curly hair; several students—including Ron—have a crush on her. In  Prisoner of Azkaban , Madam Rosmerta is angered when  Dementors  are in  Hogsmeade  as their presence is scaring away many of her customers. Apart from hosting an informal meeting between McGonagall,  Cornelius Fudge ,  Filius Flitwick , and Hagrid, she does not play a major role in the early part of the  Harry Potter  series. \n In  Half-Blood Prince  it emerges that in order to fulfil his mission to assassinate Dumbledore, Draco has managed to place Rosmerta under the  Imperius Curse . He uses her to pass on a cursed necklace to Hogwarts student  Katie Bell , who accidentally touches the necklace and is herself subjected to the very harmful curse intended for the Headmaster. Draco also commands her to send a bottle of poisoned mead to  Horace Slughorn  intending it to be a Christmas present for Dumbledore, after overhearing Hermione mentioning that the school security would not recognise something put in a mislabelled bottle, and knowing that a package from Rosmerta would not be checked. Malfoy communicates with Rosmerta through  enchanted fake Galleons . After Harry and Dumbledore's adventure in the cave to retrieve a locket they believe to be one of Voldemort's Horcruxes, they  Apparated  to Hogsmeade, where Madam Rosmerta alerts them to the presence of the  Dark Mark  above the school and gives them brooms on which they can travel rapidly back to Hogwarts, where Draco's plan can be brought to completion. Rosmerta is among those paying respects at Dumbledore's funeral. \n She is named after the  Gaulish goddess   Rosmerta , whose attributes include abundance and fertility. \n Julie Christie  appeared as Madam Rosmerta in the film adaptation of  Harry Potter and the Prisoner of Azkaban . \n Stan Shunpike [ edit ] \n Stan Shunpike  is the young, pimply conductor of the  Knight Bus . He speaks with a  Cockney  accent and talks to Harry as he travels to London in the first part of  Prisoner of Azkaban . He also appears briefly in  Harry Potter and the Goblet of Fire  at the Quidditch World Cup, boasting to a group of Veela, the Bulgarian team's official mascot, of his ambitious plans to become the next Minister of Magic. In  Order of the Phoenix,  he conducts the Knight Bus when Harry, Ron, Hermione, Fred, George, Ginny, Lupin, and Tonks take it to return to Hogwarts after the Christmas holidays. Stan mentions that he does not believe the media rumours about Harry being insane, though Harry interprets Stan's actions as not caring how insane someone is as long as he/she is famous enough to get into the papers. \n In  Harry Potter and the Half-Blood Prince , Stan is arrested on suspicion of Death Eater activity. Harry and Dumbledore, however, believe that he is almost certainly not guilty. Even so, Stan is kept in Azkaban in order for the Ministry of Magic to give the pretence that progress is being made in the capturing of Death Eaters. When the new Minister for Magic asks Harry to be a sort of mascot for the Ministry, Harry refuses on the grounds of the Ministry's actions at the time – namely holding Stan under arrest. In  Deathly Hallows , a \"strangely blank\" looking Stan is among the Death Eaters who pursue Harry during his escape from Privet Drive. Harry gives himself away to his attackers by attempting to only disarm Stan, as Harry believes him to be under the Imperius Curse. Later on, when Harry, Ron and Hermione are captured in the forest by Fenrir Greyback, Ron attempts to pose as Stan only to be immediately disbelieved and told Stan has \"put a bit of work their way\" referring to turning in missing or wanted Muggle-borns. \n Stan was portrayed by  Lee Ingleby  in the film adaptation of  Prisoner of Azkaban . \n Rita Skeeter [ edit ] \n Rita Skeeter  is a reporter for the  Daily Prophet  and a correspondent for the  Witch Weekly , who specialises in  yellow journalism , for which she is armed with such magical devices as the  Quick-Quotes Quill . Rita is an unregistered  Animagus , capable of transforming into a beetle to spy on unsuspecting victims for her stories. As a reporter who fabricates information to write an appealing story, she is a nuisance to Harry and his friends throughout  Goblet of Fire , and a brief but reluctant ally in  Order of the Phoenix . She is described as having curly blonde hair, jewelled spectacles, thick fingers with two-inch long nails painted crimson, a crocodile-skin handbag, and a heavy jawed face. \n Harry first encounters Rita when she interviews the  Triwizard Tournament  contestants for an article in the  Daily Prophet , which turns out to be a highly falsified story on Harry himself. During the situations where Rita overhears information, the book subtly refers to her presence:  Viktor Krum  mentions that Hermione has a water beetle in her hair, and during the Yule Ball, she overhears Hagrid telling  Madame Maxime  that he is half-giant, Harry having noticed a beetle on a nearby statue. During a Divinations class, Harry falls asleep and hears an \"insect clicking.\" Rita prints an article that portrays Hagrid as dangerous, prompting letters from parents frightened by the idea of having a \"ferocious\" giant teach their children. When Rita encounters Harry, Ron, and Hermione in Hogsmeade, Hermione insults her. Rita, in revenge, then writes a nasty story about Hermione based on false rumours provided by  Pansy Parkinson , making her out to be a plain but skilled witch who uses love potions to \"satisfy her taste for celebrity wizards,\" including Harry and Krum. Rita's last defaming article states that Harry is \"disturbed and dangerous,\" and uses comments from Draco and his Slytherin cronies as its basis. Ultimately, Hermione discovers the means by which  Rita Skeeter  spies on others and forces her to \"keep her quill to herself for a full year\", threatening to report her to the authorities as an illegal Animagus. Her last article discredits Harry and serves as the basis for Cornelius Fudge's refusal to believe Harry's story about Voldemort's return. It is also the start of the Ministry's smear campaign against Harry and Dumbledore. [26] \n In  Harry Potter and the Order of the Phoenix  Hermione  blackmails  Rita by threatening to reveal that she is an Animagus and forces her to interview Harry about Voldemort's return. She then must submit her story to  The Quibbler . Rita later makes a brief appearance in  Half-Blood Prince , where Harry is infuriated to notice her clutching a notebook at Dumbledore's funeral. Although Rita does not make an appearance in  Deathly Hallows,  she is mentioned on numerous occasions throughout the novel, generally in a negative light in relation to her unauthorised biography of Dumbledore entitled  The Life and Lies of Albus Dumbledore . The book depicts the former headmaster in an extremely negative light but is mostly based on truth, much to Harry's horror. It is implied that she gained some of her information in unethical or illegal ways. [27] [28]  When asked on a web chat if Rita was still reporting, Rowling answered; \"Naturally, what could stop Rita? I imagine she immediately dashed off a biography of Harry after he defeated Voldemort. One quarter truth to three-quarters rubbish.\" and \" Snape: Scoundrel or Saint? \" [1] \n It has been speculated that the fraught relationship between Rowling and the press was the inspiration for the author to develop the character. However, Rowling noted in 2000 that the character actually predates her rise to fame. [29]  Rita was intended to be in  Philosopher's Stone , as Rowling revealed in an interview: \"you know when Harry walks into the Leaky Cauldron for the first time and everyone says, \"Mr. Potter you're back!\", I wanted to put a journalist in there. She wasn't called Rita then but she was a woman. And then I thought, as I looked at the plot overall, I thought, that's not really where she fits best, she fits best in Four when Harry's supposed to come to terms with his fame.\" [30] \n Miranda Richardson  appeared as Rita in the film adaptation of  Goblet of Fire  as well as in  Deathly Hallows . [31] \n IGN 's Joe Utichi called Rita his eighth favourite  Harry Potter  character, saying that she was \"terrifyingly familiar\". [32] \n Hepzibah Smith [ edit ] \n Hepzibah Smith  is introduced within Dumbledore's  Pensieve , as part of a series of memories shown to Harry by his headmaster probing into Voldemort's past. She is described as having been an extremely wealthy, well-born old witch who enjoyed collecting antiques and collectibles. In the memory, Hepzibah wears long robes and gowns of pink, and when sitting upon her throne-like chair, she is described as giving the impression of a large \"melting iced cake\". She wears a large, elaborate, ginger wig upon her head and dabs her red cheeks with rouge. \n Tom Riddle , fresh out of Hogwarts and working for  Borgin and Burkes , visits Hepzibah to make an offer for some goblin-made armour which she owns. He presents her with flowers and charms and flatters her. Enamoured of Riddle, Hepzibah shows him her most prized possessions – a cup, owned by her ancestor  Helga Hufflepuff , and a locket which once belonged to  Salazar Slytherin , that she had purchased from Borgin and Burkes. Two days after the events of the memory occurred, Hepzibah died, and Hufflepuff's cup and Slytherin's locket were never found. Dumbledore theorises that Riddle had killed Hepzibah and tampered with the memory of her house-elf,  Hokey , so that she falsely thought she had accidentally poisoned her mistress's evening drink. It proves at an early age, that Tom Riddle had a certain thirst for trophies, and other valuable objects that he could collect. Hufflepuff's cup and Slytherin's locket would go on to become two of Voldemort's seven Horcruxes: Tom Riddle's diary, Marvolo Gaunt's ring, Voldemort's pet snake Nagini, Salazar Slytherin's locket, Helga Hufflepuff's cup, Rowena Ravenclaw's Diadem, and albeit inadvertently, Harry Potter. Rowling has confirmed that Hepzibah's death was used by the Dark Lord to create a Horcrux using the cup. [9] \n Andromeda Tonks [ edit ] \n Andromeda Tonks  is the mother of  Nymphadora Tonks . Born Andromeda Black, she is a  pure-blood  witch, daughter of  Cygnus Black and Druella Rosier  and sister of  Bellatrix Lestrange  and  Narcissa Malfoy . The middle sister, she was burned off the family tapestry in  Number 12, Grimmauld Place  by her aunt Walburga and estranged from the family because she married Ted Tonks, a  Muggle-born  wizard. She was  Sirius Black 's favourite cousin. Andromeda is responsible for giving her daughter the name \"Nymphadora\", [33]  a name like those typical of her family. She has a talent for household spells and cleanliness, lacked by her husband and daughter. \n She is not introduced until the beginning of  Harry Potter and the Deathly Hallows . She strongly resembles her sister Bellatrix, so much so that Harry thinks she is Bellatrix upon first meeting her, but Andromeda is kind looking and has soft brown rather than black hair. She and Ted are later tortured for information on Harry's whereabouts. For someone who is not a member of the Order of the Phoenix, the war with Voldemort and his followers exacts a very heavy toll on Andromeda: her husband, her daughter, her son-in-law and her sister are all killed. Rowling stated in an interview that after the war, Andromeda raises  Teddy Lupin , her grandson. She is never seen in the films, though her name can be seen (with her face burnt off) on the Black family tree in  Order of the Phoenix . [1] \n Ted Tonks [ edit ] \n Edward \"Ted\" Tonks  is a Muggle-born wizard who is described as a \"fair-haired, big-bellied man\". He marries Andromeda Black. Their marriage led to his wife's disownment by the rest of her strict pure-blood family. Ted and Andromeda are the parents of Nymphadora Tonks. Ted plays an active role in  Harry Potter and the Deathly Hallows . Near the beginning of the novel, his home is a hideout for Harry and Hagrid, as the two are on the run from Voldemort. His home holds the Portkey that helps Harry escape to  The Burrow . Later due to Ted's refusal to register as a Muggle-born, he is one of the Muggle-born wizards to flee the Ministry's new oppressive regime after the Death Eaters take over. During his flight, he meets the goblins  Griphook  and Gornuk, as well as  Dean Thomas  and  Dirk Cresswell . Soon after, Ted is murdered by Snatchers who also kill Gornuk and Cresswell. [34]  When Nymphadora gives birth to her and Lupin's son, they name him Teddy in honour of her father. \n Oliver Wood [ edit ] \n Oliver Wood  is Captain of the Gryffindor Quidditch team in the first three novels and was first introduced in  Harry Potter and the Philosopher's Stone . He is simply described as being big and burly. Wood is a talented and keen player and a born leader as captain, but also tends to act as a taskmaster due to his obsession with the game; he never cancels practices, poor weather conditions not withstanding, and holds training sessions in early morning hours. Although Oliver is in general a nice person, he lacks tact. Oliver appears briefly in  Goblet of Fire , when he excitedly introduces Harry to his parents at the  Quidditch World Cup  and announces that he joined the Puddlemere United reserve team. He is one of many Hogwarts students, past and present, who take part in the Battle of Hogwarts in  Deathly Hallows , and is among the survivors of the first clash; Harry sees him assisting  Neville Longbottom  in carrying the body of  Colin Creevey . He is four years above Harry in Gryffindor. \n Oliver Wood was portrayed by  Sean Biggerstaff  in the first two films and once again in the eighth film. \n The Muggle Prime Minister  [ edit ] \n The  Prime Minister of the United Kingdom , referred to as  the Muggle Prime Minister  by wizards, receives a visit from  Cornelius Fudge  and  Rufus Scrimgeour  in the opening chapter of  Harry Potter and the Half-Blood Prince . Using a series of flashbacks, Rowling describes how the Prime Minister is aware of the existence of the wizarding world, through several meetings with Fudge that include his first night as Prime Minister, the night in which  Sirius Black  escaped from  Azkaban , the notification of the incident in the  Quidditch  World Cup and the announcement of the importation of dragons and a sphinx for the Triwizard Tournament, and finally the Azkaban mass break-out from the fifth book. Rowling intended to include the Prime Minister scene in earlier books, but she thought that it could not properly fit until the sixth book. [35] \n In the first chapter of  Harry Potter and the Half-Blood Prince , the Prime Minister recalls his day, during which one of his political opponents had been criticising him and his government for several catastrophes that have recently happened in Britain. Readers discover a little later during the discussion with Fudge, that these catastrophes are, in fact, the doings of Voldemort and his followers. He also discovers that he is protected by an  Auror  who now works in his office,  Kingsley Shacklebolt . \n The Weird Sisters [ edit ] \n The Weird Sisters  are a wizards' rock band. Their instruments include guitars, bass, lute, cello, bagpipes and drums. They are booked by Dumbledore to play at Hogwarts during the  Yule Ball . In  Harry Potter and the Goblet of Fire  they are described as \"all extremely hairy and dressed in black robes that had been artfully ripped and torn.\" A full music video of the band playing at the Yule Ball is included as an extended scene on the  Goblet of Fire  film  2-disc DVD. In 2005,  Warner Bros. , the international distributor of  Goblet of Fire  was sued for trademark violations by members of a Canadian  folk-rock  band named  The Wyrd Sisters . [36] [37]  The term  Weird Sisters  is also used in  William Shakespeare 's play  Macbeth  to describe the three witches. \n The members of the band according to  Wizards of the Coast  Famous Wizard cards are: \n Heathcote Barbary – rhythm guitar \n Gideon Crumb – bagpipes \n Kirley Mcormack – lead guitar \n Merton Graves – cello \n Orsino Thruston – drums \n Donaghan Tremlett – bass \n Myron Wagtail – lead singer \n Herman Wintringham – lute \n They appear as a conventional band in the film version  Harry Potter and the Goblet of Fire . The members were: \n Jarvis Cocker  (of  Pulp ) as Myron Wagtail – vocals \n Jonny Greenwood  (of  Radiohead ) as Kirley Mcormack – lead guitar \n Jason Buckle  (of  All Seeing I ) as Heathcote Barbary – rhythm guitar \n Steve Mackey  (of  Pulp ) as Donaghan Tremlett – bass \n Steven Claydon  (of  Add N to (X) ) as Gideon Crumb – keyboards and bagpipes \n Phil Selway  (of  Radiohead ) as Orsino Thruston – drums \n They performed three songs (all composed by Cocker), entitled \"Do the Hippogriff\", \"This Is the Night\" and \"Magic Works\" during the Yule Ball. The band was originally to be played by  Franz Ferdinand . [38] \n Children of the Potter family [ edit ] \n James Sirius Potter [ edit ] \n James Sirius Potter  is the first-born child of Harry and Ginny, born two years before his brother Albus Severus. He was named after his paternal grandfather  James Potter  and his father's godfather  Sirius Black , and he is described as being similar in character to both of his namesakes as well as his uncles,  Fred and George Weasley , with a penchant for practical jokes and general misbehaviour. [HP7]  James is played by Will Dunn in  Harry Potter and the Deathly Hallows – Part 2  and Tom Milligan in  Harry Potter and the Cursed Child . \n Albus Severus Potter [ edit ] \n Albus Severus Potter  is Harry and Ginny's second-born child. He is said to look much like Harry, and is the only one of his siblings to have inherited Lily Potter's green eyes. He is named after Albus Dumbledore and Severus Snape, and would be eleven at the time of the epilogue. Albus is played by  Arthur Bowen  in  Deathly Hallows: Part 2. \n Albus is featured in the two-part  West End  stage play  Harry Potter and the Cursed Child . He is played by Sam Clemmett. \n Lily Luna Potter [ edit ] \n Lily Luna Potter  is the daughter of Harry and Ginny, the youngest of their three children. Her name honors two women important to her parents—her paternal grandmother  Lily Potter , and her parents' good friend  Luna Lovegood . [39]  She is two years younger than her brother Albus Severus, making her around nine, and is close in age to her cousin Hugo. It is also stated that she has her mother's and possibly both of her own grandmothers' red hair. In the epilogue of  Harry Potter and the Deathly Hallows , she accompanied her parents as they escorted James and Albus Potter to Platform 9¾ to the Hogwarts express. \n Lily is played by Daphne de Beistegui in  Deathly Hallows: Part 2 . She is played by several actresses in  Harry Potter and the Cursed Child . \n Children of the Weasleys [ edit ] \n Rose Granger-Weasley [ edit ] \n Rose Granger-Weasley  is Hermione and Ron's daughter and older child. Rose is introduced in the  Harry Potter and the Deathly Hallows  epilogue in which she is leaving for her first year at Hogwarts, as is her cousin Albus Severus Potter. According to Ron she inherited her mother's brains and like her mother, she changes into her Hogwarts robes earlier than necessary. She has a younger brother named Hugo. \n Rose is played by  Helena Barlow  in  Harry Potter and the Deathly Hallows: Part 2 . \n Rose is also in  Harry Potter and the Cursed Child , played by Cherrelle Skeete. \n Hugo Granger-Weasley [ edit ] \n Hugo Granger-Weasley  is Hermione and Ron's son and younger child. He is close in age to Harry and Ginny's daughter and youngest child, Lily Luna Potter, and had not yet started at Hogwarts by the epilogue of  Deathly Hallows . \n Hugo is played by Ryan Turner in  Deathly Hallows: Part 2 . \n Victoire Weasley [ edit ] \n Victoire Weasley  is the eldest child of Bill Weasley and Fleur Delacour and the oldest of the Weasley grandchildren. [40]  She is named after the French word for victory as she was born on the second anniversary of the Battle of Hogwarts. [39]  Victoire herself is only mentioned in the epilogue of  Harry Potter and the Deathly Hallows , where Harry's son James Sirius saw her kissing  Teddy Lupin  and proceeded to tell his family along with Ron, Hermione, Rose and Hugo. \n References [ edit ] \n ^  a   b   c   d   e   f   g   h   \"J.K. Rowling Web Chat Transcript\" .  The Leaky Cauldron . 30 July 2007 . Retrieved  30 July  2007 .   \n ^   Ricks, Hanako (24 March 2011).  \"Deleted scene from deathly hallows shows different side to disliked character\" .  Hollywood News . Retrieved  28 March  2011 .   \n ^   \"Deathly Hallows – Part 1 DVD & Blu-ray\" .  Mugglenet . Retrieved  28 March  2011 .   \n ^   Edward.  \"J. K. Rowling Talks Marriage, Writing and More at Open Book Tour Stop in New York City – The Leaky Cauldron\" . The-leaky-cauldron.org . Retrieved  31 May  2011 .   \n ^   Site design and technology by Lightmaker.com.  \"J.K.Rowling Official Site\" . Jkrowling.com. Archived from  the original  on 30 April 2011 . Retrieved  31 May  2011 .   \n ^   Jackson-Edwards, phoebe (31 July 2015).  \"Not Chubby Dudley Anymore! Harry Melling Is Unrecognisable from His Harry Potter Character in Latest Twitter Photo... after Transforming Just like Neville Longbottom\" . Associated Newspapers Ltd . Retrieved  23 November  2016 .   \n ^   Pottermore \n ^   In  Harry Potter and the Deathly Hallows , Chapter 18, it is revealed that Bathilda Bagshot was sent a copy of  The Life and Lies of Albus Dumbledore  accompanied by a note: \"Dear Batty, Thanks for your help. Here's a copy of the book, hope you like it. You said everything, even if you don't remember it. Rita.\" \n ^  a   b   c   \"Harry Potter at Bloomsbury\" . Bloomsbury.com. Archived from  the original  on 19 July 2009 . Retrieved  31 May  2011 .   \n ^   \"Jamie Waylett won't return for Deathly Hallows\" . SnitchSeeker.com . Retrieved  31 May  2011 .   \n ^   Joshua Herdman & Louis Cordice to reprise Goyle and Zabini roles for Deathly Hallows  – Snitchseeker.com Forums \n ^   \"Rowling dubs Dumbledore of 'Harry Potter' books as gay\" .  Daily News . 19 October 2007 . Retrieved  20 October  2007   \n ^   \"J.K. Rowling outs Hogwarts character\" . Associated Press. 20 October 2007. Archived from  the original  on 21 October 2007 . Retrieved  22 October  2007 .   \n ^   sue.  \"Jamie Campbell Bower Talks Role as Young Grindelwald in Deathly Hallows\" . The-leaky-cauldron.org . Retrieved  31 May  2011 .   \n ^   Harry Potter and the Deathly Hallows: Part 1 (2010) - Full Cast & Crew - IMDb \n ^   Evans, Alan.  \"Johnny Depp to co-star in JK Rowling's Fantastic Beasts sequel\" .  The Guardian . Retrieved  30 November  2016 .   \n ^   \"J.K. Rowling and the Live Chat, Bloomsbury.com, July 30, 2007 (2.00–3.00 pm BST)\" . Retrieved  9 October  2007   \n ^   Rowling, J. K.  (2005).  Harry Potter and the Half-Blood Prince . London:  Bloomsbury /New York City:  Scholastic , et al. UK  ISBN   0-7475-8108-8 /U.S.  ISBN   0-439-78454-9 ., chapter 9 \n ^   \"TIME Person of The Year Runner-up: J.K. Rowling\" .  Time . 23 December 2007 . Retrieved  23 December  2007 .   \n ^   \"Scoop on Filming the 'Deathly Hallows' Wedding Scene\" . Harry Potter Movie Buzz. 28 October 2009 . Retrieved  31 May  2011 .   \n ^   sue.  \"Deathly Hallows Casting Updates: Aunt Muriel Cast, Mafald Hopkirk Recast and Clemence Confirmed!\" . The Leaky Cauldron . Retrieved  31 May  2011 .   \n ^   Rowling, J.K. (October 31, 2017).  \"The secret lives and deaths of the Hogwarts ghosts \" . Pottermore. Retrieved October 31, 2017.  Archived  via the  Internet Archive  October 31, 2017. \n ^   Site design and technology by Lightmaker.com.  \"What houses were Tonks and Myrtle in?\" . Jkrowling.com. Archived from  the original  on 7 June 2011 . Retrieved  31 May  2011 .   \n ^   Shepherd, Jack (12 May 2015).  \"Moaning Myrtle's full name sparks controversy after being revealed by JK Rowling on Twitter\" .  The Independent . Retrieved  12 May  2015 .   \n ^   \"Hogwarts Ghosts - Pottermore\" .  Pottermore . Retrieved  2017-04-25 .   \n ^   Harry Potter and the Goblet of Fire  Chapter 36: The Parting of the Ways. \n ^   Rowling, J. K.  (2007).  Harry Potter and the Deathly Hallows . London:  Bloomsbury /New York City:  Scholastic , et al. UK  ISBN   1-55192-976-7 /U.S.  ISBN   0-545-01022-5 ., chapter 2 \n ^   Rowling, J. K.  (2007).  Harry Potter and the Deathly Hallows . London:  Bloomsbury /New York City:  Scholastic , et al. UK  ISBN   1-55192-976-7 /U.S.  ISBN   0-545-01022-5 ., chapter 18 \n ^   \"About the Books: transcript of J. K. Rowling's live interview on Scholastic.com\" . Archived from  the original  on 15 October 2009.    16 October 2000. Retrieved 30 October 2007. \n ^   Transcript of interview with J.K. Rowling .  BBC Newsround . 2000. Retrieved 25 October 2007. \n ^   \"Miranda Richardson to reprise Rita Skeeter role in Deathly Hallows\" . SnitchSeeker. 23 December 2009 . Retrieved  24 December  2009 .   \n ^   Joe Utichi (3 November 2010).  \"The Top 10 Harry Potter Characters\" .  IGN . Retrieved  3 April  2011 .   \n ^   Rowling, J. K.  (2003).  Harry Potter and the Order of the Phoenix . London:  Bloomsbury /New York City:  Scholastic , et al. UK  ISBN   0-7475-5100-6 /U.S.  ISBN   0-439-35806-X ., Chapter 3 \n ^   Rowling, J. K.  (2007).  Harry Potter and the Deathly Hallows . London:  Bloomsbury /New York City:  Scholastic , et al. UK  ISBN   1-55192-976-7 /U.S.  ISBN   0-545-01022-5 ., Chapter 22 \n ^   J. K. Rowling.  \"The Opening Chapter of Book Six\" . Jkrowling.com. Archived from  the original  on 7 June 2011 . Retrieved  31 May  2011 .   \n ^   \" ' Wyrd Sisters' cannot stop Harry Potter\" . Canadian Broadcasting Corporation. 4 November 2005. Archived from  the original  on 27 May 2007.   \n ^   Canadian Group Sues Radiohead, Warner Bros. Over Use Of Name In 'Harry Potter' Flick  Long-running folk group claims trademark infringement \n ^   Perez, Rodrigo (12 October 2004).  \"Franz Ferdinand To Play Ugly Sisters in Next 'Harry Potter' Flick?\" . MTV . Retrieved  27 January  2008   \n ^  a   b   J.K.Rowling – A Year in the Life; James Runcie; Independent Television (ITV); 2007 \n ^   Brown, Jen (26 July 2007).  \"Exclusive: Finished 'Potter'? Rowling tells what happens next – Wild about Harry – MSNBC.com\" . MSNBC . Retrieved  31 May  2011 .   \n External links [ edit ] \n Fictional characters portal \n The Harry Potter Lexicon's page on the Dursley family \n v \n t \n e \n The  Harry Potter  series by  J. K. Rowling \n Books \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows \n Film series \n Films \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Music \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Related \n Cast members \n Production of  The Deathly Hallows \n Characters \n Main \n Harry Potter \n Ron Weasley \n Hermione Granger \n Lord Voldemort \n Albus Dumbledore \n Severus Snape \n Rubeus Hagrid \n Draco Malfoy \n Supporting \n Hogwarts staff \n Order of the Phoenix \n Dumbledore's Army \n Death Eaters \n Fictional universe \n Hogwarts \n Magic \n Magical creatures \n Magical objects \n Ministry of Magic \n Muggle \n Places \n Potions \n Quidditch \n Related works \n Fantastic Beasts and Where to Find Them \n Quidditch Through the Ages \n The Tales of Beedle the Bard \n Prequel \n Pottermore \n The Cursed Child \n Hogwarts: An Incomplete and Unreliable Guide \n Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists \n Short Stories from Hogwarts of Heroism, Hardship and Dangerous Hobbies \n Games and toys \n Quidditch World Cup \n Lego Creator: Harry Potter \n Lego Harry Potter: Years 1–4 \n Lego Harry Potter: Years 5–7 \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Book of Spells \n Book of Potions \n Trading Card Game \n Lego  Harry Potter \n Attractions \n The Wizarding World of Harry Potter \n Orlando \n Japan \n Hollywood \n Dragon Challenge \n Flight of the Hippogriff \n Harry Potter and the Escape from Gringotts \n Harry Potter and the Forbidden Journey \n Hogwarts Express \n Harry Potter Movie Magic Experience \n Warner Bros. Studio Tour London \n Fandom \n Harry Potter Alliance \n The Leaky Cauldron \n MuggleNet \n LeakyCon \n Wizard rock \n Wrockstock \n Voldemort: Origins of the Heir \n Related \n Influences and analogues \n Legal disputes \n Parodies \n Politics \n Religious debates \n Translation \n A Very Potter Musical \n The Harry Potter Lexicon \n The Magical Worlds of Harry Potter \n Potter Puppet Pals \n   Book \n   Category \n   Portal \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=List_of_supporting_Harry_Potter_characters&oldid=811634562#Garrick_Ollivander \"\t\t\t\t\t \n Categories :  Harry Potter characters Lists of literary characters Lists of minor fictional characters Hidden categories:  Articles with inconsistent citation formats Use dmy dates from November 2013 Use British English from August 2013   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Català Čeština Dansk Eesti Ελληνικά Emiliàn e rumagnòl Español Euskara فارسی Français Italiano עברית Lietuvių Norsk Polski Русский Svenska Türkçe Tiếng Việt   \n Edit links   \n  This page was last edited on 22 November 2017, at 22:13. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}