{"url": "https://www.seao.ca/Information/avislegaux.aspx", "content": "SEAO : Conditions d'utilisation\r\n Exploité par CGI en partenariat avec  \n Constructo \n  pour le Secrétariat du Conseil du trésor du Québec. \n Rechercher un avis \n Recherche avancée \n Ouvrir une session \n English \n Avis du jour \n Abonnements \n Service à la clientèle \n Aide \n Recherche avancée \n                                      Panier \n                                      À propos de SEAO \n                                      Info sur Constructo \n                                      Conditions d'utilisation \n                                      Polices supportées \n Conditions d'utilisation \n IMPORTANT  : LES CONDITIONS SUIVANTES RÉGISSENT L'UTILISATION DES SITES INTERNET  «SEAO.CA» ET «CONSTRUCTO.CA». (INDIVIDUELLEMENT LE « SITE » OU COLLECTIVEMENT LES «SITES») AINSI QUE DU SYSTÈME ÉLECTRONIQUE D'APPEL D'OFFRES (LE « SEAO » TEL QUE PLUS AMPLEMENT DÉFINI CI-APRÈS) LEQUEL EST DISPONIBLE PAR L’ENTREMISE DU SITE. EN ACCÉDANT AU SITE VOUS CONFIRMEZ AVOIR LU, COMPRIS ET ACCEPTÉ LES CONDITIONS D’UTILISATION ÉNONCÉES CI-APRÈS. \n   \n NOTE : Les conditions d’utilisation qui suivent ne s’appliquent pas aux organismes publics. Les conditions d’utilisation applicables aux organismes publics qui utilisent le Site sont accessibles lorsque l’utilisateur s’est authentifié au Site comme organisme public. \n   \n 1.        Définitions \n   \n 1.1 « Addenda » \r\n(également appelé mise à jour ou amendement) Désigne un document qui précise ou modifie le contenu d’un Avis émis par un Organisme public après la publication de l'Avis en question mais avant sa fermeture. Les Addendas sont disponibles sur le SEAO pour consultation dès leur publication.\r\n   \n 1.2 « Avis » \r\nDésigne un sommaire de l'information relative à un marché public émis par un Organisme public. Pour les fins des présentes conditions d’utilisation, le terme « Avis » désigne, sans s’y restreindre, l’un ou l’autre des avis suivants selon les circonstances : \r\n Avis d’appel d’offres (public ou sur invitation) : Avis utilisé par un Organisme public pour solliciter des soumissions en vue de l’adjudication d’un contrat; \n Avis d’appel d’intérêt : Avis utilisé par un Organisme public pour explorer un nouveau marché public en vue d’obtenir des informations des fournisseurs à cet égard; \n Avis de qualification de prestataires de services :Avis utilisé par un Organisme public pour constituer une liste de fournisseurs suite à un processus de qualification qui seront par la suite invités à présenter une soumission dans le cadre d’un appel d’offres qui leur sera réservé;  \n Avis de qualification d’entrepreneurs : Avis utilisé par un Organisme public pour constituer une liste d’entrepreneurs préalablement à la conclusion de contrats de travaux de construction relatifs aux infrastructures de transports; \n Avis d’homologation de produits (Approvisionnement) : Avis utilisé par un Organisme public visant à faire homologuer un produit selon les spécifications énoncées à l’avis en vue de limiter par la suite d’éventuels appels d'offres aux fournisseurs offrant le ou les produits homologués. \n   \n 1.3 « Document (ou Document d’appel d’offres) » \r\nDésigne l’ensemble des documents publiés par un Organisme public et rattachés à un Avis.\r\n   \n 1.4   « Organisme public (ou Donneur d’ouvrage) » \r\nDésigne :\r\n les ministères et les organismes publics de l’Administration gouvernementale, visés aux paragraphes 1 à 4 du premier alinéa de l’article 4 de la Loi sur les contrats des organismes publics (la « LCOP »); \n les organismes du réseau de l’éducation, comprenant notamment les commissions scolaires, les cegeps et les universités, visés au paragraphe 5 du premier alinéa de l’article 4 de la LCOP; \n les organismes du réseau de la santé et des services sociaux, incluant notamment les centres hospitaliers, les Centres d’hébergement et de soins de longue durée (CHSLD), les Centres locaux de services communautaires (CLSC), les agences de la santé et des services sociaux, visés au paragraphe 6 du premier alinéa de l’article 4 de la LCOP; \n les municipalités et les autres organismes municipaux. \nD’autres organismes peuvent utiliser le SEAO, selon les conditions prévues. Il s’agit notamment des organismes publics visés à l’article 7 de la LCOP (sociétés d’État à vocation commerciale ou industrielle et autres organismes publics), d’organismes à but non lucratif (OBNL), de coopératives et autres entreprises privées. \r\n   \n 1.5 « Exploitant du SEAO » \r\nDésigne Conseillers en gestion et informatique CGI inc. (« CGI ») qui est responsable de l'exploitation du SEAO en partenariat avec Media Transcontinental s.e.n.c. (« Médias Transcontinental »), conformément aux conditions du contrat qui lie CGI et le Secrétariat du Conseil du trésor (le « SCT »). \r\n   \n 1.6 « Fournisseur »  \r\nDésigne toute entreprise pouvant agir à titre de contractant pour la conclusion d’un contrat avec un Organisme public. Pour les fins des présentes, ce terme désigne toute personne ou une entité qui s’est enregistrée au SEAO à titre de « Fournisseur abonné » ou inscrit à titre de « Fournisseur non abonné ». \r\n   \n 1.7 « Gestionnaire de contrat » \r\nDésigne le (la) secrétaire associé(e) aux marchés publics du STC et qui agit à titre de gestionnaire du contrat qui lie le SCT et CGI. Le Gestionnaire de contrat est chargé de coordonner la mise en place du SEAO, d’en assurer le suivi et de faire procéder aux ajustements, si nécessaire. \r\n   \n 1.8 « Information » \r\nDésigne toute information, logiciel et autre matériel rendu disponible aux Utilisateurs par l’entrequant à lamise du SEAO, incluant le contenu des Avis, des Documents d'appel d'offres et de tous autres documents et avis que les Organismes publics diffusent par l’entremise du SEAO. \r\n   \n 1.9 « Jumelage d'avis » \r\nDésigne la fonctionnalité du SEAO qui permet aux fournisseurs qui le désirent de configurer et de maintenir un profil de recherche qui repère et transmet, par courriel, SMS ou télécopieur, les Avis correspondant à différents critères prédéterminés. \r\n   \n 1.10 « Mode de distribution » \r\nDésigne le mode par lequel les Fournisseurs prennent livraison des Documents d’appel d’offres. Il peut s’agir de téléchargement, d’auto-cueillette, de messagerie, de courriel ou de télécopie. \r\n   \n 1.11 « SEAO » \r\nDésigne le système électronique d'appel d'offres du gouvernement du Québec exploité par CGI en partenariat avec Médias Transcontinental. Le SEAO est accessible par Internet à l’adresse « seao.ca ». Le SEAO rassemble les différents Avis émis par les Organismes publics. Les Fournisseurs intéressés par les marchés visés par ces Avis peuvent utiliser le SEAO afin d’y consulter les Avis et acheter les Documents d’appel d’offres y afférents.  \r\n   \n 1.12 « Soumission » \r\nDésigne une offre présentée par un soumissionnaire en réponse à un Avis et transmise avant la date et heure limite de réception des offres publiées dans l’Avis.\r\n   \n 1.13 « Utilisateur » \r\nDésigne toute personne ou entité, autre qu’un Organisme public, qui accède au SEAO dans le but de consulter un Avis, de commander des Documents d’appel d’offres, de prendre connaissance des résultats de l’ouverture publique de soumissions ou de l’adjudication d’un contrat ou, d’utiliser tout autre service offert par l’entremise du SEAO. Il peut s’agir d’un Fournisseur ou de toute autre personne intéressée qui n’est pas enregistrée ou inscrite au SEAO à titre de Fournisseur ou de Fournisseur non abonné. \r\n   \n   \n 2. Fournisseur abonné \n   \n 2.1 \r\nEn vous abonnant au SEAO à titre de « Fournisseur abonné », vous acceptez de payer le tarif mensuel d'abonnement selon les modalités de paiement applicables. Le tarif applicable vous sera facturé d’avance chaque mois à la date anniversaire de votre abonnement. Il est entendu que votre abonnement se renouvelle automatiquement à chaque mois, de mois en mois, jusqu’à ce que vous y mettiez fin conformément aux dispositions de l’article 11.2 des présentes ou, jusqu’à ce que l’Exploitant du SEAO y mette fin conformément aux dispositions de l’article 2.6, de l’article 7.2 ou de l’article 11.1 des présentes. Le tarif payé pour le mois au cours duquel votre abonnement prend fin n’est pas remboursable.\r\n   \n 2.2 \r\nVous acceptez également de payer tous les frais et tarifs relatifs aux services offerts par l’entremise du SEAO dont vous vous êtes prévalus. La grille des tarifs applicables à ces services est disponible sur l’un ou l’autre des Sites. \r\n   \n 2.3 \r\nVous autorisez l’Exploitant du SEAO à porter au compte de votre carte de crédit valide AMEX, MasterCard ou Visa tous les frais applicables à votre utilisation du SEAO dès le moment où ils sont dus.\r\n   \n 2.4 \r\nDans la mesure où l’Exploitant du SEAO vous a autorisé à effectuer vos paiements par chèque, vous vous engagez à effectuer tout paiement requis sur réception de votre état de compte. \r\n   \n 2.5  \r\nLes sommes en souffrance portent intérêt au taux de 1,5 % par mois (équivalant à 18 % par année) à compter de la première date d’arriéré jusqu’au plein paiement des sommes en souffrance. Vous comprenez également que l’Exploitant du SEAO pourra appliquer une surcharge pour tout paiement effectué par chèque dans l’éventualité où ce chèque est fait sans provision. \r\n   \n 2.6 \t\r\nVous reconnaissez que l’Exploitant du SEAO peut, à sa discrétion, mettre fin à votre abonnement ou suspendre votre accès au SEAO pour raison de non-paiement. Ceci inclut l'interruption, le cas échéant, de l’acheminement des Documents d’appel d’offres commandés par vous.\r\n   \n 2.7  \r\nVous comprenez que l’Exploitant du SEAO pourra, à sa discrétion et sous réserve de l'autorisation préalable du Gestionnaire de contrat, modifier les frais et tarifs applicables aux différents services disponibles par l’entremise du SEAO. Dans l’éventualité d’une telle modification, ceux-ci seront reflétés dans la grille tarifaire disponible sur le Site.\r\n   \n   \n 3. Fournisseur non abonné \n   \n 3.1 \r\nÀ titre de Fournisseur non abonné, vous acceptez de payer à l'avance, au moyen d'une carte de crédit valide AMEX, MasterCard ou Visa, les frais et tarifs applicables à toute commande de Documents. La grille des tarifs applicables est disponible sur l’un ou l’autre des Sites.\r\n   \n   \n 4. Commande de Documents \n   \n 4.1 \r\nLes Documents commandés par un Fournisseur sont à la charge de ce Fournisseur et incluent les Addendas émis par l’Organisme public à la date où le Fournisseur a commandé les Documents. Par contre les Addendas émis par l’Organisme public après la date où le Fournisseur a commandé les Documents sont à la charge de l’Organisme public qui les a émis.\r\n   \n 4.2  \r\nVous comprenez que les commandes de Documents placées auprès de l’Exploitant du SEAO sont finales et non remboursables. \r\n   \n 4.3   \r\nDans l’éventualité où un appel d'offres publié par un Organisme public sur SEAO est annulé avant la date de réception des offres, vous devez vous adresser directement à l’Organisme public en question afin d’obtenir le remboursement du montant défrayé auprès du SEAO pour l'achat de documents relatifs à cet appel d’offres.\r\n   \n   \n 5. Service à la Clientèle \n   \n   \r\nLes Utilisateurs qui le désirent peuvent recevoir l'assistance du service à la clientèle du SEAO du lundi au vendredi entre 8 h 30 à 17 h 00 par téléphone au (514) 856-6600 ou au 1-866-669-SEAO (1-866-669-7326) ou par l’entremise du système de messagerie disponible sur l’un ou l’autre des Sites.\r\n   \n   \n 6. Propriété et utilisation de l'Information \n   \n   \r\nLes droits d’auteur relatifs au contenu des Sites (seao.ca et constructo.ca) incluant sans s’y restreindre les écrans et leur présentation, appartiennent à CGI et Médias Transcontinental. Toutefois, les droits d'auteur relatifs au contenu des Avis, Documents et autres avis publiés sur ces Sites par un Organisme public appartiennent à l’Organisme public qui les a émis. Sauf pour les fins de réponse à un appel d'offres, il est interdit reproduire (en tout ou en partie), adapter, publier, communiquer ou vendre le contenu de l’un ou l’autre des Sites (incluant les Avis, Documents et autres avis qui y sont  publiés) par quelque moyen que ce soit sans avoir préalablement obtenu l'autorisation écrite de CGI, Médias Transcontinental et, le cas échéant, de l’Organisme public concerné. Dans l’éventualité où vous obtenez cette autorisation, une mention de la source doit être indiquée sur le matériel copié ou publié. Pour obtenir de plus amples renseignements sur l'utilisation autorisée ou la permission de reproduire ou publier du matériel provenant de l’un ou l’autre des Sites, adressez-vous au Service à la Clientèle du SEAO, Direction générale, 5800, Rue Saint-Denis, bureau 900, Montréal (Québec) H2S 3L5. Toute violation des droits sera passible de poursuites. CGI et Médias Transcontinental déclinent toute responsabilité quant aux conséquences pouvant découler de la reproduction ou de l'utilisation non autorisée des informations publiées sur l’un ou l’autre des Sites. Nonobstant ce qui précède, les données publiées sur l’un ou l’autre des Sites peuvent être rendues disponibles à tout organisme luttant contre la corruption, la collusion, l’évasion fiscale ou le travail au noir, lequel peut dès lors utiliser ces données à ces fins. À la demande du Gestionnaire de contrat, les données publiées sur l’un ou l’autre des Sites pourront également être rendues disponibles électroniquement sur le site des données ouvertes du Gouvernement du Québec. \r\n   \n   \n 7. Confidentialité et Sécurité \n   \n 7.1 \r\nVous reconnaissez que l’Exploitant du SEAO ne peut garantir la confidentialité ni l'authenticité de toute l'information que vous transmettez ou recevez via Internet. Vous comprenez que l’Exploitant du SEAO ne sera en aucun cas tenu responsable de quelque dommage que ce soit que vous puissiez subir résultant, directement ou indirectement, de la transmission par vous d'information confidentielle à l’Exploitant du SEAO par Internet ou par courriel ou, de  la transmission par Internet ou par courriel par l’Exploitant du SEAO de telle information confidentielle à votre demande.\r\n   \n 7.2  \r\nVous vous engagez à ne pas dévoiler le mot de passe qui vous donne accès au SEAO à quelque tierce partie que ce soit. Vous reconnaissez que vous êtes seul responsable de l'utilisation de votre mot de passe et vous vous engagez à prendre les mesures nécessaires afin d’en sauvegarder la confidentialité. Vous vous engagez à aviser immédiatement l’Exploitant du SEAO par l’entremise du service à la clientèle, de toute utilisation non autorisée de votre mot de passe. Vous comprenez que l’Exploitant du SEAO peut suspendre ou mettre fin à votre droit d’utilisation du SEAO dans l’éventualité où vous négligez de vous conformer à ce qui précède.\r\n   \n 7.3  \r\nDans la mesure où l’un ou l’autre des Sites comporte des liens vers d'autres sites Internet, vous comprenez que de tels liens n'impliquent aucune forme d’endossement ou d’approbation de ces sites de la part de l’Exploitant du SEAO.\r\n   \n   \n 8. Informations relatives aux Utilisateurs \n   \n   \r\nVous autorisez l’Exploitant du SEAO à rendre disponible aux autres Utilisateurs du SEAO certaines informations vous concernant, incluant votre nom ou le nom de votre entreprise, lorsque celles-ci sont rendues publiques conformément à la réglementation en vigueur, par exemple, pour la divulgation des noms de soumissionnaires et de contractants (les « Informations Publiées »). Vous acceptez également que les Informations Publiées soient rendues disponibles électroniquement en format ouvert sur le site des données ouvertes du Gouvernement du Québec. Toutefois, les informations vous concernant, autre que les Informations Publiées, ne seront  en aucun cas transmise à une tierce partie à des fins de listes d'envois postaux ou pour tout autre motif non relié à votre utilisation du SEAO, sauf à tout organisme luttant contre la corruption, la collusion, l’évasion fiscale ou le travail au noir, lequel peut dès lors utiliser ces informations à ces fins. \r\n   \n   \n 9. Changement d'adresse \n   \n   \r\nVous êtes responsable de l’exactitude des informations vous concernant notamment en ce qui concerne toute adresse de livraison ou de facturation, numéro de télécopieur ou adresse courriel fournis à l’Exploitant du SEAO pour fins de livraison de services (« Coordonnées »). Vous êtes également responsable d’aviser l’Exploitant du SEAO de tout changement à vos Coordonnées. Pour ce faire vous pouvez communiquer avec l’Exploitant du SEAO par l’entremise du Site SEAO (seao.ca), par courrier postal, par télécopieur ou par téléphone en appelant au service à la clientèle du SEAO. En aucun cas l’Exploitant du SEAO ne sera tenu responsable de dommages résultant, directement ou indirectement, de la transmission de Coordonnées inexactes ou de toute omission de votre part d’informer l’Exploitant du SEAO d’un changement à vos Coordonnées.\r\n   \n   \n 10. Modifications des conditions d’utilisation \n   \n   \r\nVous reconnaissez que l’Exploitant du SEAO peut à sa seule discrétion sous réserve de l'autorisation préalable du Gestionnaire de contrat, modifier les présentes conditions d’utilisation. \r\n   \n   \n 11. Fin de l’entente \n   \n 11.1 \r\nL’Exploitant du SEAO peut suspendre ou mettre fin à votre droit d’utilisation du SEAO conformément aux dispositions de l’article 2.6 ou de l’article 7.2 des présentes, selon le cas, ou pour tout autre motif raisonnable.\r\n   \n 11.2  \r\nVous pouvez, à tout moment, mettre fin à votre abonnement ou inscription, en communiquant avec le service à la clientèle du SEAO par téléphone au (514) 856-6600 ou au 1-866-669-SEAO (1-866-669-7326) ou l’entremise du système de messagerie disponible sur l’un ou l’autre des Sites. Vous comprenez que, dès lors que vous mettez fin à votre abonnement ou à votre inscription, votre mot de passe expirera et vous ne recevrez plus de Documents.  \r\n   \n 11.3   \r\nLa suspension ou la fin de votre abonnement ou inscription pour quelque motif que ce soit, ne vous dégage pas de vos obligations de paiement relatives à votre utilisation du SEAO.  Vous convenez que les articles 6 (Propriété et utilisation de l'information), 7 (Confidentialité et Sécurité), 8 (Informations relatives aux Utilisateurs), 12 (Limite de responsabilité) et 13 (Lois applicables) des présentes conditions d’utilisation demeureront en vigueur après la fin de l'entente.\r\n   \n   \n 12. Limite de responsabilité \n   \n 12.1 \r\nVous reconnaissez que CGI et Médias Transcontinental n'assument aucune responsabilité quant à l'exactitude, la totalité et l'opportunité du contenu des Documents émis par un Organisme public.\r\n   \n 12.2  \r\nVous reconnaissez que les Documents d’appel d’offres rendus disponibles électroniquement sur l’un ou l’autre des Sites sont les seuls Documents d’appel d’offres à avoir valeur officielle (la « Version Électronique »). La version papier des Documents d’appel d’offres offerts par l’entremise du SEAO  vous est offerte pour votre commodité et n’a pas valeur officielle (la « Version Papier »). En cas de disparité entre le contenu de la Version Électronique d’un Document d’appel d’offres et le contenu de sa Version Papier, c’est le contenu de la Version Électronique qui prime. \r\n   \n 12.3  \r\nVous comprenez que des circonstances pourraient survenir vous donnant droit à des dommages-intérêts et vous convenez que, dans ces circonstances, vos recours et la responsabilité de CGI et de Médias Transcontinental, qu’elle soit contractuelle ou extra-contractuelle, seront limités comme il est énoncé ci-après, et que ces dispositions s’appliqueront malgré votre choix de résilier votre abonnement au SEAO.\r\n   \n   \r\nVOTRE RECOURS EXCLUSIF SERA DE RECEVOIR PAIEMENT DE CGI ET DE MÉDIAS TRANSCONTINENTAL POUR VOS DOMMAGES DIRECTS CAUSÉS PAR TOUTE ACTION, OMISSION OU NÉGLIGENCE DANS LA FOURNITURE DES SERVICES OU RÉSULTANT DE TOUT RETARD OU OMISSION À LES FOURNIR, JUSQU’À CONCURRENCE D’UN MONTANT MAXIMAL QUI SOIT ÉGAL AU TARIF PAYÉ PAR VOUS POUR L’UTILISATION DU SERVICE À L’ÉGARD DE L’AVIS À L’ORIGINE DE VOTRE RÉCLAMATION.\r\n   \n   \r\nEn aucun cas les dommages ne comprendront les dommages spéciaux, indirects, punitifs, exemplaires, incidents ou accessoires ainsi que toute perte de revenus ou de profits, ou le défaut de réaliser les économies projetées ou des dommages réclamés à votre encontre par toute autre partie. CGI et Médias Transcontinental ne seront pas tenues responsables de ces dommages, même si CGI et/ou Médias Transcontinental ont été avisées dans tous les cas de la possibilité de leur survenance.\r\n   \n 12.4  \r\nEn aucun cas CGI et Médias Transcontinental, leurs administrateurs, leurs dirigeants, leurs employés, leurs agents ou leurs sous-traitants , ne seront tenus responsables pour des dommages, directs, indirects, spéciaux, indirects, punitifs, exemplaires, incidents ou accessoires, même si CGI et/ou Médias Transcontinental en ont été avisées ou même si elles avaient pu prévoir de tels dommages, découlant de la transmission, de l'utilisation ou de la fiabilité d’une Version Papier des Documents d’appel d’offres rendus disponibles par l’entremise du SEAO en vertu des présentes.\r\n   \n 12.5  \r\nVous vous engagez à indemniser CGI et Médias Transcontinental ainsi que leurs administrateurs, dirigeants, employés, agents ou sous-traitants respectifs, pour tout dommage, perte, frais, dépense, responsabilité ou réclamation reçu, engagé ou fait contre CGI et Médias Transcontinental découlant de votre défaut de vous conformer aux termes des présentes conditions d’utilisation, d'une fraude, d'une fausse représentation, d'une négligence de votre part dans le cadre de la réalisation de cette entente. \r\n   \n   \n 13. Lois applicables \n   \n   \r\nLes présentes sont régies par les lois de la Province de Québec.\r\n   \n   \n 14. Force majeure \n   \n   « Force majeure » \r\nsignifie un événement empêchant l’Exploitant du Service d’exécuter le Service, lequel est indépendant de la volonté de l’Exploitant du Service et se produit sans la faute ou la négligence de l’Exploitant du Service, et lequel n’aurait pu avoir été raisonnablement prévu ou empêché par des mesures raisonnables, tels que, sans limiter la généralité de ce qui précède, les cas fortuits ou actes d’un ennemi public, les guerres civiles, les insurrections ou les émeutes, les actes de guerre, les actes d’un gouvernement, les actes de terrorisme, les incendies, les inondations, les tempêtes, les explosions, les tremblements de terre ou les accidents, les intempéries particulièrement graves, les épidémies ou les mises en quarantaine, les grèves ou les conflits de travail causant la cessation, le ralentissement ou l’interruption des travaux, les pannes ou les fluctuations de courant électrique, de chauffage, d’éclairage, de climatisation de réseau ou d’équipement de télécommunications, ou tout autre événement semblable, ou un tout événement mentionné ci-dessus empêchant un sous-traitant d’exécuter ses obligations en vertu d’un contrat de sous-traitance.\r\n   \n   \n 15. Ententes antérieures \n   \n   \r\nLes présentes conditions d’utilisation annulent et remplacent toutes versions précédentes de celles-ci à compter de la date de dernière mise à jour.\r\n   \nDate de dernière mise à jour : 2 novembre 2015\r\n Le site officiel des appels d’offres du Gouvernement du Québec. \n Les avis publiés sur le site proviennent des ministères et organismes publics, des municipalités, des organisations des réseaux de la santé et des services sociaux ainsi que de l’éducation. \n Besoin d'aide? \n Aide en ligne \n Glossaire \n Plan du site \n Accessibilité \n UPAC-Signaler un acte répréhensible \n Service clientèle \n Grille des tarifs \n Contactez-nous \n Nouvelles \n Marchés publics hors Québec \n Registre des entreprises non admissibles \n                            Autorité des marchés financiers\r\n À propos \n À propos de SEAO \n Info sur Constructo \n Conditions d’utilisation \n Polices supportées \n Partenaires \n © 2003-2017 Tous droits réservés"}