{"url": "http://ev.buaa.edu.cn/info/1035/1640.htm", "content": "Beihang Joins Sino-Russian Comprehensive University Alliance-BEIHANG \n About BUAA \n Overview \n President's Welcome \n BUAA Today \n Current Leaders \n Administration \n Statistics \n Maps \n Admission \n Why BUAA \n Undergraduate \n Graduate \n Chinese Training \n International Education \n Exchange Program \n Scholarship \n Research \n NLAA \n IRI \n Labs & Centers \n Key Disciplines \n News & Events \n News \n Events \n Campus Life \n General Information \n Campus Map \n Alumni \n Alumni \n Donate \n Share To \n   中文版 \n                                                News\r\n Beihang Joins Sino-Russian Comprehensive University Alliance \n Release time：September 29, 2017  /  Mingzhu Li  \n The opening ceremony of the Sino-Russian Comprehensive University Alliance and  Sino-Russian University Presidents’ Forum was held in Shenzhen on September 13th. At the ceremony, Haijun Huang, Vice President of Beihang University, signed the regulations of the alliance, which formally began Beihang’s membership in it. \n    \n Guided by the Russia-China comprehensive strategic partnership, the alliance set the following goals: deepening the systematic exchange and cooperation between universities from both sides, building a platform for information exchange, working on the integration of the teaching and research of basic disciplines and the mutual recognition of diplomas, establishing unified standards in teaching content and requirements, supporting the development and popularization of Chinese and Russian cultures and languages, and facilitating the mutual learning and improvement in strategic development, teaching and research and international cooperation. At present, it has 40 Chinese members and 20 Russian members. \n    \n    \n Written by Lingpei Wang \n  Edited by Qing Wang \n  Translated by Mingzhu Li \n    \n    \n September 28, 2017 \n Professor Wenfei Fan was Honored Membership of Academia Europaea"}