{"url": "https://m.wikihow.com/Work-With-PDF-Files", "content": "How to Work With PDF Files (with Pictures) - wikiHow \n Home Random Browse Articles Notifications Add to This Page Add Tip Easy Ways to Help Approve Questions Review Tech Feedback Fix Spelling More Things to Try...   \n Log in / Sign up   \n Desktop Site   \n Talk How to Work With PDF Files   \n The file extension .pdf (Portable Document Format), developed by Adobe Systems, is a common format for digital documents. The format is widely used because of its broad compatibility and flexible feature set. While some simple actions like viewing, merging, and digital signing of pdf files is possible with free software, more complex editing will require the purchase of Adobe Acrobat. This guide will cover some of the more basic use cases for reading, creating, and editing .pdf files. \n Steps Edit \n Part One of Four: Creating and Editing PDF Files Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/05\\/Work-With-PDF-Files-Step-1-Version-3.jpg\\/v4-460px-Work-With-PDF-Files-Step-1-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/05\\/Work-With-PDF-Files-Step-1-Version-3.jpg\\/v4-760px-Work-With-PDF-Files-Step-1-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Determine how you will be using PDF files.  For complex editing and manipulation of PDF files, you will need to purchase Adobe Acrobat. If you just want to be able to open or export existing files as PDF files, then there are free options.\n Acrobat Reader, Foxit Reader, or Windows Reader App are a few free options for viewing .pdf files. \n You can create a document in a word processor like Word, or Google Docs and save it as .pdf file, but further manipulation of that PDF will not be possible without Acrobat. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/0b\\/Work-With-PDF-Files-Step-2-Version-3.jpg\\/v4-460px-Work-With-PDF-Files-Step-2-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/0b\\/Work-With-PDF-Files-Step-2-Version-3.jpg\\/v4-760px-Work-With-PDF-Files-Step-2-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Create a PDF file from an existing file.  Open Adobe Acrobat and press  Tools > Create PDF . This is where you start when importing files to turn into a PDF or starting a new PDF from scratch.\n There are a number of import options to choose from, including importing a single or multiple files, a scanned file, a webpage, or the contents of your clipboard.\n Adobe limits its file support to Microsoft Office (2007 and later) or OpenOffice filetypes, as well as basic text (.txt, .rtf), image files, or other adobe products. \n Selecting a file will create a PDF copy of that file in the same location on your computer as the original file. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c5\\/Work-With-PDF-Files-Step-3-Version-3.jpg\\/v4-460px-Work-With-PDF-Files-Step-3-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c5\\/Work-With-PDF-Files-Step-3-Version-3.jpg\\/v4-760px-Work-With-PDF-Files-Step-3-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Edit text in the imported file.  With the file now opened, press “Edit PDF” and select a highlighted box of text. You can either type out the changes you want or utilize the options in the Format section.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4f\\/Work-With-PDF-Files-Step-4-Version-3.jpg\\/v4-460px-Work-With-PDF-Files-Step-4-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4f\\/Work-With-PDF-Files-Step-4-Version-3.jpg\\/v4-760px-Work-With-PDF-Files-Step-4-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Edit images in the imported file.  Press “Edit PDF” and select any highlighted image. Use the options in the Objects section to manipulate the image.\n Advertisement \n Part Two of Four: Reorganizing PDF Files in Adobe Acrobat Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4b\\/Work-With-PDF-Files-Step-5-Version-3.jpg\\/v4-460px-Work-With-PDF-Files-Step-5-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4b\\/Work-With-PDF-Files-Step-5-Version-3.jpg\\/v4-760px-Work-With-PDF-Files-Step-5-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Choose a document to reorganize.  Open a PDF file in Acrobat and press “Organize Pages” in the right-hand panel. The interface will change to display thumbnail previews of all pages. A new toolbar appears with a number of options: “Rotate”, “Delete”, “Extract”, “Insert”, “Replace”.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/cc\\/Work-With-PDF-Files-Step-6.jpg\\/v4-460px-Work-With-PDF-Files-Step-6.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/cc\\/Work-With-PDF-Files-Step-6.jpg\\/v4-760px-Work-With-PDF-Files-Step-6.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Rotate a page.  Select the thumbnail of the desired page and press either the “Rotate Left” or “Rotate Right” arrow buttons to rotate the page 90 degrees.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/71\\/Work-With-PDF-Files-Step-7.jpg\\/v4-460px-Work-With-PDF-Files-Step-7.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/71\\/Work-With-PDF-Files-Step-7.jpg\\/v4-760px-Work-With-PDF-Files-Step-7.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Delete an unwanted Page.  Select the thumbnail of the desired page and press the “Delete” (Trashcan icon) and press “OK” to confirm.\n You can select multiple pages to delete at once with  Ctrl  + Click ( ⌘  Cmd  + Click on Mac). \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Work-With-PDF-Files-Step-8.jpg\\/v4-460px-Work-With-PDF-Files-Step-8.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Work-With-PDF-Files-Step-8.jpg\\/v4-760px-Work-With-PDF-Files-Step-8.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Insert a new page.  Pressing the Insert tool reveals a menu with options similar to new PDF creation: “Insert from File”, “Webpage”, “Scanner”, “Clipboard”, or “Blank Page”. Any selection will add the new page to the end of the document.\n This menu can also be accessed from the “+” button next to any of the page thumbnails. This method will insert the new page in this location. \n You may insert any filetype supported by Acrobat. It will be integrated into the .pdf like importing any other file. \n Free users can still merge PDF files using a variety of online services. Typically the process involves uploading each file to the site, selecting the order, and downloading the merged file.\n In this case, usually all of the files must already be in the PDF format in order to be merged. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7c\\/Work-With-PDF-Files-Step-9.jpg\\/v4-460px-Work-With-PDF-Files-Step-9.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7c\\/Work-With-PDF-Files-Step-9.jpg\\/v4-760px-Work-With-PDF-Files-Step-9.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Replace an existing page.  Click the thumbnail of the page you want to replace and press the “Replace” button. Browse to the location of the desired replacement page, select it, and press \"OK\" to confirm the page replacement.\n Multiple pages can be replaced with your page selection by selecting a page range from the box prior to confirmation. \n Note, the replacement page must be an Acrobat supported filetype. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c1\\/Work-With-PDF-Files-Step-10.jpg\\/v4-460px-Work-With-PDF-Files-Step-10.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c1\\/Work-With-PDF-Files-Step-10.jpg\\/v4-760px-Work-With-PDF-Files-Step-10.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Rearrange the pages.  Select the thumbnail(s) of the page(s) you want to move and simply drag and drop them to the preferred location in the PDF. A blue line will indicate the area that you have selected to place them before dropping them.\n You can also select specific page ranges, or other options like all even/odd pages, from the “Select Page Range” menu. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/92\\/Work-With-PDF-Files-Step-11.jpg\\/v4-460px-Work-With-PDF-Files-Step-11.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/92\\/Work-With-PDF-Files-Step-11.jpg\\/v4-760px-Work-With-PDF-Files-Step-11.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 7 \n Extract pages from a PDF.  Select the desired pages to extract, Press the “Extract” toolbar button, then the “Extract” button that appears below it. This will extract the selected pages into a new separate PDF file. These pages are not removed from the original document.\n Two options appear to the left of the “Extract” button before selection: “Delete Pages After Extracting” and “Extract Pages As Separate Files”. The first will delete the extracted pages from the original document after extraction, and the second will create a separate PDF file for each selected extracted page. \n Advertisement \n Part Three of Four: Creating a Fillable Form with Adobe Acrobat Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b6\\/Work-With-PDF-Files-Step-12.jpg\\/v4-460px-Work-With-PDF-Files-Step-12.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b6\\/Work-With-PDF-Files-Step-12.jpg\\/v4-760px-Work-With-PDF-Files-Step-12.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Scan and/or import the document.  In Acrobat, select  Tools > Prepare Form . From here, select to open or scan a document and press Start. Once imported, Acrobat will automatically analyze the document for empty fields and insert fillable spaces.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c6\\/Work-With-PDF-Files-Step-13.jpg\\/v4-460px-Work-With-PDF-Files-Step-13.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c6\\/Work-With-PDF-Files-Step-13.jpg\\/v4-760px-Work-With-PDF-Files-Step-13.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Create or edit form fields.  There are a variety of tools to manipulate the form fields to ensure the digital form is just as accurate as a physical copy.\n If you want to add more fields, you can select the area and choose the desired type of field from the panel on the right. \n Signature fields that are not obviously defined can be missed by Acrobat’s auto-scan. In the toolbar press the “Digital Signature” button to add one manually. Click and drag to select the area of the form you want to add a digital signature field. \n Existing fields can be easily edited by right-clicking (ctrl-click on Mac) a field and selecting  Properties… > Options . \n Any unwanted field can be removed with right-click > Delete. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a0\\/Work-With-PDF-Files-Step-14.jpg\\/v4-460px-Work-With-PDF-Files-Step-14.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a0\\/Work-With-PDF-Files-Step-14.jpg\\/v4-760px-Work-With-PDF-Files-Step-14.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Preview the changes.  You can test your changes at any time by pressing the Preview button and filling out the form.\n Notice that the Preview button changes to Edit when you press it. This is because you have exited editing mode. You must re-enter editing mode to make further changes or complete your form. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/bd\\/Work-With-PDF-Files-Step-15.jpg\\/v4-460px-Work-With-PDF-Files-Step-15.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/bd\\/Work-With-PDF-Files-Step-15.jpg\\/v4-760px-Work-With-PDF-Files-Step-15.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Complete your form.  When you are done making changes, press  Edit > Distribute  to send out your digital form.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/bc\\/Work-With-PDF-Files-Step-16.jpg\\/v4-460px-Work-With-PDF-Files-Step-16.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/bc\\/Work-With-PDF-Files-Step-16.jpg\\/v4-760px-Work-With-PDF-Files-Step-16.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Fill in a fillable form.  The recipient of a fillable form will need to have some kind of PDF viewing software in order to open a fillable form. Most free options, including Adobe Reader, will allow users to complete fillable forms.\n For signatures, the most comprehensive solution Adobe Reader. When opening the file, Adobe Reader will detect the signature field and prompt the user to add a signature. The user can scan or capture an image of their digital signature, draw a signature with the mouse, or type the name and allow the software to make a digital approximation. \n Advertisement \n Part Four of Four: Working with PDF Security Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e9\\/Work-With-PDF-Files-Step-17.jpg\\/v4-460px-Work-With-PDF-Files-Step-17.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e9\\/Work-With-PDF-Files-Step-17.jpg\\/v4-760px-Work-With-PDF-Files-Step-17.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Add a password to restrict viewing access.  If you don’t want just anybody to access your PDF, you go to  Tools > Protect > Encrypt > Encrypt with Password  and select “Require a Password to Open this Document”. Enter your desired password and confirm.\n From this menu you can also set advanced settings like encryption levels and compatibility with earlier versions of acrobat to make sure legacy users will also not have access. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Work-With-PDF-Files-Step-18.jpg\\/v4-460px-Work-With-PDF-Files-Step-18.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e2\\/Work-With-PDF-Files-Step-18.jpg\\/v4-760px-Work-With-PDF-Files-Step-18.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Add a password to restrict editing access.  If you want people to be able to view your PDF but ensure that no changes are made, you can restrict editing access. Navigate to  Tools > Protect > Restrict Editing . Input your desired password and press “OK” to confirm.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b5\\/Work-With-PDF-Files-Step-19.jpg\\/v4-460px-Work-With-PDF-Files-Step-19.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b5\\/Work-With-PDF-Files-Step-19.jpg\\/v4-760px-Work-With-PDF-Files-Step-19.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Remove a password.  In order to undo any security on your PDF, navigate to  Tools > Protect > Encrypt > Remove Security . Press “OK” to confirm and save the change.\n Depending on the type of security used, you may be prompted to input your password before you can remove it. \n Advertisement \n Community Q&A \n Search \n Add New Question \n Do I have to download a PDF viewer in order to convert my PDF file to a word document? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n No. One way is to go to \"Google.com\", and type \"Google Drive\" in the search box. Click on it when you get the results of your search. Now drag your .pdf file onto the Google Drive page  to upload the file. This may take awhile, depending on the file's size. When it's done uploading, click once on the file to highlight it, then flick on \"More\"..then \"Open With\"...then \"Google Docs\". When it's done opening, you can download the file to your computer by clicking on \"File\", then \"Download As\", and choose \"Microsoft Word\". That's it! \n Thanks! \n 0 \n 0 \n How can I download a .pdf in my iPhone? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n One way you can achieve this is to email the .pdf file to yourself and open the Mail app on your phone. You can tap the document and once you're viewing the document, tap the icon that looks like a square with an arrow inside of it pointing down. (If you can't see the icon, make sure the .pdf is open and tap the screen once to make the file name at the top appear.) Through this icon, you can save it as a .pdf to your phone. \n Thanks! \n 0 \n 0 \n How can I create text in a PDF document? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n You can't create text in a PDF document. A PDF file is essentially a picture of text. You need to go back to the original document to change it. \n Thanks! \n 0 \n 0 \n Can other pdf documents be inserted into a pdf file? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Yes, you can do this a couple of ways, but you will need the full version of Adobe Pro, or something similar. First, you can save a spreadsheet or word document as a PDF.  Once you save this as a PDF open the Tools and select \"Import Pages.\"\nA different option is to open a blank PDF. In the upper left corner, click on \"Create\" which opens a drop down window. From there, click on \"PDF Portfolio\". This basically opens a folder and you can add other documents to this including; PDFs, Word docs, spreadsheets, PowerPoints, Images, etc. \n Thanks! \n 0 \n 0 \n I need to transfer an email PDF document into one I can type on. Advice? \n Answer \n Show more unanswered questions \n Ask a Question \n 200 characters left \n Submit \n Things You Will Need Edit \n Adobe Acrobat \n Microsoft Office or OpenOffice \n A document scanner \n Related wikiHows Edit \n How to  Digitally Sign PDF Documents \n How to  Resize a PDF Using Messiah's Dysprosium \n How to  Convert a PDF to a Word Document \n How to  Unlock a Secure PDF File \n How to  Reduce PDF File Size \n How to  Extract Pages from a PDF Document to Create a New PDF Document \n How to  Convert JPG to PDF \n How to  Convert PDF to JPEG \n How to  Convert a Microsoft Word Document to PDF Format \n How to  Compress a PDF File \n Advertisement \n About This Article \n How helpful is this? \n\t\t\t\tCo-authors:   22 \n Updated:  \n\t\t\t\tViews:  69,728 \n\t\t\t\tCategories:  Using PDF Files \n Sources and Attribution \n Is this article up to date? \n Yes \n No \n\t\t\t\tNo\n\t\t\t\t\t\t{{questionText}}\n\t\t\t\t\t\t{{currentMethod}}\n\t\t\t\t\t{{cheerText}}\n\t\t\t\t\t{{oopsText}}\n\t\t\t\tYes\n https://helpx.adobe.com/acrobat.html \n Share \n Creating and Editing PDF Files Reorganizing PDF Files in Adobe Acrobat Creating a Fillable Form with Adobe Acrobat Working with PDF Security Community Q&A Related wikiHows \n Surprise Me! \n 297"}