{"url": "https://en.wikipedia.org/wiki/Social_design", "content": "Social design - Wikipedia \n Social design \n From Wikipedia, the free encyclopedia \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article has multiple issues.  Please help  improve it  or discuss these issues on the  talk page .  ( Learn how and when to remove these template messages ) \n This article may  require  cleanup  to meet Wikipedia's  quality standards .  No  cleanup reason  has been specified. Please help  improve this article  if you can.   (January 2012)   ( Learn how and when to remove this template message ) \n This article  needs additional citations for  verification .  Please help  improve this article  by  adding citations to reliable sources . Unsourced material may be challenged and removed.   (January 2012)   ( Learn how and when to remove this template message ) \n ( Learn how and when to remove this template message ) \n Social design  is design that is mindful of the designer’s role and responsibility in society; and the use of the design process to bring about social change. [1] \n Contents \n 1   Responsibility \n 2   Strategic thinking \n 3   Performance design \n 4   Designing systems \n 5   Social world \n 6   Initiatives \n 7   Articles \n 8   References \n 9   See also \n Responsibility [ edit ] \n Within the design world social design is sometimes defined as a design process that contributes to improving human well-being and livelihood. [2]  The agenda of social design is inspired by among others'  Victor Papanek ’s idea that designers and creative professionals have a  responsibility  and are able to cause real change in the world through good design. Papanek writes about responsible design. Designers can contribute to designing more  ecological  products by carefully selecting the materials they use. Papanek also remarks on designing for people's needs rather than their wants. Responsible design includes many directions and one of these is design for the  Third World . Designers have responsibility over the choices they make in design processes. [3] \n Social design thinking within the design world joins developing human and  social capital  with new products and processes that are  profitable . Profitability and  ownership  of the processes are the cornerstones of  sustainability  that underpins human well-being [ according to whom? ] . Another author that contributes to the development of this definition of social design is  Victor Margolin . He writes in \" The Politics of the Artificial \" about the \"designer's ability to envision and give form on material and immaterial products that can address human problems on broad scale and contribute to social well-being.\" This  ideology  is something that social design is built on. [4]  In this view social design is an activity that should not be framed with connotations of charity, aid donations, help etc. It is not voluntary work, but it should be seen as professional contribution that plays a part in local  economic development  or livelihood. \n Strategic thinking [ edit ] \n Another starting point for outlining social design is  strategic thinking  of design. Creating policies and implementing them on a civil level. The two poles: tradition and the market economy can, in one of the models for social design, be placed in  interaction , rather than in competition, with each other. An author that has to be mentioned here is  Jacque Fresco  and his Venus Project. He proposes that the future of the social systems needs to be designed by the  scientific method . Social design can then be seen as a process that leads to human capabilities that in turn contributes to their well-being. As  Amartya Sen  writes,  poverty  is seen as deprivation of capabilities. By focusing on capabilities, rather than e.g. income, Amartya Sen suggests that development within various social aspects of life can contribute to general development. Understanding and using social design processes can contribute to the improvement of livelihood [5] \n Performance design [ edit ] \n This section  contains information of unclear or questionable  importance  or  relevance  to the article's subject matter .  Please  help improve  this section by clarifying or removing  superfluous information . If importance cannot be established, the section is likely to be moved to another article,  pseudo-redirected , or removed. \n Find sources:   \"Social design\"  –  news   ·   newspapers   ·   books   ·   scholar   ·   JSTOR   (January 2017)   ( Learn how and when to remove this template message ) \n As social media becomes integrated with live performance, social design has become a term to describe someone who designs how online tools connect to a performance. Just as there are lighting designers, sound designers, set designers, costume designers and video designers - social designers work with a team to complement a production with social media tools and content. In this context, social design is defined as: \"The strategic implementation of social media to deepen or broaden the nature of an artistic performance.\" \n Designing systems [ edit ] \n Another dimension of social design focuses on designing systems that join the elements of  communication ,  new product development  and the  environment . It is argued that no single area of design is, by itself, sufficient to drive sustainable social development. What is needed is a system of design, one that encompasses all of the areas of design, towards an open system with multiple, self-adjusting and complementary actors that aim for a vision of a loosely defined common set of goals. \n Outside the design world social design appears in a number of professional environments. There are a growing number of artists, especially in Scandinavia, that use the term social design to describe their work, though the work is exhibited within the art world. These are artist like FOS and  Superflex . They come out of a tradition of social art that can be led back to the Futurists, the Dadaists and e.g. the German artist  Joseph Beuys . \n Social world [ edit ] \n The term social design is also increasingly used to describe design of the social world. This definition implicates a perception of a man-made reality, which consequently can only be changed by humans, and  is  changed by humans all the time. In this view social design is inescapable, it is there whether people are aware of it or not. The social reality is created as a result of the sum of all our individual actions. There is an emerging discussion of this concept of social design, which encompasses all other definitions of the term. \n Initiatives [ edit ] \n The World Design Research Initiative aka Worldesign, at the University of Art and Design Helsinki. [6]  Worldesign aims to explore issues relevant to social, welfare, and responsible design and to generate theory, as well as applicable systems or models. Its members produce exhibitions, workshops, and publications, which work as tools for testing and evaluating different social design applications. [7] \n Architects  Arup  Associates designed  The Druk White Lotus School  in the Indian Himalaya along social design principles. [8] \n The  University of Applied Arts Vienna  has a master's degree dedicated to the challenges within urban social systems and related issues. The master programme is oriented towards graduates from diverse fields of study using transdisciplinary teams. Art in synergy with project-related scientific methods and knowledge is seen as a tool for urban innovation. [9] [10] \n The  University of Technology Sydney  introduced a Bachelor of Creative Intelligence & Innovation (BCII) degree in 2014 [11]  which must be completed in combination with another undergraduate degree. With a strong focus on developing novel solutions for social issues, it enables students \"to participate in a future-facing, world-first, transdisciplinary degree that takes multiple perspectives from diverse fields, integrating a range of industry experiences, real-world projects and self-initiated proposals – equipping students to address the complex challenges and untapped opportunities of our times.\" [12] \n Articles [ edit ] \n Benson, E. (2007).  \"Prescription for an Ethically Designed Future.\"  AIGA Centre for Sustainability. \n Bhan, N., and Tait, D. (2008).  \"Design for the Next Billion Customers.\"  Core77.com. \n Bruinsma, M. (1999).  \"Idealism: An Ideal Design is Not Yet\". \n Casey, V. (2007).  \"The Designer’s Dilemma.\"  DesignersAccord.org. \n Emerson, J. (2009)  \"Mapping Power: Using design to get where we want to go\" \n Emerson, J. (2008)  \"The Vision Thing: Seeing and creating change through design\" \n Emerson, J. (2007)  \"The Conversation: When should designers make a political commitment?\" \n Emerson, J. (2005)  \"Guns, Butter and Ballots: Citizens take charge by designing for better government\" \n Emerson, J. (2004)  \"Taking it to the Streets: Graphic design for advocacy\" \n Garland, K. (1964).  \"First Things First Manifesto.\" \n Hidalgo, M. (2014).  \"Armas de construcción Masiva: Manual de Diseño Social\"  Diseño Social EN+ (Spanish) \n Howard, A. (2001).  \"There is such a thing as society.\"  EyeMagazine.com \n Howard, A. (2001).  \"Design Beyond Commodification.\"  EyeMagazine.com \n Nini, P. (2004).  \"In Search of Ethics in Graphic Design.\"  AIGA.org \n Poynor, R. (2007).  \"The Price of Juice.\"  EyeMagazine.com \n Poynor, R. (2001).  \"The Time For Being Against.\"  Typotheque.com \n Poynor, R. (2000).  \"First Things First 2000.\" \n Rule, A. (2008).  \"The Revolution Will Not Be Designed.\"  InTheseTimes.com \n Sagmeister, S. (2002).  \"How Good is Good?\"  Typotheque.com \n Various. (1883–2010).  \"100+ Years of Design Manifestos\" \n Larosa, Antonio (2007).  \"Designers Against The iPodization Of Society\" \n References [ edit ] \n Find more about Social design at Wikipedia's  sister projects \n Definitions  from Wiktionary \n Media  from Commons \n News  from Wikinews \n Quotations  from Wikiquote \n Texts  from Wikisource \n Textbooks  from Wikibooks \n Learning resources  from Wikiversity \n ^   http://www.mica.edu/Programs_of_Study/Graduate_Programs/Social_Design_(MA)/Overview.html \n ^   Holm, Ivar (2006).  Ideas and Beliefs in Architecture and Industrial design: How attitudes, orientations, and underlying assumptions shape the built environment . Oslo School of Architecture and Design.  ISBN   82-547-0174-1 . \n ^   Papanek, Victor (1984): Design for the Real World. Academy Chicago Publishers. Completely Revised Second Edition \n ^   Margolin, Victor (2002): The Politics of the Artificial. Essays on Design and Design Studies. The University of Chicago Press. Chicago and London \n ^   Sen, Amartya (2000): Development as Freedom. Anchor Books. New York \n ^   TaiK \n ^   among the publications are : \nUniversity of Art and Design Helsinki, Working Papers F 31. Potentials: Design in the Field : New Discourse on Craft Development 1-2.Helsinki 2006 ( http://www.taik.fi/tutkimus/julkaisut/working_papers.html ) \nMiettinen, Satu: Designing the Creative Tourism Experience. A Service Design Process with Namibian Crafts People. Publication series of University of Art and Design Helsinki A 81. Doctoral Dissertation. Gummerus kirjapaino oy. Jyväskylä 2007. \nMiettinen, Satu (ed.): Design Your Action. Publication series of University of Art and Design Helsinki B 82. Gummerus kirjapaino oy. Jyväskylä 2007. \n ^   http://www.dwls.org/Award-Winning-Buildings.html  award winning Druk White Lotus School \n ^   http://www.dieangewandte.at/socialdesign_en \n ^   Social Design_Arts as Urban Innovation \n ^   http://www.uts.edu.au/future-students/creative-intelligence-and-innovation \n ^   http://www.uts.edu.au/future-students/creative-intelligence-and-innovation/what-creative-intelligence-and-innovation/what \n See also [ edit ] \n Ethics \n Experimental home \n Social change \n Conceptual design \n Sustainable design \n Social responsibility \n v \n t \n e \n Design \n Outline \n Portal \n Designer \n Disciplines \n Communication \ndesign \n Advertising \n Book design \n Corporate design \n Exhibit design \n Film title design \n Graphic design \n Motion \n Postage stamp design \n Print design \n Illustration \n Information design \n Instructional design \n News design \n Photography \n Retail design \n Signage  /  Traffic sign design \n Typography  /  Type design \n Video design \n Visual merchandising \n Environmental \ndesign \n Architecture \n Architectural lighting design \n Building design \n Passive solar \n Ecological design \n Environmental impact design \n Garden design \n Computer-aided \n Healthy community design \n Hotel design \n Interior architecture \n Interior design \n EID \n Keyline design \n Landscape architecture \n Sustainable \n Landscape design \n Spatial design \n Urban design \n Industrial \ndesign \n Automotive design \n Automotive suspension design \n CMF design \n Corrugated box design \n Electric guitar design \n Furniture design \n Sustainable \n Hardware interface design \n Motorcycle design \n Packaging and labeling \n Photographic lens design \n Product design \n Production design \n Sensory design \n Service design \n Interaction \ndesign \n Experience design \n EED \n Game design \n Level design \n Video game design \n Hardware interface design \n Icon design \n Immersive design \n Information design \n Sonic interaction design \n User experience design \n User interface design \n Web design \n Other \n applied arts \n Public art design \n Ceramic  /  glass design \n Fashion design \n Costume design \n Jewelry design \n Floral design \n Game art design \n Property design \n Scenic design \n Sound design \n Stage/set lighting design \n Textile design \n Other \ndesign \n&  engineering \n Algorithm design \n Boiler design \n Conceptual design \n Database design \n Drug design \n Electrical system design \n Experimental design \n Filter design \n Job design \n Integrated circuit design \n Circuit design \n Physical design \n Power network design \n Mechanism design \n Nuclear weapon design \n Nucleic acid design \n Organization design \n Process design \n Processor design \n Protein design \n Research design \n Social design \n Software design \n Spacecraft design \n Strategic design \n Systems design \n Approaches \n Activity-centered \n Adaptive web \n Affective \n Brainstorming \n By committee \n By contract \n C-K theory \n Closure \n Co-design \n Concept-oriented \n Configuration \n Contextual \n Continuous \n Cradle-to-cradle \n Creative problem-solving \n Creativity techniques \n Critical \n Design fiction \n Defensive \n Design–bid–build \n Design–build \n architect-led \n Domain-driven \n Ecodesign \n Energy neutral \n Engineering design process \n Probabilistic design \n Error-tolerant \n Fault-tolerant \n Framework-oriented \n For assembly \n For behaviour change \n For manufacturability \n For Six Sigma \n For testing \n For X \n Functional \n Generative \n Geodesign \n High-level \n Integrated \n Integrated topside \n Intelligence-based \n Iterative \n KISS principle \n Low-level \n Metadesign \n Mind mapping \n Modular \n New Wave \n Object-oriented \n Open \n Parametric \n Participatory \n Platform-based \n Policy-based \n Process-centered \n Public interest \n Rational \n Regenerative \n Reliability engineering \n Research-based \n Responsibility-driven \n RWD \n Safe-life \n Sustainable \n Systemic \n SOD \n Tableless web \n Theory of constraints \n Top-down and bottom-up \n Transformation \n Transgenerational \n TRIZ \n Universal \n Design for All \n Usage-centered \n Use-centered \n User-centered \n Empathic \n User innovation \n Value-driven \n Value sensitive \n Privacy by \n Design  choice \n computing \n controls \n flow \n leadership \n management \n marker \n methods \n pattern \n research \n science \n strategy \n theory \n thinking \n Tools \n Intellectual property \n Organizations \n Awards \n Tools \n AAD \n Architectural model \n Blueprint \n Comprehensive layout \n CAD \n CAID \n Virtual home design software \n CAutoD \n Design quality indicator \n Electronic design automation \n Flowchart \n Mockup \n Product design specification \n Prototype \n Sketch \n Storyboard \n Technical drawing \n Web design program \n Website wireframe \n Intellectual \nproperty \n Community design \n Design around \n Design patent \n Geschmacksmuster \n Industrial design rights \n European Union \n Organizations \n AIGA \n Chartered Society of Designers \n Design and Industries Association \n Design Council \n International Forum Design \n The Design Society \n Design Research Society \n Awards \n European Design Award \n German Design Award \n Good Design Award (Chicago) \n Good Design Award (Japan) \n Graphex \n IF product design award \n James Dyson Award \n Prince Philip Designers Prize \n Related topics \n Aesthetics \n Agile \n Concept art \n Creative industries \n Cultural icon \n .design \n Enterprise architecture \n Futures studies \n Innovation Management \n Intelligent design \n Lean Startup \n New product development \n OODA Loop \n Philosophy of design \n Process simulation \n Slow design \n STEAM fields \n Unintelligent design \n Visualization \n Wicked problem \n Design  brief \n change \n classic \n director \n education \n elements and principles \n engineer \n firm \n history \n knowledge \n language \n life \n load \n museum \n paradigm \n rationale \n review \n specification \n studio \n technology \n Commons \n Wikibooks \n Wikinews \n Wikiquote \n Wikisource \n Wiktionary \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Social_design&oldid=796505892 \"\t\t\t\t\t \n Categories :  Design Hidden categories:  Articles needing cleanup from January 2012 All pages needing cleanup Cleanup tagged articles without a reason field from January 2012 Wikipedia pages needing cleanup from January 2012 Articles needing additional references from January 2012 All articles needing additional references All articles with specifically marked weasel-worded phrases Articles with specifically marked weasel-worded phrases from January 2017   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article \n Talk \n Variants \n Views \n Read \n Edit \n View history \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Deutsch Ελληνικά Español Português Русский   \n Edit links   \n  This page was last edited on 21 August 2017, at 09:05. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}