{"url": "http://www.w3.org/TR/2016/NOTE-WCAG20-TECHS-20161007/F73", "content": "F73: Failure of Success Criterion 1.4.1 due to creating links that are not visually evident without color vision | Techniques for WCAG 2.0\n               Techniques for WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  Failure F72 Next:  Failure F74 On this page: Important Information about Techniques Applicability Description Examples Related Techniques Tests -     F73: Failure of Success Criterion 1.4.1 due to creating links that are not visually evident without color vision Important Information about Techniques See  Understanding Techniques for WCAG Success Criteria  for important information about the usage of these informative techniques and how they relate to the normative WCAG 2.0 success criteria. The Applicability section explains the scope of the technique, and the presence of techniques for a specific technology does not imply that the technology can be used in all situations to create content that meets WCAG 2.0. Applicability Any technology. This failure relates to: \n\t\t\t\tSuccess Criterion 1.4.1 (Use of Color) \n\t\t\t\t\t\tHow to Meet 1.4.1 (Use of Color)\n\t\t\t\t\t\tUnderstanding Success Criterion 1.4.1 (Use of Color)\n\t\t\t\t\t Description The objective of this failure is to avoid situations in which people who cannot perceive color differences cannot identify links (when people with color vision can identify links). Link underlines or some other non-color visual distinction are required (when the links are discernible to those with color vision).  While some links may be visually evident from page design and context, such as navigational links, links within text are often visually understood only from their own display attributes. Removing the underline and leaving only the color difference for such links would be a failure because there would be no other visual indication (besides color) that it is a link. Note 1:\n\t\t\t\t\t Red and Pink are the same color (hue) but they have different lightness (which is not color ).   So red and pink would pass the requirement for \"not distinguished by color (hue) alone\" since they differ by lightness (which is not color) - as long as the difference in lightness (contrast) is 3:1 or greater.   (e.g. if surrounding text is RED and the link is PINK it would pass.  Similarly a light green and a dark red differ BOTH by color AND by lightness so they would pass if the contrast (lightness) difference is 3:1 or greater) before focus or pointing. ) Note 2:\n\t\t\t\t\t There is no requirement that links be identifiable by people who cannot perceive color if they are not perceivable for those with color vision. (e.g. if the links are hidden for everyone – as in a game or test). Note 3:\n\t\t\t\t\t If the non-color cue only happens when the mouse hovers over the link or when the link receives focus, it is still a failure. Note 4:\n\t\t\t\t\t If the link is a different color and bold it would not fail because the boldness is not color dependent. Examples \n\t\t\t\t\tFailure Example 1:  A Web page includes a large number of links within the body text. The links are styled so that they do not have underlines and are very similar in color to the body text. This would be a failure because users would be unable to differentiate the links from the body text. \n\t\t\t\t\tFailure Example 2:  The following code is an example of removing the underline from a link in a sentence or paragraph without providing another visual cue besides color. Example Code: \n<head>\n<style type=\"text/css\">\np a:link {text-decoration: none}\np a:visited {text-decoration: none}\np a:active {text-decoration: none}\np a:hover {text-decoration: underline; color: red;}\n</style>\n</head>\n<body>\n<p>To find out more about the <a href=\"rain_in_spain.htm\">rain in spain</a>there are many resources.</p>\n</body>\n Note:  If the visual cue is only provided on hover (as in the example above), it would still fail.\n Related Techniques G182: Ensuring that additional visual cues are available when text color differences are used to convey information G183: Using a contrast ratio of 3:1 with surrounding text and providing additional visual cues on focus for links or controls where color alone is used to identify them Tests Procedure Check that each link in the page that is identifiable by color (hue) is visually identifiable via some other means (e.g., underlined, bolded, italicized, sufficient difference in lightness, etc).  Expected Results If check #1 is false, then this failure condition applies and the content fails this Success Criterion. Top Contents Intro Previous:  Failure F72 Next:  Failure F74 This Web page is part of  Techniques and Failures for Web Content Accessibility Guidelines 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}