{"url": "http://www.w3.org/Consortium/Legal/privacy-statement-20140324", "content": "W3C Privacy Statements \n W3C \n Standards \n Participate \n Membership \n About W3C \n Site Navigation \n Policies and Legal Information  \n Licenses for W3C Test Suites \n Policies for Contribution of Test Cases to W3C \n Intellectual Rights FAQ \n W3C Privacy Statements \n W3C Document License \n W3C Trademarks and Generic Terms \n W3C® Trademark and Service Mark License \n W3C Software Notice and License \n W3C Invited Expert and Collaborators Agreement \n W3C URI Persistence Policy \n Mirroring the W3C Site \n Translations of the Copyright Notice \n Skip \n W3C   »   \n About W3C   »   \n Facts About W3C   »   \n Policies and Legal Information   »   \n W3C Privacy Statements \n W3C Privacy Statements \n On this page →  \n Public Web Browsing  •  \n Logged-in Usage  •  \n Mailing Lists  •  \n Law Enforcement \n Public Web Browsing (non-logged-in)  \n We make no effort to identify public users of our site. No identifying data is disclosed to any third party for any purpose. Data that we collect is used only for server administration, site improvement, usage statistics, and Web protocol research. \n We log http requests to our site including 'IP', 'Referer' and 'User-Agent' to be able to analyze the traffic. We use cookies for purposes including to understand usage patterns of the site and to maintain session state for some applications. \n Pages may link to or embed content such as video from other sites. Those resources are governed by the privacy policies of their originating sites. \n Logged information may be kept indefinitely as administrative, diagnostic, and research material, or discarded for any reason. Such information is not disclosed outside of host site personnel. Aggregate (non-identifying) statistics generated from these logs may be reported publicly as part of research results. \n If you set the Do-Not-Track header, which is\n\t\t     an option in the preferences of many browsers, we\n\t\t     will treat you just like all our other users,\n\t\t     because we do not track any users for behavioral\n\t\t     targeting.  Note:  We intend\n\t\t     to update our practices as necessary to follow\n\t\t     subsequent W3C privacy recommendations.  \n  Logged-in Usage \n When you create a user account, you are asked for a username, email address, real name, and affiliation. This information is stored in the database and displayed on your public profile page; your email address is not displayed in your profile unless you choose to do so. You may choose to provide additional information for public display. \n We use some of this information to show organizational affiliations and participant activity including group membership, mailing list and conference call contributions, and editorship credits. This record of activity is important to organizational transparency in our  Process  and  Patent Policy . \n Mailing Lists \n Mailing lists associated with W3C are publicly archived. On your first submission to one of these lists, you will be asked to approve the public posting of your message. We do not remove postings from archived lists.  archive-editing policy . \n Law Enforcement and Other Compelled Disclosures \n In the event that we are required by law (including a court order) to disclose the information you submit, we will make an effort to provide you with notice (unless we are prohibited) that a request for your information has been made and give you an opportunity to object to the disclosure. We will attempt to provide this notice by email, if you have given us an email address. We will independently object to over-broad requests for access to information about users of our site. If you do not challenge the disclosure request we may be legally required to turn over information.  \n Appendix: Changes from the previous version of the policy \n W3C enacted this policy on 5 August 2014. \n Since the previous version, the policy has\n\t\t     been clarified to reflect current technology and\n\t\t     W3C practices. We do not intend material changes\n\t\t     in what W3C does with information resulting from\n\t\t     visits to our site. The changes from the  previous version of the policy  are: \n The distinction between Member and non-Member browsing was not a useful distinction in practice. The new policy is much clearer about behavior when users are logged in or not logged in. \n  W3C uses a number of open source tools that use cookies to maintain state, such as WordPress, Media Wiki, and Bugzilla. The policy has been updated to make it clearer that we may use cookies for state management and to understand usage patterns in order to improve our site. \n W3C will continue to not track people for behavioral targeting; we mention this with reference to DNT signals. \n The policy is clearer about how W3C account data is managed. \n We dropped mention of some practices that W3C has discontinued (e.g., automatic newsletter subscription) \n W3C also updated its  P3P policy  to align with these changes. \n On 24 March 2014, W3C  announced plans  to enact this policy. \n Footer Navigation \n Navigation \n Home \n Standards \n Participate \n Membership \n About W3C \n Contact W3C \n Contact \n Help and FAQ \n Sponsor / Donate \n Site Map \n Feedback \n W3C Updates \n Copyright © 2014 W3C  ®  ( \n MIT \n ,  \n  ERCIM \n ,  Keio ,  Beihang )  Usage policies apply ."}