{"url": "https://slicejack.com/careers/", "content": "Careers - Slicejack \n Services \n About \n Our stuff \n Blog \n Let's talk! \n Let's talk! \n Services \n About \n Our stuff \n Blog \n Let's talk! \n Services \n About \n Our stuff \n Blog \n Join our team.  \nSlicejack careers. \n At Slicejack, it’s more than just a job. \n You’ll be working hard on projects for creative design agencies across the planet. You’ll often communicate directly with them–and now and then, even party with them. \n We’re passionate about providing a great service. \n It’s what we’re all about. So, interpersonal skills are at the top of the agenda. We’re looking for highly responsible, independent, talented professionals. People who want to make a difference. Sounds like you? We just might be a match made in heaven. \n\t\t\t\t\t\t\tWe’re hiring.\t\t\t\t\t\t \n Front-end developer   Slicing is your passion. You’re a wizard of responsive web design. You love to collaborate & you’ve got a real appetite to learn new things and progress—and not afraid to pull up your sleeves. \n Sounds familiar? There’s only one thing for it. It’s time to take the next step in your career. Fill in this application form and if you’ve got what it takes and you’re in for the ride — this might be the first move to becoming a Slicejack Ninja. \n Read on  \n Back-end developer   We’re always pushing our development work so we can continue to stay one step ahead in our industry. We need the right people who can produce the goods. You’ve got strong skills in PHP. You know JavaScript like the back of your hand. And you just can’t get enough of WordPress CMS. \n If you’re someone who ticks all the boxes–we want to hear from you. \n Read on  \n What we offer— \n Flexible working hours —just the way you like it. \n Top-notch equipment —MacBook Pros/Airs with external screens. \n Team building —keeping the positive momentum is our number one priority. Cageball, craft beer & sausages, coffee and summer chilling on the Croatian islands.   \n Competitive salary —up to date with market standards. \n Speaking appointments at conferences —travel & accommodation expenses, all on us. \n Travel opportunities —meeting clients all over the world – someone's got to do it!   \n Where we’re located— \n Split, Croatia. A 1700 year-old beautiful Mediterranean city with 300 sunny days per year. \n Testimonials \n Careers \n Contact \n Site map \n Twitter Facebook Instagram LinkedIn   \n Copyright © 2017. Slicejack. All rights reserved."}