{"url": "https://www.ubuntu.com/legal/terms-and-policies/privacy-policy", "content": "Privacy policy | Terms and policies | Ubuntu \n Menu \n Menu \n Jump to main content \n Cloud \n Overview \n OpenStack \n Managed cloud \n Public cloud \n Juju \n Storage \n Partners \n Foundation Cloud Build \n Training \n Server \n Overview \n Server provisioning \n Hyperscale \n Livepatch \n Containers \n Overview \n LXD \n Kubernetes \n Docker Engine \n Desktop \n Overview \n Features \n For enterprise \n For education \n For government \n For developers \n For partners \n Snappy \n Ubuntu 17.10 \n Core \n Overview \n IoT \n Overview \n Digital signage \n Robotics \n Gateways \n Support \n Overview \n Community support \n Plans and pricing \n ESM \n Downloads \n Overview \n Cloud \n Server \n Desktop \n Alternative downloads \n Ubuntu flavours \n Search \n Legal \n Terms and policies \n Terms and conditions \n Privacy policy \n Intellectual property \n Online account terms \n U1 Terms of Service \n Confidentiality agreement \n Developer terms \n Livepatch terms \n JAAS terms \n Privacy policy \n Valid from 8 February 2016 \n Your privacy matters to us. This policy outlines the information we collect from you — and what we do with it. \n Canonical collects personal information from you in a number of different ways. For example, when you download one of our products, receive services from us or use one of our websites (including  www.canonical.com         and  www.ubuntu.com ). \n At Canonical, we consider your privacy to be extremely important to us. These are the fundamental principles that we follow in relation to your personal information: \n We don’t ask you for personal information unless we truly need it. \n We don’t share your personal information with anyone except to provide you with services, products, to comply with the law, or to protect our rights. \n We don’t store personal information unless required for the on-going operation of services to you, to provide you with products, to comply with law or to protect our rights. \n We will use personal information that you provide to us in accordance with this privacy policy. \n Older versions \n 25 March 2013 › \n What we collect \n We may collect the following types of personal information from you: \n Websites \n When you register to use certain parts of our websites, such as wikis or message boards, or register for free accounts, we may ask for personal information such as your full name, email address and a password. \n Chat rooms, forums and newsgroups \n These are available to our community. Any information that you disclose in these areas becomes public information and may be recorded, archived and republished by anyone. Please exercise caution when deciding to disclose any personal information\n        in such areas. \n Canonical products \n When you register for services or purchase any product from Canonical, we may ask for information such as your email address, billing address, and credit card information. Credit card information is only used in processing your transaction. Please\n        note that we may use a third party payment processing merchant to process your payments. \n Non-personally identifying information \n Canonical may collect non-personally-identifying information of the sort that web browsers and servers typically make available, such as the browser type, referring site, and the date and time of each visitor’s request. Our purpose in collecting\n        non-personally identifying information is to better understand how visitors use our websites and services. For further information about how we use cookies, see the “cookie” section below. \n Error reports \n When you chose to send an error report, it includes a unique identifier for your computer. This identifier does not identify you, unless you (or someone acting on your behalf) discloses it separately. An error report may include personal information\n        such as the state of programs that were running at the time. You can block future error reports from the privacy panel of System Settings. \n Ubuntu online accounts \n When you use Ubuntu online accounts, your personal information is stored on your PC and it can be accessed by some applications.  View the legal notice explaining how we use this personal information. \n General \n If you contact us and provide us with information, we may keep a record of that correspondence and information \n Searching in the dash \n When you enter a search term into the dash Ubuntu will search your Ubuntu computer and will record the search terms locally. Depending on whether you have opted in or out (see the “Online Search” section below), we may also send your\n        keystrokes as a search term to productsearch.ubuntu.com and selected third parties so that we may complement your search results with online search results from such third parties including: Facebook, Twitter, BBC and Amazon. Canonical and these\n        selected third parties will collect your search terms and use them to provide you with search results while using Ubuntu. \n By searching in the dash you consent to: \n the collection and use of your search terms and IP address in this way; and \n the storage of your search terms and IP address by Canonical and such selected third parties (if applicable). \n Canonical will only use your search terms and IP address in accordance with this Privacy Policy. For information on how our selected third parties may use your information, please see their privacy policies. \n You may restrict your dash so that we don’t send searches to third parties and you don’t receive online search results. To do this go to the Privacy panel and toggle the ’Include online search results’ option. The Privacy\n        panel can be found in your System Settings or via a dash search.  For a current list of our selected third parties, please see the third party privacy policies. \n What do we do with the information we collect? \n We may use your information in the following ways: \n To authenticate access to certain features of our websites. \n To contact you to respond to enquiries or to provide notices to you regarding your use of our websites or the provision of our services. \n To provide services, products, process payment, and authenticate access (where required). \n To analyse the performance or the appropriateness of products or services. \n To comply with legal and regulatory requirements (including responding to court orders, subpoenas and to prevent crime). These special circumstances may require us to disclose personal information. \n To contact you if your actions violate your agreement with us (if any). \n To fix errors and analyse trends. \n To study how anonymous users interact with our websites and services. \n To market our products or services to you. \n Unless you have notified us otherwise, Canonical may occasionally send you email to tell you about new features, solicit feedback, or just to keep you up to date with what’s going on. We may use various community websites (Launchpad Answers,\n        Ubuntu Forums, blogs etc.) to communicate this type of information, so we expect to keep this type of information to a minimum. If you no longer wish to receive such communications from us, please follow the unsubscribe instructions provided in\n        any of the communications, modify the communications preferences in your account or contact us using the contact details provided below. \n Access \n The information you provide to us will be held on computers and may be accessed by or given to our staff working inside and outside of the UK and to third parties, including contractors and companies within Canonical’s group, for the purposes\n        set out in this Privacy Policy, i.e. to provide you with products or services, or as otherwise agreed with you. \n You acknowledge that it may be necessary for your information to be processed by such parties and that it may be transferred to someone who provides a service to us in another country, including some outside of the European Economic Area, and you\n        consent to such processing and transfer. If it is necessary to transfer your personal information outside of the European Economic Area we will make every effort to ensure that the person to whom we pass the personal information agrees to treat\n        it with the same level of protection as we do. \n If we are sold or merge with another business entity your personal information may be disclosed to our new business partners or owners. \n Unless required by law, we will not otherwise share, sell or distribute any personal information you provide to us without your consent. \n Cookies \n We use persistent cookies to support a smooth user experience. This cookie remains on your computer after you close your browser and may be used by your browser on subsequent visits to our websites. We also use cookies to better understand how you\n        interact with our websites and services and to improve our websites and services overall. \n Cookies we use \n Cookie \n Name \n Purpose \n More information \n site cookie acceptance \n _cookies_accepted \n This cookie is used to record if a user has accepted the use of cookies on our website. \n To withdraw your consent after accepting this cookie, delete the _cookies_accepted cookie. Find out how at  www.aboutcookies.org \n Google Analytics \n _utma \n _utmb \n _utmc \n _utmz \n These cookies are used to collect information about how visitors use our website, which we use to help improve it. The cookies collect information in an anonymous form, including the number of visitors to the site, where visitors have come\n                to the site from and the pages they visited. \n Find out more about Google Analytics privacy please visit  support.google.com/analytics/answer/6004245?hl=en \n Crazyegg \n is_returning \n Crazyegg tracks javascript on some pages of our site to understand what links our visitors are clicking on. This helps us optimize our content for the best user experience. The Crazyegg script may store a cookie on your computer. This cookie\n                may contain a session ID, a visitor ID and a few other dynamically created parameters that allow Crazyegg to track our site's traffic accurately. No personal information is stored within the cookie. \n For Crazy Egg's complete Privacy Policy please visit  www.crazyegg.com/privacy . \n Marketo Munchkin \n _mkto_trk \n Marketo's cookie allows us to track repeated visits to the website, and link each visit to the information voluntarily provided by the visitor. For example, if the visitor is asked to provide us with their name, company name and email\n                address, we will know the identity of the visitor when they visit the site at a later date, or when we send them email. \n For Marketo's complete Privacy Policy please visit  uk.marketo.com/trust/privacy.php \n If you do not wish to have cookies placed on your computers, please set your browsers to refuse cookies before visiting our websites and using our services. \n How do we protect the information we collect \n Canonical is very concerned about protecting the confidentiality of your personal information. We have security measures, including administrative, physical and electronic measures, to protect against the loss, exposure, misuse or alteration of\n        information that we have collected from you in the use of the services. These measures include SSL data encryption to transmit your personal information as well as technical architectures and systems to prevent unauthorised third parties from\n        accessing your personal information. \n Want a fully managed private cloud? \n BootStack is your OpenStack private cloud with our experts responsible for design, deployment and availability. \n Get BootStack › \n Get Ubuntu \n The open source software platform that runs everywhere from the smartphone, the tablet and the PC to the server and the cloud. \n Download Ubuntu › \n Further reading \n Making NTP best practices easy with Juju charms › \n Announcing snapcraft 2.35 › \n Join us at the Ubuntu Enterprise Summit! › \n Ubuntu Server Development Summary – 21 Nov 2017 › \n MAAS 2.3.0 (final) Released! › \n Back to top \n Cloud \n Overview \n OpenStack \n Managed cloud \n Public cloud \n Juju \n Storage \n Partners \n Foundation Cloud Build \n Training \n Server \n Overview \n Server provisioning \n Hyperscale \n Livepatch \n Containers \n Overview \n LXD \n Kubernetes \n Docker Engine \n Desktop \n Overview \n Features \n For enterprise \n For education \n For government \n For developers \n For partners \n Snappy \n Ubuntu 17.10 \n Core \n Overview \n IoT \n Overview \n Digital signage \n Robotics \n Gateways \n Support \n Overview \n Community support \n Plans and pricing \n ESM \n Downloads \n Overview \n Cloud \n Server \n Desktop \n Alternative downloads \n Ubuntu flavours \n Contact us \n Contact us \n About us \n Careers \n Press centre \n © 2017 Canonical Ltd. Ubuntu and Canonical are registered trademarks of Canonical Ltd. \n Legal information \n Cookie policy \n Report a bug on this site \n Go to the top of the page"}