{"url": "https://www.mediawiki.org/wiki/Special:MyLanguage/Help:Categories", "content": "Help:Categories - MediaWiki \n Help:Categories   \n From MediaWiki.org   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Translate this page \n Other languages: \n अङ्गिका  • ‎ العربية  • ‎ azərbaycanca  • ‎ български  • ‎ বাংলা  • ‎ català  • ‎ کوردی  • ‎ čeština  • ‎ Cymraeg  • ‎ Deutsch  • ‎ Zazaki  • ‎ Ελληνικά  • ‎ English  • ‎ Esperanto  • ‎ español  • ‎ eesti  • ‎ فارسی  • ‎ suomi  • ‎ français  • ‎ galego  • ‎ עברית  • ‎ हिन्दी  • ‎ Հայերեն  • ‎ Bahasa Indonesia  • ‎ italiano  • ‎ 日本語  • ‎ 한국어  • ‎ Ripoarisch  • ‎ Kurdî  • ‎ Lëtzebuergesch  • ‎ lietuvių  • ‎ latviešu  • ‎ मैथिली  • ‎ македонски  • ‎ Bân-lâm-gú  • ‎ norsk bokmål  • ‎ Nederlands  • ‎ occitan  • ‎ ਪੰਜਾਬੀ  • ‎ polski  • ‎ پښتو  • ‎ português  • ‎ português do Brasil  • ‎ română  • ‎ русский  • ‎ sicilianu  • ‎ Scots  • ‎ سنڌي  • ‎ slovenčina  • ‎ српски / srpski  • ‎ Basa Sunda  • ‎ ไทย  • ‎ Türkçe  • ‎ українська  • ‎ Tiếng Việt  • ‎ ייִדיש  • ‎ 中文 \n Note:  When you edit this page, you agree to release your contribution under the  CC0 . See  Public Domain Help Pages  for more info.\n Edit  ·  Translate \n Categories, a software feature of MediaWiki, provide automatic indexes that are useful as tables of contents. \n You can categorize pages and files by adding one or more  Category  tags to the content text. These tags create links at the bottom of the page that take you to the list of all pages in that category, which makes it easy to browse related articles. \n Contents \n 1   Summary \n 2   Adding a page to a category \n 2.1   Sort key \n 3   Creating a category page \n 4   Managing the category hierarchy \n 5   Hidden categories \n 6   Linking to a category \n 7   Redirecting a category \n 8   Tracking categories \n 9   See also \n Summary \n Each of the pages in the  Category   namespace  represents a so-called  category , a grouping of related pages, and contains an index for the pages of its category. For example, this page belongs to \" Category:Help Category:Help \". If you open the category page, you will see a link to this page there. \n When a page belongs to one or more categories, these categories appear at the bottom of the page (or in the upper-right corner, depending on the  skin  being used). \n The category pages themselves contain 2 parts: \n at their beginning, an optional part may contain text that can be edited, like any other page, \n at their end, an ever present, automatically generated, alphabetical list of all pages in that category, in the form of links. In fact, in the Unicode sort order. \n To assign a category to a page, simply add the link \"[[Category: Category name ]]\" to the page's wikitext. The usual place to add it is at the bottom of the page. \n To link a category page within a page as a normal wiki link (without adding the page to the category), prefix the link name with a colon. For example: [[:Category:Not in this category]] \n New categories can be  created  before assigning any page to it, in the same way as any other regular page. \n Individual wikis may have their own top-level categories, such as  Category:Contents  in Wikipedia. \n For a complete list of all categories which have at least one page, see  Special:Categories . \n For a complete list of all created/edited categories, including the ones that don't have any pages, see  Special:Allpages/Category:  (note the colon at the end). \n Adding a page to a category \n To add a page or uploaded file to a category, simply edit the page and add the following text (where  Name  is the name of the category you want to add it to). \n[[Category: Name ]]\n Any number of Category tags may be added to the page and the page will be listed in all of them. Category tags, along with  interwiki language links  placed in the sidebar, are usually added at the very bottom of the page for the convenience of other editors. \n On a categorized page, categories are displayed in the Categories: box strictly in the order they appear in the wikitext. \n If  $wgUseCategoryBrowser Manual:$wgUseCategoryBrowser  is set to true, under the first list each category is listed again,  breadcrumb -style, with all its parent categories, sorted alphabetically. (At least in MediaWiki 1.18.2) if a category is a subcategory of more than one parent, both hierarchies will be listed, but the tagged category will be stripped off all but one of these. This creates the potential for what appear to be duplicate entries if a category with multiple parents  and  one of its parents are both tagged on a page. For example suppose Maryanne is a subcategory of both Mary and Anne. If a page tags categories Maryanne and Anne then the Category breadcrumbs will show \nAnne \nAnne\nMary -> Maryanne\n \"Anne\" appears to be duplicated, but what is meant is \nAnne \nAnne -> Maryanne\nMary -> Maryanne\n This is a bug, and has been reported in  Task T35614 . \n Sort key \n By default, a page is sorted within a category under the first letter of its name —  without the namespace . Also, MediaWiki groups accented characters separately from their unaccented version, so pages starting by À, Á, Ä, will be listed under separate headings, instead of under heading A. (If you have shell access, these defaults can be changed using  $wgCategoryCollation .) \n A  sort key  specifies under which letter heading, and where in the category list, the page will appear. You can add a sort key by placing it inside the tag after a pipe character. For example, the tag below will add the page under heading \"S\". \n[[Category: Name | Sort ]]\n Whether or not sort keys are case-sensitive  depends on your configuration settings . The order of the sections within a category follows the Unicode sort order. The sort key does not change the page title displayed in the category. \n Spaces and other characters are perfectly valid. \n See  Help:Sorting  for further information on category sorting. \n Creating a category page \n Categories exist even if their page has not been created, but these categories are isolated from others and serve little purpose for organization or navigation. \n A category is created by creating a page in the  Category:  namespace. A category page can be created the same way as other wiki pages (see  Help:Starting a new page ); just add \" Category: \" before the page title. \n To avoid extra work, try searching within your wiki before creating a new category. The list of all categories can be found in \"Special pages\" in the \"tools\" box of the  sidebar . \n Managing the category hierarchy \n Categories may belong to other categories in a hierarchy. Since category pages are much like any other page, a Category tag may be added to the bottom of a category page. \n It is a good idea to organize all categories into a hierarchy with a single top level category. The category structure can take the form of a tree with separate branches, but more often will have a graph structure. Generally, there should be a contiguous chain of parent-child links between each category and the top level category. \n Hidden categories \n The categories that a page is in are normally listed at the bottom of the page. In Mediawiki 1.13+, a category can be hidden from this list by adding the  magic word  \" __HIDDENCAT__ \" to the category page. \n Users can choose to see hidden categories in a separate \"Hidden categories\" list, by checking \"Show hidden categories\" in the \"Appearance\" section of  Special:Preferences . \n Hidden categories are automatically added to  Category:Hidden categories . This category is specified in the system message  MediaWiki:Hidden-category-category . \n See also:   hidden categories \n Linking to a category \n To create a link to a category, use a leading colon before the category name (without this colon, the current page would be added to the category): \n [[:Category:Help]]  →  Category:Help \n To change the link text, write the text inside the link tag after a pipe: \n [[:Category:Help|Help category]]  →  Help category \n Redirect pages  that redirect to categories must also use the colon, otherwise they will be added to the category instead of redirecting. \n Redirecting a category \n Like normal wiki pages, category pages can be redirected to other normal or category pages.  However , this is not recommended, as pages categorized in redirected categories do  not  get categorized in the target category ( bugzilla:3311 ). Some Wikimedia sites use a \"category redirect\" template to mark redirected categories, allowing manual or automated cleanup of pages categorized there. \n Tracking categories \n Certain syntax issues, such as a broken image link, or too many expensive parser functions, can cause a page to be added to a tracking category. See  Help:Tracking categories  for details. \n See also \n Category:Category extensions Category:Category extensions \n\t\t\t\t\t\tRetrieved from \" https://www.mediawiki.org/w/index.php?title=Help:Categories&oldid=2589875 \"\t\t\t\t\t \n Categories :  Help Category   \n Navigation menu \n Personal tools \n English Not logged in Talk Contributions Create account Log in   \n Namespaces \n Help Discussion   \n Variants \n Views \n Read View source View history   \n More \n Search \n Navigation \n Main page Get MediaWiki Get extensions Tech blog Contribute   \n Support \n User help FAQ Technical manual Support desk Communication   \n Development \n Bug tracker Code repository Code docs Statistics Wikimedia technology Wikimedia audiences   \n MediaWiki.org \n Community portal Recent changes Translate content Random page Current issues Sandbox   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons Meta-Wiki Wikibooks Wikinews Wikipedia Wikiquote Wikisource Wikiversity Wiktionary   \n Tools \n What links here Related changes Special pages Permanent link Page information Wikidata item   \n In other languages \n Boarisch भोजपुरी Català کوردی Čeština Cymraeg Dansk Deutsch Ελληνικά English Esperanto Español Eesti Euskara فارسی Français Galego Հայերեն Ilokano Italiano 日本語 ភាសាខ្មែរ Ripoarisch Lëtzebuergesch मराठी Bahasa Melayu Nederlands Norsk ਪੰਜਾਬੀ Polski Português Română Русский Scots سنڌي Simple English Slovenčina Slovenščina Svenska தமிழ் Türkçe Татарча/tatarça Українська اردو 中文 Bân-lâm-gú   \n Edit links   \n  This page was last edited on 20 October 2017, at 18:20. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.\nSee  Terms of Use  for details. \n Privacy policy \n About MediaWiki.org \n Disclaimers \n Code of Conduct \n Developers \n Cookie statement \n Mobile view"}