{"url": "https://tg.wikipedia.org/wiki/%D0%90%D0%BB%D1%8E%D0%BC%D0%B8%D0%BD%D0%B8%D0%B9", "content": "Алюминий — Википедия \n Алюминий   \n Мавод аз Википедиа — донишномаи озод   \n\t\t\t\t\tҶаҳиш ба:\t\t\t\t\t новбари , \t\t\t\t\t Ҷустуҷӯи \n 13 \n Алюминий \n Al \n 26,982 \n 3s 2 3p 1 \n Алюминий  ( Aluminium , аз  Alumen  – замч ё зок) — А1, элементи химиявии гурӯҳи III ҷадвали даврии  Менделеев. \n Рақами тартибиаш 13, массаи атомӣ 26, 9815. Дар табиат асосан дар шакли як изотопи собити 27А1 вомехӯрад. Чанд изотопи радиоактив дорад, ки ба таври сунъӣ ҳосил карда шудаанд. Дарозумртарин изотопаш 26А1 мебошад (давраи нимкоҳишаш 7,4•105 сол). Алюминий металли сафеди нуқрагун буда, ҷараёни барқро хуб мегузаронад; ҳарор. гудозишаш 60,4°С, ҳарор. ҷӯшишаш 2500°С, зичиаш 2700 кг/м3 (дар 20°С). Алюминийи холисро бори аввал соли 1825 олими даниягӣ Г. Эрстед ҳосил намудааст. Дар табиат дар шакли холис вуҷуд надорад. Алюминий дар шакли пайваст 8,8 фоизи массаи қишри заминро ташкил медиҳад. Пайвастҳои муҳими табиии Алюминий (алюмосиликатҳо) каолин, албит, анортит, ортоклаз, биотит, мусковит, корунд (оксиди алюминий) ва бокситҳо мебошанд. Калонтарин конҳои Алюминий дар  Венгрия ,  Франсия ,  Италия ,  ШМА  ва давлатҳои узви ИДМ мавҷуданд. Дар Тоҷикистон захираҳои Алюминий дар шакли бокситҳо дар Ромит, Қаратоғ, дар шакли сиёнит дар кӯҳистони Рашт дида мешаванд. Сиёнитҳои нефелинии дараи Ясмандро метавон ҳамчун ашёи хом барои истеҳсоли Алюминий истифода бурд. Дар саноат, аз ҷумла дар корхонаи воҳиди давлатии «Ширкати алюминийи Тоҷик» (TAЛKO) Алюминийро аз электролизи оксиди алюминий (Аl2Оз), ки номи техникиаш «гилхок» аст, дар гудохтаи криолит (Na3А1Fб) таҳти қарор. 950°С ҳосил менамоянд. Алюминий металли хеле фаъол мебошад. Аз ин сабаб ба воситаи оксигени ҳаво оксид ва бо пардаи муҳофизи оксиди алюминий пӯшида мешавад. Пардаи оксидӣ Алюминийро аз занг задан ва таъсири моддаҳои гуногун, масалан, буғи об ва оксиди карбони атмосфера ҳифз мекунад. Дар пайвастҳояш Алюминий асосан севалента мебошад. Агар пардаи оксидӣ нест гардад, Алюминий обро бо ихроҷи гидроген таҷзия менамояд. Пайвастҳои гидрогении Алюминий – гидридҳо фаъол буда, дар синтези химиявӣ истифода мешаванд. Алюминий ҳамчун элементи амфотер (дубаҳра) бо кислотаҳо ва ишқорҳо ба реаксия медарояд. Алюминий дар кислотаҳои сероб (масалан, кислотаи гидрогенхлорид) хуб ҳал мешавад. Пардаи муҳофизи оксидӣ намегузорад, ки Алюминий дар кислотаҳои оксигендор, масалан, кислотаи нитрат ҳал гардад. Алюминий дар ишқорҳо ҳал шуда, алюминатҳоро ба вуҷуд меоварад. Дар раванди алюминотермия Алюминий як силсила металлҳо ва ғайриметаллҳоро аз таркиби оксидҳояшон бо тавлиди гармии зиёд (то 3500°С) хориҷ месозад. Пайвастҳои Алюминий дар саноат ва кишоварзӣ васеъ истифода мешаванд. Миқдори зиёди Алюминий барои истеҳсоли хӯлаҳо истифода мегардад. Дуралюмин (94% А1, 4% Си, 0,5% Mg, 05% Мn, 0,5% Fе, 0,5% Si) ва силумин (85 – 90% А1, 10 – 14% I, 0,1% Na) хӯлаҳои муҳимтарини Алюминий мебошанд. Алюминий ва хулаҳои онро барои истеҳсоли самолёт, ракета, киштӣ, дастгоҳҳои истеҳсолоти химия, сими барқ, конденсаторҳо, радио ва телевизион, асбобҳои рӯзгор, дару тиреза ва ғайра ба кор мебаранд. Варақаҳои нафиси Алюминий дар саноати хӯрокворӣ ва доруворӣ ҳамчун борҷома истифода мегардад. Хокаи оксиди алюминий («алюмогел») намкаш буда, барои беоб сохтани газҳо ва соф кардани маҳлули қанд истифода мешавад. Сулфати Алюминийро барои тоза кардани об кор мефармоянд. Замчҳои Алюминий дар даббоғии чарм ва ранг кардани матоъҳо ба кор мераванд. Ба воситаи фосфиди Алюминий (AlP) дар анборҳои хӯрокворӣ мушу калламушҳоро нест мекунанд. Карбиди Алюминий (Al4C3) обро бо тавлиди гази метан таҷзия менамояд. Аз иловаи миқдори муайяни Алюминий пӯлод дар муқобили ҳарорати баланд устувор мегардад. Алюминий дар таркиби алюмосиликатҳо аз ҷумлаи унсурҳои тавлидкунандаи хок мебошад. Алюминий дар бофта ва маҳлули байни ҳуҷайраҳои растанӣ ва ҳайвонот низ мавҷуд аст. Дар хок ва ҷисми инсон бо ионҳои фосфат пайвастҳое ҳосил мекунад, ки чандон ҳал намешаванд, масалан, вариазит А1(ОН)2Н2РО4, ки раванди азхудкунии фосфорро халалдор месозад. Одам бо хӯрок рӯзе 40 мг Алюминийро истеъмол менамояд. Дар Ин-ти химияи АИ ҶТ оид ба тавлиди Алюминийи холис ва хӯлаҳои он тадқиқот мебаранд. \n Эзоҳ [ вироиш ] \n Адабиёт [ вироиш ] \n Популярная библиотека химических элементов, М., 1983; Шретер В., Химия, М., 1989; Идрисов Т., Кимиёи аносир (элементҳо), Д., 2004. \n Сарчашма [ вироиш ] \n   Мақола дар асоси маводи  Энсиклопедияи Миллии Тоҷик  навишта шудааст. \n\t\t\t\t\t\tБаргирифта аз \" https://tg.wikipedia.org/w/index.php?title=Алюминий&oldid=970085 \"\t\t\t\t\t \n Гурӯҳи пинҳон:  Энсиклопедияи Миллии Тоҷик   \n Менюи гаштан \n Абзорҳои шахсӣ \n Ба систем вуруд нашудаед Баҳс Саҳмгузориҳо Эҷоди ҳисоб Вуруд   \n Фазоҳои ном \n мақола мубоҳисавӣ   \n кирилликӣ \n кирилликӣ lotinī   \n Назарот \n Хондан Вироиш Намоиши таърих   \n Бештар \n Ҷустуҷӯ \n Гаштан \n Саҳифаи аслӣ Вуруди корбарон Рӯйдодҳои кунунӣ Тағйироти охирин Саҳифаҳои тасодуфӣ Роҳнамо Кумаки молӣ   \n Дигар лоиҳаҳо \n Викианбор   \n Print/export \n Download as PDF   \n Ҷаъбаи абзор \n Пайвандҳо ба ин саҳифа Тағйироти монандӣ Фиристодани парванда Саҳифаҳои вижа Нусхаи чопӣ Пайванди доимӣ Иттилооти саҳифа Элементи Викидода Ёд кардани пайванди ин мақола   \n бо забонҳои дигар \n Afrikaans Alemannisch አማርኛ Aragonés العربية অসমীয়া Asturianu Azərbaycanca تۆرکجه Башҡортса Žemaitėška Беларуская Беларуская (тарашкевіца)‎ Български भोजपुरी বাংলা བོད་ཡིག Brezhoneg Bosanski Буряад Català Mìng-dĕ̤ng-ngṳ̄ Cebuano ᏣᎳᎩ کوردی Corsu Čeština Чӑвашла Cymraeg Dansk Deutsch Ελληνικά English Esperanto Español Eesti Euskara فارسی Suomi Võro Føroyskt Français Nordfriisk Furlan Frysk Gaeilge Gàidhlig Galego ગુજરાતી Gaelg 客家語/Hak-kâ-ngî Hawaiʻi עברית हिन्दी Fiji Hindi Hrvatski Kreyòl ayisyen Magyar Հայերեն Interlingua Bahasa Indonesia Ilokano Ido Íslenska Italiano 日本語 Patois La .lojban. Basa Jawa ქართული Kabɩyɛ Gĩkũyũ Қазақша ភាសាខ្មែរ ಕನ್ನಡ 한국어 Ripoarisch Kurdî Коми Кыргызча Latina Lëtzebuergesch Лезги Limburgs Ligure Lumbaart ລາວ Lietuvių Latviešu Malagasy Македонски മലയാളം Монгол मराठी Кырык мары Bahasa Melayu မြန်မာဘာသာ Эрзянь Plattdüütsch नेपाली नेपाल भाषा Nederlands Norsk nynorsk Norsk Novial Diné bizaad Occitan Livvinkarjala ଓଡ଼ିଆ Ирон ਪੰਜਾਬੀ Kapampangan पालि Polski Piemontèis پنجابی پښتو Português Runa Simi Rumantsch Română Armãneashti Русский Русиньскый Kinyarwanda संस्कृतम् Саха тыла Sicilianu Scots Srpskohrvatski / српскохрватски සිංහල Simple English Slovenčina Slovenščina Soomaaliga Shqip Српски / srpski Seeltersk Basa Sunda Svenska Kiswahili தமிழ் తెలుగు ไทย Tagalog Türkçe Татарча/tatarça ئۇيغۇرچە / Uyghurche Українська اردو Oʻzbekcha/ўзбекча Vepsän kel’ Tiếng Việt Winaray Хальмг ייִדיש Yorùbá Vahcuengh 中文 文言 Bân-lâm-gú 粵語   \n Вироиши пайвандҳо   \n  Ин саҳифа бори охир 06:24, 19 октябри 2017 дигаргун карда шудааст. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.\nSee  Terms of Use  for details. \n Сиёсати ҳифзи асрор \n Дар бораи Википедиа \n Такзибнома \n Таҳиягарон \n Созишномаи куки \n Намуди мобилӣ"}