{"url": "http://www.w3.org/TR/2016/NOTE-WCAG20-TECHS-20161007/F52", "content": "F52: Failure of Success Criterion 3.2.1 and 3.2.5 due to opening a new window as soon as a new page is loaded | Techniques for WCAG 2.0\n               Techniques for WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  Failure F50 Next:  Failure F54 On this page: Important Information about Techniques Applicability Description Examples Resources Related Techniques Tests -     F52: Failure of Success Criterion 3.2.1 and 3.2.5 due to opening a new window as soon as a new page is loaded Important Information about Techniques See  Understanding Techniques for WCAG Success Criteria  for important information about the usage of these informative techniques and how they relate to the normative WCAG 2.0 success criteria. The Applicability section explains the scope of the technique, and the presence of techniques for a specific technology does not imply that the technology can be used in all situations to create content that meets WCAG 2.0. Applicability Applies when scripting is used to open new windows.  This failure relates to: \n\t\t\t\tSuccess Criterion 3.2.1 (On Focus) \n\t\t\t\t\t\tHow to Meet 3.2.1 (On Focus)\n\t\t\t\t\t\tUnderstanding Success Criterion 3.2.1 (On Focus)\n\t\t\t\tSuccess Criterion 3.2.5 (Change on Request) \n\t\t\t\t\t\tHow to Meet 3.2.5 (Change on Request)\n\t\t\t\t\t\tUnderstanding Success Criterion 3.2.5 (Change on Request)\n\t\t\t\t\t Description  Some Web sites open a new window when a page is loaded, to advertise a\n                        product or service. The objective of this technique is to ensure that pages\n                        do not disorient users by opening up one or more new windows that automatically attain focus as soon as a\n                        page is loaded.  Examples Note:  There are multiple methods by which this failure may be triggered. Two\n                            common examples that are supported differently in various versions of\n                            user agents are listed as examples below.  \n\t\t\t\t\tFailure Example 1:  The following example is commonly used in HTML 4.01 to open new\n                                windows when pages are loaded. Example Code: \nwindow.onload = showAdvertisement;\n function showAdvertisement()\n {\n  window.open('advert.html', '_blank', 'height=200,width=150');\n } \n\t\t\t\t\tFailure Example 2:  The following example commonly used in XHTML to open new windows when\n                                pages are loaded. Example Code: \nif (window.addEventListener) { \n    window.addEventListener(\"load\", showAdvertisement, true);\n}\nif (window.attachEvent) {\n    window.attachEvent(\"onload\", showAdvertisement);\n}\nfunction showAdvertisement()\n{\nwindow.open('noscript.html', '_blank', 'height=200,width=150');\n} Resources Resources are for information purposes only, no endorsement implied. Related Techniques G107: Using \"activate\" rather than \"focus\" as a trigger for changes of context Tests Procedure  load a new page   check to see whether a new window has been opened as a result of\n                                    loading the new page  Check to see whether the new window is automatically given focus  Expected Results  If step 2 and step 3 are true, then this failure condition applies and\n                                    content fails the Success Criterion.  Top Contents Intro Previous:  Failure F50 Next:  Failure F54 This Web page is part of  Techniques and Failures for Web Content Accessibility Guidelines 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}