{"url": "http://www.osc.gov.on.ca/en/SecuritiesLaw_sn_20140626_11-770_sop-fiscal-2014-2015.htm", "content": "OSC Notice: 11-770 - Notice of Statement of Priorities for Financial Year to End March 31, 2015 -  \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   Securities Law & Instruments   /   Instruments, Rules & Policies   /   1 - Procedure and Related Matters   /   11-770   /   Security Foundation - 11-770   /   OSC Notice: 11-770 - Notice of Statement of Priorities for Financial Year to End March 31, 2015 \n                Securities Law & Instruments\n Hide Section Menu   × \n Legislation \n Legislative Reviews \n Instruments, Rules & Policies \n Proposed Instruments, Rules & Policies \n OSC Bulletin \n Electronic Filing \n Registrant Forms and Documents \n Reporting Issuer and Issuer Forms \n Orders, Rulings & Decisions \n   Section Menu \n PDF Version \n OSC NOTICE 11-770 \n        NOTICE OF STATEMENT OF PRIORITIES FOR FINANCIAL YEAR TO END MARCH 31, 2015 \n The  Securities Act  (Act) requires the Ontario Securities Commission (OSC or Commission) to deliver to the Minister of Finance by June 30th of each year a statement of the Commission setting out its priorities for its current financial year in connection with the administration of the Act, the regulations and rules, together with a summary of the reasons for the adoption of the priorities. \n In the notice published by the Commission on April 2, 2014, the Commission set out its draft Statement of Priorities (SoP) and invited public input in advance of finalizing and publishing the 2014-2015 Statement of Priorities. Twelve responses were received and carefully considered. We appreciate the time and effort taken by all of the commenters to review the SoP and provide their thoughtful and helpful feedback. A high level summary of the comments, and our replies to them, is set out below. \n The responses were broadly supportive of the overall direction of the OSC goals and priorities and included: \n a. Support for improved regulatory harmonization including pursuit of a national regulator and greater Canadian Securities Administrators (CSA) cooperation. \n b. Positive acknowledgement of the OSC's ongoing efforts to keep pace with national and international developments. \n c. Endorsement of budget controls to the extent that they do not impair the OSC's capacity to achieve its mandate. \n Concerns were raised about the slow progress on various initiatives. While we understand, we are constrained by the fact that policy development is a complex process which takes time to do well. We believe that it is appropriate to undertake research and complete a careful assessment of consequences and potential impacts prior to implementing regulatory policies that can have profound impacts on our markets, market participants and investors. Our process often also requires considerable consultation with our CSA counterparts and other regulators, which is important for harmonization across Canada. Comments on the pace of regulatory development varied depending on whether the commenter supported or opposed the initiative. For some initiatives we heard that we are proceeding too quickly, while for others commenters expressed frustration at the perceived lack of progress. \n The comments focussed on a wide range of issues. We address notable comments in the following section: \n a. Investor advocates suggested that the SoP is too focused on capital formation and not enough attention is being placed on investor issues. \n We respectfully disagree. The majority of our priorities for 2014-2015 have considerable impact on investor protection. In particular, this year the OSC will work on three transformative initiatives that are squarely focused on investor protection as it relates to mutual fund fees, final phases of the point of sale disclosure project and a best interests standard for advisors. Important work is also planned to address shareholder democracy which is a key area for investors. We would also note that, where issues were raised that the SoP did not include specific investor-related initiatives (for example, in relation to seniors) as a priority, in almost every instance these issues are being addressed within the OSC's business plan. We remain focused on investor protection and we believe that the SoP strikes an appropriate balance in addressing these important areas of focus. \n b. Some commenters wanted to see greater evidence of the results of our efforts to engage and communicate with investors. Specifically, concern was expressed that we have not published the findings of our \"OSC in the Community\" work. \n We launched OSC in the Community in 2013 as a new way to engage directly with investors and civic leaders in their community and we committed to publishing a list of what we heard from investors. The OSC has spoken with hundreds of investors across the province and highlights of the feedback from Ontarians have been published in OSC Investor Voice, a new online publication about the OSC's conversations with investors highlighting what we have heard and how we are responding to the issues. \n c. A number of commenters highlighted seniors' issues as an area requiring more focus. One commenter suggested that the OSC create a Seniors Advisory Committee. \n We agree that seniors are a very important and growing segment of investors. Our Office of the Investor (OI) is becoming increasingly active in this area. As seniors are a key segment of investors we will look to work with the Investor Advisory Panel (IAP) to ensure that the views and issues related to this very important group are brought forward and addressed. \n The OI and the IAP will be holding a round table consultation this Fall to explore senior investment issues and possible solutions. The OI also participated in the Financial Consumer Agency of Canada's seniors' financial literacy consultations. \n d. Commenters recommended that the Commission define more clearly and specifically the timing and plans for delivering on the Statement of Priorities. \n The SoP sets out the work that we expect to complete within the year against each initiative. We publish a report card detailing our progress against each initiative following the end of our fiscal year. The report card will be published on our website following delivery of the SoP to the Minister. \n Policy initiatives can have profound impacts on our markets, market participants and investors. We believe we must thoroughly research and carefully assess potential impacts prior to implementing policies. As a result many of our initiatives have a multi-year time horizon. In these cases, it is very difficult to provide full project timetables. For many projects, such as our initiative on a Best Interest Duty, the work required will depend in part on the outcome of the research we conduct this year. Once this research and analysis has been completed we will publish the results and our decision on how we plan to move forward, including timing. \n The OSC is committed to achieving harmonized, national regulatory solutions where practical. As a result, for many of our policy projects where we must collaborate with other regulators, timelines and completion dates are often not entirely within our control. While we will continue to seek CSA-wide solutions that address regulatory issues, we may be forced to introduce Ontario-only solutions if consensus cannot be achieved that addresses the issues in a timely manner. \n e. A number of commenters suggested adding an initiative aimed at establishing a regulatory framework for advisors with a focus on proficiency. \n We are reviewing the impact that advisor titles and proficiency standards have on investor protection as part of our Best Interest Duty initiative. \n f. We received comments seeking improvements to dispute resolution and an approach to provide compensation to Ontario investors who suffer losses because of violations of the Act \n The OSC believes having one dispute-resolution service for the securities industry is important for investors. We have taken steps to improve dispute resolution through the introduction of amendments to National Instrument 31-103  Registration Requirements, Exemptions and Ongoing Registrant Obligations  (NI 31-103) and Companion Policy 31-103CP  Registration Requirements, Exemptions and Ongoing Registrant Obligations  that require all registered dealers and advisers outside of Quebec to use Ombudsman for Banking Services and Investments (OBSI) as their provider of dispute-resolution services by August 1, 2014. \n The CSA has committed to continue to work with OBSI to ensure it has the capacity to effectively discharge its mandate. Participating CSA members (the OSC included) and OBSI have entered into a memorandum of understanding (MOU) that creates an oversight framework for OBSI to monitor performance against the standards set out by the CSA. Included in the MOU is a commitment to an independent evaluation of OBSI's operations and practices by August 1, 2016. We strongly support this process and expect registrants to abide by their obligations. If experience indicates that this process is not achieving the desired outcomes, we will consider additional actions to achieve this important protection for investors. \n Some commenters have suggested that the OSC should compel payments to investors. The OSC does not have this authority and would need legislation to expand its powers in order to force binding decisions. \n g. Commenters also noted that the SoP did not specifically mention shareholder democracy issues such as rights plans, majority voting, access proxy, say on pay and defensive tactics. \n Work is underway on all of these issues. As a result we do not think it is necessary to further highlight these issues. \n h. We heard from some commenters that they want to see a priority added to address the issue of uneven regulation of interchangeable investments. One commenter suggested merging the OSC and the Financial Services Commission of Ontario (FSCO) to achieve consistency in regulatory approaches across retail managed investment products. \n We agree that consistent regulation of like products is an important objective and we strive for that outcome whenever possible. We continue to advocate for harmonized approaches with other regulators, however, any solution involving changes to the current division of regulation across the OSC and FSCO is a government decision and not within the OSC's control. \n i. Opposition was raised by an investor advocate (FAIR Canada) to our priority to reduce regulatory burden. \n We believe that industry compliance costs are ultimately borne by investors. If compliance costs can be reduced by removing regulatory requirements that do not impair our ability to achieve our regulatory goals, we believe that this contributes to more efficient markets. We remain committed to this priority as we believe that it benefits market participants and investors. \n The specific actions we have identified under our priority to reduce regulatory burden relate to addressing fees paid to us, performing solid regulatory impact analyses before introducing new policy, reducing filings or eliminating requirements that are no longer necessary or appropriate, and enhancing how we receive data from market participants. Our objective is to appropriately reduce the time and costs associated with compliance but not at the expense of investor protection or good compliance. For example, we would consider eliminating requirements to file certain forms or information if we found we no longer required the information or if changes in market structure have made a particular requirement redundant. \n j. A number of commenters suggested adding an initiative aimed at establishing a one-stop information source for investors where they could obtain information (e.g. registration, disciplinary and background). \n Ontario became part of the National Registration System in 2013. Proposals to improve the system, including potential changes to its content to better support investors, will be considered by the CSA this year. \n k. Support for our initiative aimed to improve capital formation was mixed. While some commenters favoured the move to expand opportunities for capital formation through new exemptions, others were concerned about whether the amount of research conducted to assess the potential impact on markets and investors has been sufficient. Questions were also raised about the ability to assure compliance with the investor-protection features in the new capital raising proposals. \n A number of rules and multi-lateral instruments related to proposed prospectus exemptions are currently out for public comment. With those publications we have released analysis and data on the potential impacts on the market and market participants. We will be undertaking a comprehensive review of all feedback to determine next steps on these proposals. As part of this process preliminary work is underway to develop an oversight framework to monitor compliance with any new capital raising exemption requirements. \n l. One commenter suggested that we should add a priority focusing on structured product regulation. \n Through our operational work, review of alternative asset classes, strategies and complex products remain a priority focus. The next phase of the CSA's Modernization of Investment Fund Product proposals will be focused on alternative funds, with a specific focus on differentiating how we regulate these types of products and considering the appropriate proficiency for the sale of such products. \n In response to comments we previously received about having too many priorities our objective in the last two years has been to limit the number of priorities in the SoP. This in turn has allowed us to be as transparent and accountable as we can about what we will deliver on those priorities, when we will deliver, and how we will measure our performance. In keeping with this goal to remain focused and committed to the highest priority items, we do not propose to add any additional priorities to our 2014-2015 SoP. However, beyond our twelve highest priorities, the OSC must also continue its core work and support of other important but lower priority initiatives. Several specific suggested priorities will be pursued as part of our core work. \n All of the comment letters are available on our website  www.osc.gov.on.ca . The Statement of Priorities will serve as the guide for the Commission's operations. Following delivery of the Statement of Priorities to the Minister, we will also publish on our website a report on our progress against our 2013-2014 priorities. \n June 26, 2014 \n   \n Ontario Securities Commission 2014-2015 -- Statement of Priorities \n Introduction \n We are pleased to present the Ontario Securities Commission (OSC or Commission) Chair's proposed Statement of Priorities for the Commission commencing April 1, 2014. The Statement of Priorities is required by the  Securities Act  (Ontario) and requires the OSC to publish the statement in its Bulletin and to deliver it to the Minister by June 30 of each year. This statement also supports the OSC's commitment to delivering its regulatory services effectively and with accountability. \n This Statement of Priorities sets out the OSC's strategic goals and the specific initiatives that will be pursued in support of each of these goals in the fiscal year beginning each April. The statement also presents the environmental factors that the OSC considered in setting these goals. The OSC remains committed to its Vision and Mandate: \n OSC Vision \n To be an effective and responsive securities regulator -- fostering a culture of integrity and compliance and instilling investor confidence in the capital markets. \n OSC Mandate \n The OSC's mandate (established by statute) is to provide protection to investors from unfair, improper or fraudulent practices and to foster fair and efficient capital markets and confidence in capital markets. \n Our Environment -- Risks and Challenges \n The regulatory framework for Ontario's capital markets is designed to provide protection to investors while fostering fair and efficient capital markets. Public confidence in these markets can be affected by many factors, including the stability of the financial system, the economic health of the country and the volatility in the marketplace. There are a wide range of issues and risks that challenge the OSC's ability to achieve its vision/mandate. \n As we move away from defined benefit pension plans, individual investors are facing more complex investment choices and are being forced to assume greater risks for their investments and retirement savings. A survey by the Investor Education Fund (2012) identified a number of key findings regarding the investor/advisor relationship: \n a. Investors often have limited financial literacy and advisors are the key influence on investors' decision-making \n b. Investors don't understand or consider different types of advisor registration and licensing. \n c. Knowledge of mutual fund fees and what affects them is minimal. Their complexity makes it difficult for investors to assess potential conflicts of interest. \n d. Most clients believe the advisor has a legal duty to put the client's interests ahead of his or her own. \n A well-functioning investor/advisor relationship is critical to the economic well-being of Ontarians and ultimately to achieving healthy capital markets. The OSC will need to promote a framework that protects investors, where reliance by investors on their advisors is well placed, the advice being provided is suitable and any conflicts are managed appropriately. The Ontario Government is currently examining the need for more consistent proficiency standards for individuals who offer financial advice and planning services. The OSC will work with the government as this initiative evolves. \n The OSC will also need to continue to seek ways to promote investor protection and support those efforts through investor focused policy initiatives, investor education and initiatives to deliver clearer and more understandable information to investors. Through achievement of these outcomes the OSC will continue to foster investors' confidence to invest in our capital markets. \n Capital formation and efficient access to capital for issuers is critical to the economic prosperity of Ontario. The OSC must balance the need to take action to support this vital market function with its mandate to protect investors. Smaller participants are facing challenges raising capital through traditional sources, such as bank financing. To support capital formation the OSC needs to find ways to improve access by small and medium enterprises to capital raising alternatives such as private equity and \"angel\" investors. Other alternatives such as \"crowd funding\" can provide additional options to fund start-up enterprises. Actions in these areas will also help to address competition to attract smaller issuers that is emerging from other jurisdictions. \n The OSC needs to act to address the international, national and interprovincial nature of the markets it regulates. The OSC must remain responsive to market developments with timely regulatory responses that maintain the competitiveness and attractiveness of Ontario capital markets to investors and capital. Capital markets are increasingly international and capital flows are not constrained by borders. It is critical that the OSC continue to play an active role in international organizations such as IOSCO to influence and promote changes to international securities regulation that are most beneficial to Ontario markets and participants. Greater harmonization and streamlined regulatory requirements that are aligned with international standards can enhance the quality and reputation of our markets and promote capital inflows. \n Currently the financial industry, market participants and investors are facing many challenges from globalization, structural changes within our markets as well as ongoing financial innovation. These changes all generate increased complexity and have given rise to new areas of regulatory focus such as the regulation of derivative markets, regulatory changes needed to oversee electronic trading and the effects of rapidly evolving technology including social media on our markets. Domestic market evolution also continues to present issues. For example, smaller retail focused financial firms and issuers continue to experience pressure on their current business models due to market conditions and increasing competition from larger entities. The OSC will need to focus on regulatory solutions and market structures that address market evolution, foster competition and meet the needs of market participants and investors. \n To address national and interprovincial issues it remains important for the OSC to continue to work with its Canadian Securities Administrators (CSA) partners to harmonize the rules and their application across the country where possible. Concurrently, the OSC supports the significant efforts underway between BC, Ontario and the Federal Governments to implement a cooperative securities regulator that will deliver more efficient and effective regulation of the capital markets and effectively oversee sources of systemic risk. The resource implications for the OSC's role in this initiative are currently unclear but are expected to be substantial. \n The increasing regulatory burden continues to present challenges for market participants as the complexity of regulatory requirements and the resources required to comply continue to grow. The OSC will need to examine whether the existing rules are still effective and determine whether they inhibit or promote high-quality capital markets and deliver a system that protects investors and promotes their confidence. It is important to continue to seek less intrusive regulatory solutions and opportunities to avoid undue burdens on business. The OSC must look for ways to lower the regulatory costs while achieving its mandate, as they are a critical component affecting the competiveness and efficiency of Ontario's capital markets. \n We continue to believe that effective consultation is necessary to ensure the development of good regulatory policy and decision making. We will continue to consult through our various advisory committees, public comment processes and other initiatives such as \"OSC in the Community\" and issue-specific public roundtables. \n OSC Regulatory Goals for 2014 -- 2015 \n 1. Deliver strong investor protection \n 2. Deliver responsive regulation \n 3. Deliver effective enforcement and compliance \n 4. Support and promote financial stability \n 5. Run a modern, accountable and efficient organization \n Key OSC Regulatory Priorities for 2014 -- 2015 \n The OSC strives to be as responsive, innovative and collaborative as possible in its policy responses to other regulators. The OSC remains committed to enhanced co-operation and information-sharing with the CSA, working with its partners in the International Organization of Securities Commissions (IOSCO) and collaborating with other international agencies and governments. \n In this environment, the OSC must use its finite resources as efficiently as possible. This Statement of Priorities identifies the most important areas where the OSC intends to focus its resources and actions in 2014-2015. Each of the proposed priorities has been aligned under one of the five OSC regulatory goals. \n Summary of 2014-2015 OSC Priorities \n Deliver strong investor protection \n   \n Issue/Priority \n Proposed Actions \n 1. \n Best Interest Duty to Investors \n a. \n Complete the joint OSC/IIROC/MFDA mystery shop research sweep of advisors to gauge the suitability of advice currently being provided to investors \n   \n   \n b. \n Conduct research on advisor compensation to study the alignment of compensation with client's interests and inform our assessment of the need for a best interest duty \n   \n   \n c. \n Evaluate the options and recommend and approach for this project \n   \n 2. \n Embedded Fees in Mutual Funds \n a. \n Complete third-party research to determine whether and to what extent the perceived conflicts of interests associated with various forms of commission compensation (including product imbedded commissions) influence advisor behaviour. The research will aim to: \n   \n   \n   \n i. \n quantify the degree to which various forms of compensation for distribution affect fund sales \n   \n   \n   \n ii. \n assess whether the use of fee-based compensation materially changes the advice given to the client and has the potential to lead to enhanced long-term investment outcomes relative to the use of commission compensation (including embedded commissions) \n   \n   \n b. \n Encourage expansion of product choices across distribution platforms \n   \n 3. \n Point of Sale Disclosure for Investors \n The CSA Point of Sale (POS) initiative for mutual funds will: \n   \n   \n a. \n Publish final rules introducing pre-sale delivery of the Fund Facts. Work with the CSA to consider mandating a risk classification methodology to improve the comparability of risk ratings of mutual funds in the Fund Facts \n   \n   \n b, \n Publish rules for comment by December 2014 that create a new summary disclosure document for ETFs and require it to be delivered. Legislative changes may be necessary before rules can be finalized \n   \n Deliver responsive regulation \n   \n Issue/Priority \n Proposed Actions \n   \n 4. \n Market Structure Evolution \n a. \n Publish proposals to update the order protection rule to respond to the evolution of the Canadian capital market structure \n   \n 5. \n Improve Capital Formation \n a. \n Complete our review of stakeholder feedback on the following proposed new capital raising prospectus exemptions (offering memorandum, family, friends and business associates, existing security holder and crowd funding exemptions) \n   \n   \n b. \n Subject to considering the feedback received, develop and publish proposed rules implementing these exemptions \n   \n   \n c. \n Develop proposals for streamlining the existing rights offering exemption to improve its efficiency and effectiveness for reporting issuers \n   \n 6. \n Regulation of Fixed Income Securities \n a. \n Review transparency in the corporate bond market and develop a proposal to increase post trade information available to the market. \n   \n 7. \n Corporate Governance -- Women on Boards \n a. \n Complete review of stakeholder feedback on our proposed disclosure requirements requiring TSX-listed and other non-venture issuers to provide disclosure regarding the representation of women on boards and in executive management positions \n   \n   \n b. \n Subject to considering the feedback received, develop and publish proposed rules requiring disclosure about the number of women on boards and in executive management positions \n   \n 8. \n Shareholder Democracy \n a. \n Publish a progress report with preliminary recommendations on the status of our review of the proxy voting system \n   \n   \n b. \n Review the feedback received on CSA Consultation Paper 54-401 Review of the Proxy Voting Infrastructure through the comment letter process and the related OSC roundtable to target specific concerns and potential solutions \n   \n Deliver effective enforcement and compliance \n   \n Issue/Priority \n Proposed Actions \n   \n 9. \n Serious Securities-related Misconduct \n a. \n Bring forward more cases involving fraudulent activity that harms investors and affects the integrity of our market by leveraging strategic partnerships with law enforcement agencies, the Ministry of the Attorney General and relevant international regulatory authorities \n   \n   \n b. \n Bring forward more cases where issuer or registrant misconduct is harming market integrity or eroding confidence in Ontario's capital markets. \n   \n   \n c. \n Select registrants for compliance reviews that are most likely to have material compliance issues, are new registrant firms, or are involved in a specific topic or industry sector that is of concern \n   \n   \n d. \n Issue and analyze a Risk Assessment Questionnaire to gather information necessary to risk rate our registrant population \n   \n Support and promote financial stability \n   \n Issue/Priority \n Proposed Actions \n   \n 10. \n Systemic Risk to Financial Markets \n a. \n Develop rules for the clearing of OTC derivatives and implement trade reporting rules for OTC derivatives \n   \n   \n b. \n Work with CSA colleagues to create a harmonised and efficient OTC derivatives regime in Canada \n   \n   \n c. \n Develop and implement a web portal for trade reports that are unable to be accepted by a designated trade repository \n   \n   \n d. \n Develop a plan for implementing data analysis for systemic risk oversight and market conduct purposes including the development of analytical tools and the creation of snapshot descriptions of the Canadian OTC derivatives market \n   \n   \n e. \n Pursue a leadership role internationally to influence the development of global securities regulation that works for Canada \n   \n   \n f. \n Work with the Ontario, B.C. and Federal governments to support the creation of a Co-operative Capital Markets Regulator \n   \n Run a modern, accountable and efficient organization \n   \n Issue/Priority \n Proposed Actions \n   \n 11. \n Reduce Regulatory Burden \n a. \n Review current fee rule and issues arising due to market evolution and develop a proposed fee rule for approval by the Minister \n   \n   \n b. \n Complete a regulatory impact analysis for all proposed policy projects. \n   \n   \n c. \n Review filing requirements to identify opportunities to cease collection of data that is not used, lightly used, or readily available elsewhere \n   \n   \n d. \n Implement electronic solutions to ease submission of data for market participants \n   \n 12. \n Timely and Fair Adjudication \n a. \n Implement an on-line Electronic Case Management System to receive and distribute electronic filings to improve access to the tribunal and make the hearing process more understandable and efficient \n   \n   \n b. \n Enhance accessibility for respondents and the public by holding electronic hearings (where practical) \n   \n   \n c. \n Adopt and implement a guideline for the timely release of decisions within 6 months, where practical \n Deliver strong investor protection \n Protection of investors continues to be a fundamental element of everything the OSC does. The OSC's Office of the Investor works to strengthen the OSC's investor engagement and ensure investor issues are directly considered in policy and operational activities. Our increasing engagement with investors has improved our understanding of their needs and has informed how the OSC undertakes its outreach and education, regulatory policy, compliance oversight and enforcement work. Seniors represent a growing segment of Ontario's investors. The Office of the Investor will continue to focus on outreach to seniors and bring attention to seniors' issues in policy development, compliance and enforcement. \n The Office of the Investor is continuing to lead outreach to investors across Ontario to hear their concerns and issues and to provide them with resources and tips to help them become more informed and protected investors. The OSC wants investors to be able to make more informed investment decisions. More effective disclosure, prepared in easy-to-understand formats, can help investors better understand investment products, risks, costs and performance. These initiatives and outreach efforts provide a better understanding of investor issues and enhance the OSC's ability to better protect investors. \n Many Ontarians work with an advisor or dealer to achieve their investment and retirement goals. Registered firms and individuals are expected to meet their responsibilities to clients with respect to know your client, know your product and suitability. Investors should be able to expect financial services and products that meet their needs from firms that treat them fairly. Findings from studies commissioned by the Investor Education Fund, Investor Advisory Panel and others have concluded that mutual fund investors often have little knowledge about what they are buying, the fees they are paying or how their advisors are paid. These findings are further supported by Ombudsman for Banking Services and Investments cases that show that suitability can be a problem and investors often have no understanding of the risks they are assuming. Interactions with investors at OSC in the Community events have confirmed these findings as well as investor appetite for simpler and easier to understand information relating to their investments. \n To address these issues, the OSC needs to examine the investor experience and quality of advice being provided to investors in order to better understand the impact, if any, that issues such as incentive structures and embedded commissions may be having on the nature of advice being provided to investors. Research in this crucial area will allow the OSC to identify if there are issues to address and opportunities for improvements. \n The OSC will undertake the priorities set out below toward achieving the following outcomes for investors: \n 1. Investors are provided with clear information before, during and after the point of sale of financial services and products \n 2. Advice provided to investors is clear, and suitable for their needs \n 3. The goals of firms and the investors they deal with are aligned \n Best Interest Duty to Investors \n Priority 1 Issue \n Investors expect the OSC to clearly demonstrate and communicate how they are protecting their interests. Investors expect a fair and transparent client/advisor relationship. The OSC will take steps to examine and better understand the potential impacts on dealers, advisors and investors of imposing a best interest duty. \n   \n Action Plan \n a. \n Complete the joint OSC/IIROC/MFDA mystery shop research sweep of advisors to gauge the suitability of advice currently being provided to investors \n   \n b. \n Conduct research on advisor compensation to study the alignment of compensation with client's interests and inform our assessment of the need for a best interest duty \n   \n c. \n Evaluate the options and recommend an approach for this project \n   \n Success Measures/ Expected Outcomes \n a. \n Mystery shop research completed on time and within budget. Data collected, analysed and areas for potential remediation identified \n   \n b. \n Report on mystery shop published including guidance issued on what constitutes non-compliant advice, compliant advice and good advice. Key findings used to inform targeting of future OSC suitability sweeps and best interest duty policy development \n   \n c. \n Status of advisor compensation research published \n   \n d. \n Options evaluated and recommendations developed \n Embedded Fees in Mutual Funds \n Priority 2 Issue \n Investors are at risk if advisors fail to provide suitable investment advice or manufacturers fail to offer product choices due to compensation structures. The OSC will undertake a targeted analysis of how compensation models influence advisor behaviour to inform a decision on whether or not to cap or ban embedded commissions and other types of compensation arrangements. \n   \n Action Plan \n a. \n Complete third-party research to determine whether and to what extent the perceived conflicts of interests associated with various forms of commission compensation (including product imbedded commissions) influence advisor behaviour. The research will aim to: \n   \n   \n i. \n quantify the degree to which various forms of compensation for distribution affect fund sales \n   \n   \n ii. \n assess whether the use of fee-based compensation materially changes the advice given to the client and has the potential to lead to enhanced long-term investment outcomes relative to the use of commission compensation (including embedded commissions) \n   \n b. \n Encourage expansion of product choices across distribution platforms \n   \n Success Measures/ Expected Outcomes \n a. \n Research completed as per plan (on time and within budget) by early 2015 \n   \n b. \n Actionable results identified and a recommendation made about whether or not to cap or ban embedded commissions \n   \n c. \n Staff notice setting out key findings and status will be published by early 2015 \n Point of Sale Disclosure for Investors \n Priority 3 Issue \n Investor protection can be improved by providing more meaningful and accessible information to investors to support more informed investment decisions. The OSC will publish rules introducing pre-sale delivery of Fund Facts for mutual funds and introduce a new summary disclosure document and delivery regime for ETFs. \n   \n Action Plan \n The CSA Point of Sale (POS) initiative for mutual funds will: \n   \n a. \n Publish final rules introducing pre-sale delivery of the Fund Facts. Work with the CSA to consider mandating a risk classification methodology to improve the comparability of risk ratings of mutual funds in the Fund Facts \n   \n b. \n Publish rules for comment by December 2014 that create a new summary disclosure document for ETFs and require it to be delivered. Legislative changes may be necessary before rules can be finalized \n   \n Success Measures/ Expected Outcomes \n a. \n Positive feedback from stakeholders on the consultation process \n   \n b. \n Final rules will be published by March 2015, subject to Minister approval \n   \n Note: Effectiveness of pre-sale delivery of Fund Facts to be considered in 2015-2016 following implementation (i.e. costs savings to industry stakeholders on delivery; greater investor awareness of key risks and costs). \n Deliver responsive regulation \n Market Structure Evolution \n The overall objective of market regulation is to ensure that markets remain fair and that all participants have confidence in both the resiliency and integrity of the market. Global capital markets continue to undergo significant technological change and rapid evolution. The OSC has responded to these changes with collaborative policy responses with the CSA and through the implementation of appropriate international best practices to support fair, efficient and orderly markets in Ontario. \n In addition, the OSC plans to review the effects of its rules post-implementation to determine if the rules are achieving the desired outcomes. As an example, the order protection rule appears to have had a number of unintended consequences that may be creating inefficiencies and additional costs in the market. This rule will be examined and changes to address these issues will be proposed during the coming year. \n Priority 4 Issue \n The OSC needs to address issues that arise as a result of the evolution of the market including the impact of the order protection rule. \n   \n Action Plan \n a. \n Publish proposals to update the order protection rule to respond to the evolution of the Canadian capital market structure \n   \n Success Measures/ Expected Outcomes \n a. \n Proposed changes to update the order protection rule are published \n   \n b. \n Industry feedback confirms that the proposed changes to the order protection rule will improve efficiency and are aligned with current market needs \n Improve Capital Formation \n The OSC recognizes that cost-effective access to capital is critical to companies of all sizes to grow and develop. The OSC has heard from stakeholders that the current capital raising options in Ontario may not be meeting the needs of companies, particularly start-ups and small and medium enterprises (SMEs). It is critical for the OSC to consider ways to support this important sector. The OSC has also heard from stakeholders that investors may want increased access to investment opportunities in the exempt market. \n The OSC has considered a broader range of capital raising options, particularly for smaller companies. These options are more tailored to start-ups and SMEs and will improve the rule harmonization with other CSA regulators. The OSC is also considering options that provide greater access to exempt market products for all investors while maintaining important investor protections. If appropriate, the OSC will propose changes to its current rules. \n Priority 5 Issue \n The current capital raising regime in Ontario needs to better meet the needs of market participants, especially SMEs. The OSC will look at options to expand opportunities for businesses to raise capital. \n   \n Action Plan \n a. \n Complete our review of stakeholder feedback on the following proposed new capital raising prospectus exemptions (offering memorandum, family, friends and business associates, existing security holder and crowd funding exemptions) \n   \n b. \n Subject to considering the feedback received, develop and publish proposed rules implementing these exemptions \n   \n c. \n Develop proposals for streamlining the existing rights offering exemption to improve its efficiency and effectiveness for reporting issuers \n   \n Success Measures/ Expected Outcomes \n a. \n Rule amendments delivered to Minister for approval and publication of amendments in final form \n   \n b. \n Proposals for streamlining the existing rights offering exemption published for public comment \n Regulation of Fixed Income Securities \n The Canadian fixed income market is similar to the equity market in terms of value of assets outstanding. The fixed income market (particularly the corporate bond market) has substantially increased in size in the last decade and there is a large presence of retail investors invested in this market directly and indirectly. Debt financings are also an important source of financing for Canadian corporations. \n In Canada, corporate bond trading is subject to limited post-trade transparency for both regulators and retail investors. The OSC needs to take steps to better understand the significant issues (e.g. access, sales practices and disclosure) affecting fixed income securities and those who invest in them, and to identify opportunities where changes to regulatory approaches could improve market transparency and better protect investor interests. \n Priority 6 Issue \n Fixed income is a significant but less transparent segment of our capital markets. Retail participation is high as investors seek opportunities for higher yields. The OSC will examine ways to improve the transparency of this market. \n   \n Action Plan \n a. \n Review transparency in the corporate bond market and develop a proposal to increase post trade information available to the market. \n   \n Success Measures/ Expected Outcomes \n a. \n The proposal will be published by March 2015. \n Corporate Governance -- Women on Boards \n Effective corporate governance is a fundamental part of a Board's responsibility and it is key to maintaining investor confidence. The OSC continues to seek opportunities to improve the focus of boards on good governance practices. More diverse board composition may encourage greater effectiveness and better corporate decision making. The OSC has proposed to require greater transparency for investors and other stakeholders regarding the representation of women on boards and in senior management. This transparency is intended to assist investors when making investment and voting decisions. \n Priority 7 Issue \n There are growing expectations for better board governance and transparency, including increased transparency regarding the representation of women in leadership roles at reporting issuers. \n   \n Action Plan \n a. \n Complete review of stakeholder feedback on our proposed disclosure requirements requiring TSX-listed and other non-venture issuers to provide disclosure regarding the representation of women on boards and in executive management positions \n   \n b. \n Subject to considering the feedback received, develop and publish proposed rules requiring disclosure about the number of women on boards and in executive management positions \n   \n Success Measures/ Expected Outcomes \n a. \n Rule amendments delivered to the Minister of Finance for approval and final amendments published \n   \n b. \n The criteria and process to select senior management and the Board will be more transparent to shareholders \n Shareholder Democracy \n The ability to vote on certain key decisions is a fundamental shareholder right. By voting, shareholders elect directors, approve or disapprove major matters and make their views known on matters such as executive compensation. Shareholder voting plays an important role in the fairness and efficiency of our capital markets. Recently, some issuers and investors have raised concerns about the reliability and accuracy of the proxy voting infrastructure that records shareholder votes. The OSC believes it is critical that the proxy voting infrastructure records votes accurately and reliably, and it is necessary for market confidence that it is perceived to be fair. \n Priority 8 Issue \n The OSC is taking a leadership role in looking for ways forward with the proxy voting system, and improving the accuracy and reliability of the proxy voting infrastructure. \n   \n Action Plan \n a. \n Publish a progress report with preliminary recommendations on the status of our review of the proxy voting system \n   \n b. \n Review the feedback received on CSA Consultation Paper 54-401 Review of the Proxy Voting Infrastructure through the comment letter process and the related OSC roundtable to target specific concerns and potential solutions \n   \n Success Measures/ Expected Outcomes \n a. \n Progress report published by December 2014 \n   \n b. \n Significant stakeholder engagement on the issues and positive stakeholder feedback on the consultation process \n Deliver effective enforcement and compliance \n Serious Securities-related Misconduct \n To promote public confidence in capital markets, the OSC must use its authority to address significant non-compliance and misconduct. The OSC continues to intensify its enforcement presence and is exploring new opportunities to bolster investor and market participant trust in our markets. \n The OSC continues to pursue more fraud cases before the courts, where it can seek jail sentences for violations of the Securities Act (Ontario) and breaches of Commission orders. The OSC is also considering various new policy initiatives to strengthen its enforcement regime including no-enforcement action agreements, no-contest settlements, and a credit for co-operation program with enhanced public disclosure of the credit granted for co-operating with the OSC. \n As the regulatory agenda increases the OSC must effectively allocate its resources. As enforcement consumes the greatest proportion of OSC resources it is particularly important to maximize the enforcement impact on activities with the most detrimental impact on investors. The OSC Joint Serious Offences Team (JSOT) has been formed with the cooperation of law enforcement agencies and the Ministry of the Attorney General and the OSC is leveraging their different powers, authorities and skill sets to address these issues. \n Effective Compliance \n The OSC conducts compliance reviews of registered firms primarily to assess compliance with Ontario securities law, but also to help registrants improve their understanding of the regulatory requirements and our expectations, and to help us to learn about a specific industry topic or practice. \n The OSC will continue to focus on firms that are most likely to have material compliance issues or risk of harm to investors or would have a significant effect on the capital markets if there is a compliance breach due to their size or market penetration. In addition to reviewing individual firms, the OSC will continue to conduct issue specific compliance reviews (sweeps). Sweeps allow us to respond on a timely basis to industry-wide concerns or issues. The OSC regularly performs sweeps of newly registered firms to assess if they are off to a good start and to help them to understand their requirements and our expectations. \n Priority 9 Issue \n   \n The OSC needs to better demonstrate the effectiveness and efficiency of its enforcement and compliance efforts. The OSC will seek to limit potential harm to investors by focusing enforcement efforts on cases involving fraud, manipulation and other serious securities related misconduct. \n   \n   \n The OSC will focus its compliance oversight on registrants that are most likely to have material compliance issues, including risk of harm to investors, or significant effect on the capital markets if there is a compliance breach. \n   \n Action Plan \n a. \n Bring forward more cases involving fraudulent activity that harms investors and affects the integrity of our market by leveraging strategic partnerships with law enforcement agencies, the Ministry of the Attorney General and relevant international regulatory authorities \n   \n b. \n Bring forward more cases where issuer or registrant misconduct is harming market integrity or eroding confidence in Ontario's capital markets. \n   \n c. \n Select registrants for compliance reviews that are most likely to have material compliance issues, are new registrant firms, or are involved in a specific topic or industry sector that is of concern \n   \n d. \n Issue and analyze a Risk Assessment Questionnaire to gather information necessary to risk rate our registrant population \n   \n Success Measures/ Expected Outcomes \n a. \n The OSC JSOT will: \n   \n   \n i. \n Increase the number of cases investigated for fraudulent activity and recidivist offenders \n   \n   \n ii. \n Work with law enforcement to proactively use Criminal Code tools in JSOT investigations \n   \n b. \n Visible and effective enforcement actions in cases of unacceptable or egregious issuer or registrant misconduct will result in improved market conduct and have a deterrent effect on future misconduct \n   \n c. \n Increase the number of reviews of registrants that reveal significant compliance issues \n   \n d. \n Respond on a timely basis to industry wide compliance issues or concerns \n Support and Promote Financial Stability \n Ontario's financial markets are part of the Canadian and international capital markets, closely linked by technology, investment flows, risk-management practices, cross border transactions and the global business models of market participants. The OSC must align its regulatory framework to adhere to important global reforms and standards, including G20 commitments (OTC derivatives and systemic risk) that seek to promote financial system resilience. The OSC actively participates in the development of international securities regulation and plays a leadership role as a key member of the IOSCO Executive, which sets internationally recognized standards for the securities sector. This role is critical to allow the OSC to develop and implement timely, aligned regulatory responses that maintain the competitiveness and attractiveness of Ontario capital markets to investors and capital. \n One of the key outcomes from the 2008 financial crisis was the understanding of the need for increased regulatory coordination and oversight of the OTC derivatives markets. As the trading of OTC derivatives could be a significant source of systemic risk in Canada a globally and nationally coordinated OTC derivatives regime benefits Ontario capital markets. Regulatory oversight of the OTC derivatives markets should result in earlier identification of potential risks and increase the ability of regulators to respond to systemic risk and market misconduct. This will also ensure Canada can meet its international commitments in this area. \n Priority 10 Issue \n Increasingly interconnected global financial markets present systemic risk to financial market stability. OTC derivatives represent a significant potential source of systemic risk in Canada. The OSC will develop and implement an OTC derivatives regulatory framework to reduce potential risks to the financial system posed by unregulated entities. \n   \n The OSC supports implementation of a cooperative securities regulator that will deliver more efficient and effective regulation of the capital markets and effectively oversee sources of systemic risk. \n   \n Action Plan \n a. \n Develop rules for the clearing of OTC derivatives and implement trade reporting rules for OTC derivatives \n   \n b. \n Work with CSA colleagues to create a harmonised and efficient OTC derivatives regime in Canada \n   \n c. \n Develop and implement a web portal for trade reports that are unable to be accepted by a designated trade repository \n   \n d. \n Develop a plan for implementing data analysis for systemic risk oversight and market conduct purposes including the development of analytical tools and the creation of snapshot descriptions of the Canadian OTC derivatives market \n   \n e. \n Pursue a leadership role internationally to influence the development of global securities regulation that works for Canada \n   \n f. \n Work with the Ontario, B.C. and Federal governments to support the creation of a Co-operative Capital Markets Regulator \n   \n Success Measures/ Expected Outcomes \n a. \n Clearing and reporting rules for OTC derivatives that align with international standards and meet G20 commitments will be in place \n   \n b. \n Systems for oversight and to facilitate systemic analysis of the Ontario derivatives markets will be in place on time and within budget \n Run a modern, accountable and efficient organization \n Reduce Regulatory Burden \n All market participants are operating in challenging economic times and have to deal with intense competition, uneven global economic growth and slowly recovering financial markets. Smaller market participants are struggling to adjust to market volatility and market structure changes. Recognizing these challenges the OSC is looking for ways to reduce the regulatory burden in both time and the costs of compliance. Market participants expect the OSC to use its limited resources efficiently, so improving our efficiency is a top priority. In February the OSC implemented a targeted, one-time fee reduction to address market conditions and assist smaller market participants. The OSC has also committed to review its current fee rule and issues arising due to market evolution and develop a proposed fee rule for approval by the Minister. \n Where regulatory requirements may no longer be appropriate or required due to market evolution there is an opportunity to reduce regulatory burden. The OSC is committed to assessing the impacts of its proposed policy and operational changes to try to ensure that any proposed regulation is proportionate and fit for purpose, does not act as an unnecessary barrier to new firms entering the industry and does not constrain innovation and growth. The OSC will improve its policy development process by completing a regulatory impact analysis prior to initiating any proposed policy projects. \n Priority 11 Issue \n Market participants continue to identify regulatory burden as a significant issue. The OSC will look for ways to reduce regulatory burden on market participants. \n   \n Action Plan \n a. \n Review current fee rule and issues arising due to market evolution and develop a proposed fee rule for approval by the Minister \n   \n b. \n Complete a regulatory impact analysis for all proposed policy projects. \n   \n c. \n Review filing requirements to identify opportunities to cease collection of data that is not used, lightly used, or readily available elsewhere \n   \n d. \n Implement electronic solutions to ease submission of data for market participants \n   \n Success Measures/ Expected Outcomes \n a. \n At least two opportunities identified where filing requirements could be reduced or eliminated \n   \n b. \n At least 95% of capital and financial statement filings by registrants received electronically \n Timely and Fair Adjudication \n Timely and fair adjudication processes are a key requirement of the regulatory framework. The OSC is looking for ways to reduce costs, improve the efficiency of the adjudication process and to modernize our hearing process. Improved timeliness benefits respondents and reduces the risk of offenders avoiding sanction due to unreasonable delays in the process. \n Priority 12 Issue \n The OSC needs to improve its adjudicative processes through more transparent policies, practices and procedures and more timely dissemination of its orders, decisions and reasons. \n   \n Action Plan \n a. \n Implement an on-line Electronic Case Management System to receive and distribute electronic filings to improve access to the tribunal and make the hearing process more understandable and efficient \n   \n b. \n Enhance accessibility for respondents and the public by holding electronic hearings (where practical) \n   \n c. \n Adopt and implement a guideline for the timely release of decisions within 6 months, where practical \n   \n Success Measures/ Expected Outcomes \n a. \n The Electronic Case Management System will be implemented on time and within budget. \n   \n b. \n Hearings will be held electronically, as appropriate \n   \n c. \n The efficiency and timeliness of tribunal adjudicative hearing and deliberation processes will be improved. Decisions will be released within six months, where practical \n 2014-2015 Financial Outlook \n OSC Revenues and Surplus \n The OSC is forecasting 2014-2015 revenues to increase by 2.7% from 2013-2014 revenues. The forecast reflects fee increases set out in the OSC's fee rules (13-502 and 13-503), which became effective April 1, 2013. The fee increases are necessary to meet the OSC's evolving regulatory responsibilities, many of which are driven by work at the international level. To maintain competitive capital markets in Canada, the OSC must align its regulatory framework to be consistent with important global reforms and standards including G20 commitments (derivatives and systemic risk), increasingly complex international enforcement files, changing oversight responsibilities related to market infrastructure entities and new complex products. \n In February, the OSC announced an opportunity for one-time relief on participation fees for certain small registered firms and reporting issuers (\"Participants\"). Eligible Participants were required to apply for relief. The total financial impact of the relief provided was $391,000. \n Although the OSC experienced a surplus in 2014, it expects to operate at a deficit in 2014-2015. As a result, the OSC's general surplus as at March 31, 2015 is expected to be approximately $4.9 million. The OSC maintains a $20 million reserve that may be used to fund operations. \n 2014-2015 Budget Approach \n The 2014-2015 OSC Budget is focused on investment in the key strategies identified in the 2012-2015 OSC Strategic Plan, while at the same time maintaining fiscal responsibility. In setting this budget the OSC has taken a strategic approach to assess areas where resources can be reduced, or the work can be done differently or more efficiently and has refocused resources to priority areas. This resulted in decreased budgets for certain program areas and an OSC Budget for 2014-2015 which is lower than the 2013-2014 budget. \n Budget Comparisons \n The OSC continues to face challenges to continue to improve its capacity to keep up with market developments, innovation and investor concerns. Increased use of technology is a key element of the OSC's strategy. As a result, the budget reflects the need to invest resources to update and improve the OSC Information Technology infrastructure. The budget also includes resources for work toward the successful implementation of the Common Market Regulator. \n The budget reflects a decrease of 0.6% from the 2013-2014 budget. Salaries and benefits, which comprise $77.9 million or 75.7% of the budget, reflect an increase of $3.5 million or 4.7% over 2013-2014 spending due to budgeting of full-year costs for vacancies and staff hired throughout 2013-2014 and new positions approved to achieve the OSC's strategic initiatives. \n The significant decrease in the capital budget primarily reflects the fact that the build-out of recently acquired additional space that took place in 2012-2013 and 2013-2014 is now complete. The budget also includes an investment to support upgrading and expansion of our information technology, including completion of the network replacement. In addition, funds have been allocated to implement a refresh of our mobile devices program. \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}