{"url": "http://www.boxofficemojo.com/about/?ref=ft", "content": "About Box Office Mojo \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n About Box Office Mojo \n GENERAL Box Office Mojo ( http://www.boxofficemojo.com ), is the leading online box-office reporting service. Box Office Mojo is owned and operated by IMDb ( www.imdb.com ), the #1 movie website in the world.  \n PRESS / MEDIA To request an interview with our box office editor for print, online publication or for television or radio broadcast, write to  press@imdb.com  (please include your telephone number and deadline).  \n COPYRIGHT You are also welcome to quote small subsets (less than 20 names/titles) of filmography or title related data on non-commercial websites, on message board systems, in magazine articles etc. We do insist, however, that you make reference to the source of the data via the phrase: \"Information courtesy of Box Office Mojo. Used with permission.\" For offline references please also include the URL  http://www.boxofficemojo.com  to compensate for the lack of a live link to the site.  \n ADVERTISE WITH US Click here  for more information about advertising opportunities.  \n GENERAL INQUIRIES Please write to  mail@boxofficemojo.com .  \n ADDITIONAL LINKS  -  About Box Office Tracking -  RSS Feeds -  Free Box Office Data Feeds -  Privacy Policy -  Term of Use   \n ABOUT IMDb IMDb is the world's most popular and authoritative source for movie, TV and celebrity content. The IMDb consumer site ( www.imdb.com ) is the #1 movie website in the world with a combined web and mobile audience of more than 250 million unique monthly visitors. IMDb offers a searchable database of more than 185 million data items including more than 3 million movies, TV and entertainment programs and more than 6 million cast and crew members. Consumers rely on the information IMDb provides—including local movie showtimes, ticketing, trailers, critic and user reviews, personalized recommendations, photo galleries, entertainment news, quotes, trivia, box-office data, editorial feature sections and a universal Watchlist—when deciding what to watch and where to watch it. IMDb's portfolio of leading entertainment apps ( http://www.imdb.com/apps/ ) includes its popular \"Movies & TV\" app for iPhone, iPad, Kindle Fire, Android phones, Android tablets and its mobile-optimized website. To date, there have been more than 115 million downloads of IMDb's mobile apps worldwide. IMDb's X-Ray for Movies & TV Shows ( www.imdb.com/x-ray ) is a feature that revolutionizes the viewing experience by bringing the power of IMDb directly to Kindle Fire HD, Fire TV and Fire TV Stick. IMDb's Facebook page ( https://www.facebook.com/imdb ) and official Twitter account ( https://twitter.com/imdb ) are followed by more than 7 million passionate entertainment fans. IMDbPro ( http://www.imdbpro.com ) is the essential resource for entertainment industry professionals. This membership-based service includes comprehensive information and tools that are designed to help entertainment industry professionals achieve success throughout all stages of their career. IMDbPro offers members the following: detailed contact and representation information; IMDb profile management tools; exclusive STARmeter rankings that are determined by user searches on IMDb; a casting service to post breakdowns and apply to roles, a mobile optimized website and more. Additionally, IMDb owns and operates Withoutabox ( http://www.withoutabox.com ), the premier submission service for film festivals and filmmakers, and Box Office Mojo ( http://www.boxofficemojo.com ), the leading online box-office reporting service. IMDb.com is operated by IMDb.com, Inc., a wholly owned subsidiary of Amazon.com, Inc. (NASDAQ:AMZN) ( http://www.amazon.com ). To learn more, go to:  http://www.imdb.com/press . \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}