{"url": "https://it.wikipedia.org/wiki/Ellie_Darcey-Alden", "content": "Ellie Darcey-Alden - Wikipedia \n Ellie Darcey-Alden   \n Da Wikipedia, l'enciclopedia libera.   \n\t\t\t\t\tVai a:\t\t\t\t\t navigazione , \t\t\t\t\t ricerca \n Questa voce  sull'argomento attori britannici è solo un  abbozzo . \n Contribuisci  a migliorarla secondo le  convenzioni di Wikipedia . \n Ellie Darcey Alden  ( Oxford ,  4 settembre   1999 ) è un' attrice   britannica .  \n Indice \n 1   Biografia \n 2   Filmografia e Televisione \n 3   Note \n 4   Collegamenti esterni \n Biografia [ modifica  |  modifica wikitesto ] \n [1] Ellie è nata a Oxford, Inghilterra. È una ragazza molto attiva, mentre la danza e il teatro occupano la maggior parte del suo tempo prende anche lezioni di Karate. Ellie è anche molto legata agli animali, possiede infatti due conigli, un cocker spaniel, e ama i cavalli. \n Ellie ha iniziato la sua carriera di attrice nella serie della BBC Robin Hood recitando il ruolo di Mary. Poi è apparsa anche nella serie sempre della BBC Hobly City recitando il ruolo di Emma Walker. \n Il ruolo più noto di Ellie è quello della giovane Lily Evans nell'epilogo finale della serie cinematografica di  Harry Potter , \" Harry Potter e i Doni della Morte - Parte 2 \". Ellie ha fatto un provino ai Leavesden studios insieme a  Benedict Clarke  (giovane Severus Piton) e, qualche settimana dopo ha ottenuto il ruolo della giovane Lily Evans. Nel 2012 Ellie comparirà in un film intitolato \"Welcome to the Punch\" che uscirà nel 2013. \n Ellie è una grande fan del  Quidditch Babbano , ha imparato a giocarlo dai membri delle cinque squadre nazionali che hanno partecipato ai IQA 2012 Summer Games (Canada, Regno Unito, Australia, Francia e Stati Uniti). [2]  Ha un fratello più piccolo di nome Joe. \n Filmografia e Televisione [ modifica  |  modifica wikitesto ] \n Anno \n Titolo \n Ruolo \n Note \n 2009 \n Robin Hood (serie televisiva 2006) \n Mary \n 1 episodio: \"Eclissi totale\" \n Holby City \n Emma Walker \n 3 episodi: \"The Hands That Rock the Cradle: Part 1\", \" The Hands That Rock the Cradle: Part 2 \" e \"Stand by Me \" - Titoli Originali \n 2011 \n Harry Potter e i Doni della Morte - Parte 2 \n Giovane Lily Evans Potter \n \"Ricordi di Piton\" \n 2012 \n Pranks \n Katie \n Cortometraggio \n Doctor Who \n Francesca \n 1 episodio: \"The Snowmen\" - Titolo originale \n 2013 \n Welcome to the Punch \n Ragazza \n Note [ modifica  |  modifica wikitesto ] \n ^   Ellie Darcey-Alden - Biography - IMDb \n ^   Ellie Darcey-Alden - Harry Potter Wiki \n Collegamenti esterni [ modifica  |  modifica wikitesto ] \n ( EN )  Ellie Darcey-Alden , su  Internet Movie Database , IMDb.com.   \n \"Profilo Twitter\":  https://twitter.com/Elliedalden \n Controllo di autorità \n VIAF :  ( EN )  310501854 \n   Portale Biografie \n   Portale Cinema \n\t\t\t\t\t\tEstratto da \" https://it.wikipedia.org/w/index.php?title=Ellie_Darcey-Alden&oldid=81890905 \"\t\t\t\t\t \n Categorie :  Nati nel 1999 Nati il 4 settembre Nati a Oxford Attori bambini britannici Categorie nascoste:  Stub - attori britannici Persone viventi BioBot Codice IMDb letto da Wikidata Voci con codice VIAF Voci biografiche con codici di controllo di autorità   \n Menu di navigazione \n Strumenti personali \n Accesso non effettuato discussioni contributi registrati entra   \n Namespace \n Voce Discussione   \n Varianti \n Visite \n Leggi Modifica Modifica wikitesto Cronologia   \n Altro \n Ricerca \n Navigazione \n Pagina principale Ultime modifiche Una voce a caso Vetrina Aiuto Sportello informazioni   \n Comunità \n Portale Comunità Bar Il Wikipediano Fai una donazione Contatti   \n Strumenti \n Puntano qui Modifiche correlate Pagine speciali Link permanente Informazioni pagina Elemento Wikidata Cita questa voce   \n Stampa/esporta \n Crea un libro Scarica come PDF Versione stampabile   \n In altre lingue \n Deutsch English Français   \n Modifica collegamenti   \n  Questa pagina è stata modificata per l'ultima volta il 7 lug 2016 alle 15:08. \n Il testo è disponibile secondo la  licenza Creative Commons Attribuzione-Condividi allo stesso modo ; possono applicarsi condizioni ulteriori. Vedi le  condizioni d'uso  per i dettagli. \n Informativa sulla privacy \n Informazioni su Wikipedia \n Avvertenze \n Sviluppatori \n Dichiarazione sui cookie \n Versione mobile"}