{"url": "https://en.wikipedia.org/wiki/Talk:South_Cambridgeshire_District_Council_election,_2016", "content": "Talk:South Cambridgeshire District Council election, 2016 - Wikipedia \n Talk:South Cambridgeshire District Council election, 2016   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n WikiProject Elections and Referendums \n (Rated Stub-class) \n Elections and Referendums Wikipedia:WikiProject Elections and Referendums Template:WikiProject Elections and Referendums Elections and Referendums articles \n v \n t \n e \nThis article is within the scope of  WikiProject Elections and Referendums , an ongoing effort to improve the quality of, expand upon and create new articles relating to  elections ,  electoral reform  and other aspects of democratic decision-making. For more information, visit  our project page . \n   Stub   \n This article has been rated as  Stub-Class  on the project's  quality scale . \n   \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Talk:South_Cambridgeshire_District_Council_election,_2016&oldid=716443455 \"\t\t\t\t\t \n Categories :  Stub-Class Elections and Referendums articles WikiProject Elections and Referendums articles   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit New section View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n  This page was last edited on 21 April 2016, at 20:27. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}