{"url": "https://www.amazon.com/IMDb-Mobile-LLC-Movies-TV/dp/B004GISARW", "content": "Amazon.com: IMDb Movies & TV: Appstore for Android \n Interesting Finds Updated Daily \n Amazon \n    Try Prime\n Apps & Games \n Select the department you want to search in \n All Departments \n Cyber Monday Deals Week \n Alexa Skills \n Amazon Devices \n Amazon Video \n Amazon Warehouse Deals \n Appliances \n Apps & Games \n Arts, Crafts & Sewing \n Automotive Parts & Accessories \n Baby \n Beauty & Personal Care \n Books \n CDs & Vinyl \n Cell Phones & Accessories \n Clothing, Shoes & Jewelry \n    Women \n    Men \n    Girls \n    Boys \n    Baby \n Collectibles & Fine Art \n Computers \n Courses \n Credit and Payment Cards \n Digital Music \n Electronics \n Garden & Outdoor \n Gift Cards \n Grocery & Gourmet Food \n Handmade \n Health, Household & Baby Care \n Home & Business Services \n Home & Kitchen \n Industrial & Scientific \n Kindle Store \n Luggage & Travel Gear \n Luxury Beauty \n Magazine Subscriptions \n Movies & TV \n Musical Instruments \n Office Products \n Pet Supplies \n Prime Exclusive Savings \n Prime Pantry \n Software \n Sports & Outdoors \n Tools & Home Improvement \n Toys & Games \n Vehicles \n Video Games \n Wine \n Go \n          Search\n Departments \n EN \n  \n Hello. Sign in Account & Lists Sign in Account & Lists Orders Try Prime Cart \n Your Amazon.com Cyber Monday Deals Week Gift Cards Registry Sell Help Disability Customer Support  \n Appstore for Android   Best Sellers   Amazon Coins   Deals   New Releases   Fire Tablet Apps   Fire TV Apps   Get Started   Games   Your Apps & Devices   Underground Apps   Fire Phone Apps   Help \n                Apps & Games\n             ›\n                 Movies & TV\n Get this app \n Please sign in before purchasing ( Why? ) \n            Sign in\n                        Add to List\n Learn how buying works \n            Redeem a gift card or promotion code\n IMDb Movies & TV \nby  IMDb Mobile, LLC \n Rated: \n                Guidance Suggested\n 4.3 out of 5 stars \n      789 customer reviews\n            Price:\n                Free Download\n                Sold by:\n                Amazon Digital Services LLC\n            Available  instantly \n This app needs permission to access: \n\t            Access coarse (e.g., Cell-ID, Wi-Fi) location\n\t            Open network sockets\n\t\t\t\tSee all Application Permissions\n\t\t\tContact Developer\n Try our new International mobile shopping experience! \n                Shop from your smartphone for everything Amazon.com ships to your country, now in additional languages.  Learn more \n ›  \n See more product promotions \n        By placing your order, you agree to our  Terms of Use \n Customers who bought this item also bought Page  1  of  1   Start over Page 1 of 1   \n This shopping feature will continue to load items. In order to navigate out of this carousel please use your heading shortcut key to navigate to the next or previous heading. \n Back \n            Comics\n comiXology \n 4.0 out of 5 stars \n 1,363 \n $0.00 \n            Pinball Arcade\n FarSight Studios \n 3.4 out of 5 stars \n 789 \n $0.00 \n            TV Classics\n Video Services \n 3.6 out of 5 stars \n 33 \n $1.49   \n            Word Genius - Mind Exercise Game\n HI STUDIO\u0085 \n 4.1 out of 5 stars \n 1,857 \n $0.00 \n            TETRIS® Blitz\n Electronic Arts Inc. \n 3.9 out of 5 stars \n 9,889 \n $0.00 \n            Swype Keyboard\n Nuance Communications \n 3.9 out of 5 stars \n 685 \n $0.99   \n Next \n Latest updates \n What's new in version 7.2.2.107220100 \n We've fixed a few bugs in this release, including one that was preventing the Parents' Guide from displaying for some movies and shows. Thanks for all of your feedback! \n Product details \n ASIN:  B004GISARW \n Original Release Date:  March 18, 2011 \n  Latest Developer Update:  November 9, 2017\n Rated: \n            Guidance Suggested\n\t    This app may include dynamic content. \n                What's this?\n Average Customer Review: \n 4.3 out of 5 stars \n      789 customer reviews\n Amazon Best Sellers Rank:  \n#973 Free in Apps & Games ( See Top 100 Free in Apps & Games )\n #108 \n in  Apps & Games  >  Movies & TV \n Developer info \n                            android@imdb.com\n                            http://www.imdb.com/apps/android/\n                        More apps by this developer\n Product features \n Explore and search our catalog of 3+ million movie and TV titles & 7+ million credited celebrities, actors, actresses, directors, and crew members \n Current movie trailers and entertainment news \n Movie & TV showtimes and user & critic reviews \n Product description \n                IMDb, the world’s most popular and authoritative source for movie, TV, and celebrity content. Sign in to: • Add movies and TV shows to your Watchlist • Rate what you’ve seen • Receive notifications for showtimes, breaking news, and more Explore and search: • Our catalog of 3+ million movie and TV titles • Over 7+ million credited celebrities, actors, actresses, directors, and crew members • Current movie trailers and entertainment news • Movie & TV showtimes and user & critic reviews • Quotes, trivia, and goofs • Lists of Best Picture winners, top-rated and most popular movies and TV, celebrity birthdays, and more IMDb is available worldwide in English (US/UK), Spanish, German, French, Portuguese, Italian, Japanese, Korean, and Chinese.\n Technical details \n Size:  8.9MB \n Version:  7.2.2.107220100 \n Developed By:  IMDb Mobile, LLC\n            ( \n                Privacy Policy\n )\n Application Permissions: \n        ( \n            Help me understand what permissions mean\n         )\n                Access coarse (e.g., Cell-ID, Wi-Fi) location\n                Open network sockets\n                Access information about networks\n                Access the vibration feature\n                PowerManager WakeLocks to keep processor from sleeping or screen from dimming\n                Allows an application to receive messages via Google Cloud Messaging\n Minimum Operating System:  Android 4.4 \n Approximate Download Time:  Less than 90 seconds \n Customer reviews 4.3 out of 5 stars 789 4.3 out of 5 stars 5 star 67% 4 star 14% 3 star 6% 2 star 3% 1 star 10% Share your thoughts with other customers Write a customer review See all 789 customer reviews Top customer reviews There was a problem filtering reviews right now. Please try again later. 5.0 out of 5 stars Great resource By The Professional Organizer on November 19, 2017 Verified Purchase I can't tell you how often i use this app. I watch most TV shows with it open trying to figure out where I have seen people before. Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars love IMDB By Gus P. on November 11, 2017 Verified Purchase love having IMDB on my new Fire 7. Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Five Stars By Curtis Cotton on November 10, 2017 Verified Purchase Excellent Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Five Stars By michael barbee on November 11, 2017 Verified Purchase Good Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Five Stars By Amazon Customer on October 31, 2017 Verified Purchase awesome Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 2.0 out of 5 stars View wifi settings, why? By Josh on March 14, 2017 Verified Purchase Why does a bug fix update require new permissions?Take this time to evaluate what permissions you actually need and remove the rest. I'll look for your update informing what unneeded permissions were removed and will happily update this review at that point. Read more 0 Comment | \n      2 people found this helpful.\n  Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Five Stars By Edward Levine on August 25, 2017 Verified Purchase great source for movie lovers and current news Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Helps in so many ways..... By Rainy Day on April 11, 2014 Verified Purchase My friends and  I are old movie buffs.  We discuss movies and actors and this helps settle disputes.  It is also great to find out what is showing at theaters now.  I travel some and can always find out what is showing and when from IMDb.  Recommend. Read more 0 Comment | Was this review helpful to you? Yes No Report abuse See all 789 reviews Write a customer review \n Customer images \n See all customer images \n Most recent customer reviews 5.0 out of 5 stars My go-to for anything I want to know about actors ... My go-to for anything I want to know about actors, movies and television shows. They almost always have movie trailers you can watch to determine whether or not it's a movie you... Read more \n Published 3 days ago by Jill's Amazon Account 3.0 out of 5 stars I really liked this app I'm not sure how to respond. I really liked this app, & used it frequently, but all of a sudden it is no longer supported on my Kindle Fire HD. Read more \n Published 5 days ago by Stephanie 1.0 out of 5 stars Nk longer supported on kindle fire What happened to this app?  It's no longer supported on my Kindle fire.  Disappointed :( \n Published 11 days ago by nvl 5.0 out of 5 stars IMDb App This was one of my favourite apps. I used it daily-now as others have mentioned my kindle no lingers supports it. I am very annoyed and frustrated. Read more \n Published 13 days ago by MR G K OLBRECHTS 1.0 out of 5 stars No longer supported??? This app. stopped working on Kindle Fire HD. As the other reviewer mentioned, it has we worked properly for years, now it's not supported.  Please fix this!!! \n Published 13 days ago by K.C. 5.0 out of 5 stars IMDb is the go to site for everything entertainment. I've been using IMDb to find names, settle questions, track down projects for years. No surprise that Amazon bought this gem of a site. \n Published 13 days ago by A Close Reader 1.0 out of 5 stars BUMMER! I'm devasted! When I purchased my Kindle a few years back the IMDb App came with it, and I soon became an avid fan... Read more \n Published 14 days ago by BN 5.0 out of 5 stars It has every movie I've looked up. It has every actor I've looked up. \n Published 19 days ago by RedwoodGal 1.0 out of 5 stars One Star Will this app play movies? \n Published 23 days ago by Amazon Customer Search customer reviews Search \n        Amazon Appstore Return Policy\n There's a problem loading this menu right now. \n Learn more about Amazon Prime. \n  Get fast, free shipping with Amazon Prime  \n  Prime members enjoy FREE Two-Day Shipping and exclusive access to music, movies, TV shows, original audio series, and Kindle books.  \n      >\n       Get started \n Back to top \n Get to Know Us Careers About Amazon Investor Relations Amazon Devices Make Money with Us Sell on Amazon Sell Your Services on Amazon Sell on Amazon Business Sell Your Apps on Amazon Become an Affiliate Advertise Your Products Self-Publish with Us Become an Amazon Vendor › See all Amazon Payment Products Amazon Rewards Visa Signature Cards Amazon.com Store Card Amazon.com Corporate Credit Line Shop with Points Credit Card Marketplace Reload Your Balance Amazon Currency Converter Let Us Help You Your Account Your Orders Shipping Rates & Policies Amazon Prime Returns & Replacements Manage Your Content and Devices Amazon Assistant Help \n English \n United States \n Amazon Music   Stream millions  of songs \n Amazon Drive   Cloud storage  from Amazon \n 6pm   Score deals  on fashion brands \n AbeBooks   Books, art  & collectibles \n ACX    Audiobook Publishing  Made Easy \n Alexa   Actionable Analytics  for the Web \n Amazon Business   Everything For  Your Business \n   \n AmazonFresh   Groceries & More  Right To Your Door \n AmazonGlobal   Ship Orders  Internationally \n Home Services   Handpicked Pros  Happiness Guarantee \n Amazon Inspire   Digital Educational   Resources \n Amazon Rapids   Fun stories for   kids on the go \n Amazon Restaurants   Food delivery from  local restaurants \n Amazon Video Direct   Video Distribution  Made Easy \n   \n Amazon Web Services   Scalable Cloud  Computing Services \n Audible   Download  Audio Books \n AudiobookStand   Discount Audiobooks  on Disc \n Book Depository   Books With Free  Delivery Worldwide \n Box Office Mojo   Find Movie  Box Office Data \n ComiXology   Thousands of  Digital Comics \n CreateSpace   Indie Print Publishing  Made Easy \n   \n DPReview   Digital  Photography \n East Dane   Designer Men's  Fashion \n Fabric   Sewing, Quilting  & Knitting \n Goodreads   Book reviews  & recommendations \n IMDb   Movies, TV  & Celebrities \n IMDbPro   Get Info Entertainment  Professionals Need \n Junglee.com   Shop Online  in India \n   \n Kindle Direct Publishing   Indie Digital Publishing  Made Easy\n Prime Now   FREE 2-Hour Delivery  on Everyday Items \n Prime Photos   Unlimited Photo Storage  Free With Prime \n Shopbop   Designer  Fashion Brands \n TenMarks.com   Math Activities  for Kids & Schools \n Warehouse Deals   Open-Box  Discounts \n Whispercast   Discover & Distribute  Digital Content\n   \n Whole Foods Market   America’s Healthiest  Grocery Store \n Withoutabox   Submit to  Film Festivals \n Woot!   Deals and   Shenanigans \n Zappos   Shoes &  Clothing \n Souq.com   Shop Online in  the Middle East \n Subscribe with Amazon   Discover & try  subscription services \n   \n Conditions of Use Privacy Notice Interest-Based Ads © 1996-2017, Amazon.com, Inc. or its affiliates"}