{"url": "http://www.w3.org/WAI/Resources/WAI-UA-Support", "content": "User Agent Support for Accessibility \n User Agent Support for Accessibility \n Note: This page is outdated; some of the information is not currently correct. \n Note:\n  WCAG 2.0 was published in December 2008, and is recommended over WCAG 1.0.  See  Web Content\n    Accessibility Guidelines (WCAG) Overview . \n Last modified: \n $Date: 2010/04/27 14:56:09 $ \n Send comments/addition to: \n wai-wcag-editors@w3.org \n About this page \n The   Web Content\nAccessibility Guidelines 1.0  contains 13 checkpoints that require content\ndevelopers to create pages in a particular manner \"until user agents\" support\na particular feature. This page documents user agent support for those\ncheckpoints. This page includes additional  Resources\nfor User Agent support . \n Throughout this document, UAGL refers to the  Techniques\nfor User Agent Accessibility Guidelines Working Draft of 6 December 1999 .\nThese references  [were not]  updated to reflect  Techniques for\nUser Agent Accessibility Guidelines 1.0  published December 2002. \n Note:  As of December 2003, the  Web\nContent Accessibility Guidelines Working Group  (WCAG WG) has begun\ntesting and gathering information to update this document. \n Status of this page \n The test results in this document were last updated 8 December 1999.  [OLD information: As of\nDecember 2003, we are planning to update the information with test results\nfrom the most current versions of Opera, Microsoft Internet Explorer (MSIE),\nMozilla, Safari, and Lynx. We also intend to include information about\nassistive technologies (screen readers, screen magnifiers, and voice input\nsoftware) that address accessibility requirements.] \n Tests for the\nUser Agent Support Page  was developed in conjunction with this document.\nHowever, the more recent  Draft\nUse Agent Accessibility Guidelines test suite for HTML 4.01  will be of\nmore use. \n Checkpoints from WCAG 1.0 \n Checkpoint 1.3 \n Checkpoint text: \n  Until user agents can automatically read aloud the text equivalent of a\n  visual track, provide an auditory description of the important information\n  of the visual track of a multimedia presentation. \n Status: Under discussion. [link to GL open issues list once added] \n Checkpoint 1.5 \n Checkpoint text: \n  Until user agents render text equivalents for client-side image map links,\n  provide redundant text links for each active region of a client-side image\n  map. \n Status: Opera 3.6 (Win98) and MSIE 5 (Win98) support tabbing through\nclient-side image maps when the image map image is loaded.  Lynx 2.8 (Unix)\nshows the text equivalents of each image map link as active links. \n Len Kasday created a test page and the results are documented on the WAI\nInterest Group mailing list. \n Len Kasday's image map test page [no longer available]. \n Results\n    posted to the WAI Interest Group mailing list . \n UAGL\nTechniques for checkpoint 1.1  discuss how user agents should do this. \n Checkpoint 7.1 \n Checkpoint text: \n  Until user agents allow users to control flickering, avoid causing the\n  screen to flicker. \n Status:  Netscape Navigator (versions, platform), Microsoft Internet\nExplorer (versions, platform), and Opera (versions, platform) allow the user\nto turn off loading of images, scripts, and applets.  Turning these off will\nallow the user to avoid flicker caused by images, scripts, and applets.  For\nother plug-ins the user can choose not to load the plug-in.  However, it\nwould be ideal if users could stop, pause, or step through  animations,\nscripts, or other dynamic content that may cause flicker as discussed in the\n UAGL\ncheckpoint 3.7  and  UAGL\ncheckpoint 3.10 \n Checkpoint 7.2 \n Checkpoint text: \n  Until user agents allow users to control blinking, avoid causing content to\n  blink (i.e., change presentation at a regular rate, such as turning on and\n  off). \n Status:  In NN (4.5, Win98) and Opera (3.6, Win98), scripts and style\nsheets may be turned off separately.They may also be turned off separately\nwith Netscape (4.61, Linux) although turning off scripts has some effect on\nstyle sheets.  MSIE (5.0, Win98) does not allow the user to turn off style\nsheets, although user style sheets may override author style sheets. Lynx\n(2.8, Unix) and Amaya (2.2, Linux) do not support the BLINK element nor style\nsheets thus no blinking occurs. \n Refer to  UAGL\ncheckpoint 3.5  and  UAGL\ncheckpoint 3.6. \n Tests for\ncheckpoint 7.2 . \n Checkpoint 7.3 \n Checkpoint text: \n  Until user agents allow users to freeze moving content, avoid movement in\n  pages. \n No information \n Refer to  UAGL\ncheckpoint 3.5 ,   UAGL\ncheckpoint 3.6 , and  UAGL\ncheckpoint 3.10 . \n Checkpoint 7.4 \n Checkpoint text: \n  Until user agents provide the ability to stop the refresh, do not create\n  periodically auto-refreshing pages. \n No information \n Refer to  UAGL\ncheckpoint 3.10 . \n Checkpoint 7.5 \n Checkpoint text: \n  Until user agents provide the ability to stop auto-redirect, do not use\n  markup to redirect pages automatically. Instead, configure the server to\n  perform redirects. \n No information \n Refer to  UAGL\ncheckpoint 3.9 . \n Checkpoint 10.1 \n Checkpoint text: \n  Until user agents allow users to turn off spawned windows, do not cause\n  pop-ups or other windows to appear and do not change the current window\n  without informing the user. \n No information \n Refer to  UAGL\ncheckpoint 4.18 . \n Checkpoint 10.2 \n Checkpoint text: \n  Until user agents support explicit associations between labels and form\n  controls, for all form controls with implicitly associated labels, ensure\n  that the label is properly positioned. \n No information \n Refer to  UAGL\ncheckpoint 2.1  and   UAGL\ncheckpoint 7.4 \n Checkpoint 10.3 \n Checkpoint text: \n  Until user agents (including assistive technologies) render side-by-side\n  text correctly, provide a linear text alternative (on the current page or\n  some other) for all tables that lay out text in parallel, word-wrapped\n  columns. \n Status: IBM's Home Page Reader in combination with Netscape Navigator\n(4.5, Win98) and Henter Joyce's JAWS in combination with Microsoft Internet\nExplorer (4.0 and higher, Win98) are instances of a browser and assistive\ntechnology combination that can linearize a table.  Opera (3.6, Win98) allows\na user to linearize tables.  Lynx (2.81, Unix) renders tables by row.  Silas'\nGateway and other tools being developed by the ER Working Group [ER-IG] allow\nusers to linearize tables.  However, only Microsoft Internet Explorer (4.0\nand higher, Win98) with HelpDB and WWW with EmacsSpeak allow a user to\nnavigate within and between the cells of a table. \n Refer to  UAGL\ncheckpoint 5.2  and  UAGL\ncheckpoint 8.1 . \n Checkpoint 10.4 \n Checkpoint text: \n  Until user agents handle empty controls correctly, include default,\n  place-holding characters in edit boxes and text areas. \n There are two pieces \n older browsers (Netscape 2.0?) did not allow users to navigate into\n    form controls; \n older assistive technologies in trying to overcome this issue would\n    only navigate into form controls with content. \n Refer to  UAGL\ncheckpoint 7.4 . \n Checkpoint 10.5 \n Checkpoint text: \n  Until user agents (including assistive technologies) render adjacent links\n  distinctly, include non-link, printable characters (surrounded by spaces)\n  between adjacent links. \n A  test case, and some\npreliminary results  are available \n Checkpoint 13.6 \n Checkpoint text: \n  Group related links, identify the group (for user agents), and, until user\n  agents do so, provide a way to bypass the group. \n No information \n Resources for user agent support \n The following resources provide information about user agent support for\nlanguage features (e.g., HTML, CSS) and accessibility features. \n Webreview .com \n WebReview offers a few browser compatibility charts, including the\n      \"safe list\" and the \"danger list.\"  They also offer several helpful\n      articles about designing style sheets. \n HTML Compendium \n The HTML Compendium documents browser support for a variety of\n      browsers on a variety of platforms. \n Alternative\n  WebBrowsing \n A collection of pointers to information, and where possible,\n      todemonstration versions of alternative browsing method. \n CSS Test Suite \n The CSS1 Test Suite is provided as a way for vendors and page authors\n      to test their browser's conformance to the CSS1 specification. \n WSP - The Web Standards\n  Project \n The Web Standards Project is a coalition of web developers and users\n      encouraging standards support in browsers.  They have a number of\n      resources documenting support of standards on various browsers and\n      platforms. \n Disclaimer \n W3C provides the information on this page as a service to the Web\ncommunity and in good faith. However, due to resource constraints, W3C cannot\nverify the accuracy of all claims made by developers or users. W3C is not\nresponsible for the content or persistence of non-W3C Web sites linked from\nthis page. \n Note: This page is outdated; some of the information is not currently correct. \n Note:\n  WCAG 2.0 was published in December 2008, and is recommended over WCAG 1.0.  See  Web Content\n    Accessibility Guidelines (WCAG) Overview . \n Copyright \n© 1999  W3C  ( MIT ,  INRIA ,  Keio ), All Rights Reserved. W3C  liability ,\n trademark ,\n document\nuse  and  software\nlicensing  rules apply."}