{"url": "https://toshl.com/", "content": "Toshl Finance - Personal finance, budget and expense tracker app \n Log in \n Track all your cards and cash in one place.\n             Connect your financial accounts, \nor enter expenses using our \nquick and slick  Toshl apps . Toshl helps you with the financial means. \nSo you can  focus on the goals . \n How?\n             1. \n Log in with Facebook or Log in with Google \n to enter the web app. Or  sign up with email . \n 2. Download the mobile app\n             What you add to Toshl on one device, shows up on others too. \n 3. Set yourself a goal\n             Start by making an emergency fund. Just in case. \nThen, you can focus on the big stuff. \nRetire in 5 years? Your own flat? That's up to you. \n 4. Stay in control with a budget\n             Add a budget to make sure you can save some money each month. \nToshl will tell you how much you have \"Left to spend\" while sticking\nto your budget and saving goals. \n Tutorial:  How to set up your budgets \n 5. Track\n           Food, bills, penguins. Whatever. \nTwo ways to track expenses and incomes: \n Automatically \nToshl connects with your bank, credit card, PayPal etc. Pay with card, expense gets saved in Toshl. Categorised and all. This works with US banks. We'll add more soon(ish). \n Manually \nEnter it in the app. Quickly. A basic expense is just 4 taps: Amount, next, category, save. Bam! Done. \n 6. Meet your goal\n           Optimize  spending by showing where you spend more than you think. \n Nudge  when you approach budget limits. \n Remind  of upcoming bills. \n Make it fun.  Why so serious? Toshl monsters are there to make finance more fun, less drab. \n What's the catch? How does Toshl make money?\n Basic Toshl  is completely free. \n Toshl Pro  offers in-depth features in the apps, more budgets and financial accounts. \n Toshl Medici  enables automatic connections with banks and credit cards. Plus everything in Toshl Pro. \n Plans & Pricing \n Like what you see? Follow me.\n Follow @Toshl \n This site uses cookies. Almost all sites do. By continuing to use the site, you're agreeing to the use of cookies. See our  privacy policy . \n They know us, you should too\n Toshl Finance apps for mobile phones\n Toshl Finance Web App for Tablets\n The Toshl Web App is optimised to work great on tablets.\n Open toshl.com in the web browser on a tablet device and  log in . Then save it as a bookmark to your home screen.\n Try it out!\n Toshl Finance Web App on the Big Screen\n Toshl Finance really shines when you're behind your laptop or desktop computer. With all the extra screen space, graphs get even clearer and you see further into your future.\n Where can you get it? You're already there, just  Sign up  or  Log in .\n From the Toshl Blog\n How to Set Up Your Finances (Web App) \n How to Set Up Your Budgets and Control Your Spending (Web App) \n How to Use The Budgets (Web App) \n Left to Spend – The Gist of Your Finances in One Number (Web App) \n The River Flow Graph – How Your Money Flows Each Month (Web App) \n How to Set Up Your Finances (iOS) \n How to Set Up Your Budgets and Control Your Spending (iOS) \n How to use the Budgets (iOS) \n Left to Spend – The Gist of Your Finances in one Number (iOS) \n The River Flow Graph – How Your Money Flows Each Month (iOS) \n Blog \n Facebook \n Twitter \n Google+ \n Contact \n Support \n Press Kit \n Jobs \n Developers \n Privacy Policy \n Terms of Service \n Language:"}