{"url": "https://csu.qc.ca/hojo/rent-receipts?page=1", "content": "Rent Receipts | Concordia Student Union | csu.qc.ca \n English \n Français \n Menu \n About Us Our Mission Council of Representatives Executive Team Judicial Board Funding and Fees Directory University Bodies Senate Board of Governors Jobs @ CSU Services Advocacy Centre Legal Information Clinic Housing and Job Bank (HOJO) Classifieds Health and Dental Plan Hive Loyola Free Lunch Emergency Food Vouchers Bookings General Booking Terms and Conditions CSU Mezzanine Information Tables Terms and Usage Policies CSU Live Newsletter Projects Reggie's Bar Renovations Daycare Service Hive Café Solidarity Co-op Cooperative Student Housing Cooperative Housing Committee Cooperative Housing Focus Group Concordia Student Congress Survey Campaigns Campaigns Unpaid Internships Climate Justice & Divestment Anti-Consumerism Past Campaigns #BringBissanHome Austerity International Tuition Hike Tribunals Student Life Fee Levy Groups Student Groups & Associations Bursaries at the CSU Sustainability Food Systems Reform Sustainability Resources on Campus Food System Special Project Funding Policy Clubs Active Clubs Starting a New Club How to Manage your Club Resources Apply for Funding Apply for Funding Special Project Funding CSU Special Clubs Funding CSU Community Action Fund Food Systems Special Project Funding CSU Committee Funding Other Sources of Funding   \n Home   \n Rent Receipts \n  Aug 17, 2015   kmcloughlin   \n Language  \n Undefined\n Did you know that it is your right under the Civil Code of Quebec to recieve a reciept for each payment of rent you make to your landlord? \n The HOJO always recommends you exercise this right to ensure you have proof of payment for your rent. Even if you pay by bank card or transfer still ask your landlord for a reciept. If they do not have a way of offering you one then you can use this generator to create your own.  \n http://www.rentreceipt.net/ \n Remember if you don't have proof you paid it's like you never did. Landlords can and do take advantage of tenants this way. Know your rights so that you can better protect yourself.  \n   \n HOJO Articles \n   Finding Work Off Campus   \n   Finding an On-campus Part-Time Job at Concordia   \n   Protecting your Privacy   \n   Temporary Accomodation   \n   How to deal with Frozen Pipes   \n   Bed Bugs   \n   Looking for an Internship?   \n   Did you receive a Rental Increase letter from your landlord?   \n   Students and Employment   \n   Off-Campus Safety   \n   Neighbourhoods in Montreal   \n   Fraud Prevention   \n   Cockroaches   \n   6 simple ways to get ready for winter    \n   Apartment Search Tools   \n ‹ previous \n 2 of 3 \n next › \n ​   \n Quick Links \n Login \n Resources \n Jobs \n Contact Information \n Downtown: 1455 de Maisonneuve Blvd West, H-711 Montréal, QC H3G 1M8 \n Loyola: 7141 Sherbrooke Street West, CC-426 Montréal, QC H4B 1R6 \n Phone - 514 848-7474 | Fax: 514 848-7450 \n Email -  contactus@csu.qc.ca \n Concordia Student Union | Copyright 2016 | All Rights Reserved"}