{"url": "http://www.osc.gov.on.ca/en/SecuritiesLaw_csa_20160428_33-404_proposals-enhance-obligations-advisers-dealers-representatives.htm", "content": "CSA Consultation Paper 33-404 - Proposals to Enhance the Obligations of Advisers, Dealers, and Representatives toward their Clients -  \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   Securities Law & Instruments   /   Instruments, Rules & Policies   /   3 - Registration Requirements and Related Matters   /   33-404   /   Security Foundation - 33-404   /   CSA Consultation Paper 33-404 - Proposals to Enhance the Obligations of Advisers, Dealers, and Representatives toward their Clients \n                Securities Law & Instruments\n Hide Section Menu   × \n Legislation \n Legislative Reviews \n Instruments, Rules & Policies \n Proposed Instruments, Rules & Policies \n OSC Bulletin \n Electronic Filing \n Registrant Forms and Documents \n Reporting Issuer and Issuer Forms \n Orders, Rulings & Decisions \n   Section Menu \n Extension of Consultation Period -  Consultation Paper 33-404 Proposals to Enhance the Obligations of Advisers, Dealers, and Representatives toward their Clients - Comment Period Ends September 30 th , 2016 \n Learn more about the  roundtable  held on December 6, 2016 \n PDF Version \n CANADIAN SECURITIES ADMINISTRATORS CONSULTATION PAPER 33‐404 \n PROPOSALS TO ENHANCE THE OBLIGATIONS OF ADVISERS, DEALERS, AND REPRESENTATIVES \nTOWARD THEIR CLIENTS \nApril 28, 2016 \nAdministering the Canadian Securities Regulatory System\nLes autorités qui réglementent le marché des valeurs mobilières au Canada \n PART 1 -- INTRODUCTION \n On October 25, 2012, the Canadian Securities Administrators (the  CSA ) published CSA Consultation Paper 33-403 --  The Standard of Conduct for Advisers and Dealers: Exploring the Appropriateness of Introducing a Statutory Best Interest Duty When Advice is Provided to Retail Clients  (the  Original Consultation Paper ). On December 17, 2013, the CSA published CSA Staff Notice 33-316 --  Status Report on Consultation under CSA Consultation Paper 33-403 :  The Standard of Conduct for Advisers and Dealers: Exploring the Appropriateness of Introducing a Statutory Best Interest Duty When Advice is Provided to Retail Clients  (the  Staff Notice ). {1}  The Staff Notice provided a status report on the best interest consultation initiative, and identified key themes that emerged from the Original Consultation Paper. We {2}  concluded that more work was needed. \n This consultation paper ( Consultation Paper ) is the next step in the CSA's work toward improving the relationship between clients and their advisers, dealers and representatives ( registrants ). It follows the comments received on the Original Consultation Paper and the key themes the CSA summarized in the Staff Notice, and builds on subsequent work conducted by the CSA, including related consultations and research, on the relationship between clients and registrants (the  client-registrant relationship ). \n The purpose of this consultation is to seek comment on proposed regulatory action aimed at enhancing the obligations of advisers, dealers and representatives toward their clients. We are of the view that the current Canadian registrant regulatory framework requires enhancements to address the issues we have identified in the client-registrant relationship, including to better align the interests of registrants with the interests of their clients, to improve outcomes for clients, and to clarify the nature of the client-registrant relationship for clients. As a result, the status quo must change. It is in this context that: \n • all of the CSA jurisdictions are consulting on a set of regulatory amendments to National Instrument 31-103  Registration Requirements, Exemptions and Ongoing Registrant Obligations  ( NI 31-103 ) that would work together to better align the interests of registrants to the interests of their clients and enhance various specific obligations that registrants owe to their clients ( proposed targeted reforms ); and \n • all of the CSA jurisdictions, except the British Columbia Securities Commission ( BCSC ), are consulting on a regulatory best interest standard, accompanied by guidance, that would form both an over-arching standard and the governing principle against which all other client-related obligations would be interpreted. \n Regarding the regulatory best interest standard proposal: \n • the Ontario Securities Commission ( OSC ) and the Financial and Consumer Services Commission of New Brunswick ( FCNB ) are of the current view that the introduction of a regulatory best interest standard would materially enhance the effectiveness of the proposed targeted reforms and strengthen the principled foundation of the client-registrant relationship. The OSC and FCNB believe that such a standard, as a governing principle, would have a number of benefits, such as assisting in the interpretation of more specific requirements and acting as a guide for registrants to address situations that fall between specific rules or that are novel; \n • the Autorité des marchés financiers ( AMF ), the Alberta Securities Commission ( ASC ), the Manitoba Securities Commission ( MSC ) and the Nova Scotia Securities Commission ( NSSC ), in considering the current regulatory and business environment and the research conducted by the ASC and the BCSC, share strong reservations on the actual benefits of the introduction of a regulatory best interest standard over and above the proposed targeted reforms, and are concerned with the potential unintended outcomes of the codification of such an aspirational standard of conduct. However, the AMF, the ASC, the MSC and the NSSC are interested in receiving and reviewing the comments on the proposed regulatory best interest standard; \n • the Financial and Consumer Affairs Authority of Saskatchewan ( FCAA ) recognizes that the introduction of a regulatory best interest standard would be a significant regulatory change and is interested in receiving and reviewing all comments on the proposed regulatory best interest standard; and \n • the BCSC is of the view that implementing only the proposed targeted reforms will significantly strengthen the standards of conduct and advance the best interests of investors. Given the current regulatory and business environment, imposing an over-arching best interest standard may not be workable and may exacerbate one of the investor protection issues identified, that being misplaced trust and overreliance by clients on registrants. Further, the introduction of a regulatory best interest standard over and above the proposed targeted reforms is vague and unclear and will create uncertainty for registrants. \n The jurisdictions that are consulting on the regulatory best interest standard have not made a final decision on whether such standard should be adopted; no final decision on implementation of a best interest standard will be made without broad public consultation and discussion. \n Both the proposed targeted reforms and proposed regulatory best interest standard, if introduced, would apply to all advisers, dealers and representatives, including those who are members of the Investment Industry Regulatory Organization of Canada ( IIROC ) and Mutual Fund Dealers Association of Canada ( MFDA , and together with IIROC, the  self-regulatory organizations  or  SROs ). We will work with the SROs to ensure their member rules are materially harmonized with the CSA's requirements and would be implemented on the same schedule. \n Comments must be submitted in writing by  August 26, 2016 . We encourage commenters to provide comments on the full range of issues identified under both the proposed targeted reforms and the proposed regulatory best interest standard. \n PART 2 -- STRUCTURE OF CONSULTATION PAPER \n The remainder of this Consultation Paper is structured as follows: \n • Part 3 summarizes certain CSA and third-party research related to the client-registrant relationship. \n • Part 4 summarizes the absence of certain explicit obligations of registrants toward their clients under NI 31-103. \n • Part 5 identifies the CSA's key investor protection concerns in connection with the client-registrant relationship. \n • Part 6 provides an overview of the proposals to enhance the obligations of registrants toward their clients. \n • Part 7 describes in chart format the proposed targeted reforms under consideration by all CSA jurisdictions. In this chart, we refer to specific appendices containing a description of the potential guidance relating to specific reforms. \n • Part 8 discusses the proposed regulatory best interest standard under consideration. We refer to a specific appendix containing a description of the potential guidance relating to such standard. \n • Part 9 solicits feedback on the anticipated impacts of the proposals. \n • Part 10 describes international developments involving a best interest standard and similar initiatives. \n • Part 11 explains how stakeholders can provide comments and discusses next steps. \n • Appendices: \n • Appendices A -- G: potential guidance with respect to certain of the proposed targeted reforms; \n • Appendix H: potential guidance related to the proposed regulatory best interest standard; and \n • Appendix I: list of consultation questions. \n PART 3 -- RESEARCH RELATED TO THE CLIENT-REGISTRANT RELATIONSHIP \n This part sets out certain key evidence related to the client-registrant relationship. Although this part only canvasses a limited subset of the evidence available on the issues with the client-registrant relationship, we feel it is reasonably representative of the key issues identified in this body of evidence. This part does not identify the research findings related to the benefits that registrants may provide to their clients, for example, with respect to increased saving. \n CSA Research \n Since publication of the Staff Notice in 2013, the CSA have continued their work to address regulatory issues and concerns arising in the client-registrant relationship. Through the Fund Facts delivery ( Point of Sale ) {3}  and Client Relationship Model Phase 2 ( CRM2 ) {4}  initiatives, the CSA have introduced regulatory reforms to make mutual fund fees, registrants' compensation (and related conflicts), and clients' investment performance, more transparent. We are committed to measuring the impact of these initiatives to determine whether they have been effective in achieving greater investor understanding of mutual fund fees, registrants' compensation and individual investment performance. The CSA Mutual Fund Fee initiative {5}  has also been considering issues relating to the client-registrant relationship in Canada. The following is a list of our key consultation, research (direct or commissioned), and outreach activities. \n OSC Town Hall Meetings \n The OSC held financial advisor town hall meetings in 2014 with local communities of representatives. A common theme from these meetings was that most representatives believe they already act in their client's best interest. {6} \n BCSC/ASC Review of Client-Registrant Relationship \n In 2015, the BCSC and ASC reviewed the client-registrant relationship. Staff reviewed commentary in media reports, investment publications, academic journals and investor advocate publications and conducted interviews with investor advocates, industry organizations and current and former industry participants. The findings of the review were that there are three main problems in the registrant-client relationship: \n • misplaced trust and reliance, creating an expectations gap between clients and their registrants that may result in suboptimal investments; \n • clients not getting the value or returns they could reasonably expect from investing. Product costs, investment strategy and investor bias can all erode overall savings; and \n • clients not getting outcomes that the regulatory system is designed to give them. \n Mystery Shopping Report \n The Mystery Shopping report, published on September 17, 2015 by the OSC, IIROC and the MFDA, {7}  describing the results of a \"mystery shop\" of registrants across Ontario between July and November 2014, {8}  found that: \n • investors did not always know if they have had experienced a good advice process: while 88% felt they received sufficient information to make an informed decision, 33% of those experiences did not meet regulators' compliance expectations; \n • the variety of business titles used by representatives (48 different titles were used across all platforms) creates confusion concerning proficiency and representatives' status and responsibilities within their firms; \n • when first meeting with a representative, investors were likely to hear about products and services offered (78%) and discuss their investment goals (89%), but less likely to hear about product fees (56%), the risk/return relationship (52%) or registrant compensation (25%), making it difficult to comparison shop for financial advice, especially on important aspects such as fees and costs; \n • in the 24 shops {9}  where a product or specific recommendation was made: \n • 71% complied with know your client ( KYC ), know your product ( KYP ) and suitability requirements and 29% did not; \n • 37% did not fulfill all compliance expectations; \n • 67% did not discuss registrant compensation and 29% did not discuss product fees; \n • 50% did not explain how the recommendation related to the investors' goals; and \n • in the 21 shops where only a specific product was recommended, 14% were in fact unsuitable due to asset concentration issues. \n National Smarter Investor Study \n The National Smarter Investor Study, which was published on November 3, 2015 by the BCSC, {10}  examined client-registrant relationships in Canada. The study found that, among other things, 90% of respondents described their existing level of trust in their investment representative as strong or very strong. This trust led some clients to ask fewer questions about how their representatives were compensated and to place less importance on reading their account statements because they were confident that their representative was taking care of their money. \n Fee-Based v. Commission-Based Literature Review: The Brondesbury Report \n On June 11, 2015, the CSA published a report prepared by The Brondesbury Group entitled  Mutual Fund Fee Research . {11}  The Brondesbury Group conducted a literature review to assess the extent to which the use of fee-based versus commission-based compensation changes the nature of advice and impacts investment outcomes over the long term. The Brondesbury Group found that there is conclusive evidence that commission-based compensation creates problems that must be addressed. More specifically, the research found that: \n • funds that pay a commission (sales loads and trailer fees) underperform those that do not, whether looking at raw, risk-adjusted or after-fee returns; \n • representatives tend to push investors into riskier funds; \n • investors cannot easily assess what form of compensation is best for them and readily make sub-optimal choices; \n • representative recommendations are sometimes biased in favour of alternatives that generate more commission for the representative; \n • compensation affects the effort made by representatives to overcome investor behavioural biases that may lead to sub-optimal returns; and \n • while commission-based compensation is problematic, there are other conflicts that would likely persist under a fee-based model and that would affect the representative's conduct (e.g. advancement, recognition, affiliation between the investment fund manager and a dealer firm). \n Fund Flows Research: The Cumming Report \n On October 22, 2015, the CSA published a research paper prepared by a team led by Professor Douglas Cumming entitled  A Dissection of Mutual Fund Fees, Flows and Performance . {12}  The paper found that conflicts of interest, specifically sales commissions and trailing commissions paid by fund companies ( embedded registrant compensation ), dealer affiliation and the use of deferred sales charge arrangements materially affect representative/dealer behaviour to the detriment of investor outcomes and market efficiency. While generally, mutual fund flows should (and do) bear a relationship to the fund's past performance, the research found that: \n • the payment of embedded registrant compensation and the use of deferred sales charge arrangements materially reduce the sensitivity of fund flows to past performance and increase the level of fund flows that have no relationship to performance; \n • the converse is also true: fund flows for mutual fund series that do not pay embedded registrant compensation (fee-based series) are more sensitive to past performance; \n • as embedded registrant compensation increases there is an associated reduction in future outperformance before fees; and \n • fund flows from affiliated dealers of the investment fund manager show little to no sensitivity to past performance, and this lack of sensitivity is also associated with reduced future outperformance before fees. \n Risk Profiling Report \n On November 12, 2015, the OSC Investor Advisory Panel {13}  published a report entitled  Current Practices for Risk Profiling in Canada and Review of Global Best Practices . {14}  This report was prepared by PlanPlus Inc., an independent research firm engaged to perform research into the current practices in the Canadian marketplace to determine a client's risk profile and to evaluate these practices compared to best practices globally. For purposes of the report, risk profiling was defined as a complex, multi-dimensional process that combines many factors, both subjective and objective, to try and arrive at an overall assessment of the most appropriate level of risk for a consumer, called a 'risk profile'. \n The report made a number of findings, including: \n • there are verified techniques that improve the measurement of some subjective or emotional factors like risk tolerance or loss aversion, but they are rarely used by the industry; \n • over 53% of respondents to a survey indicated that between 76% and 100% of clients had completed a risk questionnaire, creating a strong dependency on the fitness of these tools; \n • only 11% of firms could confirm that their questionnaires (where they had one) were 'validated' in some manner; \n • only 16.7% of questionnaires reviewed would be considered 'fit for purpose' -- they have too few questions, poorly worded or confusing questions, arbitrary scoring models or outright poor scoring models; and \n • there is overwhelming evidence that the issue of assessing a client's risk profile and recommending suitable solutions is a primary area of concern in the industry. \n Compensation Practices Impacting Representatives \n CSA staff conducted a survey to identify the practices used by adviser and dealer firms to compensate their representatives. The CSA expects that a staff notice summarizing the results of this research will be published before the end of the year. \n Compliance Reviews \n Non-compliance with key areas of the client-registrant regulatory regime, such as obligations relating to suitability and conflicts of interest, remains stubbornly high. These requirements are therefore not currently protecting investors as regulators intended or as expected by investors. {15}  In addition, compliance reviews have also identified a variety of scenarios that highlight the limitations of the current client-facing obligations of advisers, dealers and representatives toward their clients. \n Investor Complaints \n The self-regulatory and industry organization investor complaint experience shows there is consistent and ongoing non-compliance with many of the current key regulatory requirements, with the unsuitability of investment recommendations being the primary basis for complaints to OBSI for the past five years, case assessment files for IIROC for the past three years and allegations in MFDA enforcement cases for the past three years. {16} \n Third-Party Research \n In addition to the work performed or commissioned by the CSA, there is a variety of third-party research that identifies areas of concern with the client-registrant relationship, both domestically and internationally. The following sets out a short list of certain key third-party research findings. \n Foerster Research \n In 2014, a team of academics led by Professor Stephen Foerster published a paper entitled  Retail Financial Advice: Does One Size Fit All? {17}  The paper focused on costs, benefits and customization of mutual fund advice and found that registrants influence investors' trading choices but that their advice materially underperforms passive investment benchmarks. Specifically, the research showed that, among other things: \n • representatives induce their clients to take more risk, thereby raising clients' expected investment returns. However, they do not generally customize portfolios to their clients' attributes, but instead build very similar portfolios for all of their clients. Given the lack of customization, a question arises about why the advice is not cheaper. The paper finds that investors pay on average 2.5% of assets per year for advice. It states \"if the equity premium is 6 percent, the 40-percentage point increase in risky share  caused  by [representatives] translates into 0.40 x 6% = 2.4% higher expected return ... But for the average investor, it is the [representative] who captures all of these additional returns\"; {18} \n • \"[t]here is little evidence of [representatives] adding value through superior performance. The performance lag is largely due to the fees the investors pay, not due to the poor performance of the underlying assets.\" The significance of these negative net alphas {19}  is non-trivial (-2.91%). \"Because investors could earn a net alpha of 0% by investing in the passive benchmarks, this estimate implies that the investors hand over a steady stream of potential savings year after year\"; {20}  and \n • \"the typical investor who begins saving for retirement with a [representative] hands over a quarter of the present value of his or her retirement savings on day one.\" {21} \n Other Research \n The findings from the Cumming Research are consistent with the findings of a research paper based on an analysis of United States ( U.S. ) data. Between 1993 and 2009, among U.S. mutual funds with loads or revenue sharing, higher payments to registrants led to higher inflows, suggesting that registrants' recommendations are biased by the payments they receive. Net returns are approximately 50 basis points lower for every 100 basis points of loads that are shared with registrants. This suggests biased advice, lower returns, and higher fees. {22} \n In the U.S., one study found that \"[c]onflicted advice leads to lower investment returns. Savers receiving conflicted advice earn returns roughly 1 percentage point lower each year (for example, conflicted advice reduces what would be a 6 percent return to a 5 percent return).\" {23} \n Another U.S. study found that \"[registrants] fail to de-bias their clients and often reinforce biases that are in their interests. [Registrants] encourage returns-chasing behavior and push for actively managed funds that have higher fees, even if the client starts with a well-diversified, low-fee portfolio.\" {24} \n Several U.S. studies have found that conflicts of interest affect financial representatives' behavior and that registrants often act opportunistically because of payments they receive from product providers. {25} \n The current suitability process places too little emphasis on product cost despite a number of studies supporting the general position that \"in virtually every single time period and data point tested, low-cost funds beat high-cost funds and costs are still the most dependable predictor of performance.\" {26} \n Canadian mutual fund investors are more highly invested in actively managed funds relative to fund investors in other jurisdictions. At June 2015, index-tracking funds comprised only 1.5% of the Canadian mutual fund market (excluding exchange traded funds) compared to 15.3% of the U.S. market and 11.2% of the United Kingdom (U.K.) market. {27} \n Finally, conflict disclosure, by itself, is generally an ineffective conflict mitigation strategy and may have counter-intuitive results, such as increasing reliance on conflicted advice, which results in sub-optimal outcomes for investors. {28} \n PART 4 -- ABSENCE OF CERTAIN EXPLICIT OBLIGATIONS IN NI 31-103 \n The following table provides a high-level summary of certain obligations of registrants toward their clients that are not currently explicitly set out in NI 31-103. {29}  Compliance with some of these obligations, although not explicit, is necessary to meet the CSA's expectations for compliance with the current regulatory framework. \n Obligation \n Summary of Areas Without Explicit Requirements \n Conflicts of Interest \n • \n No explicit requirement to prioritize the interests of the client when responding to conflicts \n • \n No explicit requirement that: \n • \n disclosure related to conflicts of interest is fully understood by the client, including the implications and consequences of the conflict; and \n • \n registrants must have a reasonable basis for concluding that a client understands such disclosure \n • \n Only explicitly applies to firms, not representatives \n Know Your Client \n • \n No explicit requirement to collect certain key elements of investment needs and objectives and financial circumstances (e.g., amount and nature of debts) \n • \n No explicit requirement around developing risk profiles for clients \n • \n No explicit requirement that the original KYC information, and any material change, is confirmed in writing with a signed copy provided to the client \n • \n No explicit requirement that registrant take reasonable steps to update KYC information at least once a year \n Know Your Product \n • \n Although KYP is a key element of the suitability analysis, it is not an explicit, stand-alone requirement (currently embedded for representatives as an element of proficiency that applies only when a recommendation is made, but not explicitly when the client initiates the order) \n • \n No explicit requirement for representatives to know about all the products on their firm's product list, how each product compares to the others, and all fees, costs and charges connected to the product, the client's account and the product and account investment strategy \n • \n No explicit role for the firm in meeting the KYP requirement \n • \n No explicit requirements for shelf development by the firm \n Suitability \n • \n Requirement is primarily \"trade\"-based (i.e., based on a product order or recommendation to buy or sell only) \n • \n No explicit requirement to consider product/account costs against the client's investment needs and objectives \n • \n No explicit requirement to conduct a suitability review for recommendations or decisions to hold or exchange securities \n • \n No explicit requirement to conduct a suitability review for recommendations not to purchase, sell, hold or exchange securities \n • \n No explicit requirement for representatives to recommend the product from their firm's shelf that is most likely to meet the investment needs and objectives of the client compared to the other products on the firm's shelf \n • \n No explicit requirement to consider the investment strategy and other basic financial strategies as part of the product-focused suitability analysis \n • \n No explicit requirement that suitability be conducted upon certain key events, including at least once a year \n Relationship Disclosure \n • \n No explicit requirement for firms to provide disclosure about the general nature of the client-registrant relationship in easy to understand terms \n • \n No explicit requirement for firms to provide disclosure about the nature and impact on the client of the firm's approved product list or restricted category of registration, as applicable \n Proficiency \n • \n No explicit ongoing continuing education requirement \n • \n Less, or no, emphasis on the areas that lack certain explicit obligations set out in this table \n Titles and Designations \n • \n Limited regulation on client-facing titles has allowed proliferation of dozens of confusing and competing titles \n Role of UDP and CCO \n • \n No explicit requirement for ultimate designated persons ( UDPs ) and chief compliance officers ( CCOs ) in the context of key compliance and oversight obligations, such as the compliance obligations relating to conflicts of interest and suitability \n Statutory Standard of Conduct \n • \n Limited guidance that explains what regulators' expectations are and how this standard is used separately from, and together with, more targeted obligations \n We note that the analysis may be different in respect of certain obligations in the SROs' rules, and, as a result, there is some inconsistency (in law and/or application) across platforms (CSA jurisdictions, IIROC and/or MFDA). Ideally, there would be no, or only principled, inconsistency across these platforms. \n PART 5 -- KEY INVESTOR PROTECTION CONCERNS IN CONNECTION WITH THE CLIENT-REGISTRANT RELATIONSHIP \n Based on the evidence gathered to date, we have identified the following key investor protection concerns in Canada: \n •  Clients are not getting the value or returns they could reasonably expect from investing:  At least part of the reason for this is the wording of the existing suitability requirement. Failure of registrants to consider all relevant factors, including product costs and investment strategies (such as the use of leverage or choosing active over passive management of assets) in their suitability analysis may prevent clients from meeting the goals of their investment activity. \n •  Expectations Gap : Most investors incorrectly assume that their registrants must always provide advice that is in their best interest. As a result, clients have misplaced reliance or trust on their registrants, resulting in opportunities for some registrants to take advantage of their clients and creating an expectations gap between clients and registrants. Most investors place too much reliance on their registrants, which exacerbates the agency problem inherent in the client-registrant relationship and can result in sub-optimal investments. \n Clients need to understand the nature of the relationship, and what level of trust and reliance they should afford their registrant. The problem of misplaced reliance is exacerbated when registrants (1) use titles or designations that exaggerate their proficiency or the services they actually provide and (2) sell a limited or proprietary shelf of products. \n •  Conflicts of Interest : The application in practice of the current conflicts of interest rules is, in many instances, less effective than intended. Not only is the concern that disclosure may be ineffective in mitigating conflicts of interest, disclosure may have a counter-intuitive effect of increasing reliance on advice where the client is told such advice is, or potentially is, conflicted. Part of the challenge for regulators is identifying when disclosure of conflicts is effective, and when it may exacerbate the conflict situation or is ineffective. \n •  Information Asymmetry : The current regulatory framework is, in many instances, less effective than intended in mitigating the consequences of the information and financial literacy asymmetry between registrants and their retail clients. With the limited financial literacy of most investors, the increasing complexity of securities products and the limited effectiveness of initiatives to improve financial literacy, coupled with the challenge that most investors have in avoiding biases and applying their financial knowledge in their decision making, more onus for prioritizing the client's interest and ensuring that clients understand the information and advice they receive should shift onto registrants. \n •  Clients are not getting outcomes that the regulatory system is designed to give them:  There are a number of potential causes of this concern, including opaqueness in the suitability assessment, existing requirements that require more clarity to assist in effective enforcement, barriers to obtaining redress for a registrant breach, and lack of effective compliance and enforcement in certain cases. \n PART 6 -- OVERVIEW OF PROPOSALS TO ENHANCE THE OBLIGATIONS OF ADVISERS, DEALERS, AND REPRESENTATIVES TOWARD THEIR CLIENTS \n In light of the foregoing: \n • all of the CSA jurisdictions are consulting on a set of proposed targeted reforms to NI 31-103, which are described in further detail in Part 7 below; and \n • all of the CSA jurisdictions, except the BCSC, are consulting on a regulatory best interest standard, accompanied by guidance, that would form both an over-arching standard and the governing principle against which all other client-related obligations would be interpreted, which is described in further detail in Part 8 below. \n As stated above, we think some elements of the proposed regulatory action are consistent with our expectations for compliance with the current regulatory framework applicable to registrants. However, we think that making these expectations explicit will clarify, and strengthen the enforceability of, the requirements applicable to registrants. \n In addition, we are also taking regulatory action to focus compliance initiatives on conflicts management. In particular, we will be conducting (or have already conducted, depending on the jurisdiction) compliance sweeps to target incentives that may favour the sale of one family of funds over another. \n PART 7 -- PROPOSED FRAMEWORK FOR THE PROPOSED TARGETED REFORMS \n In this part, we discuss the proposed targeted reforms relating to the client-registrant relationship, including the regulation of conflicts of interest, the KYC and KYP requirements, the suitability obligation, the use by registrants of business titles and proficiency. These potential reforms are intended to work together to improve the client-registrant relationship. We ask consultation questions in respect of each of the potential regulatory reforms. \n We will work with the SROs to ensure that SRO member rules will be materially harmonized with the CSA's requirements and will be implemented on the same schedule. \n For certain of the proposed targeted reforms, we refer to an appendix containing a description of potential guidance we might include in Companion Policy 31-103CP  Registration Requirements, Exemptions and Ongoing Registrant Obligations . We ask additional consultation questions in these appendices. \n Proposed Targeted Reforms \n Description of Proposed Targeted Reforms \n Consultation Questions \n Conflicts of Interest -- General obligation \n Part 13 of NI 31-103 would be amended to require that firms and representatives must respond to each identified material conflict of interest in a manner that prioritizes the interests of the client ahead of the interests of the firm and/or representative. \n 1) Is this general approach to regulating how registrants should respond to conflicts optimal? If not, what alternative approach would you recommend? \n Any disclosure given to a client about a conflict of interest must be prominent, specific and clear. The disclosure must be sufficient to be meaningful to the client such that the client fully understands the conflict, including the implications and consequences of the conflict for the client. \n 2) Is the requirement to respond to conflicts \"in a manner that prioritizes the interest of the client ahead of the interests of the firm and/or representative\" clear enough to provide a meaningful code of conduct? If not, how could the requirement be clarified? \n Firms and representatives must have a reasonable basis for concluding that a client fully understands the implications and consequences of the conflict that is disclosed. \n 3) Will this requirement present any particular challenges for specific registration categories or business models? \n Please refer to Appendix A for a description of potential guidance. \n Know Your Client \n Section 13.2 of NI 31-103 would be amended by adding requirements that registrants must: \n 4) Do all registrants currently have the proficiency to understand their client's basic tax position? Would requiring collection of this information raise any issues or challenges for registrants or clients? \n • \n ensure that the KYC process results in a thorough understanding of the client; \n • \n gather more client-centered information in respect of each of the three key elements of the KYC obligation, including: \n • \n investment needs and objectives : time horizon for their investments, how liquid they need their investments to be, and applicable investment constraints; \n • \n financial circumstances : the amount and nature of all assets and debts, employment status, basic tax position ,  and spousal and dependents' status and needs; and \n • \n risk profile : the client's risk profile for investment purposes, based on concepts including risk attitude, risk capacity and loss aversion (terms to be defined for client); \n • \n ensure that KYC forms and a record of the risk profile, both at initial account opening and upon material changes, are dated and signed by both the client and the representative and a copy is provided to the client; and \n • \n take reasonable steps to update their client's KYC information (and related form) at least once every 12 months, and more frequently in response to material changes in circumstances affecting the client or the client's portfolio. \n Please refer to Appendix B for a description of potential guidance. \n 5) Should the CSA also codify the specific form of the document, or new account application form, that is used to collect the prescribed KYC content? \n 6) Should the KYC form also be signed by the representative's supervisor? \n Know Your Product -- Representative \n Part 13 of NI 31-103 would be amended by explicitly setting out that representatives must have sufficient knowledge of a product, together with the KYC information about the client, to support a suitability analysis. \n 7) Is this general approach to regulating how representatives should meet their KYP obligation optimal? If not, what alternative approach would you recommend? \n This would include requirements for representatives to: \n (1) \n understand and consider the structure, product strategy, features, costs and risks of each security on their firm's product list, \n (2) \n understand and consider how a product being recommended compares to other products on the firm's product list, and \n (3) \n understand and consider the impact on the performance of the product of all fees, costs and charges connected to: \n • \n the product, \n • \n the client's account, and \n • \n the product and account investment strategy. \n Please refer to Appendix C for a description of potential guidance. \n Know Your Product -- Firm \n Part 13 of NI 31-103 would be amended by explicitly requiring that firms: \n 8) The intended outcome of the requirement for mixed/non-proprietary firms to engage in a market investigation and product comparison is to ensure the range of products offered by firms that present themselves as offering more than proprietary products is representative of a broad range of products suitable for their client base. Do you agree or disagree with this intended outcome? Please provide an explanation. \n • \n ensure, through policies and procedures, training tools, guides or other methods, that their representatives have the information and ability to comply with their KYP obligation; and \n • \n identify whether they have a proprietary or mixed/non-proprietary product list. \n • \n A \"proprietary product list\" would be defined as a product list that includes only proprietary products. \n • \n A \"mixed/non-proprietary product list\" would be defined as a product list that includes both proprietary and non-proprietary products, or only non-proprietary products, that the firm is registered to advise on or trade in. \n Mixed/non-proprietary firms would be required to select the products they offer in accordance with policies and procedures that include a fair and unbiased market investigation of a reasonable universe of products that the firm is registered to advise on or trade in; a product comparison to determine whether the products the firm offers are appropriately representative of the reasonable universe of products most likely to meet the investment needs and objectives of its clients, and an optimization process where the firm makes any necessary changes to the range of products it offers to achieve a range of products that is appropriately representative of the products most likely to meet the investment needs and objectives of its clients, based on the securities products that the firm is registered to advise on or trade in. \n 9) Do you think that requiring mixed/non-proprietary firms to select the products they offer in the manner described will contribute to this outcome? If not, why not? \n Please refer to Appendix D for a description of potential guidance. \n 10) Are there other policy approaches that might better achieve this outcome? \n 11) Will this requirement raise challenges for firms in general or for specific registration categories or business models? If so, please describe the challenges. \n 12) Will this requirement cause any unintended consequences? For example, could this requirement result in firms offering fewer products? Could it result in firms offering more products? \n 13) Could these requirements create incentives for firms to stop offering non-proprietary products so that they can fit the definition of proprietary firm? \n 14) Should proprietary firms be required to engage in a market investigation and product comparison process or to offer non-proprietary products? \n 15) Do you think that categorizing product lists as either proprietary and mixed/non-proprietary is an optimal distinction amongst firm types? Should there be other characteristics that differentiate firms that should be identified or taken into account in the requirements relating to product list development? \n Suitability \n Section 13.3 of NI 31-103 would be replaced with the following. \n 16) Do you agree with the requirement to consider other basic financial strategies? \n A registrant must ensure that, before it makes a recommendation to (or recommendation not to), or accepts an instruction from a client to, buy, sell, hold or exchange a security, or makes a purchase, sale, hold or exchange of a security for a client's managed account, such purchase, sale, hold or exchange (or decision not to purchase, sell, hold or exchange in the case of a recommendation not to take any of these actions) satisfies the following three elements, as applicable: \n 17) Will there be challenges in complying with the requirement to ensure that a purchase, sale, hold or exchange of a product is the \"most likely\" to achieve the client's investment needs and objectives? \n • \n <<Basic financial suitability>> : by identifying whether there are any other basic financial strategies, such as paying down high interest debt or directing cash into a savings account, that are more likely to achieve the client's investment needs and objectives than a transaction in securities; \n • \n <<Investment strategy suitability>> : by identifying a basic asset allocation strategy for the client (and evaluating any other proposed investment strategy) that is most likely to achieve the client's investment needs and objectives. This would include identifying a target rate of return the client will need to achieve his or her investment needs and objectives, assessing the target rate against the client's risk profile and resolving any mismatches. If the risk required to achieve the investment needs and objectives is higher than the client's risk capacity, the registrant must revisit the investment needs and objectives with the client; and \n • \n <<Product selection suitability>> : by ensuring that the purchase, sale, hold or exchange of the security (or the decision not to purchase, sell, hold or exchange) is both: \n • \n suitable for the client, and \n • \n most likely to achieve the client's investment needs and objectives, given the client's financial circumstances and risk profile, based on a review of the structure, features, product strategy, costs and risks of the products on the firm's product list. \n This determination must take into account the impact on the performance of the product of any compensation paid to the registrant by the client or a third party in relation to the product and the impact of the investment strategy of the product. \n 18) Should there be more specific requirements around what makes an investment \"suitable\"? \n Registrants must perform a suitability analysis of the portfolio of securities in the client's account at the firm: \n 19) Will the requirement to perform a suitability assessment when accepting an instruction to hold a security raise any challenges for registrants? \n • \n when accepting an instruction from the client to buy, sell, hold or exchange securities or using (or ceasing to use) an investment strategy involving a security; \n • \n when recommending that the client buy, sell, hold or exchange securities or using (or ceasing to use) an investment strategy involving a security; and \n • \n within a reasonable time after any of the following events occur while the client retains an account with the firm, and in any case, at least once every 12 months, or more frequently if the investment strategy (if any) proposed by the representative requires more frequent monitoring: \n • \n securities received into the client's account by deposit or transfer; \n • \n change in representative or firm for the account; \n • \n material changes in the client's KYC information that the registrant knew or reasonably should have known; \n • \n occurrence of a significant market event affecting capital markets to which the client is exposed; and \n • \n material change in the risk profile of an issuer whose securities are held in the client's account, whether determined by external credit ratings or other internal or external risk assessment mechanisms. \n Where an unsuitable investment is identified within an account, the registrant must take appropriate measures to ensure the client receives advice considering the client's investment needs and objectives, risk profile, and other particular circumstances (for example, an appropriate measure or course of action may include contacting the client in a timely manner to recommend changes). Where a client does not want to dispose of the unsuitable investment, it may be appropriate to recommend changes to other investments within the account in order to ensure the suitability of the overall portfolio. {30} \n 20) Will the requirement to perform a suitability analysis at least once every 12 months raise challenges for specific registrant categories or business models? For example, a client may only have a transactional relationship with a firm. In such cases, what would be a reasonable approach to determining whether a firm should perform ongoing suitability assessments? \n Please refer to Appendix E for a description of potential guidance. \n 21) Should clients receive a copy of the representative's analysis regarding the client's target rate of return and his or her investment needs and objectives? \n 22) Will the requirement to perform a suitability review for a recommendation  not  to purchase, sell, hold or exchange a security be problematic for registrants? \n Relationship Disclosure \n Section 14.2 of NI 31-103 would be amended by including the following explicit requirements. \n 23) Do you agree with the proposed disclosure required for firms registered in restricted categories of registration? Why or why not? \n Nature of Relationship Disclosure \n Firms would be required to disclose the actual nature of the client-registrant relationship in easy-to-understand terms. \n 24) Do you agree with the proposed disclosure required for firms that offer only proprietary products? Why or why not? \n Proprietary Product List Disclosure \n Firms must disclose whether they offer proprietary products only or a mixed/non-proprietary list of products. Firms that offer a mixed/non-proprietary list of products must disclose the proportion of proprietary products they offer. Where the product list of the firm meets the definition of a \"proprietary product list\", the firm must clearly disclose to its clients, prominently and in plain language at the time of account opening (or before any product or service is provided), that: \n 25) Is the proposed disclosure for restricted registration categories workable for all categories identified? \n • \n their product list is restricted to proprietary products and they will only recommend proprietary products; and \n • \n as a result, the suitability analysis conducted by the firm and its representatives does not consider: \n • \n the larger market of non-proprietary products; and \n • \n whether such non-proprietary products are better, worse or equal in meeting the client's investments needs and objectives. \n This obligation does not apply when firms deal with institutional clients. \n 26) Should there be similar disclosure for investment dealers or portfolio managers? \n Restricted Registration Category Disclosure \n Firms that are mutual fund dealers, exempt market dealers, scholarship plan dealers or restricted dealers/advisers must clearly disclose to their clients, prominently and in plain language at the time of account opening (or before any product or service is provided), that they only offer, as a result of their registration category, a limited range of products and, as a result, the suitability analysis conducted by the firm and its representatives does not consider: \n 27) Would additional guidance about how to make disclosure about the relationship easier to understand for clients be helpful? \n • \n a full range of securities products; and \n • \n whether such other types of products are better, worse or equal in meeting the client's investments needs and objectives. \n This obligation does not apply when firms deal with institutional clients. \n Please refer to Appendix F for a description of potential guidance. \n Proficiency \n Division 2 of Part 3 of NI 31-103 would be amended to add the following explicit requirements: \n 28) To what extent should the CSA explicitly heighten the proficiency requirements set out under Canadian securities legislation? \n • \n increased proficiency for representatives, including standards that explicitly incorporate the knowledge elements required for compliance with the proposed targeted reforms, including that all representatives must generally understand the basic structure, features, product strategy, costs and risks of all types of securities, such as equities, fixed income, mutual funds, other investment funds, exempt products, and scholarship plan securities; \n • \n in particular, increased proficiency regarding how product costs and investment strategies (e.g. active vs passive) can impact investment outcomes for clients; and \n • \n that representatives are subject to a continuing education requirement, {31}  including on key securities regulatory obligations such as suitability, the KYC and KYP obligations and conflicts of interest, as well as an ethics training component. \n 29) Should any heightening of the proficiency requirements for representatives be accompanied by a heightening of the proficiency requirements for CCOs and UDPs? \n Titles \n A new requirement would be added to NI 31-103 that explicitly requires that all client-facing business titles for representatives be prescribed, as follows: \n 30) Will more strictly regulating titles raise any issues or challenges for registrants or clients? \n <<Alternative 1:>> \n • \n for a representative (i) where his or her sponsoring firm is registered as a portfolio manager or investment dealer and has a mixed/non-proprietary product list, and (ii) that manages a client's discretionary account:  securities advisor -- portfolio management \n • \n for a representative (i) where his or her sponsoring firm is registered as a portfolio manager or investment dealer and has a mixed/non-proprietary product list, and (ii) that advises a client with a non-discretionary account:  securities advisor \n • \n for a representative of any other firm that is not an investment dealer or portfolio manager but that has a mixed/non-proprietary product list:  restricted securities advisor \n • \n for a representative of any firm that has a proprietary product list:  securities salesperson . \n <<Alternative 2:>> \n • \n for representatives of firms registered as portfolio managers and of firms registered as investment dealers that are IIROC members and manage clients with discretionary accounts:  advisor \n • \n for representatives of any other firm:  salesperson \n <<Alternative 3:>> \n • \n representatives could only use their individual category of registration (e.g., dealing representative and/or advising representative) \n 31) Do you prefer any of the proposed alternatives or do you have another suggestion, other than the status quo, to address the concern with client confusion around representatives' roles and responsibilities? \n 32) Should there be additional guidance regarding the use of titles by representatives who are \"dually licensed\" (or equivalent)? \n Designations \n NI 31-103 would be amended to include specific provisions about the designations (i.e., credentials that are used to indicate that the individual has specialized knowledge or expertise in an area gained through education and/or experience) that each category and specific types of representatives may use when dealing with clients. \n 33) Should we regulate the use of specific designations or create a requirement for firms to review and validate the designations used by their representatives? \n Please refer to Appendix G for a description of potential guidance. \n Role of UDP and CCO \n Sections 5.1, 5.2 and 11.1 of NI 31-103 would be amended to clarify the role of UDPs and CCOs, both in terms of compliance systems generally, as well as ensuring compliance in key areas, such as obligations relating to conflicts of interest and suitability. \n 34) Are these proposed clarifying reforms consistent with typical current UDP and CCO practices? If not, please explain. \n Specifically, section 5.1 of NI 31-103 would be amended to clarify that a UDP must: \n • \n ensure the firm has policies and procedures to identify and manage conflicts of interest arising between the firm, each individual acting on its behalf, and clients; \n • \n ensure that material conflicts are avoided if they cannot be managed by disclosure and controls; \n • \n promote consideration and management of conflicts of interest in a manner that prioritizes the interests of the client; and \n • \n promote compliance with the suitability obligation, including assessing the impact of the cost of products on the client's ability to meet his/her investment needs and objectives, given his/her risk profile and financial circumstances. \n Specifically, section 5.2 of NI 31-103 would be amended to clarify that a CCO must establish and maintain policies and procedures and monitor and assess compliance by the firm, and individuals acting on its behalf, with: \n • \n the obligation to respond to material conflicts of interest in a manner that prioritizes the interests of the client ahead of the interests of the firm or registrant; and \n • \n the suitability obligation, including assessment of the impact of the cost of products on the client's ability to meet its investment needs and objectives, given his/her risk profile and financial circumstances. \n Statutory Fiduciary Duty when Client Grants Discretionary Authority \n Existing securities legislation in British Columbia, Saskatchewan, Ontario, Québec, Nova Scotia, Prince Edward Island, Nunavut, Yukon, and the Northwest Territories would be amended to introduce a statutory fiduciary duty for registrants when they manage the investment portfolio of a client through discretionary authority granted by the client. \n 35) Is there any reason not to introduce a statutory fiduciary duty on these terms? \n {30}  See IIROC Notice 12-0109 --  Know your client and suitability -- Guidance , online:  http://www.iiroc.ca/Documents/2012/d21b2822-bcc3-4b2f-8c7f-422c3b3c1de1_en.pdf . \n {31}  Note that (i) in Québec, representatives of mutual fund dealers and of scholarship plan dealers must be members of the Chambre de la sé;curité financière, and are subject to an existing continuing education (CE) requirement, and (ii) IIROC registered individuals are subject to a CE requirement and the MFDA issued a discussion paper soliciting detailed feedback regarding appropriate components of CE requirements and related implementation considerations. \n Although the proposed targeted reforms are meant to apply to all registrants in respect of all their clients, their application is tailored in the following situations: \n Institutional Clients \n For registrants dealing with institutional clients: \n • the proposed targeted reforms relating to suitability and KYC requirements do not apply; \n • the requirement to identify the product list as either mixed/non-proprietary or proprietary does not apply; \n • disclosure by itself may be an acceptable response to a conflict of interest if the conflict of interest is not obviously contrary to the interests of the institutional client, based on the information the firm and representative have about the institutional client. However, certain situations may arise where there can be no other reasonable response than avoidance; and \n • the requirements relating to client-facing titles do not apply. \n Order Execution-Only Services \n For registrants dealing with clients in the context of discount brokerage services, suitability and related KYC requirements do not apply. \n PART 8 -- PROPOSED FRAMEWORK FOR A REGULATORY BEST INTEREST STANDARD \n Reasons all jurisdictions (except the BCSC) are consulting on the potential introduction of a regulatory best interest standard \n All the jurisdictions of the CSA (except the BCSC) (the  BIS Consulting Jurisdictions ) are also consulting on the potential addition of a regulatory best interest standard to the current standard of care for registrants, in addition to the proposed targeted reforms set out in Part 7. \n A regulatory best interest standard would require that a registered dealer or registered adviser shall deal fairly, honestly and in good faith with its clients and act in its clients' best interests, and that a representative of a registered dealer or registered adviser shall deal fairly, honestly and in good faith with his or her clients and act in his or her clients' best interests. The conduct expected of a registrant in meeting her, his or its standard of care would be that of a prudent and unbiased firm or representative (as applicable), acting reasonably. In complying with the standard of care, registrants would be guided by the following principles: \n 1. Act in the best interests of the client \n 2. Avoid or control conflicts of interest in a manner that prioritizes the client's best interests \n 3. Provide full, clear, meaningful and timely disclosure \n 4. Interpret law and agreements with clients in a manner favourable to the client's interest where reasonably conflicting interpretations arise \n 5. Act with care \n The BIS Consulting Jurisdictions have not made a final decision on the adoption of such a standard but have articulated potential guidance in the form provided in Appendix H. \n Any best interest standard in the context of Canadian securities legislation would be formulated as a regulatory conduct standard and not as a restatement or formulation of a fiduciary duty. This approach is preferable since: \n • the content of the regulatory best interest standard is more comprehensive and tailored to the client-registrant relationship than a statutory fiduciary duty would be; \n • the fiduciary duty and its content have developed primarily through case law. Securities regulators can appropriately express a regulatory best interest standard, where the regulator imposes the existence and content of the standard, separate from the process undertaken in particular cases by the courts; \n • fiduciary duty remedies are potentially too harsh for all instances of registrant misconduct; {32}  and \n • fiduciary duty, as a common law concept with a long history and application across various disciplines and situations, lacks the upfront clarity and specificity we require, and that registrants expect, regarding registrant conduct standards that apply on a day-to-day basis. \n The BIS Consulting Jurisdictions have also considered whether the use of the phrase \"best interest\" in the formulation automatically establishes a fiduciary duty. Our view is that it does not, since our express intention is not to establish a statutory fiduciary duty for registrants, and although the phrase \"best interest\" has been interpreted in some contexts as a fiduciary duty, {33}  in others it has not. {34}  With respect to the experience in the U.K. and Australia, two other common law jurisdictions, we understand that the statutory \"best interest\" standard in those jurisdictions does not, by itself, establish a fiduciary duty. {35} \n The OSC and the FCNB are of the current view that the introduction of a regulatory best interest standard would materially enhance the effectiveness of the proposed targeted reforms and strengthen the principled foundation of the client-registrant relationship. The OSC and FCNB believe that such a standard, as a governing principle, would have a number of benefits, such as assisting in the interpretation of more specific requirements and acting as a guide for registrants to address situations that fall between specific rules or that are novel. \n The AMF, the ASC, the MSC and the NSSC are consulting on the best interest standard; however, considering the current regulatory and business environment and the research conducted by the ASC and the BCSC, all four share strong reservations on the actual benefits of the introduction of such a standard over and above the proposed targeted reforms, and are concerned with the potential unintended outcomes of the codification of such an aspirational standard of conduct. See concerns in \"Reasons certain CSA jurisdictions have concerns with the potential regulatory best interest standard\" below. \n The FCAA recognizes that the introduction of a regulatory best interest standard would be a significant regulatory change and is interested in receiving and reviewing all comments on the proposed regulatory best interest standard. \n The BIS Consulting Jurisdictions understand that there are different views on the adoption of a best interest standard, and we welcome all views. Comments will help the jurisdictions considering the adoption of a best interest standard make a decision on this matter. \n The OSC and FCNB are of the view that the introduction of a regulatory best interest standard on the terms set out above would have the benefits identified below; the other BIS Consulting Jurisdictions are of the view that the regulatory best interest standard may have the identified benefits. \n •  Governing principle . A regulatory best interest standard would constitute a governing principle that would: \n • govern the interpretation of more specific regulatory requirements (e.g., those obligations related to KYC, KYP, conflicts of interest and suitability) as a result of ambiguity, new developments or other changes in the investment environment, and \n • act as a guide for registrants and securities regulators to address situations arising in the client-registrant relationship that fall outside specific rules. \n •  Closes the expectations gap . A regulatory best interest standard, over and above the proposed targeted reforms, would help close the expectations gap between the standard of care that clients believe they are receiving from registrants and the standard of care that registrants are subject to under securities legislation. Clients would have the confidence that their relationship with a registrant is governed by a standard of care that prioritizes their interests and that this will govern the interpretation of specific rules as well as situations not presently covered by the rules. A statutory best interest standard would also align with the standard of conduct that representatives who seek to follow high standards of integrity themselves feel they already provide to their clients. In this sense, it would close this gap as well. \n •  More objective, client-centered standard of care . A regulatory best interest standard would be a more objective, client-centered standard of care than the current standard of care (i.e., dealing fairly, honestly and in good faith). At the heart of the regulatory best interest standard is a clear expectation that when registrants are faced with competing interests, their clients' interests are paramount. This would provide a more concrete, intuitive and actionable standard of care for registrants than the current standard of care. \n •  Appropriate tone from the top . The regulatory best interest standard would codify what we currently expect as a sound \"tone from the top\" at registrants, but now given the strength of a regulatory requirement. This would better enable management of firms to assert that the development of a strong compliance culture within the firm is the right thing to do and is a necessary risk management principle. This standard would strengthen the role of CCOs who, with their firms' knowledge, could implement the best practices to be adopted rather than accept minimum standards set out in prescriptive rules. \n •  A principle-based approach allows greater flexibility for registrants . Framing the regulatory best interest standard as a principle would allow the concept of the client's best interest to be the guiding principle that serves as guide to regulators' expectations and would allow registrants to take a flexible, tailored and contextual approach when dealing with (i) the varied conduct situations that can arise in respect of their clients, and (ii) the rapid pace of change within Canada's capital markets generally. In addition, the requirement for registrants to act in the best interest of clients and the focus on client outcomes are important elements of the proposed regulatory best interest standard that would support a principle-based approach, rather than a more prescriptive, process-based approach. \n •  Investors responsible for investing to fund their retirement.  The savings landscape has changed -- amounts invested by investors often constitute a major portion of their wealth and responsibility for funding the costs of living during old age is shifting more to investors. There are various causes for this change, including the shift away from defined benefit retirement plans in Canada. A regulatory best interest standard would acknowledge the critical importance of advice in savings, including retirement, and the enormous financial stakes involved for Canadian investors. \n •  Mitigates client-registrant information gap and validates clients' significant trust in registrants . The adoption of a regulatory best interest standard may help to further mitigate concerns with the lower financial literacy of many investors by ensuring that the registrant has the clients' interests top of mind, rather than requiring clients (who may not be equipped to do so) to attempt to determine whether a particular course of action is in their best interests or not. This would place an appropriate obligation on the party to the relationship who is most often the most knowledgeable and financially literate, namely the adviser or dealer and their representatives. This aligns with what we know about clients' actual ability and/or confidence to manage their own financial affairs. It would also clarify that the registrant would be expected to objectively help formulate the client's best interests, providing a service that is necessary and appropriate for most clients. Since clients already believe that registrants must act in their best interest and place significant trust in registrants, this should not result in investors becoming less engaged in the relationship with their registrant but rather having the confidence to engage in a dialogue with a professional who is required to be unquestionably in the \"client's corner\". \n •  Immediate impact . The key investor protection concerns identified are so substantial that solutions could not await an iterative process of regulatory amendments if the concerns are not mitigated by such amendments or other initiatives, such as CRM2 and Point of Sale. The regulatory best interest standard would be an overarching principle that would allow swifter regulatory action in the interests of investors where required and where registrants do not live up to the spirit of the proposed targeted reforms. While the CRM2 and the Point of Sale initiatives are important enhancements to our regime, their fundamental focus on disclosure is unlikely to sufficiently address the concerns we have identified in Part 5. \n •  Assists in professionalization of advisers, dealers and representatives . The best interest standard would assist in the progress toward the professionalization of the advisory role in Canada similar to other important services that require practitioners to comply with professional standards of conduct. Similarly, it would support and align with the evolution in organizational culture that regulators, and many registrants, have been encouraging for some time. {36} \n •  Aligns with conduct expectations of key international and domestic standard setters . International bodies such as the International Organization of Securities Commissions ( IOSCO ), the Group of Twenty ( G20 ) and the Organisation for Economic Co-operation and Development ( OECD ) are clear that, in the wake of the financial crisis, financial intermediaries, such as advisers and dealers, should act in their clients' best interest. {37}  International and domestic standard setters have also identified the over-arching obligation to act in the client's best interest, or to place the client's interest first, as a key component of the conduct expectation for their members. {38} \n •  Fosters confidence and trust in capital markets and strengthens investor protection . The introduction of a regulatory best interest standard would increase confidence and trust by investors in Canadian capital markets and would strengthen the protection for such investors. This may have the effect of encouraging investors (i) that are not currently invested in securities products to begin investing in securities products and (ii) that are currently invested in securities products to invest more of their overall financial assets in securities products. \n For greater certainty, the proposed regulatory best interest standard is not intended to: \n • interfere with the registration categories under Canadian securities legislation or the scope of application of those categories; \n • prohibit firms from charging clients for their services; \n • prohibit the offering of proprietary products by firms; \n • guarantee that clients' securities investments never lose value, result in the \"best\" or \"highest\" returns for the client, or result in the lowest risk; \n • always result in the lowest cost product on the firm's shelf being recommended to clients since the lowest cost product may not, based on an analysis of a client's investment needs and objectives, always be in the client's best interest; or \n • interfere with the ability of courts to apply common law doctrines relating to, for example, fiduciary duty, negligence or contract law principles, to the client-registrant relationship. \n Reasons the BCSC Is Not Consulting on a Regulatory Best Interest Standard \n The BCSC strongly supports taking action to strengthen the client-registrant relationship. Our objectives are to deliver better regulatory responses, empower investors with better information and improve investor financial outcomes. \n The BCSC has considered the feedback from the Original Consultation Paper about the appropriateness of introducing a statutory best interest duty. Together with the ASC, we have also supplemented that information by conducting our own research and consulting with other experts. Further consultation on a best interest standard is not warranted given the extensive consultation already undertaken by the CSA and the work that has been done since then to identify the investor protection issues and craft targeted responses to them. \n The BCSC is proposing an alternative approach that in our view will significantly strengthen the standards of conduct, lead to better investor outcomes and advance the best interests of investors. The BCSC is of the view our priority should be focused on consideration of the proposed targeted reforms only. Implementing specific requirements that deal directly with the identified issues in the client-registrant relationship will strengthen investor protection and confidence of investors in our capital markets. \n The adoption of a broad, sweeping and vague best interest standard will create uncertainty for registrants and may be unworkable in the current regulatory and business environment. Introducing an over-arching duty called a best interest standard while continuing to permit certain fundamental conflicts to exist between registrants and their clients is not in the public interest. Doing so may exacerbate one of the issues we identified; the expectations gap between clients and registrants and may raise clients' expectations about investor protection that may not be realized under a best interest standard. \n The CSA should establish clear requirements for registrants to follow and regulators and courts to enforce. The proposed targeted reforms, followed through with coordinated and focused compliance and enforcement efforts, and full realization of the CRM2 and Point of Sale initiatives, will achieve the best outcomes for investors and advance the best interests of investors. \n The concerns of BCSC staff are set out more fully in the next section. \n Reasons certain CSA jurisdictions have concerns with the potential regulatory best interest standard \n Staff of the BCSC, the AMF, the ASC, the MSC, and the NSSC (the  Jurisdictions with Concerns about a BIS ) have concerns with the proposed best interest standard, as follows: \n •  The proposed best interest standard may exacerbate the expectations gap between clients and registrants because of the existing restricted registration categories and proprietary business models permitted in Canada. Clients may expect that all registrants have an unqualified duty to act in their best interests, not understanding that some conflicts would still be permitted. \n The current Canadian regulatory and business environment for registrants allows for a wide range of business models and registration categories. These range, on one end, from salespeople dedicated to selling only proprietary products to, on the other end, portfolio managers with fiduciary obligations over fully managed accounts. There are a host of business models between these two extremes. \n For those business models that are closer to the \"salesperson\" end of the spectrum, it would be impossible to impose a regulatory standard on these registrants that is truly a \"best interest\" standard. That has been borne out through the collective experience in other jurisdictions around the world that have wrestled with fiduciary or regulatory best interest standards. It is simply not possible to require a salesperson of proprietary products only to act in a manner that is truly in an investor's best interest. \n All of this is evident in the best interest standard proposed in this Consultation Paper. The proposed standard will not prohibit certain fundamental conflicts between registrants and their clients. Registrants will continue to be able to: \n • sell a limited range or type of investment products (these registrants have the clear limitation that there may be nothing in the limited range of products they offer that is actually in the investor's \"best interest\" to buy); \n • be owned by, or affiliated with, businesses that create the investment products they sell; and \n • be compensated by investment product manufacturers rather than the clients they are meant to serve. \n These arrangements are not consistent with what a client would expect from a standard that purportedly requires registrants to act in their \"best interest\". \n The Jurisdictions with Concerns about a BIS have identified an existing problem of clients misunderstanding the nature of their relationship with their registrant and the corresponding overreliance this produces. If regulators impose a standard that is called a best interest standard, but at the same time permit fundamental conflicts to continue, they run the risk of contributing further to this problem by leading clients to believe that they are getting protections they are not. The proposed standard may therefore exacerbate the gap between what clients expect and what is actually permitted. \n The proposed standard may also lead to client complacency. Trust already plays a significant role in the problem of overreliance. In the recent National Smarter Investor Study commissioned by the BCSC, 90% of respondents described their existing level of trust in their investment representatives as strong or very strong. \n Of those clients whose representative did not discuss with them how they were compensated, 74% of clients said they did not need to know about their registrant's compensation more often because they trusted that it was fair and reasonable. 64% of clients who do not always read their investment statements said they did not need to read their statements very often because they trusted that their representative was taking care of their money. While trust in a representative is of course important and desirable, the proposed best interest standard may cause investors to completely absolve themselves of any responsibility for their investment decisions, on the mistaken belief that registrants will be held to a higher standard of care that will prohibit conflicts that are permitted today. Research shows that engaged and informed investors lead to better investment decisions. \n In the absence of more fundamental changes to restricted registration categories and conflicted business models, the Jurisdictions with Concerns about a BIS think making it our priority to implement the proposed targeted reforms discussed in this Consultation Paper and vigorously enforcing the current conduct standard to \"deal fairly, honestly and in good faith\" will improve investor protection and investor confidence. The proposed targeted reforms are geared to the realities of our current registrant categories and conflicted business models. \n •  The proposed best interest standard will create legal uncertainty. It does not create a clear standard for registrants to follow or for regulators to enforce. \n Imposing a best interest standard that permits the existing restricted business models and conflicted compensation structures will create legal uncertainty. The proposed standard is expressly not a fiduciary duty, so courts may no longer rely on existing jurisprudence in that area. The Jurisdictions with Concerns about a BIS are uncertain how regulators or the courts will interpret a standard that on the one hand expressly requires conduct in the client's best interest and the avoidance of material conflicts, but in other cases permits conduct that may not be in the client's best interest as long as there is disclosure. \n There are also tensions between the proposed standard and more specific regulatory requirements, which may create uncertainty for registrants. In some cases, specific requirements contemplate conduct that seems inconsistent with the proposed standard. For example, currently firms that sell only proprietary products can meet their suitability requirement provided they ensure any recommendation they make to purchase a security from their product list is suitable for the client. However, under a best interest standard, that recommendation may not be in the client's best interest, as it may be in the client's best interest to invest in a non-proprietary product. The firm's recommendation would therefore appear not to comply with the requirement to act in the client's best interest. \n Other regulators that have implemented a best interest standard have faced challenges with the uncertainty it creates. When Australia introduced its statutory best interest standard, it included a \"safe harbour\" if registrants followed certain prescribed steps. One of the elements of the safe harbour was that registrants take \"any other steps that, at the time the advice is provided, would reasonably be regarded as being in the best interests of the client, given the client's relevant circumstances\". In 2014, a new government proposed a bill that included removal of this language, following its commitments to reduce compliance costs for the financial services industry and for consumers who seek advice. The government was concerned that the catch-all provision created significant legal uncertainty and rendered the safe harbour unworkable for registrants because it was too open-ended. \n Because it does not establish a clear standard for registrants to follow or for regulators or courts to enforce, it is uncertain whether the proposed standard will drive better behaviour by registrants and at what cost any changes in behaviour will come. It is not clear how registrants would modify their behaviour to comply with their interpretation of what the standard requires or whether their responses will improve outcomes for investors. \n •  The CRM2 and Point of Sale Initiatives are intended to improve communication in the client-registrant relationship around costs and investment performance. Their effectiveness should be measured before we consider a best interest standard. \n Both industry and regulators have made significant effort to implement the CSA's CRM2 and Point of Sale reforms. Before proceeding with consideration of a best interest standard, the Jurisdictions with Concerns about a BIS believe that we should determine whether those reforms are effective. These changes are intended to advance clients' understanding of how their portfolio is performing and what they are paying their registrants. No other regulatory regime has imposed these significant types of reforms. \n The BCSC is leading a CSA project to measure the impact of CRM2 and Point of Sale disclosure reforms, including their impact on registrant behaviour and client understanding of the cost and performance of their investments. This project is in the planning stage and will run through 2018. \n Only if the Jurisdictions with Concerns about a BIS determine that, together, the CRM2, Point of Sale and proposed targeted reforms are not effective, should we then revisit the question of imposing a best interest standard and how that standard should be defined. \n •  Other jurisdictions that have implemented a best interest standard have done so in conjunction with targeted reforms prohibiting certain conflicted compensation models. \n The proposed standard is unlikely to be effective without more fundamental changes to the Canadian securities industry, including reforms to compensation structures. In the U.K. and Australia, for example, reforms specific to compensation structures were implemented in addition to a qualified best interest standard. Work is being done by the CSA's mutual fund fee project in this area. \n •  The proposed standard may impact interpretation of existing fiduciary standards for certain registrants, i.e. portfolio managers and investment fund managers. \n By applying the proposed standard to all registrants, regardless of the actual nature of the relationship between the registrant and its clients, the Jurisdictions with Concerns about a BIS believe that we risk diminishing the standard currently set out in some jurisdictions' securities laws requiring portfolio managers and dealers with discretionary authority and investment fund managers to act in the best interest of their clients. \n These laws refer to registrants having to act in the client's best interest and are intended to establish true fiduciary standards. The Jurisdictions with Concerns about a BIS think adopting a standard that requires other registrants to also act in their client's best interest, but that is qualified to mean something less than a full fiduciary standard may impact the interpretation of the words \"best interest\" as they apply elsewhere. \n - - - - - - - - - - - - - - - - - - - - \n Questions \n 36) Please indicate whether a regulatory best interest standard would be required or beneficial, over and above the proposed targeted reforms, to address the identified regulatory concerns. \n 37) Please indicate whether you agree or disagree with any of the points raised in support of, or against, the introduction of a regulatory best interest standard and explain why. \n 38) Please indicate whether there are any other key arguments in support of, or against, the introduction of a regulatory best interest standard that have not been identified above. \n - - - - - - - - - - - - - - - - - - - - \n Please refer to Appendix H for the potential guidance for the regulatory best interest standard. \n PART 9 -- IMPACT ON INVESTORS, REGISTRANTS AND CAPITAL MARKETS \n The proposals for regulatory action outlined in this Consultation Paper include new requirements and guidance in a number of areas aimed at enhancing the obligations of registrants toward their clients, including the proposed targeted reforms that create new requirements in various areas, such as: \n • enhanced conflicts of interest provisions that require registrants to respond to conflicts in a manner that prioritizes clients' interests, \n • more specific requirements surrounding collection of KYC information, including the nature of the information required to be collected as well as the frequency of updates, \n • creation of a stand-alone KYP requirement, including product list obligations for firms , \n • the components of a suitability review, \n • client disclosure by firms in restricted registration categories, \n • client disclosure by firms offering only proprietary products, and \n • the use of client-facing titles. \n In addition to the proposed targeted reforms, certain jurisdictions are also considering enhancing the standard of care applicable to registrants by adding a regulatory obligation to act in their clients' best interests. \n We strive to strike a balance between (i) providing protection to investors from unfair, improper or fraudulent practices and (ii) fostering fair and efficient capital markets and confidence in capital markets. In so doing, the business and regulatory costs and other restrictions on the business and investment activities of market participants should be proportionate to the significance of the regulatory objectives sought to be realized. We seek input on the anticipated impact of the proposed targeted reforms and the potential adoption of a regulatory best interest standard on investors, registrants and capital markets generally. \n - - - - - - - - - - - - - - - - - - - - \n Questions \n 39) What impact would the introduction of the proposed targeted reforms and/or a regulatory best interest standard have on compliance costs for registrants? \n 40) What impact would the introduction of the proposed targeted reforms and/or a regulatory best interest standard have on outcomes for investors? \n 41) What challenges and opportunities could registrants face in operationalizing: \n (i) the proposed targeted reforms? \n (ii) a regulatory best interest standard? \n 42) How might the proposals impact existing business models? If significant impact is predicted, will other (new or pre-existing) business models gain more prominence? \n 43) Do the proposals go far enough in enhancing the obligations of dealers, advisers and their representatives toward their clients? \n - - - - - - - - - - - - - - - - - - - - \n PART 10 -- INTERNATIONAL DEVELOPMENTS \n Background \n While our core focus is Canada, we also considered certain recent and ongoing developments in the U.S., U.K., Australia and the European Union ( E.U. ) regarding the client-registrant (or equivalent) relationship. All of these jurisdictions have either implemented, or are proposing to implement, a regulatory best interest standard or fiduciary duty. International reforms tend toward a qualified best interest standard, and not an unqualified fiduciary duty. Other jurisdictions that have adopted a qualified best interest standard have also introduced restrictions on certain compensation models that create conflicts between the registrant and client. \n During the consultation period, we will continue to monitor international developments. \n Reforms and proposals in the U.S. \n In the U.S., the Securities and Exchange Commission ( SEC ) has been considering the 2011 staff recommendations from SEC Staff on the adoption of a uniform, statutory fiduciary duty; the Staff recommendations were provided in the context of the  Dodd Frank Wall Street Reform and Consumer Protection Act of 2010  ( Dodd-Frank Act ). {39}  No new standard has yet been adopted by the SEC although a notice of rulemaking is expected in October 2016, according to the SEC Office of Management and Budget's agenda. {40} \n On March 1, 2013, the SEC issued a request for data in its  Release 34-69013 -- Duties of Brokers, Dealers, and Investment Advisers  ( SEC 2013 release ). {41}  The purpose of the SEC 2013 Release is to request quantitative data and economic analysis, relating to the benefits and costs that could result from various alternative approaches regarding the standards of conduct and other obligations of broker-dealers and investment advisers. Several comments have been made relative to the SEC 2013 Release and SEC staff have met with industry. \n In October 2013, the Financial Industry Regulatory Authority ( FINRA ) issued a report titled  Report on Conflicts of Interest , {42}  in which it indicated that the adoption of a best interest of the customer standard is a key feature of a robust conflicts management framework. \n Following President Obama's statement on February 23, 2015, the U.S. Department of Labor made a rulemaking proposal on April 20, 2015 ( DOL Fiduciary Rule ) {43}  requiring fiduciary advice for retirement accounts and expanding the types of retirement advice covered by \"fiduciary protections\". The DOL Fiduciary Rule also prohibits registrants subject to the rule from receiving certain types of commissions, including embedded (trailing) commissions. An important feature of the DOL Fiduciary Rule is the \"best interest contract exemption\" which allows firms to continue to set their own compensation practices so long as they, among other things, commit by contract with the client to putting their client's best interest first and disclose any conflicts that may prevent them from doing so. On April 6, 2016, the Department of Labor released the final version of the DOL Fiduciary Rule, {44}  which provides the U.S. Congress with 60 days to review it. \n The Securities Industry and Financial Markets Association ( SIFMA ) proposed, on June 3, 2015, a best interest standard for dealer-brokers. {45}  SIFMA proposes, among other things, that the traditional securities regulatory approach of establishing a rules-based, heightened standard be followed, including robust disclosure, coupled with robust examination, oversight, and enforcement by the SEC, FINRA and state securities regulators, as well as a private right of action for investors. \n Finally, the Best Practices Board of the Institute for the Fiduciary Standard ( IFS ) published a number of best practices for financial representatives on September 30, 2015, {46}  which IFS qualifies as concrete and verifiable, as opposed to aspirational. The position of IFS rests on the premise that \"fiduciary principles broadly include two sets of competence criteria. \"Technical\" criteria such as education, expertise and experience, and \"ethical\" criteria such as character, honesty and transparency. Each set of competences is vital.\" General best practices should therefore, in its view, be based on an affirmation that the fiduciary standard under the  Investment Advisers Act of 1940  and common law principles govern all professional advisory client relationships at all times. \n Reforms and proposals in the U.K. \n In the U.K., the Financial Conduct Authority ( FCA ) Handbook {47}  provides that all registrants must act honestly, fairly and professionally in accordance with the best interest of the client. This best interest standard is qualified, however, since registrants are subject to a spectrum of requirements which vary according to the nature of the advice given to clients (independent, namely unbiased advice on a broad range of products, and restricted, namely advice on mainly proprietary or other specific products). \n In December 2012, the FCA prohibited embedded commissions and prescribed higher professional requirements for representatives as part of its Retail Distribution Review. {48}  Representatives need to subscribe to a code of ethics, hold an appropriate qualification, carry out at least 35 hours of continuing professional development a year, and hold a statement of professional standing from an accredited body. Representatives that do not meet these standards have not been able to make personal recommendations to retail customers since January 1, 2013. \n In December 2014, the FCA published the findings from the first stage of its Post Implementation Review {49}  which concluded that the ban on commissions has led to a reduction of product bias in representatives' recommendations, based on evidence such as a decline in the sale of products which had higher commissions pre-reform, as well as an increase in the sale of those which paid lower or no commission pre-reform. \n In August 2015, UK HM Treasury and the FCA launched the Financial Advice Market Review ( FAMR ) {50}  in order to explore the supply and demand sides of the market for financial advice, with the objective of examining whether there is an advice gap, centred on the supply of financial advice, the cost of advice and the revenue from providing it, and the barriers to firms providing advice, including regulatory costs and liability. The paper indicated a possible reduction in access to advice for less affluent investors. UK HM Treasury published a final report on March 14, 2016 setting out the findings of the FAMR {51}  together with a number of recommendations intended to address the barriers to accessing advice, including recommendations to allow for the development by firms of more streamlined services such as mass-market automated advice models. \n Reforms and proposals in Australia \n In Australia, the Future of Financial Advice Review ( FAR ) {52}  became mandatory on July 1, 2013 and included a qualified statutory best interest standard with a safe harbour when reasonable steps relating to know your client, know your product, suitability and proficiency are taken by the registrant. Regulation of fees and a prohibition on conflicted remuneration structures were also introduced. FAR followed in the footsteps of a report issued in 2009 by the Australian Parliamentary Joint Committee on Corporations and Financial Services, which examined the high-profile collapse of two Australian securities firms, and called for stricter regulation of financials registrants. {53} \n Reforms and proposals in the European Union (MiFID II) \n Amendments to MiFID II were adopted in 2014 with a target date for their coming into force in January 2018 in all E.U. member states. {54}  Some of the important measures introduced by MiFID II include: \n • a ban on inducements from third parties for services they carry out on behalf of a client for independent advice and portfolio management, \n • disclosure of whether or not advice is being provided on an independent basis, \n • a requirement that investment firms providing independent advice must assess a sufficient range of financial instruments, \n • restrictions for the distribution of complex products, disclosure of costs and charges, and \n • product governance requirements for investment firms. \n PART 11 -- COMMENT PROCESS AND NEXT STEPS \n The issues addressed in this Consultation Paper are important ones which affect all participants in the Canadian capital markets. Due to the broad impact of these proposed changes, we invite all interested parties to make written submissions. Once we have considered feedback received, we will propose the appropriate rule changes, as necessary. Any rule proposal will be published for comment in accordance with the regular rule-making process. \n Please submit your comments in writing on or before  August 26, 2016 . If you are sending your comments by email, you should also send an electronic file containing the submissions in Microsoft Word format. \n Certain CSA regulators require publication of the written comments received during the comment period. We will publish all responses received on the websites of the AMF ( www.lautorite.qc.ca ), the OSC ( www.osc.gov.on.ca ), and the ASC ( www.albertasecurities.com ). Therefore, you should not include personal information directly in comments to be published. It is important that you state on whose behalf you are making the submission. \n Please address your comments to each of the following: \n Alberta Securities Commission \n Autorité des marchés financiers \n British Columbia Securities Commission \n The Manitoba Securities Commission \n Financial and Consumer Services Commission (New Brunswick) \n Nova Scotia Securities Commission \n Ontario Securities Commission \n Financial and Consumer Affairs Authority of Saskatchewan \n Please send your comments only to the following addresses. Your comments will be forwarded to the remaining jurisdictions: \n Josée Turcotte, Secretary \n Ontario Securities Commission \n 20 Queen Street West, 22nd Floor \n Toronto, Ontario \n M5H 3S8 \n Fax: 416-593-2318 \n E-mail: comments@osc.gov.on.ca \n Me Anne-Marie Beaudoin, Corporate Secretary \n Autorité des marchés financiers \n 800, rue du Square-Victoria, 22e étage \n C.P. 246, tour de la Bourse \n Montréal, Québec \n H4Z 1G3 \n Fax: 514-864-6381 \n E-mail: consultation-en-cours@lautorite.qc.ca \n Questions \n If you have any comments or questions, please contact any of the CSA staff listed below. \n Jason Alcorn \n Chris Besko \n Senior Legal Counsel \n Director, General Counsel \n Financial and Consumer Services Commission of New Brunswick \n The Manitoba Securities Commission \n Tel: 506-643-7857 \n Tel: 204-945-2561 \n <<jason.alcorn@fcnb.ca>> \n Toll Free (Manitoba only): 1-800-655-5244 \n <<chris.besko@gov.mb.ca>> \n Jane Anderson \n Gérard Chagnon \n Director, Policy & Market Regulation and Secretary to the Commission \n Analyste expert en réglementation \n Nova Scotia Securities Commission \n Direction de l'encadrement des intermédiaires \n Tel: 902-424-0179 \n Autorité des marchés financiers \n <<jane.anderson@novascotia.ca>> \n Tel: 418-525-0337, ext. 4815 \n Toll Free: 1-877-525-0337 \n <<gerard.chagnon@lautorite.qc.ca>> \n Sarah Corrigall-Brown \n Liz Kutarna \n Senior Legal Counsel, Capital Markets Regulation \n Deputy Director \n British Columbia Securities Commission \n Capital Markets, Securities Division \n Tel: 604-899-6738 \n Financial and Consumer Affairs Authority of Saskatchewan \n <<scorrigall-brown@bcsc.bc.ca>> \n Tel: 306-787-5871 \n <<liz.kutarna@gov.sk.ca>> \n Sophie Jean \n Maye Mouftah \n Directrice de l'encadrement des intermédiaires \n Senior Legal Counsel \n Autorité des marchés financiers \n Compliance and Registrant Regulation \n Tel: 514-395-0337, ext. 4801 \n Ontario Securities Commission \n Toll Free: 1-877-525-0337 \n Tel: 416-593-2358 \n <<sophie.jean@lautorite.qc.ca>> \n <<mmouftah@osc.gov.on.ca>> \n Bonnie Kuhn \n Jeff Scanlon \n Manager, Legal \n Senior Legal Counsel \n Market Regulation \n Compliance and Registrant Regulation \n Alberta Securities Commission \n Ontario Securities Commission \n Tel: 403-355-3890 \n Tel: 416-204-4953 \n <<bonnie.kuhn@asc.ca>> \n <<jscanlon@osc.gov.on.ca>> \n Sonne Udemgba \n Deputy Director \n Legal Department, Securities Division \n Financial and Consumer Affairs Authority of Saskatchewan \n Tel: 306-787-5879 \n <<sonne.udemgba@gov.sk.ca>> \n {1}  The Original Consultation Paper and the Staff Notice are available on the websites of the members of the CSA. \n {2}  \" We\" or \"us\" when used in this Consultation Paper refers to the CSA other than when used in Part 8, a part of the Consultation Paper that expresses different opinions of various CSA members. In Part 8, \"we\" or \"us\", when used in each of the three subsections of that part, means the jurisdiction, or subset of jurisdictions, of the CSA defined at the beginning of each subsection. \n {3}  See  Implementation of the Final Stage of Point of Sale Disclosure for Mutual Funds: Pre-Sale Delivery of Fund Facts -- CSA Notice of Amendments to NI 81-101 Mutual Fund Prospectus Disclosure and to Companion Policy 81-101CP Mutual Fund Prospectus Disclosure  (December 11, 2014). The publication is available on the websites of members of the CSA. \n {4}  See CSA Notice of Amendments to National Instrument 31-103  Registration Requirements, Exemptions and Ongoing Registrant Obligations  and to Companion Policy 31-103CP  Registration Requirements, Exemptions And Ongoing Registrant Obligations  (Cost Disclosure, Performance Reporting And Client Statements) (March 28, 2013). The publication is available on the websites of members of the CSA. \n {5}  See CSA Discussion Paper and Request for Comment 81-407  Mutual Fund Fees  and related, subsequent, materials. These publications are available on the websites of members of the CSA. \n {6}  OSC, 2015 Annual Report, online:  https://www.osc.gov.on.ca/documents/en/Publications/Publications_rpt_2015_osc-annual-rpt_en.pdf  at p.7. \n {7}   Mystery Shopping for Investment Advice  ( https://www.osc.gov.on.ca/documents/en/Securities-Category3/20150917-mystery-shopping-for-investment-advice.pdf ). \n {8}  A total of 105 shops were completed throughout Ontario across four investment platforms, including investment dealers, mutual fund dealers, exempt market dealers and portfolio managers. \n {9}  \"Shops\" in this context means a visit by the \"client\" to a representative. In some cases, more than one shop occurred at the same firm. \n {10}   http://www.investright.org/uploadedFiles/news/research/Smarter%20Investor%20Study%20FULL%20REPORT.pdf \n {11}   https://www.securities-administrators.ca/uploadedFiles/General/pdfs/Brondesbury%20Mutual%20Fund%20Fee%20Research%20Report_ engwr.pdf . \n {12}   http://www.csa-acvm.ca/uploadedFiles/General/pdfs/Dissection%20Fund%20Fees%20Flows_October%2019%202015_FINALEng.pdf . \n {13}  The Investor Advisory Panel is an independent committee of the OSC. \n {14}   https://www.osc.gov.on.ca/documents/en/Investors/iap_20151112_risk-profiling-report.pdf . \n {15}  IIROC,  IIROC Notice 16-0068 -- Managing Conflicts in the Best Interest of the Client  (April 6, 2016), online:  http://www.iiroc.ca/Documents/2016/F58C9465-AFC5-42F3-A5D1-6C5BFDF19CF3_en.pdf ; IIROC,  2015-2016 Annual Compliance Priorities Report  (April 2016), online:  http://www.iiroc.ca/Documents/2016/09cf32f7-236c-4d13-a3ca-4c53a2a32fd0_en.pdf ; IIROC,  Annual Consolidated Compliance Report  (2014), online: http://www.iiroc.ca/Documents/2015/0bdb279a-eb58-484e-a164-4748e96c478b_en.pdf; BCSC, 2014 Compliance Report Card, online:  http://www.bcsc.bc.ca/uploadedFiles/For_Registrants/BCSC_2014_Compliance_Report_Card.pdf?t=1412377357621 ; BCSC, 2012 Compliance Report Card, online:  http://www.bcsc.bc.ca/uploadedFiles/Common/2012_Compliance_Report_Card.pdf ; OSC Staff Notice 33-728 -- 2007 Annual Report -- Compliance Team, online:  https://www.osc.gov.on.ca/documents/en/Securities-Category3/sn_20070824_33-728_2007-annual-rept.pdf ; OSC Staff Notice 33-731 -- 2008 Compliance Team Annual Report, online:  https://www.osc.gov.on.ca/documents/en/Securities-Category3/sn_20080904_33-731_2008-compliance-rpt-commercial.pdf ; OSC Staff Notice 33-732 -- 2009 Compliance Team Annual Report, online:  https://www.osc.gov.on.ca/documents/en/Securities-Category3/sn_20090925_33-732_2009-compliance-rpt.pdf ; OSC Staff Notice 33-734: (2010) Compliance and Registrant Regulation Branch Annual Report, online:  http://www.osc.gov.on.ca/en/29509.htm ; OSC Staff Notice 33-735 Sale of Exempt Securities to Non-Accredited Investors (2011), online:  http://www.osc.gov.on.ca/en/SecuritiesLaw_rule_20110513_33-735_non-accredited-investors.htm ; OSC Staff Notice: 33-736 -- 2011 Annual Summary Report for Dealers, Advisers and Investment Fund Managers, online:  http://www.osc.gov.on.ca/en/33324.htm ; OSC Staff Notice 33-740 -- Report on the results of the 2012 targeted review of portfolio managers and exempt market dealers to assess compliance with the know-your-client, know-your-product and suitability obligations, online:  http://www.osc.gov.on.ca/en/SecuritiesLaw_33-740.htm ; OSC Staff Notice: 33-738 -- 2012 OSC Annual Summary Report for Dealers, Advisers and Investment Fund Managers, online:  http://www.osc.gov.on.ca/en/SecuritiesLaw_33-738.htm ; OSC Staff Notice: 33-742 -- 2013 OSC Annual Summary Report for Dealers, Advisers and Investment Fund Managers, online:  http://www.osc.gov.on.ca/en/SecuritiesLaw_33-742.htm ; OSC Staff Notice: 33-745 -- 2014 Annual Summary Report for Dealers, Advisers and Investment Fund Managers, online:  http://www.osc.gov.on.ca/en/46225.htm ; CSA Staff Notice 31-336 -- Guidance for Portfolio Managers, Exempt Market Dealers and Other Registrants on the Know-Your-Client, Know-Your-Product and Suitability Obligations, online:  https://www.osc.gov.on.ca/documents/en/Securities-Category3/csa_20140109_31-336_kyc-kyp-suitability-obligations.pdf ; CSA Staff Notice 31-343 --  Conflicts of interest in distributing securities of related or connected issuers  (November 2015), online:  https://www.bcsc.bc.ca/Securities_Law/Policies/Policy3/PDF/31-343__CSA_Notice___November_19__2015/ . \n {16}  MFDA, 2015 Annual Enforcement Report, online:  http://www.mfda.ca/about/AnnReports/EnfAR2015.pdf ; MFDA 2014 Annual Enforcement Report, online:  http://www.mfda.ca/about/AnnReports/EnfAR2014.pdf ; IIROC Website -- \"Statistics\" webpage, online:  http://www.iiroc.ca/industry/enforcement/Pages/Statistics.aspx ; OBSI, 2015 Annual Report, online:  https://www.obsi.ca/en/download/fm/500/filename/Annual-Report-2015-1457540052-fdac0.pdf ; OBSI, 2014 Annual Report, online:  https://www.obsi.ca/en/download/fm/290/filename/Annual-Report-2014-1426085311-f082e.pdf  (for copies of OBSI annual reports from prior years, see  https://www.obsi.ca/en/news-and-publications/annual-report ). \n {17}  Foerster  et al ,  Retail Financial Advice: Does One Size Fit All?  (2014), online:  http://www.usc.edu/schools/business/FBE/seminars/papers/F_10-3-14_LINNAINMAA.pdf . This study draws on a large data set comprised of account-level data for a large group of Canadian investors and their representatives. \n {18}   Ibid.  at p.1 and 31. \n {19}  \"Net alpha\" is a term that means the average abnormal return net of fees and expenses. \n {20}   Ibid . at p.27 \n {21}   Ibid . \n {22}  Christoffersen et al,  What do Consumers' Fund Flows Maximize? Evidence from Their Brokers' Incentives  (2013), online:  http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1393289 . \n {23}  Executive Office of the President of the United States,  The Effects of Conflicted Investment Advice on Retirement Savings  (2015), online:  https://www.whitehouse.gov/sites/default/files/docs/cea_coi_report_final.pdf  at p.2. See also, e.g., Bergstresser et al, Assessing the Costs and Benefits of Brokers in the Mutual Fund Industry (2009), online:  http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1479110 ; Chalmers & Reuter, What is the Impact of Financial Advisors on Retirement Portfolio Choices and Outcomes? (2012), online:  http://www.nber.org/papers/w18158 ; and Del Guercio & Reuter, Mutual Fund Performance and the Incentive to Generate Alpha (2012), online:  http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1935109 . \n {24}  NBER Working Paper Series,  The Market for Financial Advice: An Audit Study  (2012), online:  http://www.nber.org/papers/w17929  at Abstract. See also Hackethal et al,  Financial Advisors: A Case of Babysitters?  (2011), online:  http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1360440&download=yes . \n {25}  See, e.g., Bergstresser et al,  Assessing the Costs and Benefits of Brokers in the Mutual Fund Industry  (2009), online:  http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1479110 ; Chalmers & Reuter,  What is the Impact of Financial Advisors on Retirement Portfolio Choices and Outcomes?  (2012), online:  http://www.nber.org/papers/w18158 ; Del Guercio & Reuter,  Mutual Fund Performance and the Incentive to Generate Alpha  (2012), online:  http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1935109 ; and Finke,  Financial Advice: Does it Make a Difference?  (2012), online:  http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2051382&download=yes . \n {26}  Russel Kinnel, \"How expense ratios and star ratings predict success\", Morningstar FundInvestor, August 2010, online:  http://news.morningstar.com/articlenet/article.aspx?id=347327 . See also William F. Sharpe, \"The Arithmetic of Investment Expenses\" Financial Analysts Journal, Volume 69:2, online:  http://www.cfapubs.org/doi/pdf/10.2469/faj.v69.n2.2 ; The Economist, \"Against the odds: The costs of actively managed funds are higher than most investors realise\" (February 11, 2014), online:  http://www.economist.com/news/finance-and-economics/21596965-costs-actively-managed-funds-are-higher-most-investors-realise-against ; Vanguard,  The Case For Index-Fund Investing for Canadian Investors  (April 2015), online:  https://www.vanguardcanada.ca/documents/case-for-indexing.pdf . See also  http://www.ft.com/intl/cms/s/0/7db9d3ee-4887-11e4-9d04-00144feab7de.html#axzz40vW4XIk8 \n {27}  Sources: Investor Economics, Morningstar Direct, and the Investment Management Association at June 2015. \n {28}  See, e.g., Cain et al,  The Dirt on Coming Clean: Perverse Effects of Disclosing Conflicts of Interest  (2005), online:  http://www.cbdr.cmu.edu/mpapers/cainloewensteinmoore2005.pdf ; Sah et al,  The Burden of Disclosure: Increased Compliance with Distrusted Advice  (2012), online:  http://www.cmu.edu/dietrich/sds/docs/loewenstein/BurdenDisclosure.pdf ; Sah & Loewenstein,  Nothing to declare: Mandatory and voluntary disclosure leads advisors to avoid conflicts of interest  (2014), online:  http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2289975 ; Prentice,  Moral Equilibrium: Stock Brokers and the Limits of Disclosure  (2011), online:  http://wisconsinlawreview.org/wp-content/files/1-Prentice.pdf . \n {29}  This summary is not comprehensive and we note that interpretations of current law are not necessarily static and can be the subject of continuing interpretation and refinement; therefore, this limited summary is not binding on the interpretation of the current obligations by members of the CSA or the SROs in any particular case. \n {32}  For example, when calculating damages when a breach of fiduciary duty has been found, such calculation \"is not subject to the limiting principles of foreseeability, contributory negligence or the duty to mitigate.\" From G. Clarke, \"Liability and Damages in Unsuitable Investment Advice Cases\" (August 2005), online:  http://www.fasken.com/files/Publication/4cf45b14-e485-48e4-aa0a-da03f61fc5bd/Presentation/PublicationAttachment/b246cb59-696f-49e9-a746-8f905e0437d7/LIABILITY_AND_DAMAGES.PDF  at 64. See also See also generally M.V. Ellis,  Fiduciary Duties in Canada , looseleaf (Toronto: Carswell, 1988) at Chapter 20. \n {33}  For example, sections 116 of the  Securities Act  (Ontario) and 159.3 of the  Securities Act  (Québec); director duties under corporate law; and other situations where legislation codified pre-existing fiduciary duties at common law. \n {34}  For example, in the SRO rules relating to responding to conflicts of interest (which is a key area of focus of fiduciary duties), the obligation includes a reference to acting in a manner consistent with the best interests of the client. The SROs are clear that this, by itself, does not constitute a fiduciary duty; it seems their members and the courts have not disagreed. \n {35}  For a detailed discussion regarding the feasibility of amending the law of fiduciary duty to address concerns with the conduct of financial intermediaries in the U.K., please see  http://www.lawcom.gov.uk/wp-content/uploads/2015/03/cp215_fiduciary_duties.pdf . \n {36}  See, e.g., IIAC, \"Letter from the President: How Investor Psychology is Changing -- and Wealth Management Firms and Advisors are Responding\" (10 April 2014), online:  http://iiac.ca/wp-content/uploads/IIAC-Letter-from-the-President-Volume-73.pdf ; The Economist (Intelligence Unit),  A Crisis of Culture: Valuing ethics and knowledge in financial services  (2013), online:  http://www.economistinsights.com/sites/default/files/LON%20-%20SM%20-%20CFA%20WEB.pdf . \n {37}  IOSCO, International Conduct of Business Principles (July 1990), online:  https://www.iosco.org/library/pubdocs/pdf/IOSCOPD8.pdf ; OECD, G20 High-Level Principles on Financial Consumer Protection (October 2011), online:  http://www.oecd.org/dataoecd/58/26/48892010.pdf ; G20/OECD Task Force on Financial Consumer Protection, Update Report on the Work to Support the Implementation of the G20 High-Level Principles on Financial Consumer Protection (2013), online:  http://www.oecd.org/g20/topics/financial-sectorreform/G20EffectiveApproachesFCP.pdf ; G20/OECD Task Force on Financial Consumer Protection, Effective Approaches to Support the Implementation of the Remaining G20/OECD High-Level Principles on Financial Consumer Protection, online:  http://www.oecd.org/daf/fin/financial-education/G20-OECD-Financial-Consumer-Protection-Principles-Implementation-2014.pdf . See also Expert Committee to Consider  Financial Advisory and Financial Planning Policy Alternatives, Financial Advisory and Financial Planning Policy Alternatives: Preliminary Policy Recommendations of the Expert Committee to Consider Financial Advisory and Financial Planning Policy Alternatives  (April 2016), online:  http://www.fin.gov.on.ca/en/consultations/fpfa/fpfa-policy-recommendations.pdf . \n {38}  See, e.g., Advocis, Code of Professional Conduct, online:  http://www.advocis.ca/pdf/Advocis-CPC.pdf ; CFA Institute,  Statement of Investor Rights , online:  https://www.cfasociety.org/liechtenstein/Documents/statement_of_investor_rights.pdf ; CFA Institute, Code of Ethics and Standards of Professional Conduct (2014), online:  http://www.cfapubs.org/doi/pdf/10.2469/ccb.v2014.n6.1 ; CFA Institute, Standards of Practice Handbook (2014), online:  http://www.cfapubs.org/doi/pdf/10.2469/ccb.v2014.n4.1 ; CFA Institute, Asset Manager Code of Professional Conduct, online:  http://www.cfainstitute.org/ethics/Documents/amc_outreach_flyer.pdf ; Financial Planning Standards Council, Code of Ethics, online:  http://www.fpsc.ca/guidance-code-of-ethics ; Chartered Investment Manager, Code of Ethics, online:  https://www.csi.ca/student/en_ca/designations/pdf/CIM_code_of_Ethics.pdf ; Fi360, Prudent Practices for Investment Advisors (2014), online:  http://www.fi360.com/main/pdf/handbook_advisor.pdf ; Certified International Wealth Manager, Code of Ethics and Standards of Professional Conduct, online:  https://www.csi.ca/student/en_ca/designations/pdf/CIWM-code-ofethics.pdf . \n {39}  H.R. 4173, 111 th  Cong. (2010) ( https://www.sec.gov/about/laws/wallstreetreform-cpa.pdf). \n {40}   http://www.reginfo.gov/public/do/eAgendaViewRule?pubId=201510&RIN=3235-AL27 . \n {41}   http://secsearch.sec.gov/search?utf8=%E2%9C%93&affiliate=secsearch&query=Release+34-69013+-+Duties+of+Brokers%2C+Dealers%2C+and+Investment+Advisers . \n {42}   https://www.finra.org/sites/default/files/Industry/p359971.pdf . \n {43}  Department of Labor, Notice of proposed rulemaking and withdrawal of previous proposed rule, Definition of the Term \"Fiduciary\"; Conflicts of interest Rule -- Retirement Investment Advice, April 20, 2015  http://www.gpo.gov/fdsys/pkg/FR-2015-04-20/pdf/2015-08831.pdf.https://www.uschamber.com/sites/default/files/summary_of_dol_fiduciary_proposal.pdf . Under the DOL proposal, any individual receiving compensation for providing advice that is individualized or specifically directed to a particular plan sponsor, plan participant, or investment retirement account owner for consideration in making a retirement investment decision would be a fiduciary. \n {44}   http://www.dol.gov/ebsa/regs/conflictsofinterest.html . \n {45}  Proposed Best Interests of the Customer Standard for Broker-Dealers:  http://www.sifma.org/issues/item.aspx?id=8589954937 \n {46}   http://www.thefiduciaryinstitute.org/wp-content/uploads/2015/09/BestPracticesSeptember302015.pdf . \n {47}  Section 2.1.1 of Financial Conduct Authority  Handbook  ( http://fsahandbook.info/FSA/html/handbook/COBS ). \n {48}   http://www.fsa.gov.uk/static/pubs/guidance/fg12-15.pdf . \n {49}   http://www.fca.org.uk/static/documents/post-implementation-review-rdr-phase-1.pdf. \n {50}   http://www.fca.org.uk/static/documents/famr-cfi.pdf . \n {51}   https://www.fca.org.uk/static/fca/documents/famr-final-report.pdf . \n {52}   http://www.austlii.edu.au/au/legis/cth/consol_act/ca2001172/. \n {53}   http://www.aph.gov.au/binaries/senate/committee/corporations_ctte/fps/report/report.pdf. \n {54}  Directive 2014/65/EU of the European Parliament and Council of 15 May 2014 on Markets in Financial Instruments and amending Directive 2002/92/EC and Directive 2011/61/EU (recast)  http://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32014L0065&from=EN . See also:  http://europa.eu/rapid/press-release_IP-16-265_en.htm  in respect of the postponement of the January 2017 target date, to January 2018. \n Appendix A \n Description of Potential Guidance -- Conflicts of Interest \n Responding to conflicts of interest \n General \n When responding to any material conflict of interest, firms and representatives must do so in a manner that prioritizes the interests of the client ahead of the interests of the firm and representative. \n Conflicts of interest must either be avoided or disclosed and controlled. When they cannot be disclosed and controlled in a manner that prioritizes the interests of the client ahead of the interests of the firm and representative, conflicts of interest must be avoided. In other circumstances, they can be mitigated by disclosure and controls. However, disclosure alone is a generally inadequate mitigation mechanism because of its limited impact on a client's decision-making process. \n Avoiding conflicts of interest \n If a firm or a representative is unable to control a material conflict of interest in a manner that prioritizes the interests of the client ahead of the interests of the firm and representative, then the firm and representative must avoid the conflict of interest. \n Avoiding a conflict may include ceasing to provide a service, not trading in or advising on a particular product or products, or ending the relationship with the client. \n Controlling conflicts of interest \n In order to respond to material conflicts in a manner that prioritizes the interest of the client, firms and representatives must be able to identify conflict situations and take measures to appropriately respond to them. Firms should address material conflicts of interest through proactive decision making by reference to thorough and effective conflict of interest policies and procedures. The framework for these policies and procedures will depend on a number of factors for each firm, including the size and complexity of their business and the availability of information about their clients. \n The following would be key elements of a reasonable conflict management system for firms in meeting their duties to their clients: \n • A tone from the top, set by the firm's UDP, executive management of the firm and the firm's board of directors (or equivalent), that emphasizes the importance of integrity when dealing with clients and the handling of conflicts of interest in a manner that prioritizes the interests of the client ahead of the interests of the firm and representative; \n • articulated structures, policies and procedures to identify and respond to conflicts of interest that include: \n • a working description of conflicts of interest that enables the firm and its employees (including representatives) to understand and identify material conflicts of interest that may arise in a firm's business; \n • an internal requirement that when employees or agents of the firm (including representatives) become aware of a potential or actual material conflict of interest, the employee should immediately report the conflict of interest to the CCO of the firm; \n • adoption of a \"prioritization of the client's interest\" or \"client's interest first\" standard in a firm's code of conduct; \n • a clear delineation of firm and representatives' responsibilities with respect to identifying and managing conflicts of interest; \n • defined escalation procedures for handling potential conflict situations; \n • proactive and systematic identification of conflicts of interest in a firm's business on an ongoing and periodic basis, for example, by the creation of a conflicts inventory; \n • regular reporting of material conflicts of interest by the CCO to the firm's UDP, executive management and board of directors (or equivalent) including how the firm responded to the conflict; and \n • periodic testing of the firm's conflicts management framework; \n • a requirement in the firm's compliance system to avoid material conflicts of interest if this is the only response that would be reasonable and consistent with the obligation to prioritize the interests of the client ahead of the interests of the firm and representative, even if that avoidance means foregoing an otherwise attractive business opportunity or compensation to the firm or representative; \n • effective disclosure to clients; \n • hiring practices that rigorously review potential representatives' history, when available, of integrity, solvency and demonstrated proficiency, as well as their compliance with Canadian securities legislation and interactions with securities regulators; \n • training that focuses on integrity when dealing with clients; and \n • a system that is thorough and effective in all locations of business of the firm, not just the firm's head office. \n For firms that trade in or advise on proprietary products, the incentive to recommend the proprietary product results in a material conflict of interest which may increase the likelihood that the firm or representative will recommend a product that is not suitable for a client, in breach of its suitability obligation. In addition to ensuring that the products they recommend are suitable for clients, firms and representatives must respond to this conflict with thorough controls that effectively mitigate the conflict, and not rely on disclosure alone to mitigate the conflict. If the firm or a representative acting on its behalf cannot control the conflict raised by the incentive to recommend a proprietary product, it must avoid the conflict and not recommend or trade the product. \n When a registrant has decided to control, instead of avoid, a conflict of interest, the onus is on the registrant to demonstrate that the controls in place ensure that the conflict is controlled in a manner that prioritizes the interests of the client ahead of the interests of the firm and representative. \n Disclosing conflicts of interest \n Subsection 13.4(3) of NI 31-103 requires that, if a reasonable investor would expect to be informed of an actual or potential material conflict of interest in their relationship with their firm and representative, then the firm must provide adequate disclosure to the client in a timely manner. This is in addition to the controls the firm must use to respond to the conflict. \n We expect that clients will use disclosure about conflicts of interest to help inform their decision when selecting a registrant and/or evaluating the registrant's business practices, conflicts management and overall performance on an ongoing basis. As a result, the disclosure that clients (and prospective clients) receive is critical to their ability to make an informed decision about whether to engage a registrant and, having engaged the registrant, how to manage and evaluate that relationship. The following sets out certain of our expectations when firms provide disclosure to clients regarding conflicts of interest: \n • for new clients, disclosure should be made prior to opening an account for the client; \n • for existing clients, appropriate disclosure should be provided either as the conflict of interest occurs or, in the case of a transaction-related conflict of interest, prior to entering into the transaction with the client, such that clients are provided a reasonable amount of time to assess the conflict; \n • it is the firm's responsibility to disclose material conflicts of interest in a manner that is prominent, specific, clear and meaningful to the client so that clients may properly understand them; \n • firms and representatives should have a reasonable basis for believing that clients fully understand the implications and consequences of the conflict between the firm or representative and the client. This may include: \n • the relative merits and risks of options considered, but not chosen by the representative or the client; \n • any additional fees earned by the firm or representative, whether or not paid out of client funds; \n • any additional expenses incurred which are paid by the client; \n • the potential impact of these fees and expenses on the client, including, for example, the impact on investment returns over time; \n • the firm must obtain from the client informed and specific consent before the transaction is entered into or the course of action is undertaken; \n • after receiving client consent, the firm and representative must also be able to demonstrate that the transaction or the course of action undertaken prioritizes the interests of the client ahead of the interests of the firm and representative and complies with the registrant's other duties to the client; and \n • the disclosure should include all outside business activities of the firm and applicable representatives. \n In the case of institutional clients, unless the interests of the registrant are materially opposed to the interests of the institutional client based on the information the firm and representative have about the institutional client, disclosure alone may be sufficient. However, even with institutional clients, certain situations may arise where there can be no other reasonable response than avoidance. \n - - - - - - - - - - - - - - - - - - - - \n Questions \n 44) Is it appropriate that disclosure by firms be the primary tool to respond to a conflict of interest between such firms and their institutional clients? \n 45) Are there other specific situations that should be identified where disclosure could be used as the primary tool by firms in responding to certain conflicts of interests? \n - - - - - - - - - - - - - - - - - - - - \n For purposes of this Companion Policy, \" institutional client \" means: \n (a) a Canadian financial institution or a Schedule III bank; \n (b) a registered firm acting as principal; \n (c) any of the following if they have waived the suitability requirement pursuant to subsection 13.3(4) of NI 31-103 (or equivalent under Canadian self-regulatory organization rules): \n (i) the Business Development Bank of Canada incorporated under the  Business Development Bank of Canada Act  (Canada); \n (ii) a subsidiary of any person or company referred to in paragraph (a) or (c)(i), if the person or company owns all of the voting securities of the subsidiary, except for the voting securities required by law to be owned by directors of the subsidiary; \n (iii) a pension fund that is regulated by either the federal Office of the Superintendent of Financial Institutions or a pension commission or similar regulatory authority of a jurisdiction of Canada or a wholly-owned subsidiary of such a pension fund, if the net assets of the pension fund exceed $100 million; \n (iv) an entity organized in a foreign jurisdiction that is analogous to any of the entities referred to in paragraphs (a) to (c)(iii); \n (v) the Government of Canada or a jurisdiction of Canada, or any Crown corporation, agency or wholly-owned entity of the Government of Canada or a jurisdiction of Canada; \n (vi) any national, federal, state, provincial, territorial or municipal government of or in any foreign jurisdiction, or any agency of that government; \n (vii) a municipality, public board or commission in Canada and a metropolitan community, school board, the Comité de gestion de la taxe scolaire de l'île de Montréal or an intermunicipal management board in Québec, if the net assets of such entity exceed $100 million; \n (viii) a trust company or trust corporation registered or authorized to carry on business under the  Trust and Loan Companies Act  (Canada) or under comparable legislation in a jurisdiction of Canada or a foreign jurisdiction, acting on behalf of a managed account managed by the trust company or trust corporation, as the case may be; \n (ix) a person or company acting on behalf of a managed account managed by the person or company, if the person or company is registered or authorized to carry on business as an adviser or the equivalent under the securities legislation of a jurisdiction of Canada or a foreign jurisdiction; \n (x) an investment fund if one or both of the following apply: \n (i) the fund is managed by a person or company registered as an investment fund manager under the securities legislation of a jurisdiction of Canada, \n (ii) the fund is advised by a person or company authorized to act as an adviser under the securities legislation of a jurisdiction of Canada; \n (iii) any other person or company, other than an individual, with financial assets, as defined in section 1.1 of National Instrument 45-106  Prospectus Exemptions , having an aggregate realizable value that, before taxes but net of any related liabilities, exceeds $100 million; \n - - - - - - - - - - - - - - - - - - - - \n Questions \n 46) Is this definition of \"institutional client\" appropriate for its proposed use in the Companion Policy? For example: (i) where financial thresholds are referenced, is $100 million an appropriate threshold?; (ii) is the differential treatment of institutional clients articulated in the Companion Policy appropriate?; and (iii) does the introduction of the \"institutional client\" concept, and associated differential treatment, create excessive complexity in the application and enforcement of the conflicts provisions under securities legislation? If not, please explain and, if applicable, provide alternative formulations. \n 47) Could institutional clients be defined as, or be replaced by, the concept of non-individual permitted clients? \n - - - - - - - - - - - - - - - - - - - - \n Guidance on specific conflict of interest situations \n Compensation \n The requirements set out in section 13.4 of NI 31-103 and registrants' other duties to clients do not automatically prohibit registrants from accepting remuneration from a source other than the client, including a trailing commission from a product manufacturer or a new issue commission in respect of the client's investments. Firms must assess whether any remuneration could reasonably be expected to inappropriately influence how representatives deal with their clients. Firms should ensure there are adequate controls and oversight in place to mitigate this conflict. If the conflict cannot be managed, it must be avoided. For greater certainty, if a firm or representative gives priority to maximizing or receiving the non-client source of remuneration over the interests of the client, the firm or representative will be in breach of section 13.4 of NI 31-103 and their general duties to their client. \n The framework and practices that firms use to compensate their representatives, including direct tools such as commissions, performance reviews and sales targets, as well as indirect tools such as promotions and valuation of representatives' books of business for various purposes (for example, retirement and awards) ( incentive practices ), may create significant conflicts of interest between firms or representatives and their clients. The following are approaches to incentives for representatives that may support a firm's position that it has sufficiently managed the potential or actual conflicts of interest that may arise from its incentive practices. The firm should: \n • properly consider if its incentive practices increase the risk of making recommendations, or accepting client orders, that are unsuitable for the client and, if so, how; \n • review whether its governance and controls are adequate to control the conflicts of interest resulting from incentive practices and if governance and controls are not adequate, modify them to ensure adequate controls or modify incentive practices in order to mitigate the conflict of interest; \n • maintain appropriate information and economic barriers (also known as ethical walls) between the dealing and advising activities of the firm and: \n • affiliated, related or connected securities issuers; and \n • other divisions within the firm, such as a proprietary trading division and the underwriting division; \n • where a compensation grid is used, ensure that the compensation does not create incentives for the firm or representative to prioritize the interests of the firm or representative ahead of the interests of the client, and, if it does, modify the compensation grid; \n • if its incentive practices are complex, consider its ability to clearly explain to the regulator the reason for such complexity and its intended outcomes; \n • incorporate incentive practices that allow some compensation for representatives even if they advise a client to \"do nothing\" if such recommendation is suitable. This may involve, for example, ensuring that clients are in fee-based accounts if the firm offers them and such accounts are, in fact, more suitable for the client than other types of accounts offered by the firm; \n • where it offers fee-based accounts, have an internal compliance program that tests that clients are receiving the services they are entitled to under the terms of the account or client agreement with the firm; \n • include specialized measures into its supervisory programs to assess whether a representative's recommendations may be influenced by thresholds in the firm's incentive structure. Specialized surveillance should be considered the more the representatives approach thresholds that, for example: \n • move the representative to a higher payout percentage in the firm's compensation grid; \n • qualify a representative to receive a back-end bonus; \n • result in a retroactive increase on the commissions earned for transactions that occurred earlier in the year if a specific target is reached; or \n • qualify a representative to participate in a recognition club, such as a \"President's Club\"-type recognition; \n • heighten the monitoring of the suitability of representatives' recommendations on the basis of key liquidity events in an investor's lifecycle, such as commuted pension, selling a home for retirement, and inheritance, where the impact on clients of those recommendations may be particularly significant; \n • maintain controls to mitigate the risk that the firm and its representatives generate more remuneration for themselves or one of their related parties by increasing the volume of transactions in the client's account. The firm should be on alert for this type of behaviour and closely monitor its representatives in order to detect detrimental practices; and \n • provide for supervisory or branch management staff compensation that either is not subject to the same conflicts of interest as the representatives, or, failing that, in a manner that incorporates effective controls over potential conflicts of interest, including a mechanism that reduces compensation as a result of compliance issues, such as justified client complaints, internal findings of non-compliant practices, and regulatory or disciplinary action. \n Sales practices \n Currently, National Instrument 81-105  Mutual Fund Sales Practices  ( NI 81-105 ) regulates the sales practices of industry participants in connection with the distribution of securities of publicly offered mutual funds. The intention of NI 81-105 was to reduce conflicts between the interests of investors and those of dealers, their representatives and investment fund managers. NI 81-105 establishes a minimum standard of conduct to ensure that any compensation or benefits provided to participating dealers and their respective representatives are not in any way excessive so as to improperly influence the selection of mutual funds for distribution by a representative to his or her clients. \n We are aware that there are sales practices and compensation arrangements that registrants engage in that are outside the scope of those specifically addressed in NI 81-105 that may give rise to the same types of conflicts of interest and could impact a registrant's ability to comply with their obligations to their clients. \n We expect that registrants consider how sales practices that may arise in the distribution of any type of product may impact their ability to meet their client-facing registrant obligations, such as requirements on conflicts of interest, suitability and KYP. \n By sales practices, we are referring to activities involved in the distribution of securities, including: \n • the payment of money to a registrant in connection with distributing securities of an issuer; \n • providing non-monetary benefit to a registrant in connection with distributing securities of an issuer; and \n • paying for or making reimbursement of costs or expenses incurred by a registrant distributing securities of an issuer. \n - - - - - - - - - - - - - - - - - - - - \n Questions \n 48) Are there other specific examples of sales practices that should be included in the list of sales practices above? \n 49) Are specific prohibitions and limitations on sales practices, such as those found in NI 81-105, appropriate for products outside of the mutual fund context? Is guidance in this area sufficient? \n 50) Are limitations on the use of sales practices more relevant to the distribution of certain types of products, such as pooled investment vehicles, or should they be considered more generally for all types of products? \n - - - - - - - - - - - - - - - - - - - - \n Sales practices, for all types of securities, may create incentives that give rise to material conflicts of interest between the firm, its representatives and the client. The following are examples of sales practices giving rise to conflicts of interest: \n • a firm, directly or indirectly, creates incentives for its representatives to recommend proprietary products over third-party products; \n • compensation arrangements at dealer firms create incentives for dealing representatives to recommend one product over another; \n • issuers or their affiliates sponsor conferences or other educational activities that may influence the products that a dealing representative ultimately recommends to its client; \n • registrants receive non-monetary benefits from an issuer, such as gifts or entertainment for representatives of a firm, in connection with the representative distributing securities of the issuer; and \n • registrants are paid for or reimbursed for costs or expenses they incur in connection with distributing securities of an issuer. \n Registrants should consider their obligation to identify and respond to material conflicts of interest in a manner that prioritizes the interest of the client ahead of the interest of the registrant when deciding which sales practices they will engage in. For example, when considering what type of promotional activities to participate in or gifts to accept, registered firms and their representatives should assess whether such activity could create incentives that may influence recommendations that the firm's representatives would make for its clients. This influence may result in firm representatives making recommendations to their clients that prioritize their interest in receiving the incentive ahead of the client's interest in receiving unbiased advice. \n - - - - - - - - - - - - - - - - - - - - \n Questions \n 51) Are there other requirements that should be imposed to limit sales practices currently used to incentivize representatives to sell certain products? \n 52) What type of disclosure should be required for sales practices involving the distribution of securities that are not those of a publicly offered mutual fund, which are already subject to specific disclosure requirements? \n 53) Should further guidance be provided regarding specific sales practices and how they should be evaluated in light of a registrant's general duties to his/her/its clients? If so, please provide detailed examples. \n - - - - - - - - - - - - - - - - - - - - \n Referrals \n We expect that, when providing a referral to their client or potential client for a financial product or service, such as products or services relating to insurance, banking and financial planning, firms and representatives will meet their general duties to their clients, the requirements under Division 3 of Part 13 of NI 31-103, and any other applicable obligations under securities legislation. \n For example, if a client is invested in securities and the representative refers the client to another service provider with a view to selling the securities currently held by the client, such referral should be handled in a manner that ensures the sale of securities is suitable for the client. Similarly, if a representative, who may also be regulated by other regulatory regimes such as insurance or banking, directs a client to invest in a financial product other than a security, for example a segregated fund, and the client could reasonably assume that securities products were being considered by the representative, the representative must be able to demonstrate that he/she has managed the conflict that arises because of his/her dual licensing. \n Appendix B \n Description of Potential Guidance -- Know Your Client \n Section 13.2 of NI 31-103, among other things, requires firms and representatives to take reasonable steps to ensure that they have sufficient information regarding their client's investment needs and objectives, financial circumstances and risk profile, to meet their suitability obligation. \n The KYC obligation is a fundamental obligation owed by firms and representatives to their clients and is one of the cornerstones of our investor protection regime. The KYC obligation is an extension of each firm's and representative's duties toward their clients. \n Firms and representatives act as gatekeepers of the integrity of the capital markets. As part of this gatekeeper role, they are required to establish the identity of, and conduct due diligence on, their clients under the KYC obligation. KYC information forms the basis for determining whether trades in securities are suitable for investors and, more broadly, help the firm and representative understand what the investment needs and objectives of the client are. This helps protect the client, the registrant and the integrity of the capital markets. \n Many clients may need assistance in articulating what their investment needs and objectives are. Clients may also provide instructions that are unclear or seem inconsistent with their KYC information. In these situations, the firm and representative may need to make further inquiries of the client. We expect particular care to be exercised by firms and representatives concerning more vulnerable and less sophisticated investors. \n Our expectation is that the KYC process results in a thorough understanding of the client on an individual basis, rather than merely an attempt to stream clients into product categories offered by the firm. Firms and representatives should take the opportunity with the initial KYC review to explain to their clients their role in keeping KYC information current with the firm and representative. We also expect that the KYC process is an ongoing one which does not end after the initial KYC analysis is complete and that requires action and engagement by firms, representatives and their clients. \n To meet their KYC obligation, firms and representatives must take reasonable steps to obtain sufficient information about their clients': \n • investment needs and objectives, including the client's time horizon for their investments and applicable investment constraints and preferences, for example socially responsible investing and religious constraints; \n • financial circumstances, including the amount and nature of all assets and liabilities, including the basic features of the client's indebtedness (such as the applicable interest rate on a loan). Information relating to the client's financial circumstances also includes net worth, income, current investment holdings, employment status, liquidity needs, spousal and dependents status, and basic tax position (we acknowledge that firms and representatives are not engaged in tax planning services unless they undertake this service explicitly); and \n - - - - - - - - - - - - - - - - - - - - \n Question \n 54) To what extent should the KYC obligation require registrants to collect tax information about the client? For example, what role should basic tax strategies have in respect of the suitability analysis conducted by registrants in respect of their clients? \n - - - - - - - - - - - - - - - - - - - - \n • risk profile for various types of securities and investment portfolios, taking into account the client's investment knowledge, experience and vulnerability. \n The following sets out various practices that firms and representatives should use to evidence that they are complying with their general duties to their clients in the execution of these obligations: \n • the KYC form, both at initial account opening and upon material changes, must be comprehensive, state all of the information gathered as part of the KYC process, and be dated and signed by both the client and the representative. A copy must be provided to the client; \n • the KYC form should include plain language explanations of what each entry relates to and what each term means, including financial objectives, risk profile (and related terms), types of assets and liabilities; \n • if it is reasonably apparent that information relating to the client's relevant circumstances is incomplete or inaccurate, the representative should make reasonable inquiries of the client to obtain complete and accurate information; \n • a procedure whereby the firm or representative makes reasonable attempts to contact the client in order to refresh the client's KYC information at least once every 12 months since without adequate and timely KYC information, registrants cannot meet their suitability obligation to clients; \n • a procedure to address situations where a client does not provide some or all of the required KYC information; \n - - - - - - - - - - - - - - - - - - - - \n Question \n 55) To what extent should a representative be allowed to open a new client account or move forward with a securities transaction if he or she is missing some or all of the client's KYC information? Should there be certain minimum elements of the KYC information that must be provided by the client without which a representative cannot open an account or process a securities transaction? \n - - - - - - - - - - - - - - - - - - - - \n • the firm's and representative's approach in ascertaining their clients' relationship toward investment risk (the client's \"risk profile\") should include a thorough exploration of the relevant subjective and objective factors, preferably through the use of charts, graphs and examples. In addition, we would expect that any explanation of risk should include an explicit explanation of potential financial losses, not just different levels of volatility, and risk-adjusted returns. \n Firms should ensure that, in particular: \n • they have a thorough process for assessing the level of risk a client is willing and able to take, including: \n • assessing a client's capacity for loss; \n • identifying clients that are suited to placing their money in cash deposits or guaranteed products because they are unwilling or unable to accept the risk of loss of capital; \n • appropriately interpreting client responses to questions and not attributing inappropriate weight to certain answers; \n • tools (including questionnaires), where used, are well designed to arrive at a meaningful risk profile for the client that the firm and representative can use when making recommendations to the client as part of the suitability process, and any limitations recognised and mitigated; \n • any questions and answers that are used to establish the level of risk a client is willing and able to take, and descriptions used to check this, are fair, clear and not misleading; \n • they have a thorough and flexible process for ensuring investment selections are suitable given a client's investment objectives and financial situation (including the level of risk they are willing and able to take) as well as their investment knowledge and experience; \n • representatives understand the nature and risks of products or assets selected for clients; and \n • representatives avoid assisting clients respond to questions that relate to the personal preferences of the client relating to risk (i.e., the subjective factors) in order to avoid influencing the client's personal preferences in this aspect of the analysis. \n Firms and representatives should use professional judgment to combine all of these various factors to determine a client's risk profile. Arriving at this overall determination is the primary objective of the risk profiling exercise and firms should ensure their process is supportable and reliable; \n - - - - - - - - - - - - - - - - - - - - \n Question \n 56) Should additional guidance be provided in respect of risk profiles? \n - - - - - - - - - - - - - - - - - - - - \n • the firm's and representative's approach in ascertaining their clients' financial objectives should include an opportunity for clients to express their financial objectives in their own terms. Clients' financial objectives, especially for retail clients, are often goal-oriented and outcomes-based objectives, such as saving for retirement to maintain a certain lifestyle, increasing wealth by a certain percentage in a specific number of years, investing for purchasing a home, or investing for post-secondary education of the investor's children. We expect registrants to have a meaningful understanding of what their client's actual investment needs and objectives are, and it is not sufficient to simply ask the client if their investment needs and objectives fall into one of a short list of pre-determined product-focused options, such as \"growth\", \"income\" or \"balanced\", or limiting the KYC process to a mechanical attribution of clients into such limited options; \n • the representative's approach in respect of the KYC process should not include attempting to influence a client in a manner that prioritizes the interests of the registrant ahead of the interests of the client. For example, if the representative encourages the client to increase his or her stated capacity for risk in order to achieve the required rate of return so that the client meets his or her stated investment needs and objectives, this would not comply with the KYC and suitability obligations or the general duties owed to clients. We would expect the representative to advise the client that, for example, more saving will be needed to meet his or her stated objectives or the client should lower his or her expectation in respect of the original financial objective; \n • the firm's and representative's approach in respect of the KYC process should not be limited to a narrow review of the client's liquid and financial assets. This would likely not comply with the KYC obligation or the general duties owed to clients. Rather, the representative should understand the type and basic terms of the client's financial liabilities; and \n • firms and representatives should not simply assume that their client will understand the KYC form and related discussions or interactions. The obligation is on the firm and representative to confirm that the client has a reasonable understanding of the KYC form, including its completed content, and the outcome of the KYC process. \n - - - - - - - - - - - - - - - - - - - - \n Question \n 57) Are there circumstances where it may be appropriate for a representative to collect less detailed KYC information? If so, should there be additional guidance about whether more or less detailed KYC information may need to be collected, depending on the context? \n - - - - - - - - - - - - - - - - - - - - \n Appendix C \n Description of Potential Guidance -- Know Your Product -- Representative \n The KYP obligation is a fundamental obligation owed by firms and representatives to their clients and is one of the cornerstones of our investor protection regime. The KYP obligation is an extension of each firm's and representative's general duties to its clients. \n Registrants must meet the KYP obligation, together with the KYC obligation, in order to make a suitability determination. To meet the KYP obligation, registrants should have an in-depth knowledge of all securities that they buy and sell for, or recommend to, their clients. The KYP obligation requires not only knowledge of the particular attributes of a security, viewed in isolation, but also an understanding of the impact of the proposed amount of the investment, the proposed investment strategy involving the security, and the role of the security in the client's broader portfolio. \n In order to comply with their KYP obligation, representatives must: \n • understand the specific structure, features, product strategy, costs and risks of each product their firm trades or advises on, including an understanding of how the products compare to each other; \n • understand the specific structure, features, product strategy, costs and risks of each product that they recommend or that their client purchases or sells; and \n • understand the impact of all fees, costs and charges connected to the product, the client's account and the investment strategy. \n In most cases, each product a representative recommends, or that their client purchases or sells, will be from their firm's approved product list. \n If a representative recommends or considers a product that is not on his/her firm's approved product list, he/she must conduct a product review and have the appropriate authorizations and approvals from his/her firm to do so before recommending that the client buy or sell the security. \n Appendix D \n Description of Potential Guidance -- Know Your Product -- Firm \n Firms must ensure that their representatives have the ability, through policies and procedures, training tools, guides or other methods, to comply with their KYP obligation. This obligation requires an understanding of the impact of the role of any given security in the client's broader portfolio. The firms' product list is in almost all cases determinative for the representatives' recommendations to clients. At the onset, this would also include identifying whether the firm has a proprietary or mixed/non-proprietary product list. \n A \"proprietary product list\" is a product list that only includes proprietary products. \n A \"mixed/non-proprietary product list\" is a product list that includes both proprietary and non-proprietary products, or only non-proprietary products, that the firm is registered to advise on or trade in, which a firm has selected in accordance with policies and procedures that require a fair and unbiased market investigation, a product comparison and an optimization process based on the investment needs and objectives of its clients. \n - - - - - - - - - - - - - - - - - - - - \n Questions \n 58) Should we explicitly allow firms that do not have a product list to create a product review procedure instead of a shelf or would it be preferable to require such firms to create a product list? \n 59) Would additional guidance with respect to conducting a \"fair and unbiased market investigation\" be helpful or appreciated? If so, please provide any substantive suggestions you have in this regard. \n 60) Would labels other than \"proprietary product list\" and \"mixed/non-proprietary product list\" be more effective? If so, please provide suggestions. \n - - - - - - - - - - - - - - - - - - - - \n The product list identification does not apply to firms in their dealings with institutional clients, but we expect representatives to have sufficient proficiency to understand the structure, product strategy, features and risks of each security before they make a recommendation to, or accept an instruction from, an institutional client. \n Mixed/Non-Proprietary Product Lists \n If a firm intends to offer a mixed/non-proprietary product list, such a list must be developed in accordance with policies and procedures that require a fair and unbiased market investigation, a product comparison and an optimization process based on the investment needs and objectives of its clients. The following sets out one possible approach to satisfying this requirement: \n • At least once every 12 months, the firm identifies the client profile(s) of its client base by drawing on available KYC information about its clients, or, in cases where KYC information is not collected by firms where clients have waived the suitability requirement in accordance with subsection 13.3(4) of NI 31-103, the terms of engagement of the firm by such client and any other relevant information collected as part of such client relationship. \n • New firms that intend on securing clients that fall within a particular client profile or firms seeking to expand their client profile should establish target client profiles for their new clients and ensure that such clients fall within the parameters of such target client profiles. \n • For dealers offering execution order services only, this should be based on information that the firm has about its client base, acknowledging that it does not have information about the client's investment needs and objectives as they do not collect this information about clients. \n • The firm must undertake a fair and unbiased investigation of the market of products that the firm is registered to advise or trade in order to satisfy itself it has a range of products that will most likely meet the investment needs and objectives of its clients based on its client profiles. This investigation should take into account factors including structure, product strategy, features, risks, cost, liquidity, performance, and whether the product manufacturer or issuer is related or connected to the registrant ( market investigation ). \n • Although a market investigation need not take into account the entire universe of products that the firm is registered to advise on and/or trade in, the firm should identify those products on the market that it concludes, using its professional judgment, that are most likely to meet the investment needs and objectives of its clients given the firm's client profiles. For example, if the firm is registered as a mutual fund dealer and identifies itself as a firm that offers a mixed/non-proprietary product list, it should create this list by objectively evaluating a broad range of mutual funds, for example funds with active and passive investment strategies, funds with higher and lower costs, and proprietary and non-proprietary funds. \n • To demonstrate that they have conducted a meaningful market investigation, firms may consider using research reports produced by external research report providers to identify products that may meet the investment needs and objectives of the firm's client profiles. Firms should consider conducting initial and ongoing due diligence on the research report providers they intend to rely on. \n • The firm should then evaluate its current product list to determine whether it offers a range and diversity of products that are representative of the range and diversity of products canvassed in the market investigation. The firm should evaluate whether its product list includes a range of products most likely to meet the investment needs and objectives of its clients based on its client profiles (the  product comparison ). \n • One way a firm can conduct a Product Comparison is by benchmarking, at appropriate intervals (e.g., once every 12 months), its shelf of products against the products identified in the market investigation to establish their competitiveness against key criteria, such as the history of risk-adjusted outperformance or underperformance over an appropriate period; features; fees, costs and other charges related to the product or being invested in the product; and risk factors that apply to the security or investment strategy ( benchmarking criteria ). \n • If the firm's current product list does not include those products most likely to meet the investment needs and objectives of its clients based on its client profile as identified in the product comparison, it should include those products on its product list, if it is able to do so ( product list optimization ). \n - - - - - - - - - - - - - - - - - - - - \n Question \n 61) Is the expectation that firms complete a market investigation, product comparison or product list optimization in a manner that is \"most likely to meet the investment needs and objectives of its clients based on its client profiles\" reasonable? If not, please explain your concern. \n - - - - - - - - - - - - - - - - - - - - \n In order to evidence the firm's compliance with these requirements, we expect that the firm prepare a written report that describes: \n • its internal processes for the market investigation, product comparison and product list optimization, and \n • how such processes result in the firm selecting a product list that meets the definition of a mixed/non-proprietary product list ( product list compliance report ). The initial product list compliance report, and any material amendments made to it, should be approved by the firm's UDP and board of directors (or equivalent) before finalization and implementation. \n We also remind firms that in the event of a conflict of interest between the firm and its clients resulting from its product list analysis, the firm must prioritize the interests of its clients ahead of the interests of the firm (or its representatives). \n For greater certainty, the mere existence of other products which could be \"better\" or more suitable for its clients than the products on the firm's shelf would not be considered to be a failure to comply with KYP requirement related to its mixed/non-proprietary product list, if the firm's product list development process is reasonable, unbiased and based on sound, professional judgment. \n Proprietary Product Lists \n A firm that has identified itself as having a proprietary product list must still compare all of the products on its list against key criteria to establish their relative competitiveness to each other for purposes of assisting its representatives in conducting suitability analysis for their clients. Such key criteria should include, at a minimum, the benchmarking criteria. For a firm that only offers one product on its proprietary product list (e.g., an exempt market dealer that only distributes units of one pooled fund), there is no comparison required of such product. \n If a firm's product list meets the definition of a proprietary product list, it should not hold itself out otherwise, either explicitly or implicitly. \n General expectations for product lists \n In the case of firms that include proprietary products on their product list, the due diligence processes involved in the selection of the products, and in the case of firms that have a mixed/non-proprietary product list, the evaluation of the products on the product list, in the case of all firms, should be conducted with appropriate information and economic barriers between the firm and the issuers of such proprietary products. An appropriate due diligence process is conducted in an objective manner that prioritizes the interests of the clients ahead of the interests of the registrant or the affiliated, related or connected securities issuers. \n Firms should allow enough flexibility for representatives to consider other securities products that are not on the firm's product list, under specific circumstances. For example, when a new client's current portfolio of securities products are not on the firm's product list or the client requests the representative to consider a specific securities product not on the list, our expectation is that that the representative would be required to conduct a product review before making a recommendation about the security or advising the client on its relative merits. If a representative of a firm with a proprietary product list considers a non-proprietary securities product as a result of one or more of the reasons above, this does not mean that the firm is expected to meet the shelf development process expected of firms with a mixed/non-proprietary product list. \n We expect that larger firms, especially those with a mixed/non-proprietary product list, would need to establish a product review committee to undertake the due diligence required in product list development and product evaluation. It may be impractical for smaller firms to establish a product review committee but, in such cases, they must establish a governance structure that allows them to perform the due diligence process set out above. \n For purposes of this Companion Policy: \n • \" connected issuer \" has the meaning set out in NI 33-105; \n • \" managed account pooled fund \" means, in respect of a firm providing discretionary advice to managed account clients, a proprietary investment fund managed by the firm that allows the firm to provide model portfolio or related advisory services to its clients if all of the following apply: \n (a) the portfolio securities of the pooled fund are selected using the process set out for a mixed/non-proprietary product list; \n (b) the firm qualifies, or could qualify, for the exemption set out in section 8.6 of NI 31-103; and \n (c) there are no fees, charges or commissions payable by the client with respect to the pooled fund; \n • \" NI 33-105 \" means National Instrument 33-105  Underwriting Conflicts ; \n • \" proprietary product \" of a firm means a security that is issued by the firm or an issuer that is affiliated to, or that is a connected issuer or related issuer of, the firm, or the representative of the firm, but excludes managed account pooled funds; and \n • \" related issuer \" has the meaning set out in NI 33-105. \n Appendix E \n Description of Potential Guidance -- Suitability \n Section 13.3 of NI 31-103 requires firms and representatives to ensure that, before they make a recommendation to, or accept an instruction from, their clients to buy or sell a security, or make a purchase or sale of a security for their clients' managed account, the purchase or sale is suitable for the clients. \n The suitability obligation is a fundamental obligation owed by firms and representatives to their clients and is one of the cornerstones of our investor protection regime. The suitability obligation is an extension of firms' and representatives' duties to their clients. \n Components of the suitability obligation \n In order for firms and representatives to comply with the suitability obligation, they must ensure that the securities transaction or investment strategy recommended to, or instructed by the client, satisfies the following three components of suitability: \n • basic financial suitability; \n • investment strategy suitability; and \n • product selection suitability. \n Basic Financial Suitability \n Prior to making a recommendation or accepting an order, the first step of the suitability process should be to conduct an investigation into the basic financial strategies that clients could use to meet their investment needs and objectives, given their financial circumstances and risk profile. This should include basic strategies beyond transacting in securities, such as paying down high interest debt or directing cash into a savings account. \n If the representative determines that non-securities product strategies are more aligned with the client's investment needs and objectives, given the client's financial circumstances and risk profile, and therefore better for the client, they should inform their client accordingly. \n A representative may in certain circumstances advise that another financial product, such as an insurance or banking product, is the preferred product or strategy, or may refer the client to one of these providers, which results in the client purchasing such products. If the client has a reasonable basis to believe that the representative was also considering securities products or strategies in providing this advice, the representative must be able to substantiate why the recommendation not to buy a securities product is suitable for the client. \n Investment Strategy Suitability \n If, after having performed a basic financial suitability review, the registrant determines that transacting in securities is most likely to meet the investment needs and objectives of the client, the registrant must: \n • formulate a basic asset allocation strategy that is suitable or confirm that the client's existing asset allocation strategy is suitable. This will again require specific consideration of the client's KYC information. We would expect that the representative would analyze whether the client's portfolio will generate an expected risk-adjusted rate of return sufficient to meet the client's investment needs and objectives, taking into account the client's financial circumstances and risk profile. Formulating or confirming an asset allocation strategy for the client will allow firms and representatives who are restricted in the kinds of products that they can offer, for example mutual fund dealers, exempt market dealers, scholarship plan dealers, and restricted dealers, to satisfy themselves that their products would be suitable for the client and that a particular investment would not exceed reasonable concentration limits for that asset class and for any one security in that asset class; \n • identify a target rate of return clients will need in order to achieve their investment needs and objectives, assessing the target rate against the clients' risk profile and resolving any mismatches. If the risk required to achieve the investment needs and objectives is higher than the client's risk capacity, the registrant must review the investment needs and objectives together with the client; and \n • assess whether any other investment strategy that the client requests, or that the representative recommends, is a suitable investment strategy for the client. The term \"investment strategy\" is to be interpreted broadly. For example, investment strategies would include a recommendation, or a client request, to purchase securities using borrowed money or to engage in day trading. These recommendations would fall within the term \"investment strategy\" irrespective of whether or not they result in a securities transaction or involve specific securities. \n Representatives must consider costs when assessing suitability. If a firm offers more than one type of account, it should ensure, in evaluating the suitability of an investment strategy, that clients are in the most suitable account type for them. \n Product Selection Suitability \n If the client order, or representative recommendation, also involves a specific security, the representative must ensure that the security is (i) suitable, and (ii) most likely to meet the client's investment needs and objectives, given their financial circumstances and risk profile, based on a review of: \n • the securities on the firm's approved product list, \n • other securities not on the firm's product list that are already in the client's portfolio at the firm, and \n • other securities that the client inquires about. \n Registrants must consider the impact of any compensation paid to the registrants by the client or a third party in relation to the product in assessing whether the product is suitable for the client. \n - - - - - - - - - - - - - - - - - - - - \n Question \n 62) What, if any, unintended consequences could result from setting an expectation in the context of the suitability obligation that registrants must identify products both that are suitable and that are the most likely to achieve the investment needs and objectives of the client? If unintended consequences exist, do the benefits of this proposal outweigh such consequences? \n - - - - - - - - - - - - - - - - - - - - \n General Suitability Guidance \n The obligation to ensure a recommendation is of a product that is most likely to achieve the investment needs and objectives of a client does not necessarily mean that there is only one best strategy or product, as applicable, for the client. There could be several strategies or products that are equally suitable and that are equally effective in meeting the investment needs and objectives of the client. \n In cases where a product is recommended, and the product benefits the firm or representative but not the client, such recommendation would not comply with the suitability obligation and the registrant's general duties to his/her clients. Switching clients between series of the same investment fund because this results in higher compensation for the firm or representative, with no benefit to the client would not comply with this requirement either. Similarly, if a product is recommended because it benefits the firm or representative, but there is another equally suitable product on the firm's product list that would be less costly for the client, such recommendation would not comply with the suitability obligation or the registrant's general duties to his/her/its clients. \n In most cases, it will be insufficient to conduct a suitability analysis by simply checking that the risk rating of the securities product is consistent with the client's risk profile. We expect firms and representatives to take an account portfolio approach to suitability and that the risk rating of any specific security is only one input in the analysis of the representative in the overall risk of the portfolio held at the firm. \n When determining compliance with the suitability requirement, only the information relevant at the time of the suitability analysis will be taken into account by the regulator. Subsequent events or poor performance will not inform whether the suitability analysis at a given time met the statutory requirements. However, subsequent events or poor performance may require a new suitability review: see \"Frequency\" below. \n In order to evidence compliance with the suitability requirement, registrants must be able to produce evidence that they had a reasonable basis for concluding that the suitability analysis was conducted in a manner that complies with the registrants' other duties toward their clients, including their conflict of interest obligations. The scope and nature of the client engagement and a client's investment needs and objectives, financial circumstances and risk profile will be central to the breadth of analysis required. The documentation should record all relevant facts, including key assumptions, the scope of data considered, and the analysis performed. \n All firms and representatives, including exempt market dealers and scholarship plan dealers and their representatives, should consider the suitability of the proposed investment in the context of the client's entire financial circumstances as determined through the KYC process. In general, firms and representatives cannot exclude such client information in their suitability analysis and be in compliance with their duties to their clients. \n Frequency \n In order to comply with their suitability obligation, firms and representatives must perform a suitability analysis of the client's portfolio in the account when: \n • accepting an order from the client to buy, sell, hold or exchange securities or using (or ceasing to use) an investment strategy involving a security; \n • recommending that the client buy, sell, hold or exchange securities or using (or ceasing to use) an investment strategy involving a security; and \n • any of the following events occur while the client retains an account with the firm: \n • securities are received into the client account by deposit or transfer; \n • there is a change in representative or firm for the account; \n • there are material changes in the client's KYC information that the registrant knew or reasonably should have known; \n • a significant market event affecting capital markets to which the client is exposed; \n • a material change in the risk profile of an issuer, the securities of which are held in the client's account, whether determined by external credit ratings or other internal or external risk assessment mechanisms; \n • in any case, at least once every 12 months, or more frequently if the investment strategy proposed by the representative requires more frequent monitoring. \n - - - - - - - - - - - - - - - - - - - - \n Questions \n 63) Should we provide further guidance on the suitability requirement in connection with ongoing decisions to hold a position? \n 64) Should we provide further guidance on the frequency of the suitability analysis in connection with those registrant business models that may be based on one-time transactions? For example, when should a person or entity in such a relationship no longer be a client of the registrant for purposes of this ongoing obligation to conduct suitability reviews of the client's account? \n - - - - - - - - - - - - - - - - - - - - \n Appendix F \n Description of Potential Guidance -- Relationship Disclosure \n Section 14.2 of NI 31-103 requires firms to deliver to their clients all information that a reasonable investor would consider important about the client's relationship with the firm (including the client's relationship with the firm's representatives). Firms must comply with this requirement in a manner that is consistent with the firms' general duties to their clients. \n General Nature of Relationship \n Firms must provide a description of the actual nature of the client-registrant relationship in easy-to-understand terms. \n Firms must provide a description of the conflicts of interest that the firm is required to disclose to a client under securities legislation pursuant to paragraph 14.2(2)(e) of NI 31-103. This description should include, but not be limited to, and to the extent applicable, clear disclosure that the firm: \n • has been retained by third party issuers to find buyers for their securities; \n • acts as the sole distributor for the issuers; \n • offers securities that are generally illiquid and explains the various risk factors related to such illiquidity, for example lack or shallowness of a resale market or less market-driven valuation of the security. \n Firms must (where applicable) include disclosure that they have an obligation to assess whether a purchase or sale of a security is suitable for a client prior to executing the transaction or at any other time pursuant to paragraph 14.2(2)(k) of NI 31-103. This disclosure should include: \n • a description of the approach used by the firm to assess the client's KYC information and a statement that the client will be provided with a copy of the KYC information that is obtained from the client and documented at time of account opening and when there are material changes to the information; and \n • a statement indicating that the firm will assess the suitability of investments in the client's account upon the occurrence of the applicable triggering events (both regulatory and contractual, if any), with such triggering events to be identified. \n Proprietary Product List Disclosure \n Firms must disclose whether they offer proprietary products only or a mixed/non-proprietary list of products. Firms that offer a mixed/non-proprietary list of products should disclose the proportion of proprietary products they offer. Where the product list of the firm meets the definition of a \"proprietary product list\", the firm must clearly disclose to its clients, prominently and in plain language at the time of account opening (or before any product or service is provided), that: \n • their product list is restricted to proprietary products and it will only recommend proprietary products; and \n • as a result, the suitability analysis conducted by the firm and its representatives does not consider: \n • the larger market of non-proprietary products; and \n • whether such non-proprietary products are better, worse or equal in meeting the client's investments needs and objectives. \n This obligation does not apply when firms deal with institutional clients. \n Restricted Registration Category Disclosure \n Firms must clearly identify not only what products or services they can provide to the client pursuant to paragraph 14.2(2)(b) of NI 31-103, but they should also identify in general terms what products and services they do not, or cannot, provide to their clients. \n In particular, firms that are mutual fund dealers, exempt market dealers, scholarship plan dealers or restricted dealers/advisers must clearly disclose to their clients, prominently and in plain language at the time of account opening (or before any product or service is provided), that they only offer, as a result of their registration category, a limited range of products and, as a result, the suitability analysis conducted by the firm and its representatives does not consider: \n • a full range of securities products; and \n • whether such other types of products are better, worse or equal in meeting the client's investments needs and objectives. \n General Disclosure Guidance \n Any disclosure given to a client must be prominent, specific and clear. The disclosure must be sufficient to be meaningful to the client such that the client fully understands the disclosure, including the implications and consequences for the client of the content being disclosed. Registrants should have a reasonable basis for concluding that a client fully understands the implications and consequences for the client of the content being disclosed. \n Appendix G \n Description of Potential Guidance -- Designations \n No representative should hold him or herself out to the public in any manner that deceives or misleads, or could reasonably be expected to deceive or mislead, a client or any other person as to his/her proficiency, qualifications or scope of product or service offering. This includes using designations in client facing communications. \n We expect firms to have policies and procedures on financial designations that will promote greater transparency for potential and existing clients, particularly more vulnerable and less sophisticated investors. These policies and procedures should be adapted to the firm's business model and offerings (i.e., products, services and account types) and include guidance on what financial designations representatives may use and any restrictions or prohibitions in this area, including any requirement that firms pre-approve a designation before a representative can use it. These policies and procedures should be clearly communicated to the firm's representatives and enforced by the firm. \n Appendix H \n Description of Potential Guidance -- Proposed Regulatory Best Interest Standard \n Part 1 -- Introduction and definitions \n This Companion Policy sets out how the  [TBD]  ( we ,  us ,  our , or the  [x] ) interprets and applies  [insert name and title of legislative reference]  ( [Legislative Reference] ). \n For purposes of this Companion Policy: \n • \" firm \" means a registered adviser and/or registered dealer firm in  [the jurisdiction] ; \n • \" registrant \", unless the context requires otherwise, means a firm and its representatives; and \n • \" representative \" has the meaning set out in the  [Acts] . \n Unless defined in  [Legislative Reference]  or in this Companion Policy, terms used in  [Legislative Reference]  and in this Companion Policy have the meaning given to them in Canadian securities legislation, including National Instrument 31-103  Registration Requirements, Exemptions and Ongoing Registrant Obligations  ( NI 31-103 ), National Instrument 14-101  Definitions  and other local rules and instruments. \n Part 2 -- Standard of care for advisers and dealers and their representatives \n 2.1 Summary \n Firms and their representatives must deal fairly, honestly and in good faith with their clients and act in their clients' best interests (the  Standard of Care ). The conduct expected of a firm and representative in meeting her, his or its Standard of Care is that of a prudent and unbiased firm or representative (as applicable), acting reasonably. In complying with the Standard of Care, registrants must be guided by the following principles: \n 1. Act in the best interests of the client \n 2. Avoid or control conflicts of interest in a manner that prioritizes the client's best interests \n 3. Provide full, clear, meaningful and timely disclosure \n 4. Interpret law and agreements with clients in a manner favourable to the client's interest where reasonably conflicting interpretations arise \n 5. Act with care \n An explanation of staff's interpretation of the Standard of Care, including the guiding principles, is provided below. \n 2.2 General \n The Standard of Care requires that registrants deal fairly, honestly and in good faith with their clients and act in their clients' best interests. The Standard of Care requires that firms and representatives act in a manner that is focused on achieving what is best for their clients, including placing the interests of their clients ahead of their own. \n The conduct expected of firms and representatives in meeting their Standard of Care is that of a prudent and unbiased firm or representative (as applicable) acting reasonably. This is an objective, not a subjective, standard. As such, it is not sufficient for firms and representatives to determine that they personally have the impression that a particular decision, approach or course of action complies with the Standard of Care. Instead, the firm or representative should form an opinion as to what a prudent and unbiased firm or representative (as applicable), acting reasonably, would do in the circumstances in order to comply with the Standard of Care. \n The Standard of Care is a general statement of the fundamental obligation of firms and representatives under Canadian securities legislation toward their clients. It derives its authority from the regulator's rule-making powers, and reflects the purposes and principles set out in the Acts. \n 2.3 Application and scope \n The Standard of Care applies to all registrants in  [the Jurisdictions]  in respect of all clients of the registrant, including: \n • all registered dealers and registered dealing representatives, whether or not members of any self-regulatory organization ( SRO ), such as the Investment Industry Regulatory Organization of Canada ( IIROC ) and the Mutual Fund Dealers Association of Canada ( MFDA ), that are dealers (or representatives) in Canada; \n • all registered advisers, registered advising representatives and registered associate advising representatives; \n • all registrants in a fiduciary relationship with any client or whose client is an accredited investor, permitted client or institutional client; \n • firms, not just for their own firm-level activities and behaviour, but also diligently overseeing the activity of their representatives for their compliance with the Standard of Care. \n - - - - - - - - - - - - - - - - - - - - \n Question \n 65) Should the Standard of Care apply to unregistered firms (e.g., international advisers and international dealers) that are not required to be registered by reason of a statutory or discretionary exemption from registration, unless the Standard of Care is expressly waived by the regulator? \n - - - - - - - - - - - - - - - - - - - - \n The scope of the Standard of Care extends to all aspects of the client-registrant relationship. The guidance contained in this Companion Policy, along with the other existing client-related rules and related guidance set out in Canadian securities legislation, should not be viewed as exhaustive of the scope and application of the Standard of Care. In this sense, since these other client-related rules and guidance are extensions of the Standard of Care, such standard supplements, and informs the interpretation of, these other rules and guidance. This requires that registrants comply with the various express regulatory requirements that apply to them under securities legislation (for example, the requirements related to KYC, KYP, suitability and conflicts of interest) in a manner that also complies with the Standard of Care. Any guidance provided in this Companion Policy is supplemental to any other guidance issued in respect of such express regulatory requirements (for example, guidance contained in Companion Policy 31-103CP  Registration Requirements, Exemptions and Ongoing Registrant Obligations . \n Firms' and representatives' dealings with their clients outside of express regulatory requirements are also subject to the Standard of Care to the extent such dealings involve securities or the client has a reasonable belief that the firm and representative are considering securities in the dealings with the client. To the extent of any overlap between complying with the Standard of Care and complying with any other regulatory requirement under securities legislation, firms and representatives must comply with both the Standard of Care and such regulatory requirement. \n The Standard of Care is a foundational standard of conduct. As such, neither it nor the guidance set out in this Companion Policy explicitly identifies all instances of non-compliant conduct by firms and representatives. However, as a foundational standard of conduct, the Standard of Care establishes the core values against which (i) all client-focused securities rules and guidance are applied (including, for example, the interpretation of KYC, KYP, suitability and conflicts of interest), and (ii) conduct in new and unforeseen client situations should be evaluated. \n - - - - - - - - - - - - - - - - - - - - \n Question \n 66) Do you believe that the Standard of Care is inconsistent with any current element of securities legislation? If so, please explain. \n - - - - - - - - - - - - - - - - - - - - \n In assessing whether or not the firm or representative has complied with the Standard of Care, we will take into account only the information known by the firm or representative, or which the firm or representative should reasonably have known, at the time of the conduct in question. \n In accordance with section 11.5 of NI 31-103, we expect that firms and representatives will be able to proactively demonstrate their compliance with the Standard of Care and will be able to produce books and records to evidence such compliance for compliance reviews of the Jurisdictions and the SROs. \n For greater certainty, the Standard of Care does not apply to underwriting activities and corporate finance advisory services in respect of issuer clients, controlling shareholders or persons seeking to influence control of an issuer. \n - - - - - - - - - - - - - - - - - - - - \n Question \n 67) Do you agree that the Standard of Care should not apply to the underwriting activity and corporate finance advisory services described above? If not, please explain. \n - - - - - - - - - - - - - - - - - - - - \n 2.4 Policy objectives \n This section sets out the policy objectives of the Standard of Care. The objectives are used by us as a tool to assist in interpreting and applying the Standard of Care and related obligations and should be used by firms and representatives as a guide when applying the Standard of Care to their specific situations. \n The Standard of Care is intended to: \n • reinforce that, in almost all cases, the firm's and representative's primary role and focus is one of providing advice, which requires fostering a culture of advice that is focused on placing the client's best interests first, not simply product or service sales. This means that in the tension between advice and sales cultures, advice in the client's best interest is paramount; \n • be a necessary condition for the provision of advice that is unbiased, client-focused, and portfolio-based, which aims to benefit the client in meeting his, her or its investment needs and objectives, as those are determined by reference to the client's KYC information; and \n • enhance and maintain trust and confidence of investors in capital markets in general, and in registrants in particular, so that investors are confident to seek out the advice or other services and products they need to meet their investment needs and objectives. \n The Standard of Care is not intended to: \n • interfere with the registration categories under Canadian securities legislation or the scope of application of those categories; \n • prohibit firms from charging clients for their services; \n • prohibit the offering of proprietary products by firms; \n • guarantee that clients' securities investments never lose value, result in the \"best\" or \"highest\" returns for the client, or result in the lowest risk; \n • always result in the lowest cost product on the firm's shelf being recommended to clients since the lowest cost product may not, based on an analysis of a client's investment needs and objectives, always be in the client's best interest; or \n • interfere with the ability of courts to apply common law doctrines relating to, for example, fiduciary duty, negligence or contract law principles, to the client-registrant relationship (for further discussion on this point, see below under section 2.5 \"Relevance of other legal obligations\"). \n 2.5 Relevance of other legal obligations \n In addition to the Standard of Care, firms and representatives are required to comply with a variety of other requirements under securities legislation and SRO rules, including: \n • NI 31-103, \n • National Instrument 33-105  Underwriting Conflicts , \n • to the extent applicable, IIROC's \"Dealer Member Rules\" and the MFDA's \"MFDA Rules\", and \n • other securities and derivatives legislation in the jurisdictions. \n Firms and representatives may also be subject to a variety of common law obligations. Depending on the nature of the client-registrant relationship and other factors, these obligations may fall under several different areas of common law, including: \n • fiduciary duty, \n • tort (e.g., negligence, fraudulent misrepresentation), and/or \n • contract law. \n A failure by a firm or representative to comply with obligations either under securities legislation or at common law may mean, among other things, that the firm or representative has failed to comply with its Standard of Care. For example, where a court has found that a firm has acted negligently in providing securities investment advice to a client, this may result in us concluding that the firm, and the representative that provided the negligent advice, have breached their Standard of Care. \n It is not our intention for the Standard of Care to automatically result in firms and representatives owing a common law fiduciary duty to their clients. The Standard of Care is a regulatory conduct standard, not a statutory fiduciary duty, and as such, we are not intending to define fiduciary duty as it applies to firms and representatives. Whether or not, for purposes of private claims by clients against their firm or representative, a given client-registrant relationship is interpreted as a common law fiduciary relationship will continue to be primarily within the purview of the courts. \n Part 3 -- Guiding principles \n We expect that in complying with the Standard of Care, firms and representatives be guided by five guiding principles. The following sets out our interpretation of the guiding principles. \n - - - - - - - - - - - - - - - - - - - - \n Principle 1: \n Act in the best interests of the client \n - - - - - - - - - - - - - - - - - - - - \n All registrants must deal with their clients in a manner that is in their clients' best interests and to place their clients' interests ahead of their own. This requires them to always act in a manner that is focused on achieving what is best for their clients, including (where applicable) how best to achieve the clients' investment needs and objectives at the time the dealings with the client occur. While registrants must have policies and procedures whose objective is to deal with their clients in their best interests, registrants should also monitor their clients' outcomes to confirm that their dealings with their clients are in fact achieving what is best for the client in the context of the client-registrant relationship (including meeting the investment needs and objectives of the client). \n - - - - - - - - - - - - - - - - - - - - \n Principle 2: \n Avoid or control conflicts of interest in a manner that prioritizes the client's best interests \n - - - - - - - - - - - - - - - - - - - - \n The obligation to identify and respond to material conflicts of interest is among the most fundamental obligations owed by firms to their clients and is one of the cornerstones of our investor protection regime. This obligation is expressly prescribed for firms in Division 2 of Part 13 of NI 31-103 and is, for all firms and representatives, an extension of their Standard of Care. \n Registrants must respond to conflicts of interest between them and their clients in a manner that (i) is in the best interests of the client, and (ii) prioritizes the best interests of the client over the interests of the registrant. If registrants cannot respond to a conflict of interest in the manner set out above, they must avoid the conflict of interest. Firms should institute policies and procedures to reinforce that client interests are paramount and supersede the firm's and the representative's interests in all aspects of the client-registrant relationship. Registrants must clearly place their clients' interests first. \n When deciding how to respond to a conflict of interest involving clients, only avoidance or controls (but not disclosure alone in most cases) are responses that, by themselves, can be fully effective in mitigating conflicts of interest. Disclosure alone is generally inadequate since clients (especially non-institutional clients) are often unable to fully understand such disclosure or effectively incorporate it into their decision-making process. \n - - - - - - - - - - - - - - - - - - - - \n Principle 3: \n Provide full, clear, meaningful and timely disclosure \n - - - - - - - - - - - - - - - - - - - - \n Firms must provide full, clear, meaningful and timely disclosure of all material facts relating to the client relationship and the products and/or services provided in a manner that is in the best interests of the client and that prioritizes the interests of the client over the interests of the firm and representative. This means that firms should confirm that, among other things, all advertising and promotional material, whether provided to current or prospective clients, is in plain language, balanced and not misleading. \n - - - - - - - - - - - - - - - - - - - - \n Principle 4: \n Interpret law and agreements with clients in a manner favorable to the client's interest where reasonably conflicting interpretations arise \n - - - - - - - - - - - - - - - - - - - - \n Firms and representatives should comply with the letter, as well as the spirit and intent, of Canadian securities legislation relating to, and contract(s) with, their clients. If there is any material ambiguity or material discretion inherent in such legislation or contracts, the ambiguity should be interpreted, and the discretion should be exercised, in a manner that (i) is in the best interests of the client, and (ii) prioritizes the interests of the client over the interests of the firm and representative. \n - - - - - - - - - - - - - - - - - - - - \n Question \n 68) Do you think this expectation is appropriate when the level of sophistication of the firm and its clients is similar, such as when firms deal with institutional clients? \n - - - - - - - - - - - - - - - - - - - - \n The Standard of Care (and the requirements flowing from it) cannot be excluded by way of contract between the firm and client. Any attempt to do so, whether directly or indirectly, for example by limiting liability in respect of a breach of the Standard of Care, itself constitutes a breach of the Standard of Care. \n - - - - - - - - - - - - - - - - - - - - \n Principle 5: \n Act with care \n - - - - - - - - - - - - - - - - - - - - \n Firms and representatives should exercise the degree of care, diligence and skill that a reasonably prudent and unbiased firm or representative (as applicable) would exercise in the circumstances. This obligation to act with care recognizes the high risk to the client, including the foreseeability of significant loss, when dealing with a firm or representative who does not comply with this obligation. In order to act with care, a firm or representative should: \n • accept instructions from the client, or make recommendations to the client, and carry them out with care, diligence and skill; \n • comply with industry and regulatory policies, procedures and requirements that apply to the firm and representative ; \n • have in place an effective organizational system that promotes compliance with such policies, procedures and requirements; and \n • recognize that significantly more care and diligence is required for at-risk or vulnerable clients, such as inexperienced investors, seniors, discretionary clients, etc. \n Appendix I \n List of Consultation Questions \n 1. Is this general approach to regulating how registrants should respond to conflicts optimal? If not, what alternative approach would you recommend? \n 2. Is the requirement to respond to conflicts \"in a manner that prioritizes the interest of the client ahead of the interests of the firm and/or representative\" clear enough to provide a meaningful code of conduct? If not, how could the requirement be clarified? \n 3. Will this requirement present any particular challenges for specific registration categories or business models? \n 4. Do all registrants currently have the proficiency to understand their client's basic tax position? Would requiring collection of this information raise any issues or challenges for registrants or clients? \n 5. Should the CSA also codify the specific form of the document, or new account application form, that is used to collect the prescribed KYC content? \n 6. Should the KYC form also be signed by the representative's supervisor? \n 7. Is this general approach to regulating how representatives should meet their KYP obligation optimal? If not, what alternative approach would you recommend? \n 8. The intended outcome of the requirement for mixed/non-proprietary firms to engage in a market investigation and product comparison is to ensure the range of products offered by firms that present themselves as offering more than proprietary products is representative of a broad range of products suitable for their client base. Do you agree or disagree with this intended outcome? Please provide an explanation. \n 9. Do you think that requiring mixed/non-proprietary firms to select the products they offer in the manner described will contribute to this outcome? If not, why not? \n 10. Are there other policy approaches that might better achieve this outcome? \n 11. Will this requirement raise challenges for firms in general or for specific registration categories or business models? If so, please describe the challenges. \n 12. Will this requirement cause any unintended consequences? For example, could this requirement result in firms offering fewer products? Could it result in firms offering more products? \n 13. Could these requirements create incentives for firms to stop offering non-proprietary products so that they can fit the definition of proprietary firm? \n 14. Should proprietary firms be required to engage in a market investigation and product comparison process or to offer non-proprietary products? \n 15. Do you think that categorizing product lists as either proprietary and mixed/non-proprietary is an optimal distinction amongst firm types? Should there be other characteristics that differentiate firms that should be identified or taken into account in the requirements relating to product list development? \n 16. Do you agree with the requirement to consider other basic financial strategies? \n 17. Will there be challenges in complying with the requirement to ensure that a purchase, sale, hold or exchange of a product is the \"most likely\" to achieve the client's investment needs and objectives? \n 18. Should there be more specific requirements around what makes an investment \"suitable\"? \n 19. Will the requirement to perform a suitability assessment when accepting an instruction to hold a security raise any challenges for registrants? \n 20. Will the requirement to perform a suitability analysis at least once every 12 months raise challenges for specific registrant categories or business models? For example, a client may only have a transactional relationship with a firm. In such cases, what would be a reasonable approach to determining whether a firm should perform ongoing suitability assessments? \n 21. Should clients receive a copy of the representative's analysis regarding the client's target rate of return and his or her investment needs and objectives? \n 22. Will the requirement to perform a suitability review for a recommendation not to purchase, sell, hold or exchange a security be problematic for registrants? \n 23. Do you agree with the proposed disclosure required for firms registered in restricted categories of registration? Why or why not? \n 24. Do you agree with the proposed disclosure required for firms that offer only proprietary products? Why or why not? \n 25. Is the proposed disclosure for restricted registration categories workable for all categories identified? \n 26. Should there be similar disclosure for investment dealers or portfolio managers? \n 27. Would additional guidance about how to make disclosure about the relationship easier to understand for clients be helpful? \n 28. To what extent should the CSA explicitly heighten the proficiency requirements set out under Canadian securities legislation? \n 29. Should any heightening of the proficiency requirements for representatives be accompanied by a heightening of the proficiency requirements for CCOs and UDPs? \n 30. Will more strictly regulating titles raise any issues or challenges for registrants or clients? \n 31. Do you prefer any of the proposed alternatives or do you have another suggestion, other than the status quo, to address the concern with client confusion around representatives' roles and responsibilities? \n 32. Should there be additional guidance regarding the use of titles by representatives who are \"dually licensed\" (or equivalent)? \n 33. Should we regulate the use of specific designations or create a requirement for firms to review and validate the designations used by their representatives? \n 34. Are these proposed clarifying reforms consistent with typical current UDP and CCO practices? If not, please explain. \n 35. Is there any reason not to introduce a statutory fiduciary duty on these terms? \n 36. Please indicate whether a regulatory best interest standard would be required or beneficial, over and above the proposed targeted reforms, to address the identified regulatory concerns. \n 37. Please indicate whether you agree or disagree with any of the points raised in support of, or against, the introduction of a regulatory best interest standard and explain why. \n 38. Please indicate whether there are any other key arguments in support of, or against, the introduction of a regulatory best interest standard that have not been identified above. \n 39. What impact would the introduction of the proposed targeted reforms and/or a regulatory best interest standard have on compliance costs for registrants? \n 40. What impact would the introduction of the proposed targeted reforms and/or a regulatory best interest standard have on outcomes for investors? \n 41. What challenges and opportunities could registrants face in operationalizing: \n (i) proposed targeted reforms? \n (ii) a regulatory best interest standard? \n 42. How might the proposals impact existing business models? If significant impact is predicted, will other (new or pre-existing) business models gain more prominence? \n 43. Do the proposals go far enough in enhancing the obligations of dealers, advisers and their representatives toward their clients? \n 44. Is it appropriate that disclosure by firms be the primary tool to respond to a conflict of interest between such firms and their institutional clients? \n 45. Are there other specific situations that should be identified where disclosure could be used as the primary tool by firms in responding to certain conflicts of interests? \n 46. Is this definition of \"institutional client\" appropriate for its proposed use in the Companion Policy? For example: (i) where financial thresholds are referenced, is $100 million an appropriate threshold?; (ii) is the differential treatment of institutional clients articulated in the Companion Policy appropriate?; and (iii) does the introduction of the \"institutional client\" concept, and associated differential treatment, create excessive complexity in the application and enforcement of the conflicts provisions under securities legislation? If not, please explain and, if applicable, provide alternative formulations. \n 47. Could institutional clients be defined as, or be replaced by, the concept of non-individual permitted clients? \n 48. Are there other specific examples of sales practices that should be included in the list of sales practices above? \n 49. Are specific prohibitions and limitations on sales practices, such as those found in NI 81-105, appropriate for products outside of the mutual fund context? Is guidance in this area sufficient? \n 50. Are limitations on the use of sales practices more relevant to the distribution of certain types of products, such as pooled investment vehicles, or should they be considered more generally for all types of products? \n 51. Are there other requirements that should be imposed to limit sales practices currently used to incentivize representatives to sell certain products? \n 52. What type of disclosure should be required for sales practices involving the distribution of securities that are not those of a publicly offered mutual fund, which are already subject to specific disclosure requirements? \n 53. Should further guidance be provided regarding specific sales practices and how they should be evaluated in light of a registrant's general duties to his/her/its clients? If so, please provide detailed examples. \n 54. To what extent should the KYC obligation require registrants to collect tax information about the client? For example, what role should basic tax strategies have in respect of the suitability analysis conducted by registrants in respect of their clients? \n 55. To what extent should a representative be allowed to open a new client account or move forward with a securities transaction if he or she is missing some or all of the client's KYC information? Should there be certain minimum elements of the KYC information that must be provided by the client without which a representative cannot open an account or process a securities transaction? \n 56. Should additional guidance be provided in respect of risk profiles? \n 57. Are there circumstances where it may be appropriate for a representative to collect less detailed KYC information? If so, should there be additional guidance about whether more or less detailed KYC information may need to be collected, depending on the context? \n 58. Should we explicitly allow firms that do not have a product list to create a product review procedure instead of a shelf or would it be preferable to require such firms to create a product list? \n 59. Would additional guidance with respect to conducting a \"fair and unbiased market investigation\" be helpful or appreciated? If so, please provide any substantive suggestions you have in this regard. \n 60. Would labels other than \"proprietary product list\" and \"mixed/non-proprietary product list\" be more effective? If so, please provide suggestions. \n 61. Is the expectation that firms complete a market investigation, product comparison or product list optimization in a manner that is \"most likely to meet the investment needs and objectives of its clients based on its client profiles\" reasonable? If not, please explain your concern. \n 62. What, if any, unintended consequences could result from setting an expectation in the context of the suitability obligation that registrants must identify products both that are suitable and that are the most likely to achieve the investment needs and objectives of the client? If unintended consequences exist, do the benefits of this proposal outweigh such consequences? \n 63. Should we provide further guidance on the suitability requirement in connection with ongoing decisions to hold a position? \n 64. Should we provide further guidance on the frequency of the suitability analysis in connection with those registrant business models that may be based on one-time transactions? For example, when should a person or entity in such a relationship no longer be a client of the registrant for purposes of this ongoing obligation to conduct suitability reviews of the client's account? \n 65. Should the Standard of Care apply to unregistered firms (e.g., international advisers and international dealers) that are not required to be registered by reason of a statutory or discretionary exemption from registration, unless the Standard of Care is expressly waived by the regulator? \n 66. Do you believe that the Standard of Care is inconsistent with any current element of securities legislation? If so, please explain. \n 67. Do you agree that the Standard of Care should not apply to the underwriting activity and corporate finance advisory services described above? If not, please explain. \n 68. Do you think this expectation is appropriate when the level of sophistication of the firm and its clients is similar, such as when firms deal with institutional clients? \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}