{"url": "https://www.concordia.ca/students/exchanges/internships/external.html", "content": "External opportunities \n Concordia University \n https://www.concordia.ca/content/concordia/en/students/exchanges/internships/external.html \n Study resources \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links   \n Webmail \n Library \n Cspace \n Study resources    \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services    \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new    \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges    \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links  \n The Campaign for Concordia \n MyConcordia \n Cspace \n Webmail \n Library \n Directories \n A-Z \n Maps \n Future students \n Student hub \n Alumni & friends \n Parents \n Faculty & staff \n Media \n Concordia University \n Concordia University \n Student hub \n Academic resources \n                                                                Studying in Québec\n                                                                Registration & advising\n                                                                Academic regulations\n                                                                Academic integrity\n                                                                Exams\n                                                                Graduation\n                                                                Transcripts\n                                                                Student Success Centre\n Financial matters \n                                                                Costs & budgeting\n                                                                Government student aid\n                                                                Bursaries\n                                                                Work-study program\n                                                                Undergraduate awards\n                                                                Graduate funding\n Campus services \n                                                                Learning support\n                                                                New students\n                                                                Maps & transportation\n                                                                Health & wellness\n                                                                Safety\n                                                                Birks Student Service Centre\n Beyond the classroom \n                                                                Jobs & careers\n                                                                Volunteering\n                                                                Student groups\n                                                                Leadership\n                                                                Recreation & athletics\n                                                                Faith & spirituality\n                                                                Co-curricular record\n Oui Can Help! \n The Campaign for Concordia \n Study resources \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links   \n Webmail \n Library \n Cspace \n Study resources    \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services    \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new    \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges    \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Information for...  \n Future students \n Student hub \n Alumni & friends \n Parents \n Faculty & staff \n Media \n                    Concordia\r\n                    Directories\r\n Search \n Concordia University \n Student hub \n                    Concordia.ca\r\n\t         / \r\n                    Students\r\n\t         / \r\n                    International programs for Concordia students\r\n\t         / \r\n                    Internships\r\n\t         / \r\n                    External opportunities\r\n Facebook \n Twitter \n LinkedIn \n GooglePlus \n External internship opportunities \n Country \n Name \n Overview \n Various \n Mitacs Globalink Research Awards \n The Globalink program provides funding for undergraduate and graduate students to have a hands-on research experience abroad.  \n Various (Asia and Africa) \n Aga Khan International Youth Fellowship Program \n The Fellowship program is for young Canadians seeking hands-on experience in international development through an eight month placement in Africa or Asia. There are 3 programmatic streams: International Development Management (IDM); International Microfinance and Microenterprise (IMM); and Young Professionals in Media (YPM). \n Various \n MRI Internships \n The Ministère des Relations Internationales du Québec offers several international internship opportunities for students at NGOs or international organizations. \n Various \n United Nations Internship Programme \n Interns gain experience in the work of the United Nations (UN) with the objective of deepening their knowledge and understanding of the organization’s goals, principles and activities. Internships are not paid. \n Various \n World Health Organization (WHO) Internship Programme \n The WHO Internship Programme offers a wide range of opportunities for students to gain insight in the technical and administrative programmes of WHO.  Internships are not paid.   \n Various \n European Institutes for Advanced Study (EURIAS) Fellowship Programme \n An international researcher mobility programme offering 10-month fellowships in one of the 16 participating Institutes: Berlin, Bologna, Budapest, Cambridge, Delmenhorst, Edinburgh, Freiburg, Helsinki, Jerusalem, Lyon, Marseille, Paris, Uppsala, Vienna, Wassenaar, Zürich. Candidates must hold a PhD. \n Various \n International Experience Canada - Foreign Affairs, Trade and Development Canada \n Find opportunities for working holidays, co-ops and exchange programs overseas. Programs are organized by country. Click on the link to the Consular Affairs website for passport, visas, work permit information that is required for travel abroad. \n Various \n IDRC Doctoral Research Award \n This funding supports field research in one or more developing countries. Candidates must conduct their research in areas corresponding to IDRC thematic priorities. \n Various \n IDRC Bentley Cropping Systems Fellowship \n IDRC offers this Fellowship every two years for field research focused on increasing the yield of food crops, improving farmers’ livelihoods, and enhancing soil fertility. Applicants undertake applied, on-farm research with cooperating farmers in one or more developing countries. \n Various \n Community Forestry: Trees and People—The John G. Bene Fellowship \n This fellowship funds field research on the relationship between forest resources and the social, economic, cultural, and environmental welfare of people in developing countries. \n Belgium \n MOVE-IN Louvain \n Post-doctoral fellowships are offered at one of three host institutions in Belgium.  All research fields are eligible. Candidates must hold a PhD or at least 4 years of research experience. \n Canada \n International Development Research Centre (IDRC) Research Award \n Funding for a one-year paid program of research. Research must be focused on one or more developing countries. Internship is based in Ottawa. \n Finland \n Visiting Scholars Programme at the United Nations University World Institute for Development Economics Research (UNU-WIDER) \n The Programme gives post-doctoral scholars an opportunity to research topics related to development and/or global economic issues at UNU-WIDER. Candidates must hold a PhD to apply. \n France \n AgreenSkills and AgreenSkills+ Research Fellowships \n Post-doctoral research fellowships co-funded by the European Union and based at the French National Institute for Agricultural Research (INRA). Research areas include agriculture, food and nutrition, environment, animal health and veterinary public health. \n France \n Teaching Assistant Program in France \n This program gives Canadian students aged 20 to 30 the opportunity to live in France during 7 months while teaching English language in French schools. It is open to Canadian citizens enrolled in a university and having completed 2 years of study at the time of application. \n Germany \n RISE – Research Internships in Science and Engineering \n The DAAD (German Academic Exchange Service) offers the RISE program, which “gives students in the fields of Biology, Chemistry, Engineering, Geology and Physics the chance to spend a summer working with German doctoral students on serious research projects.” \n Germany \n DAAD Research Grants for Doctoral Candidates, Young Academics and Scientists \n These grants are awarded to qualified PhD candidates and recent PhDs to conduct research projects in Germany. Both short-term (1-6 months) and long-term (7-10 months) grants are offered. \n Germany \n Humboldt Research Fellowship \n This fellowship supports postdoctoral scholars of all disciplines to conduct long-term (6-24 months) research projects in Germany. Applicants choose their own topic of research and their host in Germany. \n Germany \n EMGIP (Émigré Memorial German Internship Program)  \n EMGIP offers internship opportunities for Canadian and US students in the German parliament, the Bundestag. The internships are two months long and in positions matching the student’s interests and academic and professional experience. \n Application deadline is September 15, 2016 for internships in 2017. \n Applicants should possess outstanding academic records and personal integrity, and should have some knowledge of the German legislative process. Participants should be advanced undergraduate or Master’s students in fields such as political science, international relations, law, history, economics or German. Students must be fluent in spoken German and possess excellent writing skills. \n The successful applicant will receive a monthly salary of approximately €1,800 from the German Bundestag. \n Japan \n Amgen Scholars Japan Program \n Amgen Scholars allows undergraduates from across the globe to participate in cutting-edge research opportunities at the University of Tokyo or Kyoto University. Scholars benefit from undertaking a research project under top faculty, being part of a cohort-based experience of seminars and networking events, and taking part in a symposium. \n Japan \n Japan Society for the Promotion of Science (JSPS) Summer Program \n Provides opportunities for young researchers from North America and Europe to receive an orientation on Japanese culture and research systems and to pursue research under the guidance of host researchers at Japanese universities/research institutes during the summer. \n Japan \n JSPS Post-Doctoral Fellowships \n JSPS offers opportunities to conduct collaborative research, discussions, and opinion exchanges with researchers in Japan. Candidates must have a PhD. \n Italy \n European University Institute (EUI) \n The EUI offers a number of 1-2 year research fellowships for postdoctoral applicants to conduct research at the EUI in Florence, Italy. \n Spain  \n Teaching Assistant Internship \n University Alfonso X el Sabio is looking for last year Bachelor, Graduated or Master Degree students in Education or Language Degrees, for their Internship Program as Teacher Assistant in their partner schools in Madrid and Oviedo next academic year 2016/2017, for a full year period or one semester, starting September 2016 or January 2017. Application deadline is June 1 st  2016. \n For further information, please contact  Pauliina.Rouleau@concordia.ca . \n Uganda  \n CEED Concordia \n CEED recruits up to 15 interns to work in Gulu, Uganda every year for 3 months during Concordia University’s summer semester. The numerous  projects  that are led by our Ugandan office contribute significantly to the ongoing development of northern Uganda. CEED accepts both undergraduate and graduate students from Concordia and Concordia alumni.  \n United States \n Woodrow Wilson International Fellowships \n The Wilson Center offers 9-month residential fellowships. Fellows conduct research in their areas of expertise, while interacting with policymakers in Washington.  Candidates must hold a PhD. \n Vietnam \n Global Engagement Institute \n GEI provides accredited short-term study abroad, internship and training programs as well as conferences in East Africa, Southern Africa and Southeast Asia. Curricula focus on globally relevant topics in key disciplines. In addition, students also gain a thorough understanding and experience of sustainable development and social justice issues at the destination, in line with the UN Sustainable Development Goals (SDGs). \n International programs for Concordia students CSEP Field Schools Concordia in China Concordia in Spain Concordia Theatre Students in Germany Internships External opportunities Funding Quebec Mobility Bursary Graduate Student Mobility Award Health & safety abroad \n Back to top \n © Concordia University \n Concordia University  - Call us at 514-848-2424 \n About \n Academics \n Admissions \n Campus life \n Research \n International \n Future students \n Current students \n Alumni & friends \n Parents  \n Faculty & staff \n Media \n Sir George Williams Campus \n 1455 De Maisonneuve Blvd. W. \n Montreal ,  Quebec ,  Canada \n H3G 1M8 \n See SGW Campus map  \n Loyola Campus \n 7141 Sherbrooke Street W. \n Montreal ,  Quebec ,  Canada \n H4B 1R6 \n See Loyola Campus map  \n facebook \n twitter \n google \n youtube \n linkedin \n pinterest \n instagram \n flickr \n Concordia social \n © Concordia University \n Terms \n Privacy \n Accessibility \n Website feedback \n Share this page \n Concordia.ca \n Call us at \n 514-848-2424 \n Sir George Williams Campus \n 1455 De Maisonneuve Blvd. W. \n Montreal ,  Quebec ,  Canada \n H3G 1M8 \n See SGW Campus map  \n Loyola Campus \n 7141 Sherbrooke Street W. \n Montreal ,  Quebec ,  Canada \n H4B 1R6 \n See Loyola Campus map  \n Website feedback \n Terms \n Privacy \n Accessibility \n © Concordia University"}