{"url": "https://en.wikipedia.org/wiki/Interior_design", "content": "Interior design - Wikipedia \n Interior design \n From Wikipedia, the free encyclopedia \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n For other uses, see  Interior design (disambiguation) . \n The examples and perspective in this article  deal primarily with  the English-speaking world  and do not represent a  worldwide view  of the subject .  You may  improve this article , discuss the issue on the  talk page , or  create a new article , as appropriate.   (January 2011)   ( Learn how and when to remove this template message ) \nThe lobby of  Hotel Bristol, Warsaw \nA historical example:  Balliol College  Dining Hall, Oxford \n Interior design  is the  art  and  science  of enhancing the interiors, sometimes including the exterior, of a space or  building , to achieve a healthier and more aesthetically pleasing environment for the end user. An interior designer is someone who plans, researches, coordinates, and manages such projects. Interior design is a multifaceted profession that includes conceptual development, space planning, site inspections, programming, research, communicating with the stakeholders of a project, construction management, and execution of the design. \n Contents \n 1   History and current terms \n 1.1   Commercial interior design and management \n 1.2   Transition to professional interior design \n 1.3   Expansion \n 2   Interior decorators and interior designers \n 2.1   Interior designer \n 2.2   Color in interior design \n 3   Specialties \n 3.1   Residential \n 3.2   Commercial \n 3.3   Other \n 4   Profession \n 4.1   Education \n 4.2   Working conditions \n 5   Styles \n 5.1   Art Deco \n 5.2   Modern Art \n 5.3   Arab Materials \n 6   Media popularization \n 7   Interior design examples \n 8   Notable interior decorators \n 9   See also \n 10   References and sources \n 11   External links \n History and current terms [ edit ] \nTypical interior of one of the houses in the Folk Architecture Reservation in  Vlkolínec  ( Slovakia ) \n In the past, interiors were put together instinctively as a part of the process of building. [1]  The profession of interior design has been a consequence of the development of society and the complex  architecture  that has resulted from the development of industrial processes. The pursuit of effective use of space, user well-being and functional design has contributed to the development of the contemporary interior design profession. [2]  The profession of interior design is separate and distinct from the role of Interior Decorator, a term commonly used in the US. The term is less common in the UK where the profession of interior design is still unregulated and therefore, strictly speaking, not yet officially a profession. \n In ancient India, architects used to work as interior designers. This can be seen from the references of Vishwakarma the architect - one of the gods in Indian mythology. Additionally, the sculptures depicting ancient texts and events are seen in palaces built in 17th-century India. \n In ancient Egypt, \"soul houses\" or models of houses were placed in tombs as receptacles for food offerings. From these, it is possible to discern details about the interior design of different residences throughout the different Egyptian dynasties, such as changes in ventilation, porticoes, columns, loggias, windows, and doors. [3] \n Throughout the 17th and 18th century and into the early 19th century, interior decoration was the concern of the homemaker, or an employed  upholsterer  or craftsman who would advise on the artistic style for an interior space. Architects would also employ craftsmen or artisans to complete interior design for their buildings. \n Commercial interior design and management [ edit ] \n In the mid-to-late 19th century, interior design services expanded greatly, as the  middle class  in  industrial  countries grew in size and prosperity and began to desire the domestic trappings of wealth to cement their new status. Large  furniture  firms began to branch out into general interior design and management, offering full house furnishings in a variety of styles. This business model flourished from the mid-century to 1914, when this role was increasingly usurped by independent, often amateur, designers. This paved the way for the emergence of the professional interior design in the mid-20th century. [4] \nIllustrated catalog of the  James Shoolbred Company , published in 1876. \n In the 1950s and 1960s, upholsterers began to expand their business remits. They framed their business more broadly and in artistic terms and began to advertise their furnishings to the public. To meet the growing demand for contract interior work on projects such as  offices ,  hotels , and  public buildings , these businesses became much larger and more complex, employing builders, joiners, plasterers, textile designers, artists, and furniture designers, as well as engineers and technicians to fulfil the job. Firms began to publish and circulate  catalogs  with prints for different lavish styles to attract the attention of expanding middle classes. [4] \n As department stores increased in number and size, retail spaces within shops were furnished in different styles as examples for customers. One particularly effective advertising tool was to set up model rooms at national and international  exhibitions  in showrooms for the public to see. Some of the pioneering firms in this regard were  Waring & Gillow ,  James Shoolbred ,  Mintons , and Holland & Sons. These traditional high-quality furniture making firms began to play an important role as advisers to unsure middle class customers on taste and style, and began taking out contracts to design and furnish the interiors of many important buildings in Britain. [5] \n This type of firm emerged in America after the  Civil War . The  Herter Brothers , founded by two German emigre brothers, began as an upholstery warehouse and became one of the first firms of furniture makers and  interior decorators . With their own design office and cabinet-making and upholstery workshops, Herter Brothers were prepared to accomplish every aspect of interior furnishing including decorative paneling and mantels, wall and ceiling decoration, patterned floors, and carpets and draperies. [6] \nIllustration from  The Grammar of Ornament  (1856), by interior designer  Owen Jones . \n A pivotal figure in popularizing theories of interior design to the middle class was the architect  Owen Jones , one of the most influential design theorists of the nineteenth century. [7]  Jones' first project was his most important—in 1851 he was responsible for not only the decoration of  Joseph Paxton ’s gigantic  Crystal Palace  for the  Great Exhibition , but also for the arrangement of the exhibits within. He chose a controversial  palette  of red, yellow, and blue for the interior ironwork and, despite initial negative publicity in the newspapers, was eventually unveiled by  Queen Victoria  to much critical acclaim. His most significant publication was  The Grammar of Ornament  (1856), [8]  in which Jones formulated 37 key principles of interior design and decoration. \n Jones was employed by some of the leading interior design firms of the day; in the 1860s he worked in collaboration with the London firm Jackson & Graham to produce furniture and other fittings for high-profile clients including art collector  Alfred Morrison  and the  Khedive  of Egypt,  Ismail Pasha . \n In 1882, the  London Directory  of the  Post Office  listed 80 interior decorators. Some of the most distinguished companies of the period were  Crace , Waring & Gillow and Holland & Sons; famous decorators employed by these firms included  Thomas Edward Collcutt ,  Edward William Godwin ,  Charles Barry ,  Gottfried Semper , and  George Edmund Street . [9] \n Transition to professional interior design [ edit ] \nThis interior was designed by  John Dibblee Crace , President of the Institute of British Decorators, established in 1899. \n By the turn of the 20th century, amateur advisors and publications were increasingly challenging the monopoly that the large retail companies had on interior design. English  feminist  author  Mary Haweis  wrote a series of widely read essays in the 1880s in which she derided the eagerness with which aspiring middle-class people furnished their houses according to the rigid models offered to them by the retailers. [10]  She advocated the individual adoption of a particular style, tailor made to the individual needs and preferences of the customer: \n \"One of my strongest convictions, and one of the first canons of good taste, is that our houses, like the fish’s shell and the bird’s nest, ought to represent our individual taste and habits. \n The move towards decoration as a separate artistic profession unrelated to the manufacturers and retailers, received an impetus with the 1899 formation of the Institute of British Decorators; with  John Dibblee Crace  as its president it represented almost 200 decorators around the country. [11]  By 1915, the London Directory listed 127 individuals trading as interior decorators, of which 10 were women. Rhoda and Agnes Garrett were the first women to train professionally as home decorators in 1874. The importance of their work on design was regarded at the time as on a par with that of  William Morris . In 1876, their work -  Suggestions for House Decoration in Painting, Woodwork and Furniture  - spread their ideas on artistic interior design to a wide middle-class audience. [12] \n By 1900, the situation was described by  The Illustrated Carpenter and Builder : \n \"Until recently when a man wanted to furnish he would visit all the dealers and select piece by piece of furniture ....Today he sends for a dealer in art furnishings and fittings who surveys all the rooms in the house and he brings his artistic mind to bear on the subject.\" [13] \n In America,  Candace Wheeler  was one of the first woman  interior designers  and helped encourage a new style of American design. She was instrumental in the development of art courses for women in a number of major American cities and was considered a national authority on homedesign. An important influence on the new profession was  The Decoration of Houses , a manual of interior design written by  Edith Wharton  with architect  Ogden Codman  in 1897 in America. In the book, the authors denounced Victorian-style  interior decoration  and interior design, especially those rooms that were decorated with heavy window curtains,  Victorian bric-a-brac  and overstuffed furniture. They argued that such rooms emphasized upholstery at the expense of proper space planning and architectural design and were, therefore, uncomfortable and rarely used. The book is considered a seminal work and its success led to the emergence of professional decorators working in the manner advocated by its authors, most notably  Elsie de Wolfe . [14] \n Elsie de Wolfe , taken from  The House in Good Taste , 1913. \n Elsie De Wolfe  was one of the first female interior designers. Rejecting the Victorian style she grew up with, she chose a more vibrant scheme, along with more comfortable furniture in the home. Her designs were light, with fresh colors and delicate  Chinoiserie  furnishings, as opposed to the Victorian preference of heavy, red drapes and upholstery, dark wood and intensely patterned wallpapers. Her designs were also more practical; [15]  she eliminated the clutter that occupied the Victorian home, enabling people to entertain more guests comfortably. In 1905, de Wolfe was commissioned for the interior design of the  Colony Club  on  Madison Avenue ; its interiors garnered her recognition almost over night. [16] [17]  She compiled her ideas into her widely read 1913 book,  The House in Good Taste . [18] \n In England,  Syrie Maugham  became a legendary interior designer credited with designing the first all-white room. Starting her career in the early 1910s, her international reputation soon grew; she later expanded her business to  New York City  and  Chicago . [19]  Born during the  Victorian Era , a time characterized by dark colors and small spaces, she instead designed rooms filled with light and furnished in multiple shades of white and mirrored screens. In addition to mirrored screens, her trademark pieces included: books covered in white vellum, cutlery with white porcelain handles, console tables with plaster palm-frond, shell, or dolphin bases, upholstered and fringed sleigh beds, fur carpets, dining chairs covered in white leather, and lamps of graduated glass balls, and wreaths. [20] \n Expansion [ edit ] \n The interior design profession became more established after  World War II . From the 1950s onwards, spending on the home increased. Interior design courses were established, requiring the publication of textbooks and reference sources. Historical accounts of interior designers and firms distinct from the decorative arts specialists were made available. Organisations to regulate education, qualifications, standards and practices, etc. were established for the profession. [18] \n Interior design was previously seen as playing a secondary role to architecture. It also has many connections to other design disciplines, involving the work of  architects ,  industrial designers ,  engineers , builders, craftsmen, etc. For these reasons, the government of interior design standards and qualifications was often incorporated into other professional organisations that involved design. [18]  Organisations such as the  Chartered Society of Designers , established in the UK in 1986, and the American Designers Institute, founded in 1938, governed various areas of design. \n It was not until later that specific representation for the interior design profession was developed. The US National Society of Interior Designers was established in 1957, while in the UK the Interior Decorators and Designers Association was established in 1966. Across Europe, other organisations such as The Finnish Association of Interior Architects (1949) were being established and in 1994 the International Interior Design Association was founded. [18] \n Ellen Mazur Thomson, author of  Origins of Graphic Design in America  (1997), determined that professional status is achieved through education, self-imposed standards and professional gate-keeping organizations. [18]  Having achieved this, interior design became an accepted profession. \n Interior decorators and interior designers [ edit ] \nInterior design in a restaurant \n Interior design is the art and science of understanding people's behavior to create functional spaces within a building. Decoration is the furnishing or adorning of a space with fashionable or beautiful things. In short, interior designers may decorate, but decorators do not design. [21] \n Interior designer [ edit ] \n Interior designer implies that there is more of an emphasis on planning,  functional design  and the effective use of space, as compared to interior decorating. An interior designer can undertake projects that include arranging the basic layout of spaces within a building as well as projects that require an understanding of technical issues such as window and door positioning,  acoustics , and  lighting . [1]  Although an interior designer may create the layout of a space, they may not alter load-bearing walls without having their designs stamped for approval by a structural engineer. Interior designers often work directly with architects, engineers and contractors. \n Interior designers must be highly skilled in order to create interior environments that are functional, safe, and adhere to building codes, regulations and ADA requirements. They go beyond the selection of color palettes and furnishings and apply their knowledge to the development of construction documents, occupancy loads, healthcare regulations and sustainable design principles, as well as the management and coordination of professional services including mechanical, electrical, plumbing, and life safety—all to ensure that people can live, learn or work in an innocuous environment that is also aesthetically pleasing. \n Someone may wish to specialize and develop technical knowledge specific to one area or type of interior design, such as residential design, commercial design, hospitality design, healthcare design, universal design, exhibition design, furniture design, and spatial branding. Interior design is a creative profession that is relatively new, constantly evolving, and often confusing to the public. It is not an artistic pursuit and relies on research from many fields to provide a well-trained understanding of how people are influenced by their environments. \n Color in interior design [ edit ] \n Color is a powerful design tool in decoration, as well as in interior design which is the art of composing, and coordinating colors together to create a stylish scheme on the interior architecture of the space. [22] \n It is essential to interior designers to acquire a deep experience with colors, understand their psychological effects, and understand the meaning of each color in different locations and situations in order to create suitable combinations for each place. [23] \n Combining colors together could result in creating a state of mind as seen by the observer, and could eventually result in positive or negative effects on them. Colors make the room feel either more calm, cheerful, comfortable or dramatic. Color combination make a tiny room seem larger or smaller. [24]  So it is the Interior designer profession to choose appropriate colors for a place in a way people want to look and feel in the space. [23] \n Specialties [ edit ] \nThe interior of a private residence. \nAn electric wire reel reused as a center table in a  Rio de Janeiro  decoration  fair . \n Residential [ edit ] \n Residential design is the design of the interior of private residences. As this type design is very specific for individual situations, the needs and wants of the individual are paramount in this area of interior design. The interior designer may work on the project from the initial planning stage or may work on the remodelling of an existing structure. It is often a very involved process that takes months to fine-tune and create a space with the vision of the client. [25] \n Commercial [ edit ] \n Commercial design encompasses a wide range of subspecialties. \n Retail: includes malls and shopping centers, department stores, specialty stores, visual merchandising, and showrooms. \n Visual and spatial branding: The use of space as a medium to express a corporate brand. \n Corporate: office design for any kind of business such as banks. \n Healthcare: the design of hospitals, assisted living facilities, medical offices, dentist offices, psychiatric facilities, laboratories, medical specialist facilities. \n Hospitality and recreation: includes hotels, motels, resorts, cruise ships, cafes, bars, casinos, nightclubs, theaters, music and concert halls, opera houses, sports venues, restaurants, gyms, health clubs and spas, etc. \n Institutional: government offices, financial institutions (banks and credit unions), schools and universities, religious facilities, etc. \n Industrial facilities: manufacturing and training facilities as well as import and export facilities. [25] \n Exhibition: includes museums, gallery, exhibition hall, specially the design for showroom and exhibition gallery. \n Traffic building: includes bus station, subway station, airports, pier, etc. \n Sports: includes gyms, stadiums, swimming rooms, basketball halls, etc. \n Teaching in a private institute that offer classes of interior design \n Self-employment \n Employment in private sector firms \n Other [ edit ] \n Other areas of specialization include amusement and theme park design, museum and exhibition design,  exhibit design , event design (including ceremonies, weddings, baby and bridal showers, parties, conventions, and concerts), interior and prop styling, craft styling, food styling, product styling, tablescape design, theatre and performance design, stage and set design,  scenic design , and  production design  for film and television. Beyond those, interior designers, particularly those with graduate education, can specialize in healthcare design, gerontological design, educational facility design, and other areas that require specialized knowledge. Some university programs offer graduate studies in theses and other areas. For example, both  Cornell University  and the  University of Florida  offer interior design graduate programs in environment and behavior studies. \n Profession [ edit ] \nInstallment by L. Gargantini for the Bolzano fair, 1957. Photo by  Paolo Monti  (Fondo Paolo Monti,  BEIC ). \n Education [ edit ] \n Main article:  Interior design education \n There are various paths that one can take to become a professional interior designer. All of these paths involve some form of training. Working with a successful professional designer is an informal method of training and has previously been the most common method of education. In many states, however, this path alone cannot lead to licensing as a professional interior designer. Training through an institution such as a college, art or design school or university is a more formal route to professional practice. \n In the UK and the U.S, several university degree courses are now available, including those on interior architecture, taking three or four years to complete. \n A formal education program, particularly one accredited by or developed with a professional organization of interior designers, can provide training that meets a minimum standard of excellence and therefore gives a student an education of a high standard. There are also university graduate and Ph.d. programs available for those seeking further training in a specific design specialization (i.e. gerontological or healthcare design) or those wishing to teach interior design at the university level. \n Working conditions [ edit ] \n There are a wide range of working conditions and employment opportunities within interior design. Large and tiny corporations often hire interior designers as employees on regular working hours. Designers for smaller firms and  online renovation platforms  usually work on a contract or per-job basis. Self-employed designers, which make up 26% of interior designers, [26]  usually work the most hours. Interior designers often work under stress to meet deadlines, stay on budget, and meet clients' needs. \n In some cases, licensed professionals review the work and sign it before submitting the design for approval by clients or construction permisioning. The need for licensed review and signature varies by locality, relevant legislation, and scope of work. Their work can involve significant travel to visit different locations. However, with technology development, the process of contacting clients and communicating design alternatives has become easier and requires less travel. [27]  They also renovate a space to satisfy the specific taste for a client. \n Styles [ edit ] \n Art Deco [ edit ] \n Terracotta   Art Deco   sunburst design  above front doors of the  Eastern Columbia Building  in Los Angeles; built 1930. \n The  Art Deco  style began in Europe in the early years of the 20th century, with the waning of  Art Nouveau . The term \"Art Deco\" was taken from the Exposition Internationale des Arts Decoratifs et Industriels Modernes, a world’s fair held in Paris in 1925. [28]  Art Deco rejected many traditional classical influences in favour of more streamlined geometric forms and metallic color. The Art Deco style influenced all areas of design, especially interior design, because it was the first style of interior decoration to spotlight new technologies and materials. [29] \n Art Deco style is mainly based on geometric shapes, streamlining, and clean lines. [30] [31]  The style offered a sharp, cool look of mechanized living utterly at odds with anything that came before. [32] \n Art Deco rejected traditional materials of decoration and interior design, opting instead to use more unusual materials such as  chrome ,  glass ,  stainless steel , shiny fabrics,  mirrors ,  aluminium ,  lacquer ,  inlaid wood ,  sharkskin , and zebra skin. [29]  The use of harder, metallic materials was chosen to celebrate the machine age. These materials reflected the dawning modern age that was ushered in after the end of the  First World War . The innovative combinations of these materials created contrasts that were very popular at the time - for example the mixing together of highly polished wood and black lacquer with satin and furs. [33]  The barber shop in the Austin Reed store in London was designed by P. J. Westwood. It was soon regarded as the trendiest barber shop in Britain due to its use of metallic materials. [32] \n The color themes of Art Deco consisted of metallic color, neutral color, bright color, and black and white. In interior design, cool metallic colors including silver, gold, metallic blue, charcoal grey, and platinum tended to predominate. [30] [34]   Serge Chermayeff , a Russian-born British designer made extensive use of cool metallic colors and luxurious surfaces in his room schemes. His 1930 showroom design for a British dressmaking firm had a silver-grey background and black mirrored-glass wall panels. [32] [35] \n Black and white was also a very popular color scheme during the 1920s and 1930s. Black and white checkerboard tiles, floors and wallpapers were very trendy at the time. [36]  As the style developed, bright vibrant colors became popular as well. [37] \n Art Deco furnishings and lighting fixtures had a glossy, luxurious appearance with the use of inlaid wood and reflective finishes. The furniture pieces often had curved edges, geometric shapes, and clean lines. [28] [32]  Art Deco lighting fixtures tended to make use of stacked geometric patterns. [38] \n Modern Art [ edit ] \n \"Modern design grew out of the decorative arts, mostly from the  Art Deco , in the early 20th century.\" [39]  One of the first to introduce this style was  Frank Lloyd Wright , who hadn't become hugely popularized until completing the house called  Fallingwater  in the 1930s. \"Modern art reached its peak in the 1950s and 60s which is why designers and decorators today may refer to modern design as being \"mid-century.\" [39]  Modern Art does not refer to the era or age of design. \"Modern art is not the same as contemporary design, which is a term that interior designers apply to a shifting group of recent styles and trends.\" [39] \n Arab Materials [ edit ] \n “ Majlis  painting”, also called  nagash painting , is the decoration of the  majlis  or front parlor of traditional Arabic homes in the  Asir  province of  Saudi Arabia  and adjoining parts of  Yemen  These wall paintings, an  arabesque  form of  mural  or  fresco , show various geometric designs in bright colors: “Called 'nagash' in Arabic, the wall paintings were a mark of pride for a woman in her house.” [40] \n The geometric designs and heavy lines seem to be adapted from the area’s textile and weaving patterns. “In contrast with the sobriety of architecture and decoration in the rest of Arabia, exuberant color and ornamentation characterize those of 'Asir. The painting extends into the house over the walls and doors, up the staircases, and onto the furniture itself. When a house is being painted, women from the community help each other finish the job. The building then displays their shared taste and knowledge. Mothers pass these on to their daughters. This artwork is based on a  geometry  of straight lines and suggests the patterns common to textile  weaving , with solid bands of different colors. Certain motifs reappear, such as the triangular  mihrab  or 'niche' and the  palmette . In the past, paint was produced from mineral and vegetable  pigments .  Cloves  and  alfalfa  yielded green. Blue came from the  indigo  plant. Red came from  pomegranates  and a certain mud.  Paintbrushes  were created from the tough hair found in a goat's tail. Today, however, women use modern manufactured paint to create new looks, which have become an indicator of social and economic change.” [41] \n Women in the Asir province often complete the decoration and painting of the house interior. “You could tell a family’s wealth by the paintings,”  Um Abdullah  says: “If they didn’t have much money, the wife could only paint the  motholath ,” the basic straight, simple lines, in patterns of three to six repetitions in red, green, yellow and brown.” When women did not want to paint the walls themselves, they could  barter  with other women who would do the work. Several Saudi women have become famous as majlis painters, such as  Fatima Abou Gahas . [40] \n The interior walls of the home are brightly painted by the women, who work in defined patterns with lines, triangles, squares, diagonals and tree-like patterns. “Some of the large triangles represent mountains. Zigzag lines stand for water and also for lightning. Small triangles, especially when the widest area is at the top, are found in pre-Islamic representations of female figures. That the small triangles found in the wall paintings in ‘Asir are called banat may be a cultural remnant of a long-forgotten past.” [40] \n \" Courtyards  and upper pillared  porticoes  are principal features of the best Nadjdi architecture, in addition to the fine incised plaster wood ( jiss ) and painted window shutters, which decorate the reception rooms. Good examples of plasterwork can often be seen in the gaping ruins of torn-down buildings- the effect is light, delicate and airy. It is usually around the  majlis , around the coffee hearth and along the walls above where guests sat on rugs, against cushions. Doughty wondered if this \" parquetting  of jis\", this \" gypsum  fretwork... all adorning and unenclosed\" originated from  India . However, the Najd fretwork seems very different from that seen in the Eastern Province and  Oman , which are linked to Indian traditions, and rather resembles the  motifs  and patterns found in ancient  Mesopotamia . The rosette, the star, the triangle and the stepped pinnacle pattern of dadoes are all ancient patterns, and can be found all over the  Middle East  of antiquity.  Al-Qassim Province  seems to be the home of this art, and there it is normally worked in hard white  plaster  (though what you see is usually begrimed by the smoke of the coffee hearth). In  Riyadh , examples can be seen in unadorned  clay . [42] \n Media popularization [ edit ] \n Main article:  Interior design magazine \n Interior design has become the subject of  television  shows. In the  United Kingdom  (UK), popular interior design and decorating programs include  60 Minute Makeover  ( ITV ),  Changing Rooms  ( BBC ), and  Selling Houses  ( Channel 4 ). Famous interior designers whose work is featured in these programs include  Linda Barker  and  Laurence Llewelyn-Bowen . In the  United States , the  TLC Network  aired a popular program called  Trading Spaces , a show based on the UK program  Changing Rooms . In addition, both  Home & Garden Television ( HGTV )  and the  Discovery Home  networks also televise many programs about interior design and decorating, featuring the works of a variety of interior designers, decorators and home improvement experts in a myriad of projects. \n Fictional interior decorators include the Sugarbaker sisters on  Designing Women  and  Grace Adler  on  Will & Grace . There is also another show called  Home MADE . There are two teams and two houses and whoever has the designed and made the worst room, according to the judges, is eliminated. Another show on the  Style Network , hosted by  Niecy Nash , is  Clean House  where they re-do messy homes into themed rooms that the clients would like. Other shows include  Design on a Dime ,  Designed to Sell , and  The Decorating Adventures of Ambrose Price . The show called  Design Star  has become more popular through the 5 seasons that have already aired. The winners of this show end up getting their own TV shows, of which are  Color Splash  hosted by  David Bromstad ,  Myles of Style  hosted by  Kim Myles ,  Paint-Over!  hosted by  Jennifer Bertrand ,  The Antonio Treatment  hosted by Antonio Ballatore, and finally  Secrets from a Stylist  hosted by  Emily Henderson .  Bravo  also has a variety of shows that explore the lives of interior designers. These include  Flipping Out , which explores the life of  Jeff Lewis  and his team of designers;  Million Dollar Decorators  explores the lives of interior designers  Nathan Turner , Jeffrey Alan Marks, Mary McDonald, Kathryn Ireland, and  Martyn Lawrence Bullard . \n Interior design has also become the subject of  radio  shows. In the U.S., popular interior design & lifestyle shows include  Martha Stewart Living  and  Living Large  featuring Karen Mills. Famous interior designers whose work is featured on these programs include Bunny Williams,  Barbara Barry , and  Kathy Ireland , among others. \n Many interior design magazines exist to offer advice regarding color palette, furniture, art, and other elements that fall under the umbrella of interior design. These magazine often focus on related subjects to draw a more specific audience. For instance, architecture as a primary aspect of  Dwell , while  Veranda  is well known as a luxury living magazine.  Lonny Magazine  and the newly relaunched,  Domino Magazine , cater to a young, hip, metropolitan audience, and emphasize accessibility and a do-it-yourself ( DIY ) approach to interior design. \n Interior design examples [ edit ] \n Hotel San Domenico in Taormina \n Villa del Balbianello \n Apothecary room \n Lenno Villa \n A salong \n Bar in  Rotterdam \n Balboa Bay Club \n Springer- Hochhaus \n Birendra rana house :- \n Notable interior decorators [ edit ] \n Main pages:  Category:Interior designers  and  Category:Interior design firms \n See also:  Category:Interior designers by nationality \n Other early interior decorators: \n Sibyl Colefax \n Dorothy Draper \n Pierre François Léonard Fontaine \n Syrie Maugham \n Margery Hoffman Smith \n Elsie de Wolfe \n Arthur Stannard Vernay \n Frank Lloyd Wright \n Many of the most famous designers and decorators during the 20th century had no formal training. Some examples include  Sister Parish ,  Robert Denning  and  Vincent Fourcade ,  Kerry Joyce ,  Kelly Wearstler ,  Stéphane Boudin ,  Georges Geffroy ,  Emilio Terry ,  Carlos de Beistegui ,  Nina Petronzio ,  Lorenzo Mongiardino , and  David Nightingale Hicks . \n Notable interior designers in the world today include  Scott Salvator ,  Jonathan Adler ,  Michael S. Smith ,  Martin Brudnizki ,  Kelly Hoppen ,  Kelly Wearstler ,  Andrew Martin International ,  Nina Campbell ,  David Collins ,  Nate Berkus ,  Sandra Espinet ,  Jo Hamilton  and  Nicky Haslam . \n See also [ edit ] \n Design portal \n American Society of Interior Designers \n Blueprint \n British Institute of Interior Design \n Environmental psychology  and  Interior design psychology \n Experiential interior design \n Fuzzy architectural spatial analysis \n Interior architecture \n 1960s decor \n Window treatment \n Getty Designs  - interior design photo bank \n Interior design regulation in the United States \n Japanese Interior Design \n Wall decals \n Primitive decorating \n Chartered Society of Designers  incorporating the British Institute of Interior Design as of 1988 (formerly the Incorporated Institute of British Decorators founded 1894) \n Worshipful Company of Painters and Stainers granted Inspeximus in 1466 with origins \n References and sources [ edit ] \n ^  a   b   Pile, J., 2003, Interior Design, 3rd edn, Pearson, New Jersey, USA \n ^   Brief History of Interior Design (2007) Retrieved December 7, 2012, from www.interior-design-school.net \n ^   Blakemore, R.G.  History of Interior Design Furniture: From Ancient Egypt to Nineteenth-Century Europe . J. Wiley, 2006, p. 4. \n ^  a   b   \"Completkadgha;slkdgh;sakgkhas;gjksa e House Furnishers: The Retailer as Interior Designer in Nineteenth-Century London\" .  Journal of Interior Design .  38 : 1–17.  doi : 10.1111/joid.12000 . Retrieved  2012-12-17 .     line feed character in  |title=  at position 36 ( help ) \n ^   \"Amanda Girling-Budd's Statement\" . Retrieved  2012-12-17 .   \n ^   Howe, Katherine S.  Herter Brothers: Furniture and Interiors for a Gilded Age.  Harry N. Abrams: Metropolitan Museum of Art in association with the Museum of Fine Arts, Houston, 1994.  ISBN   0-8109-3426-4 .1994 \n ^   Clouse, Doug. \"The Handy Book of Artistic Printing: Collection of Letterpress Examples with Specimens of Type, Ornament, Corner Fills, Borders, Twisters, Wrinklers, and other Freaks of Fancy\". Princeton Architectural Press, 2009. p. 179. \n ^   Clouse, Doug. \"The Handy Book of Artistic Printing: Collection of Letterpress Examples with Specimens of Type, Ornament, Corner Fills, Borders, Twisters, Wrinklers, and other Freaks of Fancy\". Princeton Architectural Press, 2009. p. 66 \n ^   Clive Edwards (2005).  Turning Houses Into Homes: A History of the Retailing and Consumption of Domestic Furnishings . Ashgate Publishing, Ltd . Retrieved  2013-02-07 .   \n ^   Gillian Perry (1999).  Gender and Art . Yale University Press . Retrieved  2013-02-07 .   \n ^   \"History\" . Retrieved  2012-12-17 .   \n ^   \"Garrett sisters\" . DNB.   \n ^   The Illustrated Carpenter and Builder, December 7 (1900): Suppl. 2 \n ^   \"Edith Wharton's World\"  National Portrait Gallery \n ^   Flanner, J. (2009).  \"Archive, Handsprings Across the Sea\" . The New Yorker . Retrieved  August 10,  2011 .   \n ^   Munhall, Edward.  \"Elsie de Wolf: The American pioneer who vanquished Victorian gloom\" . Architectural Digest . Retrieved  27 October  2011 .   \n ^   Gray, Christopher (2003), \"Streetscapes/Former Colony Club at 120 Madison Avenue; Stanford White Design, Elsie de Wolfe Interior,\"  The New York Times , 28 September 2003  [1] \n ^  a   b   c   d   e   Lees-Maffei, G, 2008, Introduction: Professionalization as a focus in Interior Design History, Journal of Design History, Vol. 21, No. 1, Spring. \n ^   Plunket, Robert. \"Syrie's Turn: Once, everyone read W. Somerset Maugham. But now his late ex-wife is the one selling books\",  Sarasota Magazine , 2006, v. 10. \n ^   Pauline C. Metcalf (2010).  Syrie Maugham: Staging the Glamorous Interiors . Acanthus PressLlc . Retrieved  2013-02-07 .   \n ^   \"The key differences between Designers and Decorators\" .  The Kids Bedroom Co . Retrieved  2017-05-26 .   \n ^   \"Color Wheel, Color Schemes, Color Therapy, Colors by Interiordezine\" .  www.interiordezine.com . Retrieved  2016-10-19 .   \n ^  a   b   \"The Psychology of Color for Interior Design – Interior Design, Design News and Architecture Trends\" .  designlike.com . Retrieved  2016-10-19 .   \n ^   \"The Psychology of Color\" .  HGTV . Retrieved  2016-10-19 .   \n ^  a   b   Piotrowski, C, 2004, Becoming an Interior Designer, John Wiley & Sons, New Jersey, USA \n ^   \"Employment.\" Occupational Outlook Handbook: 2008-09 Edition,  US Department of Labor \n ^   \"Industrial Design Industry Report\" . ibisworld.com. July 17, 2008.   \n ^  a   b   Tinniswood, Adrian. The Art Deco House: Avant-Garde House of the 1920s and 1930s. Watsonguptill publishing company. New York. 2002 \n ^  a   b   Striner, Richard. \"Art Deco: Polemics and Synthesis\". WInterthur portfolio, Vol 25. No. 1 spring, 1990. PP. 26-34. \n ^  a   b   Beusterien, John. Rodriguez, EduardoLuis. Narciso G. The Architectural Avant-Garde: From Art Deco to Modern Regionalism. The Journal of Decorative and Propaganda Arts, Vol. 22, Cuba Theme Issue (1996), PP. 254-277 \n ^   Stanley, Meisler. ’Art Deco: High Style. Smithsonian’, Nov 2004, Vol. 35 Issue 8, PP 57-60 \n ^  a   b   c   d   Bayer, Patricia, Art Deco Interiors: Decoration and Design Classics of the 1920s and 1930s, Thames & Hudson, London 1990 \n ^   Yang, Jian. \"Art Deco 1910-39\". Craft Arts International, 2003, Issue 59, PP. 84-87. \n ^   Tinniswood, Adrian. ‘The Art Deco House: Avant-Garde House of the 1920s and 1930s’. Watsonguptill publishing company. New York. 2002 \n ^   Striner, Richard. ‘Art Deco: Polemics and Synthesis’. WInterthur portfolio, Vol 25. No. 1 ( spring, 1990). PP. 26-34. \n ^   Yang, Jian. ‘Art Deco 1910-39’. Craft Arts International, 2003, Issue 59, PP. 84-87. \n ^   Rossi, David. ‘Art Deco Renaissance’. Silvester-Carr, Denise. History Today, Jul, Vol. 49. Issue 7. PP.4-6 \n ^   Duncan, Alastair. \"Art Deco Lighting\". The Journal of Decorative and Propaganda Arts. Vol. 1 (spring. 1986). PP. 20-31 \n ^  a   b   c   \"About Modern Interior Design\" .  Home Guides | SF Gate . Retrieved  2015-12-10 .   \n ^  a   b   c   Yunis, Alia, \"The Majlis Painters,\"  Saudi Aramco World Magazine, July/August 2013, pages 24-31. \n ^   Maha Al Faisal and Khalid Azzam. 1999. \"Doors of the Kingdom\" Saudi Aramco World. This article appeared on pages 68-77 of the January/February 1999 print edition of Saudi Aramco World#  http://www.saudiaramcoworld.com/issue/199901/doors.of.the.kingdom.htm \n ^   Mostyn, Trevor. 1983. Saudi Arabia. London: Middle East Economic Digest. Pages 257-258. \n External links [ edit ] \n Candace Wheeler: The Art and Enterprise of American Design, 1875-1900 , a full text exhibition catalog from The Metropolitan Museum of Art, which includes a great deal of content about early interior design \n Wikimedia Commons has media related to  Interior design . \n v \n t \n e \n Design \n Outline \n Portal \n Designer \n Disciplines \n Communication \ndesign \n Advertising \n Book design \n Corporate design \n Exhibit design \n Film title design \n Graphic design \n Motion \n Postage stamp design \n Print design \n Illustration \n Information design \n Instructional design \n News design \n Photography \n Retail design \n Signage  /  Traffic sign design \n Typography  /  Type design \n Video design \n Visual merchandising \n Environmental \ndesign \n Architecture \n Architectural lighting design \n Building design \n Passive solar \n Ecological design \n Environmental impact design \n Garden design \n Computer-aided \n Healthy community design \n Hotel design \n Interior architecture \n Interior design \n EID \n Keyline design \n Landscape architecture \n Sustainable \n Landscape design \n Spatial design \n Urban design \n Industrial \ndesign \n Automotive design \n Automotive suspension design \n CMF design \n Corrugated box design \n Electric guitar design \n Furniture design \n Sustainable \n Hardware interface design \n Motorcycle design \n Packaging and labeling \n Photographic lens design \n Product design \n Production design \n Sensory design \n Service design \n Interaction \ndesign \n Experience design \n EED \n Game design \n Level design \n Video game design \n Hardware interface design \n Icon design \n Immersive design \n Information design \n Sonic interaction design \n User experience design \n User interface design \n Web design \n Other \n applied arts \n Public art design \n Ceramic  /  glass design \n Fashion design \n Costume design \n Jewelry design \n Floral design \n Game art design \n Property design \n Scenic design \n Sound design \n Stage/set lighting design \n Textile design \n Other \ndesign \n&  engineering \n Algorithm design \n Boiler design \n Conceptual design \n Database design \n Drug design \n Electrical system design \n Experimental design \n Filter design \n Job design \n Integrated circuit design \n Circuit design \n Physical design \n Power network design \n Mechanism design \n Nuclear weapon design \n Nucleic acid design \n Organization design \n Process design \n Processor design \n Protein design \n Research design \n Social design \n Software design \n Spacecraft design \n Strategic design \n Systems design \n Approaches \n Activity-centered \n Adaptive web \n Affective \n Brainstorming \n By committee \n By contract \n C-K theory \n Closure \n Co-design \n Concept-oriented \n Configuration \n Contextual \n Continuous \n Cradle-to-cradle \n Creative problem-solving \n Creativity techniques \n Critical \n Design fiction \n Defensive \n Design–bid–build \n Design–build \n architect-led \n Domain-driven \n Ecodesign \n Energy neutral \n Engineering design process \n Probabilistic design \n Error-tolerant \n Fault-tolerant \n Framework-oriented \n For assembly \n For behaviour change \n For manufacturability \n For Six Sigma \n For testing \n For X \n Functional \n Generative \n Geodesign \n High-level \n Integrated \n Integrated topside \n Intelligence-based \n Iterative \n KISS principle \n Low-level \n Metadesign \n Mind mapping \n Modular \n New Wave \n Object-oriented \n Open \n Parametric \n Participatory \n Platform-based \n Policy-based \n Process-centered \n Public interest \n Rational \n Regenerative \n Reliability engineering \n Research-based \n Responsibility-driven \n RWD \n Safe-life \n Sustainable \n Systemic \n SOD \n Tableless web \n Theory of constraints \n Top-down and bottom-up \n Transformation \n Transgenerational \n TRIZ \n Universal \n Design for All \n Usage-centered \n Use-centered \n User-centered \n Empathic \n User innovation \n Value-driven \n Value sensitive \n Privacy by \n Design  choice \n computing \n controls \n flow \n leadership \n management \n marker \n methods \n pattern \n research \n science \n strategy \n theory \n thinking \n Tools \n Intellectual property \n Organizations \n Awards \n Tools \n AAD \n Architectural model \n Blueprint \n Comprehensive layout \n CAD \n CAID \n Virtual home design software \n CAutoD \n Design quality indicator \n Electronic design automation \n Flowchart \n Mockup \n Product design specification \n Prototype \n Sketch \n Storyboard \n Technical drawing \n Web design program \n Website wireframe \n Intellectual \nproperty \n Community design \n Design around \n Design patent \n Geschmacksmuster \n Industrial design rights \n European Union \n Organizations \n AIGA \n Chartered Society of Designers \n Design and Industries Association \n Design Council \n International Forum Design \n The Design Society \n Design Research Society \n Awards \n European Design Award \n German Design Award \n Good Design Award (Chicago) \n Good Design Award (Japan) \n Graphex \n IF product design award \n James Dyson Award \n Prince Philip Designers Prize \n Related topics \n Aesthetics \n Agile \n Concept art \n Creative industries \n Cultural icon \n .design \n Enterprise architecture \n Futures studies \n Innovation Management \n Intelligent design \n Lean Startup \n New product development \n OODA Loop \n Philosophy of design \n Process simulation \n Slow design \n STEAM fields \n Unintelligent design \n Visualization \n Wicked problem \n Design  brief \n change \n classic \n director \n education \n elements and principles \n engineer \n firm \n history \n knowledge \n language \n life \n load \n museum \n paradigm \n rationale \n review \n specification \n studio \n technology \n Commons \n Wikibooks \n Wikinews \n Wikiquote \n Wikisource \n Wiktionary \n Authority control \n GND :  4072819-5 \n NDL :  00571298 \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Interior_design&oldid=810078059 \"\t\t\t\t\t \n Categories :  Interior design Architectural design Decorative arts Home economics Hidden categories:  CS1 errors: invisible characters Articles with limited geographic scope from January 2011 Anglophone-centric Commons category with local link different than on Wikidata Wikipedia articles with GND identifiers   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article \n Talk \n Variants \n Views \n Read \n Edit \n View history \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons   \n Languages \n العربية Català Čeština Cymraeg Deutsch Eesti Español Euskara فارسی Français 한국어 Հայերեն हिन्दी Bahasa Indonesia Italiano עברית Kiswahili Lietuvių Македонски 日本語 Polski Português Română Русский Simple English Slovenčina Српски / srpski Srpskohrvatski / српскохрватски Suomi Svenska Tagalog தமிழ் తెలుగు ไทย Türkçe Українська اردو Tiếng Việt Winaray 中文   \n Edit links   \n  This page was last edited on 13 November 2017, at 06:33. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}