{"url": "https://dbaron.org/", "content": "David Baron \n David Baron \n dbaron@dbaron.org \n\tI work for  Mozilla \n\ton the code used to display Web pages in various Mozilla products,\n\tincluding  Firefox .\n\tI've been  involved  with\n\tthe  Mozilla  project since 1998,\n\tand working full-time on Mozilla since 2003.\n\tI'm also quite interested in Web standards, and I'm on the\n\t W3C 's\n\t CSS  working group.\n\tI graduated from  Harvard  in\n\t Computer\n\tScience  after the fall 2002 semester (i.e., March 2003),\n\talthough I started off as a  Physics  major and took a\n\tbunch of  Economics \n\tclasses along the way.\n\tI have a  web log  which\n\tI update occasionally, and I post some  photos  online (and\n\tI've been\n geotagging them ),\n\tI post  photos of\n\tpeople  separately,\n\tI say brief things  on\n\ttwitter , and a significant portion of the code I write is\n\tvisible\n\t on GitHub .\n\tI also have a bunch of collected information on various web-related\n\ttopics.  The biggest collection is on the topic I know the most\n\tabout, so I have many  things I've written about\n\tCSS  including  tests  and the  results  of those tests (although the\n\ttests have gotten a little out of date).  I also have a good bit of\n\t stuff related to my work on Mozilla .  I also\n\thave some  miscellaneous WWW-related stuff , a few\n\t things related to the DOM  including some  tests .\n\tI've collected lots of bookmarks over the years, and for a while I\n\twas storing them on the Web, although I haven't updated them for a\n\tnumber of years.  The  general links  are\n\tprobably the least interesting to most people.  I used to be very\n\tinterested in the weather (although I've been less interested since\n\tthe late 90's), and I made an effort to collect lots of\n\tweather-related links, so my  weather and climate\n\tlinks  may be more interesting.  Within that, I put the most\n\teffort into making my page on  weather satellite\n\timages  useful for other people, but my pages on  tropical weather  and on local weather in\n\t Philadelphia ,  Boston , and  the San\n\tFrancisco Bay area  may also be useful.\n\t(Most of these pages haven't been touched since 2002 or so, though.)\n\tIf you're interested, you can read a bit  more about\n\tme  and you can read  my views  on various\n\tissues.  You can also see the  homepage  to which I\n\tpoint my browsers.\n dbaron@dbaron.org \n ( Copyright, etc. )"}