{"url": "http://parcolympique.qc.ca/./salle-de-presse/", "content": "Salle de presse |  Parc olympique de Montréal \n Notre organisme \n Comment se rendre \n FAQ \n English \n Menu Le Parc La Tour de Montréal L'Esplanade Financière Sun Life Le Stade Le Centre sportif Autres attraits  Close Nouvelles Activités Événements Parcours touristiques Organiser un événement \n Nouvelles \n Navigation des articles \n ←  Articles plus anciens \n Inauguration de la place Nadia-Comaneci \n\t\t\t\tPublié le  4 octobre 2017  dans  Salle de presse   \n Le président-directeur général du Parc olympique, Michel Labrecque, a procédé à l'inauguration de la place Nadia-Comaneci en compagnie de l’athlète dont elle porte le nom, la reine des Jeux de 1976 elle-même, présente pour l’occasion. Inauguré en 1986 en l’honneur notamment des[...]  En savoir plus » \n Historique, architecturale, urbaine et emblématique : quatre valeurs patrimoniales décernées au Parc olympique \n\t\t\t\tPublié le  29 septembre 2017  dans  Salle de presse   \n Le Parc olympique dévoile les résultats de l’étude patrimoniale de ses installations par Docomomo Québec, pilotée par Mme France Vanlaethem, professeure émérite à l’École de design de l’Université du Québec à Montréal et présidente fondatrice de l’organisme. Le document, de[...]  En savoir plus » \n Programmation estivale 2017 sur l’Esplanade Financière Sun life : une sixième année bien remplie \n\t\t\t\tPublié le  2 juin 2017  dans  Salle de presse   \n C’est aujourd’hui qu’est dévoilée la sixième programmation estivale de l’Esplanade Financière Sun Life du Parc olympique. Une fois encore, l’Esplanade du Parc olympique, seul pôle récréotouristique situé à l’est de la rue Saint-Denis, présentera à ses visiteurs des activités basées[...]  En savoir plus » \n Le Parc olympique au Défilé de la Fête nationale : Il était une fois… une ville olympique.     \n\t\t\t\tPublié le  29 mai 2017  dans  Salle de presse   \n Dans le cadre de la thématique du Défilé de la Fête nationale 2017,  « Il était une fois... », le Parc olympique a accepté l’invitation du comité organisateur de s’associer à la présentation d’un char allégorique soulignant l’héritage sportif de la[...]  En savoir plus » \n Le Parc olympique présente Depuis 1976, une exposition relatant les 40 ans d’histoire événementielle du Stade olympique de Montréal \n\t\t\t\tPublié le  23 mai 2017  dans  Salle de presse   \n Le Parc olympique de Montréal a inauguré officiellement son exposition permanente  intitulée Depuis 1976, relatant les 40 ans d’histoire événementielle du Stade olympique, au Hall touristique de la Tour de Montréal. Cette exposition offerte aux visiteurs d’ici et d’ailleurs, comporte[...]  En savoir plus » \n Près de trente ans après son inauguration, le funiculaire de la Tour de Montréal célèbre son millionième voyage \n\t\t\t\tPublié le  23 décembre 2016  dans    \n Montréal, le 23 décembre 2016 – Après 29 ans d’opération, le funiculaire de la Tour de Montréal a effectué aujourd’hui son millionième voyage au sommet de la Tour de Montréal. Cet imposant ascenseur vitré, pouvant accueillir sur ses deux niveaux[...]  En savoir plus » \n L'Esplanade Financière Sun Life du Parc olympique accueillera les championnats canadiens de planche à roulettes sur un nouveau parc à planche permanent dès l'été 2017 \n\t\t\t\tPublié le  4 juillet 2016  dans  Salle de presse   \n Un nouveau chapitre sportif s'ouvre sur l'Esplanade Financière Sun Life du Parc olympique. Dès l'été 2017, le site accueillera les championnats canadiens de planche à roulettes, présenté par la World Skateboarding Federation (WSF), dans un nouveau parc à planche permanent[...]  En savoir plus » \n Le Parc olympique dévoile sa programmation spéciale pour son 40e anniversaire \n\t\t\t\tPublié le  21 mars 2016  dans  Salle de presse   \n Montréal, le lundi 21 mars 2016 – Le Parc olympique de Montréal souligne ses 40 ans en grand! Pour l’occasion, une programmation originale et riche en événements de toutes sortes a été concoctée, en collaboration avec divers partenaires, afin de[...]  En savoir plus » \n Pour la première fois de son histoire, la Tour de Montréal accueille son premier locataire, près de 30 ans après son parachèvement \n\t\t\t\tPublié le  7 mars 2016  dans    \n Montréal, le lundi 7 mars 2016 – Un nouveau chapitre s’ouvre dans l’histoire du Parc olympique de Montréal. Près de 30 ans après son inauguration en 1987, la Tour de Montréal accueillera en 2018, et ce pour une durée initiale[...]  En savoir plus » \n La Tour du Parc olympique s'éclaire en bleu, blanc et rouge en soutien au peuple français \n\t\t\t\tPublié le  14 novembre 2015  dans    \n Montréal, le 14 novembre 2015 - Ce samedi 14 novembre, dès la tombée du jour, la niche et l’échine de la Tour de Montréal du Parc olympique s'illumineront en bleu, blanc et rouge, couleurs du drapeau de la France. Il[...]  En savoir plus » \n Articles plus anciens »   \n Derniers articles \n Revivre une autre Expérience ! \n Le grand retour de l’OSM au Parc olympique \n Changez de vie en devenant plus actif \n Maîtrisez votre chi grâce à la slackline \n Vroum-Vroum-Vroum sur mon ti-bicyle… \n Cinq raisons (de plus) de se rendre à l'Écosphère \n Aidez l’environnement, une poussée à la fois! \n Bien choisir sa chaussure de course \n La programmation estivale en cinq questions \n La première flamme olympique électronique \n Catégories \n Patrimoine  (6)\n Plaisirs  (15)\n Sports  (20)\n Le Stade \n La Tour de Montréal \n L'Esplanade \n Le Centre sportif \n Autres attraits \n Comment se rendre \n À propos \n Partenaires \n Bon voisinage \n Salle de presse \n Offres d'emploi \n Règlement   \n Contactez-nous \n\t\t\t\t\t4141, avenue Pierre-De Coubertin \r\n\t\t\t\t\tMontréal, Québec \r\n\t\t\t\t\tH1V 3N7\r\n\t\t\t\t\tTéléphone : 514 252-4141 ou 1 877 997-0919 \r\n\t\t\t\t\tTélécopieur : 514 252-0372 \r\n\t\t\t\t\tCourriel :  rio@rio.gouv.qc.ca"}