{"url": "https://www.gerezmieuxvotreargent.ca/politique-daccessibilite-web/", "content": "Politique d’accessibilité Web | GetSmarterAboutMoney.ca \n Passer au contenu \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n A \n Utiliser une police de taille normale \n A \n Utiliser une police de grande taille \n  Contraste\t\t\t \n English \n     Menu \n A \n Utiliser une police de taille normale \n A \n Utiliser une police de grande taille \n  Contraste\t\t\t \n English \n Recherche pour: \n Search \n Investir \n Notions de base sur les placements \n Faites vos premiers pas \n Introduction multilingue \n Comprendre le risque \n Conseils financiers \n Préparer un plan \n Suivi de votre progression \n Produits d’investissement \n Rentes \n Obligations \n Placements complexes \n Fonds négociés en bourse \n Titres dispensés de prospectus \n Fonds communs de placement et fonds distincts \n Immobilier \n Obligations d’épargne \n Actions \n Régimes d’épargne et de retraite au travail \n Régimes d’epargne \n Régimes enregistrés d’épargne-études \n Régimes enregistrés d’épargne-retraite \n Fonds enregistrés de revenu de retraite \n Régimes enregistrés d’épargne-invalidité \n Comptes d’épargne libre d’impôt \n Planifier et gérer \n Notions de base sur la planification \n Comptes bancaires \n Budget \n Planification financière \n Assurance de personnes \n Comprendre l’impôt \n Gérer ses dettes \n Épargner \n Testaments et planification d’une succession \n Les vérités universelles \n Retraite \n Planification de la retraite \n Vivre votre retraite \n Régimes enregistrés d’épargne-retraite \n Fonds enregistrés de revenu de retraite \n Rentes \n Régimes d’épargne et de retraite au travail \n Conseils financiers \n Faire affaire avec un conseiller \n Trouver un conseiller \n Verification de l’inscription \n Porter plainte \n Le rendement des placements et le coût des conseils \n Événements de la vie \n Planifier votre avenir \n Acheter une maison \n Mourir \n Éducation \n Se divorcer \n Se marier \n Avoir un bébé \n Hériter de l’argent \n Planification de la retraite \n Élever une famille \n Protéger votre argent \n Avertissements à l’intention des investisseurs \n Fraude \n Se protéger contre la fraude \n Signaler une escroquerie \n Verification de l’inscription \n Protection des investisseurs \n Réglementation au Canada \n Verification de l’inscription \n Porter plainte \n Introduction du financement participatif en capital \n Le rendement des placements et le coût des conseils \n Calculatrices et outils \n Calculatrices \n Intérêts composés \n Récupérer la valeur d’un placement \n Frais associés aux fonds communs de placement \n Valeur nette \n Rembourser des dettes ou investir \n Rembourser des cartes de crédit et d’autres dettes \n Rendement d’un portefeuille par rapport à des indices de référence \n Épargne REEE \n Épargne REER \n CELI \n Outils \n Le Match monétaire mental \n Aperçu du fonds : exemple interactif \n Questionnaire sur l’amour et l’argent \n Questionnaire sur le profil de risque \n Sondage de 2014 sur l’état d’esprit des Canadiens face aux risques liés à l’argent \n Votre modèle d’énoncé de politique de placement \n Graphique Interactif – Placements \n Feuilles de calcul \n Ressources \n Publications \n Bulletin électronique \n Recherches et rapports \n Glossaire \n Fiches d’information \n Infographies \n Brochures \n Introduction multilingue \n Re: Investir \n Le rendement des placements et le coût des conseils \n Introduction du financement participatif en capital \n Home  >  Politique d’accessibilité Web \n Politique d’accessibilité Web \n Politique d’information et de communication (y compris la Politique d’accessibilité Web) \n La Politique d’information et de communication de la Commission des valeurs mobilières de l’Ontario (CVMO) est fondée sur les normes suivantes : \n La CVMO informera le public de la disponibilité de formats accessibles et d’auxiliaires de communication avant les événements qu’elle organise, afin d’avoir suffisamment de temps pour traiter les demandes et consulter les demandeurs. La CVMO répondra aux demandes de formats accessibles et d’auxiliaires de communication concernant ses documents et ses événements publics. \n La CVMO veillera à ce que les membres du public ayant des besoins en matière d’accessibilité puissent formuler des commentaires à son intention par différents moyens de communication. \n La CVMO informera le public de la disponibilité de formats accessibles et d’auxiliaires de communication sur son site Web. \n La CVMO traitera les demandes de formats accessibles et d’auxiliaires de communication pour les personnes handicapées de façon rapide et appropriée, et à un coût ne dépassant pas celui qui est habituellement payé par les autres personnes. \n La CVMO mènera des consultations auprès des personnes qui demandent des documents dans des formats accessibles, afin de déterminer la pertinence des formats accessibles qu’elle pourrait leur offrir. \n Engagement à l’égard de l’accessibilité Web \n La Commission des valeurs mobilières de l’Ontario s’est engagé à rendre les renseignements de son site Web accessibles à tous, et elle s’efforcera de mettre à jour et d’améliorer son site Web de façon continue dans le cadre de cet engagement. \n À propos de l’accessibilité sur le site Web de la CVMO \n Le site Web de la CVMO, GerezMieuxVotreArgent.ca, est conçu pour être accessible au plus vaste public possible. Il est compatible avec les principaux logiciels de lecture à l’écran et peut être consulté par des personnes qui, pour diverses raisons, ne sont pas en mesure d’utiliser une souris. Vous pouvez naviguer sur ce site au moyen du clavier de votre ordinateur ou d’autres appareils et accessoires fonctionnels. \n Personnalisation du site Web selon vos besoins \n Il existe différents moyens pour modifier l’apparence de GerezMieuxVotreArgent.ca, et en faciliter la lecture et l’utilisation. Vous pouvez agrandir ou réduire le texte et passer directement au contenu principal d’une page. La présente section vous explique comment procéder et vous fournit des renseignements sur l’accessibilité du site Web en général. \n Taille du texte \n Le présent site offre deux tailles de texte différentes (ainsi que celles offertes par la plupart des navigateurs Web). Elles sont indiquées au moyen de l’outil « Taille du texte » que vous trouverez dans la barre d’outils située dans le coin supérieur droit de chaque page. La taille du texte par défaut du site Web est la taille moyenne. \n Accès direct au contenu \n Cette fonction permet à l’utilisateur de sauter le contenu répété au début de chaque page (comme l’en-tête et la navigation) et de passer directement au contenu principal de la page. Cette fonction est particulièrement utile pour les personnes qui se servent d’un lecteur d’écran, d’un clavier ou d’un ancien navigateur mobile parce qu’elle leur permet d’éviter d’écouter ou de dérouler de longs menus chaque fois qu’elles consultent une nouvelle page. \n Pour l’essayer, rendez-vous sur une nouvelle page et appuyez sur la touche Tabulation à quelques reprises. La fonction « Passer au contenu principal » est le premier lien sur chacune des pages, et elle deviendra visible une fois sélectionnée. Si vous utilisez un navigateur mobile plus ancien, la fonction « Passer au contenu principal » est toujours visible. Appuyez sur la touche Entrée pour activer le lien. \n Autres sites Web \n Certaines des pages de notre site Web contiennent des liens vers des sites créés et tenus à jour par d’autres organisations des secteurs public et privé. Bien que les liens vous soient fournis à des fins d’information et de commodité, les pratiques d’accessibilité de ces sites peuvent différer de celles de la CVMO. Par conséquent, vous devriez consulter la politique ou l’énoncé d’accessibilité que l’on peut y trouver. \n Communiquez avec nous \n Si vous éprouvez des problèmes en utilisant notre site Web ou si vous avez des commentaires ou des suggestions qui pourraient nous aider à en améliorer l’accessibilité, écrivez-nous à l’adresse  InvestorOffice@osc.gov.on.ca . \n Dernière mise à jour le  14 juin 2017   \n Communiquez avec nous \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n À notre sujet \n Communiquez avec nous \n Bulletin électronique \n Médias \n Multilingue \n Glossaire \n OSC in the Community \n Site Web de la CVMO \n Conditions d’utilisation \n Politique de confidentialité \n Accessibilité à la Commission des valeurs mobilières de l’Ontario \n Communiquez avec nous \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n Inscrivez-vous à l'Actualité des investisseurs \n Tenez-vous au courant des plus récentes initiatives visant les investisseurs, des ressources pédagogiques ainsi que des avertissements et des alertes à l’intention des investisseurs. \n Inscrivez-vous \n Consulter les numéros précédents \n © Commission des valeurs mobilières de l’Ontario 2017 \n Partager sur Facebook \n Partager sur Twitter \n Partager par courriel \n Imprimer l'article \n Partager sur les réseaux sociaux \n Nous poser une question sur l'investissement \n Partage sur les réseaux sociaux \n Fermer le lien sur l'investissement \n Partager sur Facebook \n Partager sur Twitter \n Partager par courriel"}