{"url": "https://www.gerezmieuxvotreargent.ca/politique-de-confidentialite/", "content": "Politique de confidentialité | GetSmarterAboutMoney.ca \n Passer au contenu \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n A \n Utiliser une police de taille normale \n A \n Utiliser une police de grande taille \n  Contraste\t\t\t \n English \n     Menu \n A \n Utiliser une police de taille normale \n A \n Utiliser une police de grande taille \n  Contraste\t\t\t \n English \n Recherche pour: \n Search \n Investir \n Notions de base sur les placements \n Faites vos premiers pas \n Introduction multilingue \n Comprendre le risque \n Conseils financiers \n Préparer un plan \n Suivi de votre progression \n Produits d’investissement \n Rentes \n Obligations \n Placements complexes \n Fonds négociés en bourse \n Titres dispensés de prospectus \n Fonds communs de placement et fonds distincts \n Immobilier \n Obligations d’épargne \n Actions \n Régimes d’épargne et de retraite au travail \n Régimes d’epargne \n Régimes enregistrés d’épargne-études \n Régimes enregistrés d’épargne-retraite \n Fonds enregistrés de revenu de retraite \n Régimes enregistrés d’épargne-invalidité \n Comptes d’épargne libre d’impôt \n Planifier et gérer \n Notions de base sur la planification \n Comptes bancaires \n Budget \n Planification financière \n Assurance de personnes \n Comprendre l’impôt \n Gérer ses dettes \n Épargner \n Testaments et planification d’une succession \n Les vérités universelles \n Retraite \n Planification de la retraite \n Vivre votre retraite \n Régimes enregistrés d’épargne-retraite \n Fonds enregistrés de revenu de retraite \n Rentes \n Régimes d’épargne et de retraite au travail \n Conseils financiers \n Faire affaire avec un conseiller \n Trouver un conseiller \n Verification de l’inscription \n Porter plainte \n Le rendement des placements et le coût des conseils \n Événements de la vie \n Planifier votre avenir \n Acheter une maison \n Mourir \n Éducation \n Se divorcer \n Se marier \n Avoir un bébé \n Hériter de l’argent \n Planification de la retraite \n Élever une famille \n Protéger votre argent \n Avertissements à l’intention des investisseurs \n Fraude \n Se protéger contre la fraude \n Signaler une escroquerie \n Verification de l’inscription \n Protection des investisseurs \n Réglementation au Canada \n Verification de l’inscription \n Porter plainte \n Introduction du financement participatif en capital \n Le rendement des placements et le coût des conseils \n Calculatrices et outils \n Calculatrices \n Intérêts composés \n Récupérer la valeur d’un placement \n Frais associés aux fonds communs de placement \n Valeur nette \n Rembourser des dettes ou investir \n Rembourser des cartes de crédit et d’autres dettes \n Rendement d’un portefeuille par rapport à des indices de référence \n Épargne REEE \n Épargne REER \n CELI \n Outils \n Le Match monétaire mental \n Aperçu du fonds : exemple interactif \n Questionnaire sur l’amour et l’argent \n Questionnaire sur le profil de risque \n Sondage de 2014 sur l’état d’esprit des Canadiens face aux risques liés à l’argent \n Votre modèle d’énoncé de politique de placement \n Graphique Interactif – Placements \n Feuilles de calcul \n Ressources \n Publications \n Bulletin électronique \n Recherches et rapports \n Glossaire \n Fiches d’information \n Infographies \n Brochures \n Introduction multilingue \n Re: Investir \n Le rendement des placements et le coût des conseils \n Introduction du financement participatif en capital \n Home  >  Politique de confidentialité \n Politique de confidentialité \n Politique de confidentialité \n La CVMO et ses agents ou représentants (parfois désignés par « nous ») respectent votre confidentialité et appliquent les principes reconnus dans la façon dont ils traitent vos renseignements personnels. Par renseignements personnels, on entend les renseignements sur une personne identifiable. La présente politique de confidentialité se rapporte à nos processus de collecte, d’utilisation et de divulgation des renseignements personnels au Canada, mais ne s’applique pas aux renseignements concernant nos employés ni aux renseignements qui ne sont pas des renseignements personnels. \n Renseignements personnels que nous recueillons.   La CVMO peut recueillir certains renseignements personnels, dont les suivants : \n les renseignements que vous nous fournissez lorsque vous communiquez avec nous pour obtenir de l’information sur nos produits ou services ou pour vous inscrire à l’une de nos activités ou à l’un de nos concours ou de nos cours. Il peut s’agir de votre âge ainsi que du nom et des coordonnées de votre école ou de votre enseignant si vous êtes un élève s’inscrivant à un de nos concours; \n vos nom, adresse postale, numéro de téléphone, adresse de courriel et autres coordonnées; \n des données démographiques, comme l’âge et l’expérience en matière de placements; \n les préférences, comme la façon dont les personnes utilisent notre site Web ou nos sites de médias sociaux, et ce qu’elles aimeraient voir dans le site; \n d’autres renseignements que nous recueillons avec votre consentement ou selon ce qui est permis ou exigé par la loi. \n Utilisation des renseignements personnels.   La CVMO peut utiliser vos renseignements personnels aux fins suivantes : \n pour communiquer avec vous afin de vous transmettre de l’information que vous avez demandée; \n pour vous envoyer des bulletins d’information ou d’autres communications électroniques auxquels vous vous êtes abonné; \n pour répondre à vos questions et à vos demandes; \n pour mettre en œuvre et administrer des sondages, des promotions, des jeux et des concours; \n pour toute autre utilisation avec votre consentement ou selon ce qui est permis ou exigé par la loi. \n Divulgation de vos renseignements personnels.  La CVMO peut divulguer vos renseignements personnels dans les circonstances suivantes : \n pour faire appliquer nos  conditions d’utilisation ,  politique d’accessibilité  et d’autres ententes;​ \n pour satisfaire, au besoin, aux exigences prévues par la loi et les règlements ainsi qu’aux exigences en matière d’assurances, d’audit, de traitement et de sécurité;​ \n pour toute autre raison avec votre consentement ou selon ce qui est  permis Permis  Permis délivré à l’agent ou à la compagnie d’assurances qui a satisfait aux normes établies par l’industrie de l’assurance. Réglementé par la Commission des services financiers de l’Ontario (CSFO) + read full definition  ou exigé par la loi. \n Fournisseurs de services.   Nous pouvons également transmettre des renseignements personnels à des agents ou à des fournisseurs de services tiers qui offrent notamment des services de traitement des données, des services de poste, des services administratifs, des services d’analyse de sites Web ou d’autres activités en ligne, ou d’autres services en notre nom. Nous prenons des mesures raisonnables pour nous assurer que les renseignements personnels qui sont traités par ces fournisseurs de services sont protégés et qu’ils ne sont pas utilisés ou divulgués à des fins autres que celles que nous avons précisées. Certains de nos fournisseurs peuvent être situés à l’extérieur du Canada; vos renseignements personnels peuvent alors être assujettis aux lois des pays en cause, ce qui signifie que des gouvernements et autorités de sécurité d’autres pays pourraient avoir le droit d’accéder à vos renseignements personnels dans certaines circonstances. \n Notre site Web et nos sites de médias sociaux.   Certains renseignements sur la navigation peuvent être recueillis afin d’aider la CVMO à évaluer son site Web ou ses sites de médias sociaux, et afin de déterminer la façon dont ces sites sont utilisés. Par exemple, nous pouvons recueillir les renseignements suivants : votre adresse IP, le type de navigateur et de système d’exploitation que vous utilisez, votre nom de domaine, vos heures d’accès et l’adresse des sites Web qui vous ont dirigé vers notre site Web. Ces renseignements peuvent être compilés avec ceux concernant d’autres visiteurs du site Web et être utilisés à des fins de gestion et d’amélioration du site Web. Par exemple, nous pouvons utiliser ces renseignements pour déterminer les sections du site Web les plus consultées par les utilisateurs. La CVMO peut faire appel à des fournisseurs de services pour l’aider à recueillir et à analyser ces renseignements. Elle peut aussi communiquer ces renseignements et d’autres renseignements de ce type aux fournisseurs de services qu’elle a retenus, dans le but de contribuer au développement et à l’administration du site Web et des sites de médias sociaux. \n Témoins.  Les témoins sont des identificateurs alphanumériques qui sont transférés au disque dur de votre ordinateur par l’intermédiaire de votre navigateur et qui permettent aux systèmes de reconnaître votre navigateur et de fournir certaines fonctions, par exemple afficher des annonces personnalisées. Le site GerezMieuxVotreArgent.ca a recours à des témoins pour stocker les renseignements concernant les préférences des visiteurs, comme les réglages relatifs à la langue et à la taille du texte. Il a aussi recours à des témoins pour enregistrer des renseignements propres aux utilisateurs lorsqu’ils accèdent à du contenu (par exemple, nous pouvons utiliser un drapeau d’identification dans un  témoin Témoin  Personne qui vous regarde signer votre testament. Vous devez avoir au moins deux témoins. Ils doivent avoir atteint l’âge légal et ne peuvent être nommés comme bénéficiaires dans votre testament. + read full definition  pour contrôler l’offre de répondre au sondage du site sur les résultats, afin de ne pas offrir de nouveau aux utilisateurs ayant refusé d’y répondre ou y ayant déjà répondu de participer au sondage). Nous utilisons ces renseignements pour comprendre vos préférences et pour personnaliser davantage votre expérience quand vous visitez notre site Web. Dans la plupart des navigateurs, la rubrique « Aide » de la barre d’outils contient l’information concernant la façon d’empêcher votre navigateur d’accepter de nouveaux témoins, de régler votre navigateur pour qu’il vous avertisse lorsqu’un nouveau témoin a été reçu et de désactiver les témoins. Étant donné que les témoins vous permettent de tirer parti de certains des éléments de notre site Web, si vous bloquez ou rejetez nos témoins, il se peut que vous ne puissiez pas accéder à ces éléments ou ne puissiez pas les utiliser. \n Certains de nos partenaires en matière de publicité et d’analyse, par exemple Google, peuvent utiliser des témoins et des pixels espions pour recueillir des renseignements additionnels. Pour en savoir plus sur les politiques de Google à ce sujet, y compris des détails sur la façon de retirer votre consentement à ce type de collecte d’information, veuillez visiter la page Web suivante :  http://www.google.com/intl/fr/policies/privacy/ads . Certains partenaires en matière de publicité peuvent participer à des programmes de l’industrie comprenant des pages Web que les utilisateurs peuvent visiter pour retirer leur consentement, comme le programme offert par l’Alliance de la publicité numérique du Canada, à l’adresse  http://youradchoices.ca/fr . \n Liens.   Si vous suivez des liens vers d’autres sites Web à partir du présent site Web, la CVMO n’est alors pas responsable des pratiques de confidentialité de ces autres sites Web. Par conséquent, vous devriez lire les conditions d’utilisation de tout site Web auquel vous accédez. \n Votre consentement.  Vous pouvez consentir à la collecte, à l’utilisation et à la divulgation de vos renseignements personnels de différentes façons. De manière générale, lorsque vous nous fournissez des renseignements personnels, nous supposons que vous consentez à la collecte, à l’utilisation et à la divulgation de ces renseignements aux fins précisées et décrites dans la présente politique de confidentialité, le cas échéant, ou à toute autre fin mentionnée au moment de la collecte des renseignements. \n Vous pouvez en tout temps retirer votre consentement à la collecte, à l’utilisation et à la divulgation de renseignements personnels, sous réserve des restrictions contractuelles et légales et avec un préavis raisonnable, en communiquant avec nous de la façon présentée ci-dessous. Veuillez noter que si vous retirez votre consentement à certaines utilisations de vos renseignements personnels, nous ne pourrons peut-être plus vous fournir certains produits et services. \n Sécurité.   Nous protégeons les renseignements personnels en notre possession ou sous notre contrôle en adoptant des mesures en matière de sécurité physique, électronique et procédurale appropriées à la nature confidentielle de ces renseignements, ce qui peut comprendre l’utilisation de mesures de protection contre la perte et le vol ainsi que contre l’accès, la divulgation, la copie, l’utilisation et la modification non autorisés. \n Renseignements supplémentaires \n Le dossier qui contient vos renseignements personnels sera conservé dans nos bureaux, sur nos serveurs ou sur ceux de nos fournisseurs de services. Les employés et les fournisseurs de services qui doivent accéder à vos renseignements personnels pour s’acquitter des exigences de leur poste pourront le faire. Si vous avez des questions ou des plaintes à formuler au sujet de la politique de confidentialité de la CVMO ou des présentes conditions d’utilisation, ou si vous avez des commentaires au sujet du site Web, veuillez envoyer un courriel à l’adresse suivante :  InvestorOffice@osc.gov.on.ca . Si vous souhaitez accéder aux renseignements personnels vous concernant qui sont en notre possession ou sous notre contrôle, ou encore y apporter des corrections, ou si vous désirez retirer votre consentement à certaines utilisations de vos renseignements personnels, comme le prévoit la présente politique de confidentialité, vous pouvez en faire la demande par écrit à l’adresse suivante : \n Commissions des valeurs mobilières de l’Ontario \n20, rue Queen Ouest \n22e étage \nToronto (Ontario) M5H 3S8 \n Réception : 20e étage \n À l’attention de : Bureau des investisseurs \n L’accès à vos renseignements personnels et la correction de ces renseignements sont assujettis aux restrictions juridiques applicables. \n ​Modifications à la politique de confidentialité \n La présente politique de confidentialité peut être modifiée périodiquement. Si nous prévoyons utiliser ou divulguer des renseignements personnels à des fins sensiblement différentes de celles décrites dans cette politique, nous ferons des efforts raisonnables pour aviser les personnes touchées, au besoin. Nous pourrions entre autres modifier la politique. Nous vous recommandons de consulter souvent la version actuelle de la politique lorsque vous visitez notre site Web. Le fait que vous continuiez à fournir des renseignements personnels ou à utiliser nos services à la suite de modifications à la politique de confidentialité signifie que vous acceptez ces modifications. La version actuelle de la politique est en vigueur depuis le 15 août 2014. \n Dernière mise à jour le  14 juin 2017   \n Communiquez avec nous \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n À notre sujet \n Communiquez avec nous \n Bulletin électronique \n Médias \n Multilingue \n Glossaire \n OSC in the Community \n Site Web de la CVMO \n Conditions d’utilisation \n Politique de confidentialité \n Accessibilité à la Commission des valeurs mobilières de l’Ontario \n Communiquez avec nous \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n Inscrivez-vous à l'Actualité des investisseurs \n Tenez-vous au courant des plus récentes initiatives visant les investisseurs, des ressources pédagogiques ainsi que des avertissements et des alertes à l’intention des investisseurs. \n Inscrivez-vous \n Consulter les numéros précédents \n © Commission des valeurs mobilières de l’Ontario 2017 \n Partager sur Facebook \n Partager sur Twitter \n Partager par courriel \n Imprimer l'article \n Partager sur les réseaux sociaux \n Nous poser une question sur l'investissement \n Partage sur les réseaux sociaux \n Fermer le lien sur l'investissement \n Partager sur Facebook \n Partager sur Twitter \n Partager par courriel"}