{"url": "https://en.wikipedia.org/wiki/Ellie_Darcey-Alden", "content": "Ellie Darcey-Alden - Wikipedia \n Ellie Darcey-Alden   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Ellie Darcey-Alden \n Darcey-Alden dances in the KAR 2015 dance competition \n Born \n ( 1999-09-04 )  4 September 1999  (age 18) \n Yarnton ,  Oxford , England \n Residence \n Los Angeles, California, U.S. \n Nationality \n British \n Occupation \n Actress, model, competitive dancer \n Years active \n 2007–present \n Ellie May Darcey-Alden [1]  (born 4 September 1999) [2]  is a former English  child  film, stage and television actress who is best known for playing young  Lily Evans  in  Harry Potter and the Deathly Hallows - Part 2 , Francesca \"Franny\" Latimer in the  Doctor Who   series 7  Christmas special, \" The Snowmen \" and  Felice della Rovere  in  Tom Fontana 's  Borgia: Faith and Fear .  Before joining such large franchises as  Harry Potter  and  Doctor Who , she appeared in minimal parts in British theatre and television. She has also done small-time modelling, commercials, voice over work and  competitive dancing . [2] \n Contents \n 1   Early life \n 2   Career \n 2.1   2007–2009: Early work \n 2.2   2009–2011:  Harry Potter \n 2.3   2012–2013: Later projects and break from acting \n 2.4   2014-present: Amateur theatre, competitive dancing and upcoming projects \n 3   Other work \n 4   Personal life \n 5   Filmography \n 5.1   Film and Television \n 5.2   Theatre \n 6   Awards and nominations \n 7   References \n 8   Notes \n 9   External links \n Early life [ edit ] \n Darcey-Alden was born in  Yarnton ,  Oxford , Oxfordshire [3]  to a  middle-class  family, the daughter of Sarah Dawn (née Darcey; b. 1975), a housewife, [4] [5]  and Philip Rodney \"Phil\" Alden (b. 1966 in  Berkshire ), [6] [7] [8] [9]  a production senior director on  Falcon 9  for  SpaceX  in Hawthorne, [10]  a former general manager at BMW Plant Automotive Group and technology manager at Jaguar Rover Automotive, [11]  and an owner of a charity website. [12]  Her father has a prominent political background as her paternal great-great-grandfather was Leonard Henry Alden, Mayor of Oxford from 1936-37. [13]  Her parents legally wed in August 2003. [14] [15] [16] [17] \n As a baby, her mother originally intended to name her \"Annie\" after the character  Little Orphan Annie  but decided against it, \"as I'd probably be a curly red head!\" Darcey-Alden explained. [18] \n She has a younger brother, Joseph (b. 18 February 2002) who is also an actor [19]  and two older half-siblings, James Philip (b. 1990), a doctor at  Colchester General Hospital [20]  and Rebecca Charlotte \"Becki\" Alden (b. 1992), who is presently engaged, [21] [22] [23] [24]  both from her father's first marriage in April 1990. [25] \n She is a former pupil of Dance 10 Theatre School within Edward Feild Primary School (named after Bishop  Edward Feild , respectively) in  Kidlington  which she attended from 2005 to 2011 [3] [6]  and of  Stagecoach Theatre Arts School  under the instruction of Maya Sprigg in Oxford until 2013 where she moved to Elite Dance Studio in  Los Angeles  until 2015. [26]  In late August 2014, she began attending  Palos Verdes High School  and is set to graduate in 2018. [27]  In Spring 2015 of her Freshman year, she joined her school's Choreo dance team, an advanced dance class that has students perform at pep rallies, community events, sporting events, and at their annual Spring Concert. [28] [29]  She additionally divides her time with the drama department. [30] \n In July 2017, she joined the  RADA  Youth Company: Acting summer term, training under Trilby James in contemporary text and  Shakespeare . [2] \n Career [ edit ] \n 2007–2009: Early work [ edit ] \n Darcey-Alden first broke into the world of acting in 2007, appearing in small roles on the British stage and television, including her stage debut in  Aladdin,  directed by  Peter Duncan  for the  Oxford Playhouse  and followed by an uncredited role in the 2008 mini-series  Tess of the D'Urbervilles . [2] [31] [6]  She began training in specialised dancing much earlier in 2005, with the Dance 10 Theatre School within Edward Feild Primary School in  Kidlington . [3] \n In 2009, she appeared in her first guest-starring role as Mary in  one episode  of  Robin Hood  and in select episodes as Emma Walker in  Holby City —both for the  BBC . She auditioned for the latter part earlier in June that year, accompanied by her mother, and was cast at the age of 9. Commenting on the experience, Darcey-Alden said: \"It was very entertaining and a very good experience. I really, really enjoyed it. [Co-stars Jade Jackson and  Patsy Kensit ] were really nice, funny and entertaining. I want to be like Patsy Kensit when I am older because she is such a good actress. I am a big  Holby City  fan and I am really excited about seeing it on the television. All my friends and family are coming to watch it with me.\" [3] \n That year, she appeared in further stage credits, including  Adrian Noble 's musical production of  Chitty Chitty Bang Bang  for the  New Theatre Oxford  which was a revamped production of the  original 2002 London production [32]  and the  Mardi Gras  Challenge, a UK dance competition at the  Sadler's Wells Theatre . [33] [2] \n She later commented at a 2013  LeakyCon  panel in London on which form of media she preferred more—theatre, TV or film: \"I love both. I actually started out doing theatre first and worked my way into TV and film. [...] I don't mind either, really. It's great!\" [34] [35] \n 2009–2011:  Harry Potter [ edit ] \n Darcey-Alden's most notable role came in December 2009, when she attended an open  audition  for the latest  Harry Potter  installment (a year before she was actually needed due to the producers' decision to split the  book  into two parts). On 25 January 2010, she was called back for a second audition at  Pinewood Studios  where she met director  David Yates  and worked with a number of other potentials for the parts of young James Potter, Sirius Black, Severus Snape and Lily Evans. During the process, the children were asked to improvise short conversations. She subsequently received a  screen test  with then 13-year-old Benedict Clarke (who would be cast as young  Severus Snape ) at  Leavesden Studios  \"as well as an associated costume, hair and makeup meeting.\" A few weeks later in February, she was contacted by the producers and was told that she received the part of young  Lily Evans , cast at age 10, in the commercially successful  Harry Potter and the Deathly Hallows - Part 2 . [36] [37] [38] [39]  In the film, Darcey-Alden appears in a  flashback sequence  as  Harry 's mother in her schooldays and reveals how she befriended Snape as child, which is crucial in explaining the back story of the shady professor and his complex relationship to Harry's deceased parents, particularly his bitter resentment to his father  James . [40] [41] \n It was revealed in a 2011 article for the  Oxford Mail  that years before landing the part Darcey-Alden was tipped for future success by her agents at  Enfield , London-based casting and theatrical agency A&J Management, although her parents decided to not treat her passion for acting seriously until she was more mature. Despite this, she resisted her mother for a chance in the business, especially for a part in  Harry Potter , a role which her mother initially did not believe she would eventually win. In the same article, it was further reported that she was not allowed to tell her close friends of her part in  Potter  as she left school for Leavesden Studios and  Hatfield House  to film her scenes, when she met then 21-year-old actor  Daniel Radcliffe  on her first day on set during her screen-test. She was quoted: \"I am still trying to get over that I am actually in  Harry Potter . When I got the part, I was so happy I was speechless. It was the best time of my life. It was very funny. Everyone was so friendly to me and it was really fun. At first, it was really difficult to keep the secret. But when my friends did find out, they were so happy for me and supported me all the way through it.\" [6] [42] \n At a 2013  LeakyCon  panel in  Portland, Oregon , Darcey-Alden further elaborated on her meeting with  Potter  co-star Daniel Radcliffe. She said: \n \"This story is when I just had my screen test for  Harry Potter . [...] I'm leaving, and the car is waiting outside and I was thinking, 'Alright.' And I got my stuff together, and I was just about to leave and the second  AD  came up and said, 'Oh, come up to my office. I got something for you, I got someone to see of you.' I thought, 'Okay, this is a bit weird.' And so I came up there and she was [like], 'Oh yeah, I'd just like you to meet Dan [Radcliffe]. And I thought, 'Oh my God! Hi! Hi, I'm Ellie!' And inside my heart's going  boom-boom-boom-boom-boom ! [...] And [Dan was] like, 'Hi! I guess I'll call you Mum!' And I'm like, 'Okay!' [...] And then he's like, to my mum, he said, 'Oh, you must be Grandma, then.' And Mum's like, 'Yeah, sure!' And I'm thinking, 'No, Mum!' [...] And I was so relaxed and thought, 'Oh yeah...' We're just having a conversation [...] and the second AD said, 'Look, the car's waiting, we've got to go, this is your quick hello-goodbye.' And so, [Dan is] so nice and was just like, 'Oh, I'm really sorry to keep you waiting, oh my God!' And I said, 'Okay, bye!' And I shake his hand and he's like, 'I'll see you around then!' And then I walked away [...] and I'm shaking his hand [...] and was like, 'I'm never washing this hand again!' And Mum looked at me and she turned around to look at Dan. Dan went (gestures), 'Alright!' [...] And Mum's like, 'You played it so cool and you just messed it all up!' And I'm like, 'I'm sorry!'\" [43] \n Filming her scenes along with Benedict Clarke (young Snape), Ariella Paradise (young  Petunia Dursely ),  Alfie McIlwain  (young James) and Rohan Gotobed (young  Sirius Black ) took place in April 2010. [44]  Shooting only lasted four days where one scene was shot per day [45]  while re-shoots and pick-ups were completed in early 2011. [30] \n According to Darcey-Alden and Clarke at a 2013  LeakyCon  cast junket in London, production alternated between sets at Leavesden Studios and  on location  shooting by the  River Lea  in the  gardens of Hatfield Park  near Hatfield House—both set in  Hertfordshire , respectively. Of the river scene in particular, Clarke elaborated by saying: \n \"[W]e did so many ludicrous camera angles, we had a camera up on a crane looking down at Ellie and I. And we had a camera crew coming across the river on a boat for one of those, and then they could play around [...] decide what they wanted, how they wanted to pan across the river and take a look at us. I thought it was really outstanding how they had such a ridiculous extent of angles to play with.\" [46] \n Darcey-Alden added: \"We only did half-and-half at Leavesden. [...] There was the actual Hatfield House there and we got to have a look around and it was really beautiful.\" [46] \n Once location shoots were completed, Darcey-Alden and Clarke joined McIlwain and Gotobed at Leavesden on the set of the Great Hall where the set was divided with one section of the Entrance Hall in ruins for the Battle of Hogwarts sequences; two days of shooting were completed from morning until evening, scheduled a week apart where three hours of school tutoring was provided. [47]  Darcey-Alden mentioned in a LeakyCon 2013 panel session that she worked with  Dame Maggie Smith  the first half of the day and was quoted, jokingly: \"She spoke to me. It's not my fault.\" [42] \n She later said in detail: \n \"When I was filming my Great Hall scene where I had to be sorted, we were rehearsing and I think it was sorting off-camera and I sat on the stool and the Sorting Hat was sort of next to me and I looked down and was thinking, 'Wow! It's the Sorting Hat. Okay!' [...] And then there was Maggie Smith behind me and I've been told, you know, give her a bit of space. You know, let her breathe [and] if she comes up to you, don't talk to her. And I was thinking, 'Oh, I'm really nervous!' Because I've been told not to say anything, not to talk her, just to sit there. And then she comes up to me and she's like, 'Oh, you have beautiful hair!' And I'm like this (mimics gawking), 'Oh my goodness, that's Maggie Smith!' And she's like, 'You have really beautiful hair! Well done! You're really catchy! Good job!' And I'm like, Thanks... Oh my God!' But because I was so nervous on set and that was the first scene I did, it kind of gave me more confidence. [...] Even though it wasn't advice, it just gave me more confidence to be myself and just have fun and relax and everything. And [Smith is] such a lovely lady. She just comes up to you and talks to you.\" [48] \n A week later, a final day of shooting commenced in the Hogwarts corridor where multiple takes had the four child actors walk and run up the corridor numerous times. The original cut had McIlwain and Gotobed chase a first year Slytherin student, though this detail was eventually omitted. \"Though originally the scene was without dialogue,\" Gotobed revealed in a blog post, \"I suggested to [David Yates] that I say 'Snivellus' as we pushed through Snape and Lily. David agreed that was a good idea, and even gave me a second line later on in the day, where I was supposed to say 'come on James' at the end of the brief scene. As you already know, both lines were cut for release in favour of [Radcliffe]'s voiceover [sic], which makes more sense in terms of the entire montage.\" [47] \n To satisfy the look of her character as described in the books, Darcey-Alden is naturally red-haired although she was required to wear blue contact lenses to match Daniel Radcliffe's eyes, given her eyes are brown, as revealed by her co-star Benedict Clarke. [2] [49]  Darcey-Alden herself later confirmed that she wore contacts in January 2015 when she acted as a special guest in a  Harry Potter  celebration at the Riverview Middle School in  New Brunswick , Canada via a live Q&A over  Skype  with a winning classroom. She said: \n \"I don't know if you [the class] know what a screen test is, you haven't got the part yet. [...] You stand in front of (sic) a green screen in costume, hair, make-up, everything as if you got the part. And then they stand you next to whoever you'll be filming with. So, I stood next to Benedict [Clarke]. And I also stood next to Ariella [Paradise]. And so I stood there in hair, and make-up and everything and after that, [I] got off [for] a couple of hours and I was wearing contacts, [they] took the contacts out, put them in, had my hair up, put it down again...\" [50] [51] [52] \n Later, on 23 July 2015, she released a photo on Twitter of herself with Daniel Radcliffe posing on the set of  Harry Potter  to celebrate Radcliffe's 26th birthday, which further supported the fact that she had worn blue colour contacts. [53] \n In the  novels , Harry is described as having his mother's eyes, which are in fact green although Radcliffe never sported any colour-correcting contacts in the films due to a negative reaction to them;  J.K. Rowling  later commented on this by saying it was not an absolute need that Harry have green eyes in the films, as long as there was a resemblance between his and his mother's. [54]  However, the method of using blue contacts ultimately backfired and Darcey-Alden's natural eye colour showed through when captured on camera. For an unknown reason, this error was not digitally corrected in  post-production . [49] [55] [56] \n When later asked by a fan of what it was like to be a part of a popular movie  franchise , Darcey-Alden commented: \"I'm not famous, people don't recognise me. I'm just a normal crazy 12 year old who was very lucky to be in such a huge film.\" [57] \n This section may  require  cleanup  to meet Wikipedia's  quality standards . The specific problem is:  Please see the  talk page   Please help  improve this section  if you can.   (April 2014)   ( Learn how and when to remove this template message ) \n 2012–2013: Later projects and break from acting [ edit ] \n Darcey-Alden has since been cast in a variety of independent and larger budget films. It was announced on 20 July 2011 via the official A&J Management  Twitter  that she had been cast in a cameo role in  Welcome to the Punch , a British thriller co-starring  James McAvoy ,  Mark Strong  and  Harry Potter   alum   Peter Mullan . [58]  She appeared briefly in the aeroplane scene seated in the opposite aisle from  Elyes Gabel . [59]  Other roles include two short films,  Pranks , a children's ghost story concerning a 12-year-old orphan named Katie confronted by the spirit of her foster mother's dead son and  Sam & Isobel , a  coming of age  tale of two young children brought together within the confines of a woodland through childlike innocence and naivety, although Sam eventually realises that Isobel is not as innocuous as she seems.  Pranks  co-starred her real life brother Joseph Darcey-Alden, [60]  was shot in four days on location at  Cuckmans Farm ,  St Albans  and was released to the public in April 2016. [61] [62]   Sam & Isobel  began filming on 9 April 2012 and wrapped production the following week on the 15th. [63] [64]  The official teaser trailer was released online on 2 April 2013 by director Brendan Lyle Moles. According to the video description, the film was making its circuit at film festivals that year and was planned to be released to the public afterwards. [65]  In early 2014, the film was officially released publicly online via Vimeo and YouTube by the production crew. [66] [67]  One review called her performance, \"ripened and complicated. [...] from the moment she begins to narrate her story, she sounds so sweetly young and yet so mature for a girl of 12 to 13 years of age, a maturity that is both engaged and a bit feverish. [...] Ultimately, this indication of maturity foreshadows who her character truly is, who may appear adorably innocent yet there's an edge of coldness beneath her given how she's not disturbed by many of her careless actions.\" [68] \n In 2012, she returned to the  BBC  for the  Doctor Who   series 7  Christmas special, \" The Snowmen \" as Francesca Latimer reuniting with real life brother Joseph Darcey-Alden as her on-screen sibling and co-starring alongside  Jenna-Louise Coleman  and  Matt Smith . [69] [70]  In the episode, set in London in 1892, Francesca \"Franny\" Latimer and her brother Digby are wards being cared for by their governess  Clara Oswin Oswald  under the alias \"Miss Montague\". The children share a much closer relationship with Clara than they do their own father and Franny decides to relate a troubling experience to her: she has been having frequent nightmares of her late governess who has been tormenting her in her dreams of a promised return on Christmas Eve; it is revealed that years earlier, the governess drowned in the Latimers' pond, now frozen. Through a series of events, Franny's nightmare manifests under the  Great Intelligence 's influence, the Ice Governess is destroyed with the help of  the Doctor , and Clara tragically succumbs to internal injuries, mourned by the Latimers. [71] \n At a Chicago TARDIS 2014 panel, Darcey-Alden revealed that it was her brother who secured her the role. She said: \"That was actually my brother's doing. And he got me the part.\" [72] \n Joseph elaborated by saying: \n \"So the agent called and they said, 'Well, this is what you got to do.' And I'm like, 'Okay.' And he sent me the script and they phoned back and said, 'Oh, bring Ellie along.' And I was like, 'No, no, no. Don't bring Ellie along. I'm not just going to bring her to audition.' And they said, 'Okay.' [I] put the phone down, [they] ring back up and said, 'Okay, they'll see Ellie.' So we both went along to audition. They sent Ellie a script. They weren't auditioning girls until, I believe the week after.\" [72] \n Ellie continued: \"Couple of weeks after they were auditioning the sister role. So they were just doing the brothers and then they do the sisters after that. But we [...] just went in and we read together and we got a callback. The following couple of days after that, we got a callback and then it kind of went off with that.\" [72] \n The  read-through  took place on 2 August 2012 and was filmed later in the month in  BBC Wales '  Roath Lock  studios and  Newport . [70]  To date, Darcey-Alden is the latest in a line of  Harry Potter  cast members to have appeared in both  Potter  and  Doctor Who , including  David Tennant ,  Michael Gambon ,  Helen McCrory ,  John Cleese ,  Zoe Wanamaker ,  Jim Broadbent ,  Toby Jones ,  Roger Lloyd Pack ,  Bill Nighy ,  Shirley Henderson ,  Adrian Rawlins ,  David Bradley , and  John Hurt . [73] \n The same year, it was confirmed that she would guest star in the second season of  Tom Fontana 's French-German-Czech historical television drama  Borgia: Faith and Fear  (not to be confused with  Showtime 's  The Borgias ) as  Felice della Rovere , on-screen and illegitimate daughter to  Dejan Čukić 's Cardinal  Giuliano della Rovere  (better known as Pope Julius II). [74] [75]  Series two was shot  on location  in  Prague  and  Italy  in March through November 2012. [76]  Darcey-Alden filmed her scenes in Italy that October over the span of three days, sharing the screen alongside Matt Di'angelo and  Mark Ryder . [77] [78]  The show premiered on  Canal+  on 18 March 2013 [79]  and  Netflix  on 1 May 2013. [80] \n Although Felice is considered a powerful and influential historical figure, Darcey-Alden's part in the show is reduced to a minimal appearance in the shadow of her powerful father; based on documentation, Felice was married as early as 14 years of age and was widowed shortly after, years before she remarried Gian Giordano Orsini and subsequently became a prominent figure of the  Italian Renaissance . [81] \n While Darcey-Alden filmed minimal scenes for episodes 11 and 12, they were eventually cut from the final version, yet her name still appears in the credits of the Season 2 DVD (Region 2). [82] [83]  The show had been renewed for a third season, which was in  principal photography  as of May 2013; it had been confirmed that this was the final of the series. [84]  At the time, it was currently unknown whether Darcey-Alden's character would return to the show, though since the finale aired in France on Canal+ on 27 October 2014, her character had been cut. [85] \n Stage credits included Ellen Kent's  Aida Verdi  for the  New Theatre Oxford [2] [86]  and  The Nutcracker Twisted  (or  A Twisted Nutcracker ), an interpretation of the  original  which breaks away from classic ballet and includes tap, hip-hop, jazz, singing and some \"Gangnam Style.\" It was presented by Elite Dance Studio and performed at the Norris Theatre on 30 November 2013. [87] [88] [89] \n This would be her last foray into professional acting until she later revealed in January 2016 to  Live From 205 News  that her professional acting career was temporarily on hold, commenting that, \"Hollywood does not like a 16-year-old girl with braces. Next year when I get my braces off, I'll be out to start auditioning again.\" [30] [90] \n 2014-present: Amateur theatre, competitive dancing and upcoming projects [ edit ] \n On 23–26 May, she appeared in the  Showstopper!  Competition 2014 which took place at the  Disneyland Hotel  in California. [91] [92]  She competed in a ballet solo, ballet group, jazz group and contemporary group. [93]  She and her group were later awarded two Platinum 1st Place prizes with scores of 114.2 and 114.0, respectively for their performances \"Stranded\" and \"Hold It Against Me\" presented by Elite Dance Studio. [94] \n On 6–8 February, she appeared in the  KAR: Kids Artistic Revue  Long Beach, CA Competition 2015, which took place at Millikan High School. [95]  She additionally performed in the  Palos Verdes High School Choreo Show  2015 and returned for 2016, which was held at the James R. Armstrong Theatre in  Torrance  from 23–24 March. [96] [97] [98]  To date, she has one stagehand credit as a  British English   dialect coach  for Palos Verdes High School's production of  Noises Off , performed from 6-8, 12–15 November 2015. [99] [30]  Later, she was cast in her first acting role since 2013 in Palos Verdes High School's production of  Joseph and the Amazing Technicolor Dreamcoat , directed by Nicole Thompson as the Female Ensemble which was performed from 15-17, 21–24 April. [100] [101] [102]  The musical was later nominated for 15 John Raitt Awards for Youth, including Best Ensemble and took home one for Musical Comedy of the Year. [103] \n Other work [ edit ] \n Outside of screen and stage credits, she modelled small-time, including ads for  Morleys Stores Ltd  ca. 2009-10, [104]  Playworld Systems,  Nestle ,  Sodexo ,  Marks and Spencer , and  McCarthy and Stone , and was a front page model for the British children and pre-teen magazine  Girl Talk  in 2012 and 2013. [105] [106]  In January 2011, she appeared in a commercial for  Skype . [107] \n She has appeared at many  Harry Potter  events and other fan conventions over the years, including the  Harry Potter and the Deathly Hallows: Part 1  cast and crew screening in October 2010, [108]  the  Harry Potter and the Deathly Hallows - Part 2   world premiere  on 7 July 2011  ( 2011-07-07 )  in  Trafalgar Square  in London, [6] [109] [110]   LeakyCon  2011 in  Orlando , Florida, [111]  the  Warner Bros. Studio Tour London: The Making of Harry Potter  in October 2012, [112] [113]  LeakyCon  Portland  2013, LeakyCon London 2013 [114]  and Misti-Con 2013 in  Laconia, New Hampshire . [115]  In December 2012, she along with  Potter  alum Ryan Turner ( Hugo Weasley ) participated in the Leighton Christmas Festival. [116] [117] \n On 21 December 2013, she along with Elite Dance Studio performed for the  Los Angeles Clippers   Halftime Show . [118] \n She was scheduled to appear as a guest at  Gallifrey One  2014, a  science fiction  and  Doctor Who  fan convention, which took place 14–16 February at the Los Angeles Airport Marriott. [119]  It was announced that she would be returning to LeakyCon 2014, which took place in Orlando, Florida from 30 July to 3 August [120]  and played  Hermione Granger  in the Opening Ceremony. [121]  She and her brother Joseph appeared as guests at the Midwest's Premier  Doctor Who  event, Chicago TARDIS 2014 from 28–30 November at the Westin Lombard Yorktwon Center. [122] [123]  In January 2015, she acted as a special guest in a  Harry Potter  celebration at the Riverview Middle School in New Brunswick, Canada via  Skype . [50] [51]  She and her brother were scheduled to appear as guests at the Twin Cities' premier  Doctor Who  convention, CONsole Room 2015 which took place from 29–31 May at the Hilton Minneapolis/St. Paul Airport. [124]  On 6 April 2016, she visited  The Wizarding World of Harry Potter  Opening at  Universal Studios Hollywood  on behalf of  MuggleNet [125] [126] [127]  where she interviewed  Harry Potter  co-stars  Tom Felton ,  James and Oliver Phelps ,  Evanna Lynch  and  Warwick Davis  as well as art director Alan Gilmore. [128] [129] [130] [131] [132] \n Personal life [ edit ] \n She moved to the United States with her immediate family on 8 February 2013 when she was 13 years old. [133] [134]  She now currently resides in Los Angeles [135]  in the city of  Rancho Palos Verdes . [136] \n She is also a big fan of  Muggle Quidditch , and was taught to play by members of the five National teams that participated in the  2012 IQA Summer Games  (Canada, United Kingdom, Australia, France, and the United States). [137] [138]  She commented to  CNN : \"I think [Muggle Quidditch is] brilliant, it's really funny to watch! I didn't realise it was so rough and tough and it's great to just have a go!\" [139] \n Filmography [ edit ] \n Film and Television [ edit ] \n Year \n Title \n Role \n Notes \n 2008 \n Tess of the D'Urbervilles \n Modesty Durbeyfield \n BBC \nSeason 1 \n Episode 1-4  (uncredited) \n 2009 \n Robin Hood \n Mary \n BBC \n Season 3 \nEpisode 1: \" Total Eclipse \" \n 2009 \n Holby City \n Emma Walker \n BBC \n Season 12 \nEpisode 1: \" The Hands That Rock the Cradle, Part 1 \" \nEpisode 2: \" The Hands That Rock the Cradle, Part 2 \" \nEpisode 11: \" Stand by Me \" \n 2011 \n Harry Potter and the Deathly Hallows - Part 2 \n Young  Lily Evans \n 2012 \n Pranks \n Katie \n Short film \nThis film was specifically created for the book \n The Craft of the Cut: The Final Cut Pro X Editor's Handbook \nwhich includes the DVD of the film's  rushes . [140] \n 2012 \n Doctor Who \n Francesca \"Franny\" Latimer \n BBC \n Season 7 \nEpisode 6: \" The Snowmen \" \n 2013 \n Welcome to the Punch \n 12-Year-Old Girl \n 2013 \n Borgia \n Felice della Rovere \n Canal+ \n Season 2  (scenes deleted) \nEpisode 11: \"The Seven Sorrows\" \nEpisode 12: \"Who Is Like God?\" \n 2014 \n Sam & Isobel \n Isobel \n Short film \n Theatre [ edit ] \n Year \n Title \n Role \n Notes \n 2007 \n Aladdin \n Street Urchin/Ensemble \n Stage Play \nDir. Peter Duncan \n Oxford Playhouse \n 2009 \n Chitty Chitty Bang Bang \n Sewer Child/Children's Ensemble \n Musical \nDir.  Adrian Noble \n New Theatre Oxford \nRevamped production of the  original 2002 London production \n 2009 \n Mardi Gras \n Dancer \n UK Dance Competition \n Sadler's Wells Theatre \n 2013 \n Aida Verdi \n Slave Girl/Ensemble \n Opera \nDir. Ellen Kent \n New Theatre Oxford \n 2013 \n Charity Spectacular \n Performer \n Variety Show \nDir. Maya Sprigg \n Stagecoach Theatre Arts School \n New Theatre Oxford \n 2013 \n Spellbound Variety Show \n Dancer \n Variety Show \n New Theatre Oxford \n 2013 \n The Nutcracker Twisted \n Sugar Plum Fairy/Ensemble \n Musical \nElite Dance Studio \nNorris Theatre \n 2014 \n Miss Dance Drill Team USA: California [141] \n Dancer \n U.S. Dance Competition \nElite Dance Studio \n 2014 \n KAR: Kids Artistic Revue [142] \n Dancer \n U.S. Dance Competition \nDir. Ernest Balderas \nElite Dance Studio \nCentinela Valley Center for the Arts, Redondo Beach \n 2014 \n Showstopper! \n Dancer \n U.S. Dance Competition \n Disneyland Hotel \n 2014 \n LeakyCon  Opening Ceremony \n Hermione Granger \n Fandom Conference \nOrange County Convention Center \n 2015 \n KAR: Kids Artistic Revue \n Dancer \n U.S. Dance Competition \nMillikan High School \n 2015 \n PV Choreo Show \n Ensemble Dancer \n Palos Verdes High School \nJames R. Armstrong Theatre \n 2015 \n Noises Off \n Dialect Coach \n Play \nDir. Nicole Thompson \nPalos Verdes High School \n 2016 \n PV Choreo Show \n \" Lose It \" Ensemble Dancer \n Palos Verdes High School \nJames R. Armstrong Theatre \n 2016 \n Picture This! [143] \n Dancer \n Spring Choreo Dance Concert \nPalos Verdes High School \nJames R. Armstrong Theatre \n 2016 \n Joseph and the Amazing Technicolor Dreamcoat \n Wives/Pharaoh's Girls/Female Ensemble \n Musical \nDir. Nicole Thompson \nPalos Verdes High School \nMulti-Purpose Room \n 2016 \n LeakyCon  Story Part 3 & Closing [144] [145] \n The Leaky Cauldron  Pub Guests/Ensemble \n Fandom Conference \nMarriott Burbank Airport Hotel \n Awards and nominations [ edit ] \n Year \n Work \n Award \n Category \n Result \n 2016 \n Joseph and the Amazing Technicolor Dreamcoat \n John Raitt Award for Youth \n Best Ensemble \n Nominated \n References [ edit ] \n ^   Darcey-Alden, Ellie.  Video: About me!   YouTube.  10 February 2017. Retrieved 10 February 2017. Event occurs at 8:27. \n ^  a   b   c   d   e   f   g   Ellie Darcey-Alden Agency Résumé.   A&JManagement.co.uk.  Retrieved 1 October 2013. \n ^  a   b   c   d   Ellie's special reason to watch Holby City.   Oxford Mail .  19 October 2009. Retrieved 1 October 2013. \n ^   England & Wales births 1837-2006.  Vol. 20, p. 2327. Print. \n ^   Darcey-Alden, Ellie.  \"Happy Belated Birthday to my wonderful mummy!\"   Twitter.  6 October 2015. Retrieved 2 February 2016. \n ^  a   b   c   d   e   Ellie's all set for Potter premiere.   Oxford Mail .  7 July 2011. Retrieved 4 October 2013. \n ^   England & Wales births 1837-2006.  Vol. 6A, p. 14. Print. \n ^   Darcey-Alden, Ellie.  \"Happy Birthday Daddy!\"   Twitter.  5 November 2015. Retrieved 2 February 2016. \n ^   Riley and Chirtou, p. ix. (See Notes.) \n ^   Darcey-Alden, Ellie.  \"Stage 1 successfully landed!\"   Twitter.  21 December 2015. Retrieved 25 January 2016. \n ^   Phil Alden.   LinkedIn.  Retrieved 5 August 2016. \n ^   Alden, Philip.  Philip's JustGiving page.   JustGiving.com.  Retrieved 3 September 2014. \n ^   \"Leonard Henry Alden, Mayor of Oxford.\"   Oxford History.  Retrieved 22 August 201. \n ^   England & Wales marriages 1837-2008.  Vol. 5E, p. 0560. Print. \n ^   England & Wales, Marriage Index, 1916-2005.  Vol. 695, p. 560. Print. \n ^   General Register Office.  England and Wales Civil Registration Indexes.  London, England: General Register Office. Print. \n ^   Darcey-Alden, Sarah and Philip.  \"About Darcey Alden's.\"   Facebook.  Retrieved 5 August 2003. \n ^   Darcey-Alden, Ellie.  \"Throwback Thursday.\"   Twitter.  21 November 2013. Retrieved 16 February 2015. \n ^   Boy lands lead role in stage show.   Oxford Mail .  30 November 2011. Retrieved 4 October 2013. \n ^   Alden, James.  \"About James Alden.\"   Facebook.  Retrieved 5 August 2016. \n ^   Darcey-Alden, Ellie.  \"Just said goodbye to my big bro... I will miss you James.\"   Twitter.  18 August 2013. Retrieved 5 October 2013. \n ^   Darcey-Alden, Ellie.  \"A massive Happy 21st Birthday to my beautiful big sister @becki_alden.\"   Twitter.  13 May 2013. Retrieved 5 October 2013. \n ^   Darcey-Alden, Ellie.  \"I still can't believe my sister is getting married!!\"   Twitter.  26 March 2016. Retrieved 28 March 2016. \n ^   England & Wales, Birth Index, 1916-2005.  Vol. 20, pp. 3297-3840. \n ^   England & Wales, Marriage Index, 1916-2005.  General Register Office.  England and Wales Civil Registration Indexes.  Vol. 20, p. 2287. London, England: General Register Office. Pint. \n ^   Darcey-Alden, Ellie.  \"So who in LA wants to attend a fantastic dance studio?? I go to Elite dance.\"   Twitter.  7 September 2013. Retrieved 20 October 2013. \n ^   Darcey-Alden, Ellie.  \"Official Palos Verdes Sea King!!!!\"   Twitter.  25 August 2014. Retrieved 1 September 2014. \n ^   \"List of students enrolled in PVHS Choreo Dance 2015-16.\"   PVHS Official Site.  Retrieved 13 February 2016. \n ^   \"Info on PVHS Choreo Dance class.\"   PVHS Official Site.  Retrieved 13 February 2016. \n ^  a   b   c   d   Video: Live From 205 News Interview.   YouTube.  6 January 2016. Retrieved 20 April 2016. \n ^   Oxford Playhouse Productions.   OxfordPlayhouse.com.  Retrieved 1 October 2013. \n ^   Chitty Chitty Bang Bang at the New Theatre, Oxford.   The  Henley Standard .  7 December 2009. Retrieved 1 October 2013. \n ^   Mardi Gras Challenge   MardiGrasDance.com.  Retrieved 1 October 2013. \n ^   Video: Harry Potter Cast Junket @ LeakyCon – Evanna Lynch, Scarlett Byrne and More.   YouTube.  10 August 2013. Retrieved 20 October 2013. \n ^   Harry Potter cast Interviews.   BetheRedCarpet.co.uk.  10 August 2013. Retrieved 9 April 2014. \n ^   New Casting Information for 'Harry Potter and the Deathly Hallows.'   The Hollywood Reporter .  22 August 2010. Retrieved 27 December 2012. \n ^   Young Lily Evans cast for Harry Potter and the Deathly Hallows: Part II.   SnitchSeeker.com.  22 August 2010. Retrieved 6 October 2013. \n ^   Video: New Potter Kid Actors at LeakyCon 2011.   YouTube.  19 July 2011. Retrieved 6 October 2013. Event occurs at 4:33. \n ^   Gotobed, Rohan.  Harry Potter and Me.   Wordpress.  4 September 2016. Retrieved 5 November 2016. \n ^   Harry Potter and the Deathly Hallows - Part 2 . Dir. David Yates. Warner Bros. Pictures, 2011. DVD. \n ^   McCabe, p. 211. (See Notes.) \n ^  a   b   Harry Potter Actors Look Back During Panel .  LeakyNews.com.  2 July 2013. Retrieved 20 October 2013. \n ^   Video: Embarrassing Moments: Scarlett Byrne, Ellie Darcey-Alden & Jackie Emerson, Leakycon Panel 2013.   YouTube.  8 July 2013. Retrieved 6 October 2013. Event occurs at 0:20. \n ^   Clarke, Benedict.  \"When exactly did you film the scenes in DH2? (like, month/year).\"   Tumblr .  15 January 2012. Retrieved 25 October 2013. \n ^   Clarke, Benedict.  \"How long did it take to film your scenes in Harry Potter?\"   Tumblr .  13 August 2011. Retrieved 20 October 2013. \n ^  a   b   Video: Harry Potter Cast Junket @ LeakyCon – Evanna Lynch, Scarlett Byrne and More.   YouTube . 10 August 2013. Retrieved 20 October 2013. Event occurs at 29:16. \n ^  a   b   Gotobed, Rohan.  Harry Potter and I.   Wordpress.  5 September 2016. Retrieved 5 November 2016. \n ^   Video: LeakyCon Portland 2013: Scarlet, Ellie, & Jackie Panel.   YouTube.  3 July 2013. Retrieved 13 April 2014. Event occurs at 0:01. \n ^  a   b   Clarke, Benedict.  \"Do you know why they decided to not give the young Lily green eyes?\"   Tumblr .  13 August 2011. Retrieved 20 October 2013. \n ^  a   b   Middle School in Canada Engages in Awesome \"Harry Potter\" Week – Mugglenet Contributes With Special Guest.   MuggleNet.  20 January 2015. Retrieved 1 February 2015. \n ^  a   b   Harry Potter inspires N.B. middle school's Hogwarts makeover.   CTV News.  21 January 2015. Retrieved 1 February 2015. \n ^   Video: Interview with Ellie Alden (Young Lily Evans) Harry Potter Week Reward.   YouTube.  23 January 2015. Retrieved 3 June 2015. Event occurs at 24:40. \n ^   Darcey-Alden, Ellie.  \"Happy Birthday Daniel!\"   Twitter.  23 July 2015. Retrieved 2 April 2016. \n ^   J.K. Rowling discusses why Harry's eyes didn't have to be green.   Hypable.  8 November 2011. Retrieved 20 October 2013. \n ^   Clarke, Benedict.  \"Did anyone else notice that in DH, they edited young Snape's eyes from blue to black?\"   Tumblr .  31 December 2011. Retrieved 20 October 2013. \n ^   Harry Potter: 10 Changes From The Books That Ruined The Movies - #3. Lily's Eyes.   WhatCulture.com.  27 August 2014. Retrieved 11 November 2014. \n ^   Darcey-Alden, Ellie.  \"Whats the best thing about being famous?\"   Twitter.  8 February 2012. Retrieved 25 October 2013. \n ^   A&J Management.  \"Well done Ellie Darcey-Alden on your second feature film. 'Welcome to the Punch.'\"   Twitter.  20 July 2011. Retrieved 27 October 2013. \n ^   Welcome to the Punch . Dir. Eran Creevy. IFC Films/Momentum Pictures, 2013. DVD. \n ^   Pranks Official Movie Site.   Pranks Media.  Retrieved 4 October 2013. \n ^   Riley and Chirtou, p. 8. (See Notes.) \n ^   Video: Pranks (Full Film).   YouTube.  28 April 2016. Retrieved 5 August 2016. \n ^   Lyle Moles, Brendan.  \"First day of shooting SAM.\"   Twitter.  8 April 2012. Retrieved 5 October 2013. \n ^   Lyle Moles, Brendan.  \"SAM is wrapped.\"   Twitter.  15 April 2012. Retrieved 5 October 2013. \n ^   Lyle Moles, Brendan.  Video: Sam & Isobel – Official Teaser Trailer.   Vimeo.  2 April 2013. Retrieved 4 October 2013. \n ^   Lyle Moles, Brendan.  Video: Sam & Isobel (Film).   Vimeo.  23 May 2013. Retrieved 10 February 2015. \n ^   Daley, Jack.  Video: Sam & Isobel (Film).   YouTube.  7 February 2014. Retrieved 10 February 2015. \n ^   Ghobhadi, J. D. Night.  Sam & Isobel, a serious children's character drama with a short run time but with a lot to say.   DeviantArt.  14 February 2015. Retrieved 21 April 2016. \n ^   'Harry Potter' actress Ellie Darcey-Alden to appear in Dr. Who Christmas Special 'The Snowmen.'   MuggleNet .  14 December 2012. Retrieved 4 October 2013. \n ^  a   b   The Fourth Dimension: The Snowmen.   BBC .  27 December 2012. Retrieved 4 October 2013. \n ^   \"The Snowmen.\"  Doctor Who . BBC One, UK. 25 December 2012. Television. \n ^  a   b   c   Video: Chicago TARDIS 2014: Current Series Smorgasbord.   Vimeo.  9 December 2014. Retrieved 7 February 2015. Event occurs at 5:00. \n ^   Actors Who Have Appeared In Harry Potter And Doctor Who.   BuzzFeed.com.  21 July 2011. Retrieved 4 October 2013. \n ^   Ellie Darcey-Alden Appearing on Borgia and Ferrante D’Este.   WordPress.com.  11 December 2012. Retrieved 4 October 2013. \n ^   A&J Management.  \"can now announce that lovely @Elliedalden has been confirmed as Felice Dellarovere.\"   Twitter.  20 September 2012. Retrieved 5 October 2013. \n ^   Tom Fontana's 'Borgia' Gets Second Season Order.   The Hollywood Reporter .  26 March 2012. Retrieved 19 October 2013. \n ^   Darcey-Alden, Ellie.  \"Flying out to Italy today for filming.\"   Twitter.  21 October 2012. Retrieved 21 October 2013. \n ^   Darcey-Alden, Ellie.  \"A great day filming with @matt_diangelo and @markryder121.\"   Twitter.  23 October 2012. Retrieved 21 October 2013. \n ^   Borgia Official Site.   CanalPlus.  Retrieved 4 October 2013. \n ^   Borgia on Netflix.   Netflix .  Retrieved 19 October 2013. \n ^   Book Review of  The Pope's Daughter : A Renaissance woman rescued from obscurity.   National Catholic Reporter.  7 October 2005. Retrieved 20 October 2013. \n ^   \"The Seven Sorrows.\"  Borgia: Season 2.  Writ. Tom Fontana, et al. Dir. Christoph Schrewe. Lions Gate, RC2, 2013. DVD. \n ^   \"Who Is Like God?\"  Borgia: Season 2.  Writ. Tom Fontana, et al. Dir. Christoph Schrewe. Lions Gate, RC2, 2013. DVD. \n ^   Borgia – Season 3 – The final season is filming now.   SpoilerTV.com.  3 June 2013. Retrieved 5 October 2013. \n ^   Canal Plus: Borgia.   Canal Plus France.  Retrieved 18 April 2016. \n ^   Ellen Kent's Aida tickets @ New Theatre Oxford, Oxford.   Ents24.com.  Retrieved 1 October 2013. \n ^   Darcey-Alden, Ellie.  \"Who in LA area wants to come and watch our 'The twisted nutcracker' show?\"   Twitter.  18 November 2013. Retrieved 23 November 2013. \n ^   Palos Verdes Holiday Traditions 2013: Information on the Norris Theatre  Nutcracker  Ballet productions.   Palos Verdes Source.  15 November 2013. Retrieved 23 November 2013. \n ^   'The Nutcracker:' 24 performances of the holiday classic around Los Angeles.   Lose Angeles Daily News.  29 November 2013. Retrieved 18 April 2016. \n ^   Darcey-Alden, Ellie.  \"First picture of Ellie with braces.\"  1 August 2014. Retrieved 21 April 2016. \n ^   Darcey-Alden, Ellie.  \"This is the best part of my day at showstoppers dance competition at the Disneyland Hotel!!\"   Twitter.  23 May 2014. Retrieved 24 May 2014. \n ^   Info for Showstopper Competition 2014.   Academy of World Dance N Arts.  Retrieved 24 May 2014. \n ^   Darcey-Alden, Ellie.  \"I'm competing a ballet solo, ballet group, jazz group and contemporary group!\"   Twitter.  23 May 2014. Retrieved 25 May 2014. \n ^   AnaheimII Overall Score Reports for Showstopper! 2014: Senior (15-19 yrs.) Large.   ShowstopperOnline.com.  Retrieved 8 August 2014. p. 36. \n ^   Information for KAR Feb 2015 Dance Competition.   DanceKar.  Retrieved 16 February 2015. \n ^   Video: Palos Verdes High School Choreo Show 2015.   YouTube.  22 April 2015. Retrieved 25 January 2016. \n ^   Lose It (Rehearsal).   YouTube.  30 December 2015. Retrieved 25 January 2016. \n ^   \"Ellie Darcey-Alden (young Lily Evans Potter) performs in the PV Choreo Show, Armstrong Theatre, 23-24 Mar. 2016.\"   Tumblr.  25 March 2016. Retrieved 28 March 2016. \n ^   \"Noises Off.\"   PV High.  Retrieved 20 April 2016. \n ^   Darcey-Alden, Ellie.  \"Joseph and the Amazing Technicolor Dreamcoat! Opening night was great yesterday!\"   Twitter.  16 April 2016. Retrieved 17 April 2016. \n ^   \"Joseph and the Amazing Technicolor Dreamcoat: Tickets & Info.\"   PVHS Drama.  Retrieved 17 April 2016. \n ^   Future Sea Kings Drama.   PVHS Future Sea Kings.  Retrieved 18 April 2016. \n ^   \"Ellie Darcey-Alden with her Palos Verdes High School's 'Joseph' co-star, Nikolas Alexander at the Eighth Annual John Raitt Awards for Youth (JRAY) Awards Show.\"   Tumblr.  22 May 2016. Retrieved 22 May 2016. \n ^   Photo: Morleys Stores Ad.   Harry Potter Kids Facebook Fan Page.  19 September 2011. Retrieved 25 May 2014. \n ^   Photo: Behind the scenes of 'Girl Talk' shoot.   Ellie Darcey-Alden Facebook Fan Page.  27 June 2012. Retrieved 25 May 2014. \n ^   Ellie Darcey-Alden for 'Girl Talk' Magazine.   LiveJournal.  3 June 2015. Retrieved 3 June 2015. \n ^   Video: Group video calling with Skype.   YouTube.  5 January 2011. Retrieved 25 August 2017. Event occurs at 0:38. \n ^   Gotobed, Rohan.  Harry Potter and How It Changed My Life.   Wordpress.  6 September 2016. Retrieved 5 November 2016. \n ^   World premiere for 'Harry Potter and the Deathly Hallows – Part 2' set for July 7.   Los Angeles Times .  1 March 2011. Retrieved 19 October 2013. \n ^   Video: Harry Potter and the Deathly Hallows Part 2 Premiere London – Magical Omnibus.   YouTube.  21 July 2011. Retrieved 19 October 2013. Event occurs at 3:52. \n ^   Meet the Deathly Hallows actors at LeakyCon 2011!   The Leaky Cauldron .  2 June 2011. Retrieved 4 October 2013. \n ^   'Harry Potter Studio Tour' – an Actor's Perspective.   MuggleNet .  19 October 2012. Retrieved 20 October 2013. \n ^   Warner Brothers Studio Tour: The Making of Harry Potter – An Actor's Perspective By Ellie Darcey-Alden (Review).   MuggleNet .  19 October 2012. Retrieved 20 October 2013. \n ^   Ellie Darcey-Alden coming to LeakyCon Portland and London!   LeakyCon.com.  30 April 2013. Retrieved 4 October 2013. \n ^   Misti-Con 2013: With Special Guest Ellie Darcey-Alden, Young Lily From Deathly Hallows 2.   MistiCon.org.  Retrieved 4 October 2013. \n ^   Leighton Festival puts Harry Potter stars in the Christmas mood.   Leighton Buzzard Observer.  3 December 2012. Retrieved 16 April 2014. \n ^   'Harry Potter' stars kick off Christmas festivities this past weekend.   MuggleNet .  3 December 2012. Retrieved 16 April 2014. \n ^   Video: Elite Dance Clippers Halftime Show.   Elite Dance.  (Archived from  the original .) 17 January 2014. Retrieved 7 September 2014. Event occurs at 0:31 and 1:07. \n ^   Convention Guests Gallifrey 2014.   GallifreyOne.com.  Retrieved 5 October 2013. \n ^   Devin Lytle, Robbie Jarvis, and Ellie Darcey-Alden are returning to LeakyCon!   LeakyCon.com.  16 May 2014. Retrieved 25 May 2014. \n ^   Video: The LeakyCon 2014 Opening Ceremony - by GeekyCon.   YouTube .  8 October 2014. Retrieved 18 April 2016. \n ^   Sibling Act.   Chicago TARDIS.  18 July 2014. Retrieved 3 September 2014. \n ^   Chicago Tardis 2014.   Wesley Bushby Blogspot.  27 November 2014. Retrieved 1 February 2015. \n ^   CONsole Room: Guests of Honor.   CONsole Room Minneapolis.  Retrieved 4 February 2015. \n ^   Universal Studios Hollywood Tickets Sold Out for WWOHP Opening.   MuggleNet .  5 April 2016. Retrieved 18 April 2016. \n ^   SNAPCHAT TAKEOVER! Follow mugglenetdotcom on Snapchat and get updates from #WWOHP @UniStudios with @Elliedalden!   Twitter.  6 April 2016. Retrieved 18 April 2016. \n ^   Darcey-Alden, Ellie.  \"I felt back at home at the Wizarding World today!\"   Twitter.  6 April 2016. Retrieved 18 April 2016. \n ^   MuggleNet Interviews Tom Felton.   YouTube.  9 April 2016. Retrieved 21 April 2016. \n ^   James and Oliver Phelps Interview.   YouTube.  9 April 2016. Retrieved 21 April 2016. \n ^   MuggleNet Interviews Evanna Lynch.   YouTube.  9 April 2016. Retrieved 21 April 2016. \n ^   MuggleNet Interviews Warwick Davis.   YouTube.  9 April 2016. Retrieved 21 April 2016. \n ^   MuggleNet Interviews Alan Gilmore.   YouTube.  9 April 2016. Retrieved 21 April 2016. \n ^   Darcey-Alden, Sarah and Phil. \"Watching our furniture being loaded onto the container.\"   Twitter.  21 November 2012. Retrieved 3 September 2014. \n ^   Darcey-Alden, Ellie.  \"Cannot believe that 3 years ago today was the day I said hello to California!\"   Twitter.  8 February 2016. Retrieved 10 February 2016. \n ^   Darcey-Alden, Ellie.  \"I'm loving living in LA but I'm really missing my family and friends back in the UK.\"   Twitter.  4 March 2013. Retrieved 5 October 2013. \n ^   Darcey-Alden, Ellie.  \"We live in Rancho Palos Verdes.\"   Twitter.  30 January 2014. Retrieved 1 February 2014. \n ^   MuggleNet Exclusive Report: 'Harry Potter' actress Ellie Darcey-Alden shares her story of Muggle Quidditch during the Summer Games.   MuggleNet .  19 July 2012. Retrieved 1 October 2013. \n ^   2012 Summer Games MuggleNet Exclusive: Ellie Darcey-Alden's Summer Games 2012 Report.   MuggleNet .  Retrieved 1 October 2013. \n ^   Video: Calls grow for Quidditch to be considered for the Olympics.   CNN .  (Archived on the official  CNN YouTube  channel .) 13 July 2012. Retrieved 6 October 2013. Event occurs at 1:22. \n ^   Riley and Chirtou, pp. xxi-7. (See Notes.) \n ^   Miss Dance Drill Team California: Winners Listing & Event Results.   Miss Dance Drill Team USA/International.  Retrieved 12 August 2016. \n ^   Video: Act #262 Four Swans Seniors.   Dancekar.  Retrieved 12 August 2016. \n ^   Palos Verdes High School Choreo presents \"Picture This!\"   South Bay Real Estate.  Retrieved 16 August 2017. \n ^   Video: LeakyCon 2016 Story - Part 3.   YouTube.  21 October 2016. Retrieved 27 October 2016. \n ^   Video: LeakyCon 2016 Story - The Closing.   YouTube.  24 October 2016. Retrieved 27 October 2016. \n Notes [ edit ] \n McCabe, Bob.  Harry Potter Page to Screen: The Complete Filmmaking Journey.  First Ed. New York, NY: Harper Design, 2011. Print.  ISBN   978-0-062-10189-1 . \n Riley, Mark, and Marios Chirtou.  The Craft of the Cut: The Final Cut Pro X Editor's Handbook . West Sussex: Wiley, 2012. Print.  ISBN   978-1-119-95173-5 . \n External links [ edit ] \n Ellie Darcy-Alden  on  IMDb \n Ellie Darcey-Alden Agency Page  at A&J Management \n Ellie Darcey-Alden  at Pranks Media \n Authority control \n WorldCat Identities \n VIAF :  310501854 \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Ellie_Darcey-Alden&oldid=810187111 \"\t\t\t\t\t \n Categories :  1999 births Living people English film actresses 21st-century English actresses English child actresses People from Oxfordshire British expatriate actresses in the United States Hidden categories:  EngvarB from November 2013 Use dmy dates from June 2017 Articles with hCards Articles needing cleanup from April 2014 All pages needing cleanup Cleanup tagged articles with a reason field from April 2014 Wikipedia pages needing cleanup from April 2014 Wikipedia articles with VIAF identifiers   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Deutsch Français Italiano   \n Edit links   \n  This page was last edited on 13 November 2017, at 20:42. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}