{"url": "https://en.wikipedia.org/wiki/Harry_Potter_Lexicon", "content": "The Harry Potter Lexicon - Wikipedia \n The Harry Potter Lexicon   \n From Wikipedia, the free encyclopedia     (Redirected from  Harry Potter Lexicon ) \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \nSteve Vander Ark, creator of the Harry Potter Lexicon, speaking at the Sectus conference in London in 2007 \n The Harry Potter Lexicon  is a fan-created online  encyclopedia  of the  Harry Potter  series. \n Contents \n 1   Overview \n 2   Lawsuit \n 3   Publication \n 4   See also \n 5   References \n 6   External links \n Overview [ edit ] \n The site was created by school librarian Steve Vander Ark. It contains detailed information for all seven published  Harry Potter  books. The Lexicon lists  characters ,  places ,  creatures ,  spells , potions and  magical devices , as well as analyzing  magical  theory and other details of the series. The Lexicon is credited as creating one of the first timelines of all events occurring in the  Harry Potter  universe. A similar timeline of events was adopted by  Warner Bros.  for inclusion with their  Harry Potter   film  DVDs, and was accepted by author  J. K. Rowling  as conforming to her works. \n The Lexicon is a winner of J. K. Rowling's Fan Site Award. Rowling said: [1] \n This is such a great site that I have been known to sneak into an  internet café  while out writing and check a fact rather than go into a bookshop and buy a copy of Harry Potter (which is embarrassing). A website for the dangerously obsessive; my natural home. \n Lawsuit [ edit ] \n Main article:  Warner Bros. and JK Rowling vs. RDR Books \n On October 31, 2007, J.K. Rowling and  Warner Brothers  filed a lawsuit against RDR Books over the publication of Vander Ark's Lexicon in book form. [2] [3] [4]  The lawsuit was heard in a  New York  court on April 14, 2008. [5]  Whilst some sources refer to Vander Ark being sued, the lawsuit actually names only RDR Books. [6] \n The lawsuit states, \n The infringing book is particularly troubling as it is in direct contravention to Ms. Rowling's repeatedly stated intention to publish her own companion books to the series. [7] \n The result of the lawsuit was that the book could be published, but not in its present form. A modified version of the book was published in 2009. This case went to  bench trial  in the New York Federal District Court of Judge Robert Patterson on April 14, 2008. RDR Books defense team, which includes solo San Francisco practitioner, Lizbeth Hasse of the Creative Industry Law Group, solo New York practitioner David Hammer, and the  Fair Use Project  at  Stanford University Law School , has replied to the suit arguing: \n In support of her position Ms Rowling appears to claim a monopoly on the right to publish literary reference guides, and other non-academic research, relating to her own fiction. This is a right no court has ever recognized. It has little to recommend it. If accepted, it would dramatically extend the reach of copyright protection, and eliminate an entire genre of literary supplements: third party reference guides to fiction, which for centuries have helped readers better access, understand and enjoy literary works. [8] \n Rowling stated that her efforts to halt the publishing of the Lexicon have been crushing her creativity, and said that she was not sure if she has \"the will or the heart\" to now publish her own encyclopedia. [9] \n On 8 September 2008, Rowling won her copyright case against RDR Books. [10]  Lexicon publisher RDR Books said: \n We are encouraged by the fact the court recognized that as a general matter authors do not have the right to stop the publication of reference guides and companion books about literary works. \n Judge Patterson said that reference materials were generally useful to the public but that in this case, Vander Ark went too far. He said that \"while the Lexicon, in its current state, is not a fair use of the Harry Potter works, reference works that share the Lexicon's purpose of aiding readers of literature generally should be encouraged rather than stifled.\" He said he ruled in Ms. Rowling's favor because the \"Lexicon appropriates too much of Rowling's creative work for its purposes as a reference guide.\" \n Publication [ edit ] \n In December, 2008, a modified (and shorter) version of Vander Ark's Lexicon was approved for publication and was released January 16, 2009 as  The Lexicon: An Unauthorized Guide to Harry Potter Fiction . [11] \n See also [ edit ] \n Harry Potter portal \n Quidditch portal \n Harry Potter fandom \n References [ edit ] \n ^   J. K. Rowling .  \"J.K.Rowling Official Site - Section: Fan Sites - The Harry Potter Lexicon\" . JKRowling.com.   \n ^   \"Rowling suing fan over new Potter book\" .  CNN . April 14, 2008. Archived from  the original  on April 15, 2008 . Retrieved  April 15,  2008 .   \n ^   Neumeister, Larry (February 29, 2008).  \"JK Rowling Bashes 'Harry Potter Lexicon ' \" . Associated Press. Archived from  the original  on March 5, 2008.   \n ^   Crace, John (March 11, 2008).  \"Harry Potter: the last battle\" .  The Guardian . London . Retrieved  May 25,  2010 .   \n ^   \"JK Rowling sues to block fan site's Harry Potter book\" . Out-law.com. March 18, 2008.   \n ^   \"Copy of Complaint\"   (PDF) . October 31, 2007.   \n ^   Kearney, Christine (October 31, 2007).  \"Rowling, Warner Bros. sue over Potter book\" .  Reuters .   \n ^   Falzone, Anthony (February 10, 2008).  \"RDR Files Opposition To Rowling's Preliminary Injunction Motion\" .  Stanford Law School .   \n ^   \"Rowling testifies in Potter case\" .  BBC News . April 14, 2008.   \n ^   \"JK Rowling Wins Copyright Claim\" . Sky News. September 9, 2008.   \n ^   \"The Lexicon: An Unauthorized Guide to Harry Potter Fiction and Related Materials\" . Amazon.ca.   \n External links [ edit ] \n Book: Harry Potter \n The Harry Potter Lexicon \n Case page  on Justia.com \n v \n t \n e \n The  Harry Potter  series by  J. K. Rowling \n Books \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows \n Film series \n Films \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Music \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Related \n Cast members \n Production of  The Deathly Hallows \n Characters \n Main \n Harry Potter \n Ron Weasley \n Hermione Granger \n Lord Voldemort \n Albus Dumbledore \n Severus Snape \n Rubeus Hagrid \n Draco Malfoy \n Supporting \n Hogwarts staff \n Order of the Phoenix \n Dumbledore's Army \n Death Eaters \n Fictional universe \n Hogwarts \n Magic \n Magical creatures \n Magical objects \n Ministry of Magic \n Muggle \n Places \n Potions \n Quidditch \n Related works \n Fantastic Beasts and Where to Find Them \n Quidditch Through the Ages \n The Tales of Beedle the Bard \n Prequel \n Pottermore \n The Cursed Child \n Hogwarts: An Incomplete and Unreliable Guide \n Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists \n Short Stories from Hogwarts of Heroism, Hardship and Dangerous Hobbies \n Games and toys \n Quidditch World Cup \n Lego Creator: Harry Potter \n Lego Harry Potter: Years 1–4 \n Lego Harry Potter: Years 5–7 \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Book of Spells \n Book of Potions \n Trading Card Game \n Lego  Harry Potter \n Attractions \n The Wizarding World of Harry Potter \n Orlando \n Japan \n Hollywood \n Dragon Challenge \n Flight of the Hippogriff \n Harry Potter and the Escape from Gringotts \n Harry Potter and the Forbidden Journey \n Hogwarts Express \n Harry Potter Movie Magic Experience \n Warner Bros. Studio Tour London \n Fandom \n Harry Potter Alliance \n The Leaky Cauldron \n MuggleNet \n LeakyCon \n Wizard rock \n Wrockstock \n Voldemort: Origins of the Heir \n Related \n Influences and analogues \n Legal disputes \n Parodies \n Politics \n Religious debates \n Translation \n A Very Potter Musical \n The Harry Potter Lexicon \n The Magical Worlds of Harry Potter \n Potter Puppet Pals \n   Book \n   Category \n   Portal \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=The_Harry_Potter_Lexicon&oldid=807649991 \"\t\t\t\t\t \n Categories :  Harry Potter websites Encyclopedias of fictional worlds   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Dansk 한국어 Nederlands Norsk nynorsk Português 中文   \n Edit links   \n  This page was last edited on 29 October 2017, at 08:43. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}