{"url": "https://en.wikipedia.org/wiki/OODA_Loop", "content": "OODA loop - Wikipedia \n OODA loop   \n From Wikipedia, the free encyclopedia     (Redirected from  OODA Loop ) \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \nDiagram of a decision cycle known as the Boyd cycle, or the OODA loop \n The phrase  OODA loop  refers to the decision cycle of  observe, orient, decide, and act , developed by  military strategist  and  United States Air Force  Colonel  John Boyd . Boyd applied the concept to the  combat operations process , often at the strategic level in military operations. It is now also often applied to understand commercial operations and learning processes. The approach favors agility over raw power in dealing with human opponents in any endeavor. \n Contents \n 1   Overview \n 2   Applicability \n 3   See also \n 4   Notes \n 5   References \n 6   External links \n Overview [ edit ] \n The OODA loop has become an important concept in  litigation , [1]  business, [2]   law enforcement , [3]  and  military strategy . According to Boyd,  decision-making  occurs in a recurring cycle of observe-orient-decide-act. An entity (whether an individual or an organization) that can process this cycle quickly, observing and reacting to unfolding events more rapidly than an opponent can thereby \"get inside\" the opponent's decision cycle and gain the advantage. Frans Osinga has argued that Boyd's own views on the OODA loop are much deeper, richer, and more comprehensive than the common interpretation of the \"rapid OODA loop\" idea. [4] \n Boyd developed the concept to explain how to direct one's energies to defeat an adversary and survive. Boyd emphasized that \"the loop\" is actually a set of interacting loops that are to be kept in continuous operation during combat. He also indicated that the phase of the battle has an important bearing on the ideal allocation of one's energies. \n Boyd's diagram shows that all decisions are based on observations of the evolving situation tempered with implicit filtering of the problem being addressed. The observations are the raw information on which decisions and actions are based. The observed information must be processed to orient it for decision making. In notes from his talk \"Organic Design for Command and Control\", Boyd said, \n The second O, orientation—as the repository of our genetic heritage, cultural tradition, and previous experiences—is the most important part of the O-O-D-A loop since it shapes the way we observe, the way we decide, the way we act. \n As stated by Boyd and shown in the \"Orient\" box, there is much filtering of the information through our culture, genetics, ability to analyze and synthesize, and previous experience. Since the OODA Loop was designed to describe a single decision maker, the situation is usually much more complex than shown, as most business and technical decisions have a team of people observing and orienting, each bringing their own cultural traditions, genetics, experience and other information. It is here that decisions often get stuck, which does not lead to winning, because: \n In order to win, we should operate at a faster tempo or rhythm than our adversaries—or, better yet, get inside [the] adversary's Observation-Orientation-Decision-Action time cycle or loop ... Such activity will make us appear ambiguous (unpredictable) thereby generate confusion and disorder among our adversaries—since our adversaries will be unable to generate mental images or pictures that agree with the menacing, as well as faster transient rhythm or patterns, they are competing against. \n The OODA loop, which focuses on strategic military requirements, was adapted for business and public sector operational continuity planning. Compare it to the  Plan Do Check Act (PDCA) cycle  or  Shewhart cycle . \n As one of Boyd's colleagues, Harry Hillaker, put it in \"John Boyd,  USAF  Retired, Father of the  F16 \": \n The key is to obscure your intentions and make them unpredictable to your opponent while you simultaneously clarify his intentions. That is, operate at a faster tempo to generate rapidly changing conditions that inhibit your opponent from adapting or reacting to those changes and that suppress or destroy his awareness. Thus, a hodgepodge of confusion and disorder occur to cause him to over- or under-react to conditions or activities that appear to be uncertain, ambiguous, or incomprehensible. \n The OODA Loop also serves to explain the nature of surprise and shaping operations in a way that unifies  Gestalt psychology ,  cognitive science  and  game theory  in a comprehensive theory of strategy.  Utility theory  (the basis of game theory) describes how decisions are made based on the perceived value of taking an action. The OODA Loop shows that prior to making a decision (the Decide phase), the person will first have to get information (Observe) and determine what it means to him and what he can do about it (Orient). In this way, the utility sought at the Decide phase can be altered by affecting the information the opponent receives and the  cognitive model  he applies when orienting upon it. [5] \n Writer  Robert Greene  wrote in an article called  OODA and You  that \n ... the proper mindset is to let go a little, to allow some of the chaos to become part of his mental system, and to use it to his advantage by simply creating more chaos and confusion for the opponent. He funnels the inevitable chaos of the battlefield in the direction of the enemy. \n Applicability [ edit ] \n Consider a  fighter  pilot being scrambled to shoot down an enemy aircraft. \n Before the enemy airplane is even within visual range, the pilot will consider any available information about the likely identity of the enemy pilot—the nationality, level of training, and cultural traditions that may come into play. \n When the enemy aircraft comes into radar contact, more direct information about the speed, size, and maneuverability of the enemy plane becomes available; unfolding circumstances take priority over radio chatter. A first decision is made based on the available information so far: The pilot  decides  to \"get into the sun\" above his opponent, and  acts  by applying control inputs to climb. Back to  observation —is the attacker reacting to the change of altitude? Then comes  orient : Is the enemy reacting characteristically, or perhaps acting like a noncombatant? Is his plane exhibiting better-than-expected performance? \n As the  dogfight  begins, little time is devoted to orienting unless some new information pertaining to the actual identity or intent of the attacker comes into play. Information cascades in real time, and the pilot does not have time to process it consciously; the pilot reacts as he is trained to, and conscious thought is directed to supervising the flow of action and reaction, continuously repeating the OODA cycle. Simultaneously, the opponent is going through the same cycle. \n One of John Boyd's primary insights in fighter combat was that it is vital to change speed and direction faster than the opponent. This may interfere with an opponent's OODA cycle. It is not necessarily a function of the plane's ability to maneuver, but the pilot must think and act faster than the opponent can think and act. Getting \"inside\" the cycle, short-circuiting the opponent's thinking processes, produces opportunities for the opponent to react inappropriately. \n Another tactical-level example can be found on the basketball court, where a player takes possession of the ball and must get past an opponent who is taller or faster. A straight  dribble  or pass is unlikely to succeed. Instead, the player may engage in a rapid and elaborate series of body movements designed to befuddle the opponent and deny him the ability to take advantage of his superior size or speed. At a basic level of play, this may be merely a series of fakes, with the hope that the opponent will make a mistake or an opening will occur, but practice and mental focus may allow one to accelerate tempo, get inside the opponent's OODA loop, and take control of the situation, causing the opponent to move in a particular way and generating an advantage rather than merely reacting to an accident. Taking control of the situation is key. It is not enough to speed through OODA faster, which results in flailing. \n The same cycle operates over a longer timescale in a competitive business landscape, and the same  logic  applies. Decision makers gather information (observe), form hypotheses about customer activity and the intentions of competitors (orient), make decisions, and act on them. The cycle is repeated continuously. The aggressive and conscious application of the process gives a business advantage over a competitor who is merely reacting to conditions as they occur or has poor awareness of the situation. Especially in business, in which teams of people are working the OODA Loop, it often gets stuck at the \"D\" (see Ullman) and no action is taken allowing the competition to gain the upper hand or resources to be wasted. \n The approach favors agility over raw power in dealing with human opponents in any endeavor. Boyd put the ethos into practice with his work for the United States Air Force. He was an advocate of maneuverable fighter aircraft, in contrast to the heavy, powerful jet fighters (such as the  McDonnell Douglas F-4 Phantom II ) that were prevalent in the 1960s. Boyd inspired the  Lightweight Fighter program  (LWF) that produced the successful  General Dynamics F-16 Fighting Falcon  and  McDonnell Douglas F/A-18 Hornet , which are still in use by the United States and several other military powers into the 21st century. \n See also [ edit ] \n United States Air Force portal \n Control theory \n Decision cycle \n Double-loop learning \n Learning cycle \n Maneuver warfare \n Mental model \n Nursing process \n Problem solving \n Situation awareness \n SWOT analysis \n Notes [ edit ] \n ^   See, e.g. Dreier pp. 20–85 \n ^   See, e.g. Richards pp. 162–171 \n ^   Papenfuhs, Steve (Pappy).  \"The OODA loop, reaction time, and decision making\" . PoliceOne.com . Retrieved  3 November  2016 .   \n ^   Osinga, Frans.  Science Strategy and War, The Strategic Theory of John Boyd . Abingdon, UK: Routledge.  ISBN   0-415-37103-1 .   \n ^   See, e.g. Dreier pp. 79–85 \n References [ edit ] \n Boyd, John R. (3 September 1976).  Destruction and Creation   (PDF) . U.S. Army Command and General Staff College.   \n Boyd, John, R.,  The Essence of Winning and Losing, 28 June 1995  a five slide set by Boyd. \n Dreier, A.S.,  Strategy, Planning & Litigating to Win , Boston, MA: Conatus Press,  ISBN   9780615676951 \n Greene, Robert ,  OODA and You \n Hillaker, Harry,  Code one magazine ,  \"John Boyd,   USAF  Retired, Father of the F16\", July 1997. \n Kotnour, Jim,  \"Leadership Mechanisms for Enabling Learning Within Project Teams\"  in  Proceedings from the Third European Conference on Organizational Knowledge , Learning and Capabilities, Proceedings OKLC 2002 \n Linger, Henry,  Constructing The Infrastructure for the Knowledge Economy: Methods and Tools, Theory and Practice , p. 449 \n Metayer, Estelle,  Decision making: It's all about taking off – and landing safely… , Competia, December 2011 \n Osinga, Frans, \" Science, Strategy and War The Strategic Theory of John Boyd \" \n Richards, Chet,  Certain to Win: the Strategy of John Boyd, Applied to Business  (2004)  ISBN   1-4134-5377-5 \n Ullman, David G.,  “OO-OO-OO!” The Sound of a Broken OODA Loop , Crosstalk, April 2007 \n External links [ edit ] \n Archived documents \n Video: The OODA Loop and Clausewitzian \"Friction\" \n Bazin, A. (2005). Boyd's OODA Loop and the Infantry Company Commander. Infantry Magazine. \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=OODA_loop&oldid=811637243 \"\t\t\t\t\t \n Categories :  United States Air Force Intelligence analysis Strategy Systems analysis Feedback Hidden categories:  Use dmy dates from April 2017   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Deutsch Español Français 日本語 Polski Русский Suomi Svenska Українська 中文   \n Edit links   \n  This page was last edited on 22 November 2017, at 22:37. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}