{"url": "https://meta.wikimedia.org/wiki/Privacy_policy/it", "content": "Informativa sulla riservatezza - Meta \n Informativa sulla riservatezza   \n From Meta, a Wikimedia project coordination wiki   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This page is a  translated version  of the page  Privacy policy  and the translation is 100% complete. \n Other languages: \n العربية  • ‎ azərbaycanca  • ‎ تۆرکجه  • ‎ башҡортса  • ‎ беларуская  • ‎ български  • ‎ روچ کپتین بلوچی  • ‎ বাংলা  • ‎ bosanski  • ‎ català  • ‎ нохчийн  • ‎ کوردی  • ‎ čeština  • ‎ Cymraeg  • ‎ dansk  • ‎ Deutsch  • ‎ Deutsch (Sie-Form)‎  • ‎ Zazaki  • ‎ Ελληνικά  • ‎ emiliàn e rumagnòl  • ‎ English  • ‎ Canadian English  • ‎ British English  • ‎ Esperanto  • ‎ español  • ‎ euskara  • ‎ فارسی  • ‎ suomi  • ‎ français  • ‎ Nordfriisk  • ‎ Frysk  • ‎ galego  • ‎ Avañe'ẽ  • ‎ ગુજરાતી  • ‎ עברית  • ‎ हिन्दी  • ‎ hrvatski  • ‎ magyar  • ‎ Bahasa Indonesia  • ‎ italiano  • ‎ 日本語  • ‎ ქართული  • ‎ ភាសាខ្មែរ  • ‎ 한국어  • ‎ Ripoarisch  • ‎ Кыргызча  • ‎ Lëtzebuergesch  • ‎ Ligure  • ‎ lietuvių  • ‎ Basa Banyumasan  • ‎ македонски  • ‎ മലയാളം  • ‎ Bahasa Melayu  • ‎ မြန်မာဘာသာ  • ‎ مازِرونی  • ‎ Napulitano  • ‎ norsk bokmål  • ‎ नेपाली  • ‎ Nederlands  • ‎ Nederlands (informeel)‎  • ‎ occitan  • ‎ ਪੰਜਾਬੀ  • ‎ polski  • ‎ پښتو  • ‎ português  • ‎ português do Brasil  • ‎ română  • ‎ русский  • ‎ sicilianu  • ‎ Scots  • ‎ سنڌي  • ‎ ၽႃႇသႃႇတႆး   • ‎ සිංහල  • ‎ Soomaaliga  • ‎ shqip  • ‎ српски / srpski  • ‎ svenska  • ‎ Kiswahili  • ‎ தமிழ்  • ‎ తెలుగు  • ‎ тоҷикӣ  • ‎ ไทย  • ‎ Türkçe  • ‎ удмурт  • ‎ українська  • ‎ اردو  • ‎ Tiếng Việt  • ‎ მარგალური  • ‎ ייִדיש  • ‎ Yorùbá  • ‎ 粵語  • ‎ 中文 \n Vuoi contribuire a tradurre?  Traduci i messaggi mancanti . \n Questa è una sintesi dell'Informativa sulla privacy. Per leggere i termini completi,  fai clic qui . \n Dichiarazioni di non responsabilità: Questa sintesi non fa parte dell'Informativa sulla privacy e non è un documento legale. Si tratta di un pratico riferimento per comprendere la completa Informativa sulla privacy. Considerala come un'interfaccia intuitiva della nostra Informativa sulla privacy. \n Riteniamo che tu non debba fornire informazioni personali per partecipare al movimento del libero sapere, pertanto puoi: \n Leggere, modificare o usare i siti Wikimedia  senza registrare un'utenza . \n Registrare un'utenza  senza fornire  un indirizzo e-mail o un nome reale. \n Desideriamo comprendere come vengono usati i Siti Wikimedia in modo da migliorarli, pertanto raccogliamo alcune informazioni quando tu: \n Effettui  contributi pubblici . \n Registri un'utenza  o aggiorni la tua pagina utente. \n Utilizzi  i Siti Wikimedia. \n Ci invii  email  o partecipi a  un sondaggio o comunichi il tuo feedback . \n Ci impegniamo a: \n Descrivere come potrebbero essere usate o  condivise  le tue informazioni in questa Informativa sulla privacy. \n Utilizzare misure ragionevoli per mantenere le tue informazioni  sicure . \n Non  vendere  mai le tue informazioni né condividerle con terzi per finalità di marketing. \n Condividere  soltanto le tue informazioni in circostanze limitate, come per  migliorare i Siti Wikimedia , per  rispettare la legge  o per  proteggere te e gli altri . \n Conservare i tuoi dati  per il più breve tempo possibile in modo da poter mantenere, comprendere e migliorare i Siti Wikimedia e i nostri obblighi ai sensi di legge. \n Attenzione: \n Qualsiasi contenuto da te aggiunto o qualsiasi modifica da te apportata a un Sito Wikimedia sarà  pubblicamente e permanentemente disponibile . \n Se aggiungi contenuti o apporti modifiche a un Sito Wikimedia  senza effettuare il login , quel contenuto o quella modifica sarà pubblicamente e permanentemente attribuita all'indirizzo IP usato al momento piuttosto che al nome utente. \n La nostra comunità di autori e collaboratori volontari è un organismo che si auto-regola. Alcuni amministratori dei Siti Wikimedia, scelti dalla comunità, utilizzano strumenti che garantiscono loro accesso limitato a informazioni non pubbliche sui contributi recenti, in modo da poter proteggere i Siti Wikimedia e applicare le politiche. \n La presente Informativa sulla privacy  non si applica  a tutti i siti e i servizi gestiti dalla Fondazione Wikimedia, come i siti o i servizi che dispongono della propria informativa sulla privacy (come il  Negozio Wikimedia ) o i siti o servizi gestiti da terzi (come i progetti di sviluppatori terzi su  Labs ). \n Nell'ambito del nostro impegno alla formazione e alla ricerca nel mondo, occasionalmente pubblichiamo informazioni pubbliche e informazioni aggregate o non personali al pubblico generale, mediante depositi di dati o insiemi di dati. \n Per la protezione della Fondazione Wikimedia e di altri utenti, se non accetti la presente Informativa sulla privacy non puoi usare i Siti Wikimedia. \n Introduzione \n Utilizzo delle informazioni \n Condivisione \n Protezione \n Informazioni importanti \n Contents  \n Contents \n 1   Introduzione \n 1.1   Benvenuto! \n 1.1.1   Definizioni \n 1.1.2   Cosa è disciplinato e cosa non lo è da questa informativa sulla riservatezza \n 2   Utilizzo delle informazioni \n 2.1   Tipi di informazioni che riceviamo da te, come le otteniamo e come le usiamo \n 2.1.1   I tuoi contributi pubblici \n 2.1.2   Informazioni relative all'utenza e registrazione \n 2.1.3   Informazioni relative al tuo utilizzo dei siti Wikimedia \n 2.1.3.1   Informazioni che riceviamo automaticamente \n 2.1.3.2   Informazioni che raccogliamo \n 2.1.3.3   Indirizzi e-mail \n 2.1.3.4   Sondaggi e commenti \n 2.1.3.5   Informazioni sulla localizzazione \n 2.1.3.5.1   GPS e altre tecnologie di localizzazione \n 2.1.3.5.2   Metadati \n 2.1.3.5.3   Indirizzi IP \n 3   Condivisione \n 3.1   Quando possiamo condividere le tue informazioni? \n 3.1.1   Con il tuo consenso \n 3.1.2   Per motivi legali \n 3.1.3   Trasferimento di proprietà dell'Organizzazione (davvero improbabile!) \n 3.1.4   Per proteggere te, noi e altri \n 3.1.5   Ai nostri fornitori di servizi \n 3.1.6   Per capire e sperimentare \n 3.1.7   Perché voi li rendete pubblici \n 4   Protezione \n 4.1   Come proteggiamo i vostri dati? \n 4.2   Per quanto conserviamo i vostri dati? \n 5   Informazioni importanti \n 5.1   Dove si trova la Fondazione e che cosa significa per me? \n 5.2   La nostra risposta ai segnali Do Not Track (DNT) \n 5.3   Modifiche a questa Informativa sulla Privacy \n 5.4   Contattaci \n 5.5   Grazie! \n Questa è una traduzione. Per la versione ufficiale e vincolante del presente documento, consultare il  documento originale in lingua inglese . \n  Introduzione \n Benvenuto! \n La Wikimedia Foundation è l'organizzazione senza scopo di lucro che ospita siti collaborativi di conoscenza libera come  Wikipedia ,  Wikimedia Commons , e  Wikizionario . \n Questa informativa spiega come sono raccolti, utilizzati e condivisi i tuoi dati personali. \n Raccogliamo un quantitativo molto ridotto di informazioni su di te. \n Non affittiamo né rivendiamo i tuoi dati a terze parti. \n Utilizzando i siti Wikimedia, accetti questa informativa. \n Il movimento Wikimedia si basa su un principio semplice ma potente: insieme possiamo fare di più di quanto chiunque di noi possa fare da solo. Non possiamo lavorare collettivamente senza aggregare, condividere e analizzare informazioni sui nostri utenti, dal momento che ciò ci permette di cercare nuovi modi per rendere i siti Wikimedia più funzionali, sicuri e utili. \n Crediamo che la raccolta delle informazioni e il loro uso vadano di pari passo con la trasparenza. Questa informativa sulla riservatezza spiega come la Wikimedia Foundation, l'organizzazione senza scopo di lucro che ospita i siti Wikimedia come Wikipedia, raccoglie, utilizza e condivide i dati ricevuti attraverso l'utilizzo dei siti stessi. È essenziale capire che, utilizzando tali siti, acconsenti alla raccolta, al trasferimento, all'elaborazione, alla memorizzazione, alla comunicazione e all'uso delle tue informazioni come descritto in questa informativa. Ciò significa che è importante leggerla attentamente. \n Riteniamo che per partecipare al movimento del sapere libero non si debba essere costretti a fornire informazioni personali. Non sei tenuto a fornire informazioni come il nome reale, l'indirizzo o la tua data di nascita per registrare una utenza standard o contribuire ai siti Wikimedia. \n Non vendiamo né affittiamo le tue informazioni riservate, né le comunichiamo a soggetti terzi con lo scopo di venderti prodotti o servizi. Le usiamo per comprendere come rendere i siti Wikimedia più coinvolgenti e accessibili, per vedere quali idee funzionano e per rendere l'apprendimento e la collaborazione più divertenti. Per dirla in parole povere: utilizziamo le tue informazioni per rendere i siti Wikimedia migliori per te. \n Dopo tutto, sono le persone come te, i \"campioni del sapere libero\", che rendono possibile non solo l'esistenza, ma anche la crescita e il progresso dei siti Wikimedia. \n Definizioni \n Dal momento che tutti (non solo gli esperti di diritto) dovrebbero essere in grado di capire facilmente come e perché le loro informazioni sono raccolte e utilizzate, all'interno di questa informativa utilizzeremo un linguaggio comune anziché termini più formali. Qui c'è una tabella di traduzioni: \n Quando diciamo \n ... intendiamo: \n “la Fondazione Wikimedia” / “la Fondazione” / “noi” / “ci” / “nostro” \n La Fondazione Wikimedia, Inc, l'organizzazione senza scopo di lucro che gestisce i Siti Wikimedia. \n “Siti Wikimedia” / “i nostri servizi” \n I siti web e i servizi Wikimedia (indipendentemente dalla\n lingua), compresi i progetti principali, come Wikipedia e Wikimedia Commons, nonché le applicazioni mobili, le API, le email e le notifiche; a eccezione, tuttavia, di siti e servizi elencati in “Cosa non copre la presente Informativa sulla privacy” di cui sopra. \n “tu” / “tuo” / “me” \n L'utente, indipendentemente dal fatto che si tratti di un singolo, un gruppo o un'organizzazione e indipendentemente dal fatto che usi i Siti Wikimedia o i nostri servizi per conto proprio o di qualcun altro. \n “la presente Informativa” / “la presente Informativa sulla privacy” \n Questo documento, dal titolo “Informativa sulla privacy della Fondazione Wikimedia”. \n “contributi” \n I contenuti che aggiungi o le modifiche che apporti a qualsiasi Sito Wikimedia. \n “informazioni personali” \n Le informazioni che ci fornisci o quelle da noi raccolte\n che potrebbero essere usate per identificarti personalmente. A fini di chiarezza, sebbene non raccogliamo necessariamente tutte le tipologie seguenti di informazioni, riteniamo almeno che quelle che seguono siano “informazioni personali” se non sono pubbliche e possono essere usate per identificarti: \n (a) il tuo vero nome, indirizzo, numero di telefono, indirizzo email, password, numero di identificazione su una carta di identità emessa dal governo, indirizzo IP, informazioni utente-agente, numero di carta di credito; \n (b) quando associate con una delle voci alla lettera (a), qualsiasi dato sensibile come la data di nascita, il genere, l'orientamento sessuale, le origini razziali o etniche, lo stato civile o familiare, le condizioni mediche o disabilità, l'affiliazione politica e la religione; e \n (c) qualsiasi voce di cui alle lettere (a) o (b) quando associate con la tua utenza. \n “terza parte” / “terze parti” \n Soggetti, enti, siti web, servizi, prodotti e applicazioni non controllate, gestite od operate dalla Fondazione Wikimedia. Questo include altri utenti Wikimedia e organizzazioni o gruppi indipendenti che aiutano a promuovere il movimento Wikimedia come i  capitoli Wikimedia , le organizzazioni tematiche  e i  gruppiutenti  nonché i volontari, i dipendenti, gli amministratori,i funzionari, i  beneficiari di sovvenzioni  e i subappaltatori di tali organizzazioni o gruppi. \n Siamo consapevoli che solo pochi utenti hanno familiarità con termini tecnici come \"pixel di tracciamento\" e \"cookies\", usati in questa informativa sulla riservatezza. Sia che si ignori completamente la terminologia relativa alla riservatezza, sia si sia esperti in materia che vogliono solo ripassare, il nostro  Glossario dei termini chiave  potrebbe essere d'aiuto. \n Cosa è disciplinato e cosa non lo è da questa informativa sulla riservatezza \n Eccetto per quanto specificato sotto, questa informativa sulla riservatezza si applica alla raccolta e alla gestione delle informazioni che ti riguardano e che riceviamo come effetto dell'utilizzo, da parte tua, di uno qualsiasi dei siti Wikimedia. Questa informativa si applica anche a qualsiasi informazione ricevuta dai nostri partner o da altre terze parti. Per capire meglio cosa sia regolamentato da questa informativa, vedi sotto. \n Esempi di ciò che questa informativa sulla riservatezza regolamenta \n Per chiarezza, questa informativa sulla riservatezza, indipendentemente dalla lingua nella quale è scritta, regolamenta: \n Tutti i nostri siti principali ( elenco dei progetti principali ), come Wikipedia, comprese le pagine relative ai profili utente, alle discussioni, e alle bacheche. \n I nostri blog e le API (a meno che non siano state realizzate linee guida distinte per quei servizi). \n Le versioni mobile dei nostri siti e le nostre applicazioni, che possono essere trovate nell'elenco ufficiale. \n Le e-mail, gli SMS e le notifiche inviate da noi o ricevute da te. \n Questa informativa sulla riservatezza non regolamenta alcuni ambiti in cui potremmo aggregare o elaborare informazioni. Per esempio, alcune di questi ambiti potrebbero essere regolamentati da informative distinte (come quelle di [$shopurl Wikimedia Shop] o di siti e servizi gestiti da terze parti, come i progetti sviluppati da terzi in [$laburl Wikimedia Labs]). Puoi trovare qui sotto degli esempi di cosa questa informativa sulla riservatezza non regolamenta: \n Ulteriori informazioni su cosa la presente Informativa sulla privacy non copre \n La presente sezione costituisce parte dell'Informativa sulla privacy e intende spiegare nel dettaglio quali situazioni non sono coperte dalla nostra Informativa sulla privacy. \n Siti Wikimedia con informative alternative \n Alcuni siti web della Fondazione Wikimedia dispongono di informative sulla privacy alternative o di disposizioni che divergono dalla presente Informativa sulla privacy. Questi siti web includono:\n il Negozio Wikimedia  (coperto dalla  informativa del negozio ); e \n donate.wikimedia.org , inclusa la procedura di donazione, come l'azione di fare clic su un banner di donazione (coperto dalla  Informativa sulla privacy del donatore ). \n Questi siti, e altri simili, forniranno un link alla propria informativa sulla privacy (se è distinta) o a una spiegazione di eventuali disposizioni divergenti (se l'informativa del sito si basa sulla presente Informativa sulla privacy). \n Membri della comunità \n I Siti Wikimedia sono il frutto di passione e collaborazione, e sono mantenuti e aggiornati costantemente da una comunità globale di volontari. Pertanto, alcuni volontari hanno accesso a certe informazioni non pubbliche e l'uso di tali informazioni potrebbe non essere disciplinato da questa Informativa sulla privacy. Alcuni esempi includono:\n Volontari amministrativi , come  CheckUser  o  Steward . Questi sono volontari che mettono in atto le policy dei Siti Wikimedia e garantiscono la sicurezza degli stessi. Quando questi amministratori accedono a informazioni non pubbliche, sono tenuti a rispettare la nostra  Policy di accesso a informazioni non pubbliche , nonché altre policy specifiche per quello strumento. \n Fornitori di strumenti . Supportiamo le piattaforme in modo che sviluppatori terzi possano sperimentare e sviluppare nuovi strumenti e siti, come i Laboratori  Labs wmflabs.org . Quando utilizzi uno di questi strumenti sviluppati da tali volontari, potresti trasferire agli stessi delle informazioni. Quando questi volontari accedono alle informazioni non pubbliche, sono tenuti a rispettare i termini che disciplinano la particolare piattaforma sulla quale è disponibile lo strumento. \n Altri utenti . Forniamo numerosi strumenti che consentono agli utenti di comunicare tra loro. Le comunicazioni possono essere coperte dalla presente Informativa quando attraversano i nostri sistemi, ma gli utenti che ricevono tali comunicazioni, e l'uso che ne fanno, non sono coperti da questa Informativa. Alcuni esempi includono:\n pubblicare su liste di email ospitate dalla Fondazione; \n richiedere supporto ai volontari tramite il  sistema online di assistenza  (email inviate a info[at]wikimedia.org raggiungono questo sistema); \n inviare email ad altri utenti tramite i Siti Wikimedia (ad esempio usando la funzionalità \"Invia email a questo utente\"); e \n chattare su  IRC  (come sul canale #wikipedia). \n Terzi \n La presente Informativa sulla privacy copre soltanto la modalità con cui WMF raccoglie e gestisce informazioni. I terzi che potrebbero ricevere informazioni quando tu utilizzi i Siti Wikimedia possono includere:\n Fornitori di servizi  che potremmo usare per assisterci nella fornitura dei nostri servizi agli utenti. Ad esempio, le nostre azioni riguardanti le tue informazioni sul  nostro blog  sono coperte dalla presente Informativa sulla privacy, ma se il nostro blog è ospitato da  WordPress , anche WordPress potrebbe raccogliere informazioni inviate automaticamente dal tuo browser o tramite cookie che WordPress installa. Se sei curioso di conoscere le pratiche relative alla privacy di fornitori terzi, fai riferimento direttamente alle loro informative sulla privacy. \n I Siti web gestiti da altre organizzazioni , come i siti collegati dalle sezioni \"Note\" di Wikipedia, o gestiti dai capitoli di Wikimedia o altre  organizzazioni del movimento . Queste organizzazioni possono ricevere informazioni da te se visiti i loro siti dopo aver usato uno dei Siti Wikimedia. Sono disciplinati dalle loro informative sulla privacy. \n Applicazioni mobili fornite da altre organizzazioni o individui . Tali organizzazioni o individui possono ricevere informazioni da te se usi le loro applicazioni per accedere ai Siti Wikimedia o ai contenuti degli stessi. Sono disciplinati dalle loro informative sulla privacy. \n Strumenti di raccolta dati appartenenti a terzi  collocati sui Siti Wikimedia dai volontari o da terzi. A volte, i volontari potrebbero collocare uno strumento di raccolta dati, come uno script, gadget, pixel di tracciamento o pulsante di condivisione, su un Sito Wikimedia senza che ne siamo a conoscenza. La presente Informativa non copre il modo in cui i terzi gestiscono le informazioni che ricevono a seguito di tale strumento. Se incontri uno strumento di terzi e ritieni che esso sia in violazione della presente Informativa, puoi rimuovere lo strumento personalmente o segnalarlo a privacy[at]wikimedia.org in modo che possiamo indagare. \n Laddove le politiche della comunità disciplinano le informazioni, come la  politica sui CheckUser , la comunità pertinente può integrare le regole e gli obblighi indicati in questa informativa. Tuttavia, non è consentito loro di creare nuove eccezioni o altrimenti ridurre le protezioni previste da questa informativa. \n Torna all'inizio   \n  Utilizzo delle informazioni \n Tipi di informazioni che riceviamo da te, come le otteniamo e come le usiamo \n I tuoi contributi pubblici \n Qualsiasi cosa tu scriva sui siti Wikimedia può essere visto e utilizzato da chiunque. \n I siti Wikimedia sono stati creati primariamente per aiutarti a condividere le tue conoscenze con il resto del mondo, e noi condividiamo i tuoi contributi perché tu ci hai chiesto di farlo. \n Quando invii un tuo contributo a qualsiasi sito Wikimedia, compreso quando lo fai in pagine utente o di discussione, stai creando una registrazione permanente e pubblica di ogni parte di contenuto aggiunta, rimossa o modificata da te. La cronologia della pagina mostrerà quando il tuo contributo o la tua cancellazione è stata eseguita, così come il tuo nome utente (se hai effettuato l'accesso) o il tuo  Indirizzo IP  (se non hai eseguito l'accesso). Possiamo usare i tuoi contributi pubblici, sia in forma aggregata insieme ai contributi pubblici di altri utenti, sia individualmente, per creare per te nuove funzionalità o prodotti collegati ai dati, sia per saperne di più di come i siti Wikimedia sono utilizzati. \n Ove non diversamente indicato da questa informativa, devi intendere che l'informazione che invii attivamente come contributo ai siti Wikimedia, comprese informazioni personali, è pubblicamente visibile e può essere trovata dai motori di ricerca. Come la maggior parte delle cose presenti in Rete, qualsiasi cosa tu condivida può essere copiata e ridistribuita su Internet da altre persone. Sei quindi pregato/a di non fornire alcuna informazione che tu non sia d'accordo a rendere permanentemente pubblica, come rivelare il tuo vero nome o i luoghi da cui contribuisci. \n Sii consapevole che dati specifici che tu rendi pubblici, o dati aggregati che noi rendiamo pubblici, possono essere utilizzati liberamente da tutti per analisi e per dedurre informazioni sugli utenti, ad esempio di quale nazione è un utente, la sua affiliazione politica o il genere. \n Torna all'inizio   \n Informazioni relative all'utenza e registrazione \n Non è necessario creare una utenza per usare i siti Wikimedia \n Se crei una utenza, non è necessario fornire il tuo nome o indirizzo di posta elettronica. \n Se non crei una utenza, i tuoi contributi saranno pubblicamente attribuiti al tuo  indirizzo IP . \n Vuoi creare una utenza? Ottimo! Non desideri farlo? Nessun problema! \n  Non ti è richiesto di creare una utenza per leggere o contribuire a un sito Wikimedia. Tuttavia, se contribuirai senza effettuare l'accesso, il tuo contributo sarà pubblicamente attribuito all' indirizzo IP  associato al dispositivo con cui sei connesso. \n  Se vuoi creare una  utenza standard , nella maggioranza dei casi non è richiesto di fornire alcuna informazione personale. Il nome utente sarà pubblicamente visibile, perciò utilizza come nome utente il tuo vero nome solo dopo averci riflettuto attentamente. La password viene utilizzata solo per verificare che l'account a cui ti colleghi sia effettivamente il tuo. Il tuo  indirizzo IP  è automaticamente inviato a noi, e lo registriamo temporaneamente per aiutarci nella prevenzione di abusi. Nessun altra informazione personale è richiesta: nessun nome, nessun indirizzo email, nessuna data di nascita, nessun dato relativo a carte di credito. \n Una volta create, le utenze non possono essere del tutto rimosse (sebbene sia generalmente possibile nascondere le informazioni della propria pagina utente). Questo perché i tuoi contributi pubblici devono essere associati ai relativi autori (tu!). Perciò fai in modo di scegliere un nome col quale non avrai problemi anche negli anni a venire. \n Per ottenere una migliore comprensione della distribuzione demografica dei nostri utenti, per ragioni di localizzazione e per migliorare i nostri servizi, potrebbe essere necessario per noi richiedere informazioni demografiche, come genere o età. Ti preciseremo se quelle informazioni dovranno intendersi pubbliche o private, in modo che tu possa prendere una decisione consapevole sulla tua scelta di fornire tali informazioni. Fornirci informazioni di questo tipo è sempre completamente opzionale: se non vuoi fornirla, non sei tenuto - semplicemente. \n Torna all'inizio   \n Informazioni relative al tuo utilizzo dei siti Wikimedia \n Potremmo ricorrere a tecnologie di uso comune per raccogliere informazioni su come utilizzi i siti Wikimedia. \n Utilizziamo queste informazioni per migliorare la tua esperienza di navigazione e per sviluppare nuove funzionalità dei nostri siti. \n Vogliamo migliorare i progetti Wikimedia attraverso una maggiore conoscenza dell'uso che ne fai. Ad esempio: la frequenza di visita ai siti Wikimedia, cosa ti piace, cosa trovi più utile, come sei arrivato ai nostri siti e se utilizzeresti di più una funzionalità qualora fosse spiegata diversamente. Vogliamo anche che questo regolamento e le nostre prassi riflettano i valori della nostra comunità. Le informazioni relative all'uso che fai dei siti Wikimedia le manteniamo confidenziali, salvo quanto previsto in questo regolamento. \n Torna all'inizio   \n Informazioni che riceviamo automaticamente \n Come altri siti web, riceviamo automaticamente alcune informazioni su di te quando visiti i siti Wikimedia. Queste informazioni ci aiutano ad amministrare i siti Wikimedia e a migliorare la tua esperienza di navigazione. \n Per come funzionano i browser e così come succede per altri importanti siti web, quando tu visiti i siti Wikimedia noi riceviamo alcune informazioni in maniera automatica. Queste informazioni comprendono il tipo di dispositivo utilizzato per la connessione (inclusi a volte i numeri identificativi del dispositivo stesso), il tipo e la versione del tuo  browser , la lingua impostata come preferita nel tuo browser, il tipo e la versione del tuo  sistema operativo , in alcuni casi il nome del tuo provider internet o operatore di telefonia mobile, il sito web che ti ha rimandato ai siti Wikimedia, quali pagine hai richiesto e visitato, e data/ora di ogni richiesta da te inviata ai siti Wikimedia. \n Per dirla semplicemente, utilizziamo queste informazioni per migliorare la tua esperienza nei siti Wikimedia. Ad esempio possiamo usarle per fini amministrativi dei siti, per migliorare la sicurezza e combattere il vandalismo; per ottimizzare le applicazioni mobili, fornire contenuti personalizzati e impostare le preferenze di lingua, testare funzionalità per vedere come funzionano e migliorare le prestazioni del sistema; capire come gli utenti interagiscono con i siti Wikimedia, registrare e analizzare l'uso di varie funzionalità, migliorare la conoscenza della consistenza demografica dei diversi siti Wikimedia e analizzare le tendenze d'uso. \n Torna all'inizio   \n Informazioni che raccogliamo \n Utilizziamo varie tecnologie di uso comune, come i cookies, per comprendere come utilizzi i siti Wikimedia, rendere i nostri servizi più sicuri e più facili da usare e aiutarci a creare una esperienza di navigazione migliore e più personalizzata. \n Raccogliamo attivamente alcuni tipi di informazioni con diverse tecnologie di uso comune. Queste possono comprendere i  pixel di tracciamento ,  Javascript  e un insieme di tecnologie relative ai \"dati memorizzati localmente\" quali  Cookies  e  local storage . Siamo consapevoli che alcune di queste tecnologie non hanno la migliore reputazione e possono essere utilizzate per scopi poco nobili, perciò vogliamo che sia quanto più possibile chiaro il motivo per cui le utilizziamo e quali informazioni raccogliamo con esse. \n A seconda della tecnologia usata, i dati memorizzati localmente possono essere testo, immagini o interi articoli/voci (come viene spiegato meglio più avanti), oppure informazioni personali (come il tuo  indirizzo IP ) e informazioni relative al tuo utilizzo dei siti Wikimedia (come il tuo nome utente o data/ora della visita). \n Utilizziamo queste informazioni per rendere la tua esperienza sui Siti Wikimedia migliore e più sicura, per comprendere meglio le preferenze dell'utente e le sue interazioni con i Siti Wikimedia e per migliorare in generale i nostri servizi. Non useremo mai cookie di terze parti senza prima ottenere il tuo consenso. Se per caso trovi uno strumento di raccolta dati che appartiene a terzi e che non hai autorizzato (come ad esempio uno che potrebbe essere stato inserito erroneamente da un altro utente o amministratore), segnalacelo a  privacy@wikimedia.org . \n I dati memorizzati localmente, i JavaScript e i pixel di tracciamento ci aiutano a fare cose come: \n Fornirti un'esperienza personalizzata, come ad esempio utilizzare i cookie per conoscere le tue impostazioni linguistiche, per ricordare le preferenze utente da te impostate, in modo da poterti fornire l'aspetto grafico personalizzato che preferisci e per segnalarti novità interessanti riguardanti Wikimedia ed eventi nella tua zona. \n Fornire contenuti per te più rilevanti in modo più rapido. Ad esempio utilizzando dati salvati in locale per archiviare le voci lette di recente direttamente sul tuo dispositivo in modo che possano essere recuperate velocemente; e utilizzando i cookie per conoscere gli argomenti cercati in modo da poter ottimizzare i risultati delle tue ricerche. \n Comprendere come si utilizzano i siti di Wikimedia, in modo da sapere ciò che funziona e ciò che è utile. Ad esempio, potremmo utilizzare dei cookie per conoscere gli articoli che stai seguendo nella tua lista di \"osservati speciali\" in modo da poter consigliare articoli simili che potrebbero interessarti. \n Capire come tu utilizzi i siti di Wikimedia su dispositivi diversi, in modo da poter rendere i nostri siti Wikimedia più efficienti ed efficaci per te. \n Rendere i siti di Wikimedia più comodi da usare, ad esempio utilizzando i cookie per conservare la tua sessione quando ti connetti, o ricordare il tuo nome utente nel campo per l'accesso. \n  Vuoi saperne di più? Puoi trovare maggiori informazioni su quali cookie specifici utilizziamo, quando scadono, e ciò per cui li usiamo nelle nostre  domande più frequenti . \n  Siamo convinti che la raccolta di informazioni ci possa aiutare a migliorare la tua esperienza come utente, ma è possibile rimuovere o disabilitare alcuni o tutti i dati memorizzati localmente attraverso le impostazioni del tuo browser, in base al browser stesso. Puoi saperne di più sulle opzioni disponibili per te nelle nostre  domande più frequenti . Sebbene la memorizzazione in locale di dati non sia necessaria per l'utilizzo dei nostri siti, disabilitandola alcune caratteristiche potrebbero non funzionare correttamente. \n  Mentre gli esempi suddetti relativi alle informazioni che ti riguardano raccolte con l'utilizzo di strumenti per la raccolta dati sono mantenuti riservati in linea con la presente informativa, tieni presente che alcune informazioni sulle azioni intraprese dal tuo nome utente sono pubblicamente disponibili nei  registri pubblici  insieme alle azioni intraprese da altri utenti. Ad esempio, un registro pubblico potrebbe includere la data di creazione della tua utenza su un Sito Wikimedia insieme alle date di creazione di altri account sullo stesso Sito. Le informazioni disponibili nei registri pubblici non includeranno informazioni personali che ti riguardano. \n Torna all'inizio   \n Indirizzi e-mail \n Se scegli di fornire un indirizzo email, lo terremo riservato, salvo che nei casi previsti in questa Informativa. \n Occasionalmente potremmo inviarti email su informazioni importanti. \n Puoi scegliere di non ricevere determinati tipi di notifiche. \n Hai facoltà di fornire un indirizzo e-mail al momento della registrazione. Se lo fai, il tuo indirizzo e-mail è mantenuto riservato, salvo per quanto previsto nella presente informativa. Non lo vendiamo, né affittiamo, né usiamo per inviarti pubblicità di prodotti o servizi di terze parti. \n Utilizziamo il tuo indirizzo e-mail per farti conoscere ciò che succede nella Fondazione, sui siti o nel movimento Wikimedia, ad esempio comunicarti informazioni importanti relative alla tua utenza, informarti di cambiamenti relativi ai siti Wikimedia e alle loro politiche, e aggiornamenti sulle modifiche a voci che hai deciso di seguire. Nota che se ci invii una mail, potremmo memorizzarla insieme al tuo indirizzo e a qualsiasi altra informazione tu ci fornisca, al fine di gestire la richiesta e risponderti. \n Puoi scegliere di limitare alcuni di questi tipi di notifiche, come quelle che ti allertano se una voce cambia. Altre, come quelle che contengono informazioni critiche che tutti gli utenti devono sapere per partecipare con successo nei siti di Wikimedia, potrebbero non essere limitabili. Puoi gestire sia le notifiche che ricevi, sia la loro frequenza di ricezione nelle tue Preferenze di Notifica. Per maggiori informazioni a proposito di e-mail e notifiche, e per sapere come cambiare le tue preferenze, leggi le nostre  domande più frequenti . \n  Non ti chiederemo mai la password tramite email (ma possiamo inviarti una password temporanea via email se hai richiesto di reimpostarla). Se ricevessi una email simile, informaci inviandola a  privacy@wikimedia.org , in modo da poter indagare sulla fonte dell'email. \n Le comunicazioni dirette tra gli utenti (come i messaggi inviati tramite la funzionalità “Invia email a questo utente”) sono mantenute riservate, nella misura in cui tali comunicazioni siano non pubbliche e archiviate o in transito sui sistemi della Fondazione Wikimedia, salvo che nei casi previsti in questa Informativa. \n Torna all'inizio   \n Sondaggi e commenti \n Potremmo chiederti di fornire informazioni tramite un sondaggio o esprimere il tuo commento, ma non sarai mai obbligato a partecipare. \n Partecipare a un sondaggio opzionale o inviarci un commento ci aiuta a migliorare i siti Wikimedia. Dato che ogni sondaggio o richiesta di commenti può essere utilizzato per vari scopi ti comunicheremo, nel momento in cui ti invieremo il sondaggio o la richiesta di feedback, come intendiamo utilizzare le tue risposte e le eventuali informazioni personali fornite. Se non ti senti a tuo agio con il modo in cui pensiamo di utilizzare i risultati del sondaggio o commento, non sei obbligato a partecipare al sondaggio né a inviare il commento. \n Torna all'inizio   \n Informazioni sulla localizzazione \n GPS e altre tecnologie di localizzazione \n Se acconsenti, possiamo usare tecnologie di localizzazione di uso comune per mostrarti contenuti più rilevanti. \n Alcune opzioni che offriamo sono ritenute le più adatte da usare se sappiamo in che zona vi trovate ma sta solamente a voi decidere se desiderate o meno usare strumenti di geolocalizzazione per rendere alcune caratteristiche disponibili. Se possiamo utilizzare il consenso,  GPS  (e altre tecnologie comunemente utilizzate per determinare la posizione) per mostrarvi più contenuti rilevanti. Manterremo le informazioni ottenute da queste tecnologie riservate, salvo quanto previsto nella presente Politica. Potete saperne di più, consulta la lista di esempi di come utilizziamo queste tecnologie nelle nostre  domande più frequenti . \n Torna all'inizio   \n Metadati \n Potremmo ricevere automaticamente dai tuoi dispositivi informazioni sulla tua localizzazione. Per esempio, se carichi una foto usando l'app per dispositivo mobile di Wikimedia Commons, tieni conto che le impostazioni predefinite del tuo dispositivo sono generalmente inserite in automatico nei metadati associati alla foto che saranno inclusi nell'immagine caricata. \n A volte potremmo automaticamente ricevere i dati sulla tua posizione dal tuo dispositivo. Per esempio se vuoi caricare una foto attraverso l'app per dispositivi mobili di Wikimedia Commons, potremmo ricevere  metadata , come il luogo e l'ora in cui hai scattato la foto, automaticamente dal tuo dispositivo. Per favore tieni presente che a differenza delle informazioni raccolte usando segnali GPS descritte più sopra, le impostazioni standard del tuo dispositivo tipicamente includono i metadati nelle tuo foto o video caricati sui siti Wikimedia. Se non vuoi che i metadati ci siano inviati e che diventino pubblici al momento del caricamento dei file, modifica le impostazioni del tuo dispositivo. \n Torna all'inizio   \n Indirizzi IP \n Quando visiti un sito Wikimedia, riceviamo automaticamente l' indirizzo IP  del dispositivo che stai utilizzando per accedere a Internet. Esso può essere utilizzato per desumere la tua posizione geografica. \n Infine, quando visiti qualsiasi sito Wikimedia, riceviamo automaticamente l' indirizzo IP  del tuo dispositivo (o il tuo  proxy ) che può essere usato per  desumere la tua posizione geografica . Manteniamo la riservatezza degli indirizzi IP, salvo nei casi in cui diversamente descritto in questa informativa. Ad esempio, se dovessi contribuire senza avere effettuato l'accesso, il tuo indirizzo IP sarà registrato in modo pubblico e permanente. Se stai visitando un sito Wikimedia con il tuo dispositivo mobile, potremmo usare il tuo indirizzo IP per ricerca e analisi dei dati; per personalizzare meglio contenuti, notizie e impostazioni per te; per contrastare lo spam, il furto di identità, i malware e altri tipi di abuso; per migliorare le applicazioni mobili e altre. \n Torna all'inizio   \n  Condivisione \n Quando possiamo condividere le tue informazioni? \n Possiamo condividere le tue informazioni quando ci dai il tuo consenso specifico di farlo. \n Con il tuo consenso \n Potremmo condividere tue informazioni per un determinato scopo. Maggiori informazioni sono presenti nell' elenco di esempi  contenuto nelle nostre domande più frequenti. \n Torna all'inizio   \n Per motivi legali \n Divulgheremo le tue informazioni a seguito di una procedura legale ufficiale, soltanto se la riteniamo legalmente valida. Laddove possibile ti informeremo di tali richieste. \n Potremmo accedere, conservare o divulgare le tue informazioni personali se abbiamo ragione di ritenerlo necessario per soddisfare un mandato, una citazione, un'ordinanza di tribunale, una legge o un regolamento valido e legalmente applicabile, o altro ordine giudiziario o amministrativo. Tuttavia, se riteniamo che una data richiesta di divulgazione delle informazioni di un utente non sia legalmente valida o costituisca un abuso del sistema legale e l'utente interessato non intenda lui stesso opporsi a tale divulgazione, faremo del nostro meglio per opporci. Laddove possibile, ci impegniamo a informarti via email almeno dieci (10) giorni di calendario prima di divulgare le tue informazioni personali a seguito di una richiesta legale. Tuttavia, possiamo fornire il preavviso soltanto purché ciò non ci sia legalmente impedito, se non vi è una credibile minaccia alla vita o all'incolumità fisica generata o peggiorata dalla divulgazione della richiesta, e purché tu abbia fornito un indirizzo email. \n Nulla nella presente Informativa sulla riservatezza è inteso a limitare alcuna obiezione o difesa legale a tua disposizione nei confronti di una richiesta di terzi (sia essa civile, penale o governativa) di divulgare informazioni. Raccomandiamo di ricorrere immediatamente a un legale qualora si presenti una tale richiesta a tuo carico. \n Per ulteriori informazioni, si veda la  pagina di risposte a citazioni in giudizio . \n Torna all'inizio   \n Trasferimento di proprietà dell'Organizzazione (davvero improbabile!) \n Nell'improbabile eventualità che la proprietà della Fondazione cambi, forniremo un preavviso di 30 giorni prima che qualsiasi informazioni personale sia trasferita ai nuovi titolari o sia soggetta a una diversa informativa sulla riservatezza. \n Nell'eventualità estremamente improbabile che la proprietà di tutta o di una percentuale rilevante della Fondazione cambi, o che subisca un riassetto (come una fusione, unificazione o acquisizione), continueremo a mantenere le tue informazioni personali riservate, a eccezione di quanto previsto dalla presente Informativa, e forniremo preavviso tramite i Siti Wikimedia e una notifica su  WikimediaAnnounce-L  o su mailing list simili almeno trenta (30) giorni di calendario prima che le informazioni personali siano trasferite o siano soggette a una diversa informativa sulla riservatezza. \n Torna all'inizio   \n Per proteggere te, noi e altri \n Noi, o gli utenti con taluni diritti amministrativi, potremmo divulgare informazioni ragionevolmente necessarie al fine di: \n rafforzare la sicurezza o indagare su potenziali violazioni delle politiche della Fondazione o della comunità; \n proteggere la nostra organizzazione, infrastruttura, i dipendenti, i subappaltatori o il pubblico; o \n prevenire danni fisici imminenti o gravi o la morte di una persona. \n Noi, o certi utenti con taluni diritti amministrativi come descritto di seguito, potremmo avere bisogno di condividere le tue informazioni personali se ciò si ritiene necessario per rafforzare la sicurezza o indagare su potenziali violazioni dei nostri  Termini di utilizzo , di questa Informativa sulla riservatezza o di qualsiasi politica della Fondazione o della comunità. Potremmo anche avere bisogno di accedere e condividere informazioni per indagare e difenderci da minacce o azioni legali. \n I Siti Wikimedia sono collaborativi, e gli stessi utenti scrivono la maggior parte delle politiche e selezionano fra loro persone incaricate di gestire taluni diritti amministrativi. Questi diritti possono includere accesso a quantitativi limitati di informazioni altrimenti non pubbliche relative a contributi e attività recenti di altri utenti. Gli utenti utilizzano questo accesso per aiutare a proteggere dal vandalismo e dall'abuso, combattere le molestie di altri utenti e in generale cercare di ridurre al minimo il comportamento indisciplinato sui Siti Wikimedia. Questi vari gruppi amministrativi scelti dagli utenti dispongono delle proprie linee guida sulla riservatezza, ma tutti questi gruppi devono accettare di seguire la nostra  Politica relativa all'accesso a informazioni non pubbliche . Questi gruppi amministrativi scelti dagli utenti, rendono conto ad altri utenti mediante controlli ed equilibri: gli utenti sono scelti tramite una procedura promossa dalla comunità e monitorata da pari mediante una cronologia registrata delle loro azioni. Tuttavia, la Fondazione Wikimedia non conosce il nome legale di tali utenti. \n Ci auguriamo che questo non si verifichi, ma potremmo dover divulgare le tue informazioni personali qualora ritenessimo che ciò fosse ragionevolmente necessario per evitare danni fisici imminenti o gravi o la morte di una persona o per proteggere la nostra organizzazione, i dipendenti, i subappaltatori, gli utenti o il pubblico. Potremmo anche divulgare le tue informazioni personali se ritenessimo ragionevolmente che ciò fosse necessario per rilevare, impedire o altrimenti valutare e risolvere eventuale spam, malware, frode, abuso, attività illecita o preoccupazioni tecniche o relative a sicurezza. (Per maggiori informazioni verificare l'elenco di esempi nella nostra sezione  domande più frequenti .) \n Torna all'inizio   \n Ai nostri fornitori di servizi \n Abbiamo facoltà di divulgare informazioni personali ai nostri fornitori di servizi o subappaltatori terzi per aiutarci a gestire o migliorare i Siti Wikimedia e fornire servizi a sostegno della  nostra missione . \n Per quanto ci impegniamo, non possiamo fare tutto da soli. Pertanto, a volte utilizziamo fornitori di servizi o subappaltatori terzi che ci aiutano a gestire o migliorare i Siti Wikimedia per te e per gli altri utenti. Possiamo concedere a tali fornitori o subappaltatori accesso alle tue informazioni personali secondo necessità per svolgere i loro servizi per noi o per usare i loro strumenti e servizi. Predisponiamo requisiti, quali accordi di riservatezza, per aiutare a garantire che tali fornitori di servizi trattino le tue informazioni nel rispetto e con una protezione della tua riservatezza non inferiore ai principi della presente Informativa. (Verificare l'elenco di esempi nella nostra sezione  Domande frequenti .) \n Torna all'inizio   \n Per capire e sperimentare \n Potremmo fornire a sviluppatori e ricercatori volontari accesso a sistemi che contengono le tue informazioni per consentire loro di proteggere, sviluppare e contribuire ai Siti Wikimedia. \n Potremmo anche condividere informazioni non personali o aggregate con terze parti interessate a studiare i Siti Wikimedia. \n Quando condividiamo le informazioni con terzi per tali finalità, applichiamo protezioni tecniche e contrattuali ragionevoli per proteggere le tue informazioni nel rispetto della presente Informativa. \n Il software open source che alimenta i Siti Wikimedia dipende dai contributi di sviluppatori di software volontari, che impiegano tempo a scrivere e provare il codice al fine di migliorarlo ed evolverlo in base alle esigenze dei nostri utenti. Per facilitare il loro lavoro, possiamo fornire ad alcuni sviluppatori accesso limitato ai sistemi che contengono le tue informazioni personali, ma soltanto come ragionevolmente necessario affinché sviluppino e contribuiscano ai Siti Wikimedia. \n Analogamente, potremmo condividere informazioni non personali o aggregate con ricercatori, studiosi, personale accademico e altri terzi interessati che desiderano studiare i Siti Wikimedia. La condivisione di tali informazioni li aiuta a comprendere l'utilizzo, la visualizzazione, le statistiche e i modelli demografici. Successivamente, possono condividere i loro risultati con noi e i nostri utenti per poter comprendere meglio e migliorare i Siti Wikimedia. \n Quando forniamo a sviluppatori o ricercatori terzi accesso alle informazioni personali, mettiamo in atto requisiti, quali ragionevoli protezioni tecniche e contrattuali, per aiutare a garantire che tali fornitori di servizi trattino le tue informazioni nel rispetto dei principi della presente Informativa e delle nostre istruzioni. Se in seguito tali sviluppatori o ricercatori pubblicano il loro lavoro o i risultati, chiediamo di non divulgare le tue informazioni personali. Tieni presente che, nonostante gli obblighi imposti a sviluppatori e ricercatori, non possiamo garantire che gli stessi rispettino il nostro accordo, né garantiamo di monitorare o verificare regolarmente i loro progetti. (Puoi ottenere altre informazioni sulla re-identificazione nella sezione  Domande frequenti .) \n Torna all'inizio   \n Perché voi li rendete pubblici \n Le informazioni che esponi sono pubbliche e possono essere visualizzate e usate da tutti. \n Ogni informazione che voi inserite pubblicamente sui siti Wikimedia è proprio così-pubblica. Cortesemente, pensate attentamente al livello di anonimato che desiderate prima di svelare informazioni personali sulla vostra Pagina utente o altrove. \n Torna all'inizio   \n  Protezione \n Come proteggiamo i vostri dati? \n Utilizziamo una serie di misure, politiche e procedure fisiche e tecniche per aiutarci a proteggere le informazioni da accesso, uso o divulgazione non autorizzati. \n Ci impegniamo a proteggere le tue informazioni da accesso, uso o divulgazione non autorizzati. Utilizziamo una serie di misure, politiche e procedure fisiche e tecniche (come le procedure di controllo dell'accesso, i firewall di rete e la sicurezza fisica) concepite per proteggere i nostri sistemi e le tue informazioni personali. Purtroppo, non esiste una trasmissione o archiviazione completamente sicura di dati, quindi non possiamo garantire che la nostra sicurezza non subisca violazioni (per misure tecniche o tramite violazioni delle nostre politiche e procedure). \n Torna all'inizio   \n Per quanto conserviamo i vostri dati? \n Conserviamo le tue informazioni personali soltanto per il tempo necessario a mantenere, comprendere e migliorare i Siti Wikimedia o per rispettare la normativa statunitense. \n Quando riceviamo da te le informazioni personali, le conserviamo per il più breve tempo possibile nel rispetto della manutenzione, comprensione e miglioramento dei Siti Wikimedia, e dei nostri obblighi ai sensi della legge statunitense applicabile. Le informazioni non personali potrebbero essere conservate a tempo indeterminato. (Verificare l'elenco di esempi nella nostra sezione  Domande frequenti .) \n  Ricorda che talune informazioni sono conservate e visualizzate a tempo indeterminato, come il tuo  indirizzo IP  (se apporti modifiche senza aver effettuato il login) e qualsiasi contributo pubblico ai Siti Wikimedia. \n Torna all'inizio   \n  Informazioni importanti \n Per la protezione della Wikimedia Foundation e degli altri utenti, se non siete d'accordo con questa Informativa sulla Privacy, non potete utilizzare i Siti Wikimedia. \n Dove si trova la Fondazione e che cosa significa per me? \n Acconsenti all'uso delle tue informazioni negli USA e al loro trasferimento ad altri paesi relativamente alla fornitura dei nostri servizi a te e ad altri. \n La Fondazione Wikimedia è un'organizzazione senza scopo di lucro con sede a San Francisco, California, e server e centri dati situati negli USA. Se decidi di usare i Siti Wikimedia, all'interno e all'estero degli USA, acconsenti alla raccolta, al trasferimento, all'archiviazione, al trattamento, alla divulgazione e ad altri usi delle tue informazioni negli USA come descritto nella presente Informativa sulla privacy. Acconsenti inoltre al trasferimento delle tue informazioni da parte nostra dagli USA ad altri paesi, che potrebbero avere normative di protezione dei dati diverse o meno rigorose del tuo paese, relativamente alla fornitura dei servizi a te. \n Torna all'inizio   \n La nostra risposta ai segnali Do Not Track (DNT) \n Non permettiamo il tracciamento da parte di siti web di terzi che non hai visitato. \n Non condividiamo i tuoi dati con terzi per finalità di marketing. \n Ci impegniamo fermamente a non condividere informazioni non pubbliche con terze parti. In particolare, non permettiamo il tracciamento da parte di siti web di terzi che non hai visitato (compresi i servizi di analisi, le reti pubblicitarie e le piattaforme sociali), né condividiamo le tue informazioni con terze parti a fini di marketing. Ai sensi della presente Informativa, possiamo condividere le tue informazioni soltanto in situazioni particolari, di cui puoi ottenere maggiori informazioni nella sezione “ Quando possiamo condividere le tue informazioni ” della presente Informativa sulla privacy. \n In questo modo proteggiamo tutti gli utenti, pertanto non cambiamo il nostro comportamento a seguito di un segnale \"do not track\" (non tracciare) del browser. \n Per ulteriori informazioni sui segnali Do Not Track e su come li gestiamo, visita le nostre  Domande frequenti . \n Torna all'inizio   \n Modifiche a questa Informativa sulla Privacy \n Non verranno apportate modifiche sostanziali alla presente Informativa fino a un periodo di commento pubblico di almeno 30 giorni. \n Dal momento che naturalmente le cose cambiano con il tempo e desideriamo garantire che la nostra Informativa sulla privacy rifletta le nostre pratiche e la legge, potrebbe essere necessario modificare questa Informativa sulla privacy di volta in volta. Ci riserviamo il diritto di farlo nel seguente modo: \n In caso di modifiche sostanziali, forniremo i cambiamenti proposti ai nostri utenti almeno in tre (3) lingue (selezionate a nostra discrezione) per un periodo di commento aperto della durata di almeno trenta (30) giorni di calendario. Prima di aprire il periodo di commento, forniremo preavviso di tale modifica e l'opportunità di commentare tramite i Siti Wikimedia e tramite una notifica su  WikimediaAnnounce- L  o altra mailing list simile. \n In caso di modifiche di minore entità, come correzioni grammaticali, cambiamenti amministrativi o legali o correzioni a dichiarazioni inesatte, pubblicheremo le modifiche e, laddove possibile, forniremo un preavviso di almeno tre (3) giorni di calendario su  WikimediaAnnounce- L  o mailing list simile. \n Ti chiediamo di revisionare la versione più aggiornata della nostra  Informativa sulla privacy . Il tuo uso continuato dei Siti Wikimedia dopo la data di efficacia di questa Informativa sulla privacy costituisce la tua accettazione dell'Informativa sulla privacy. Il tuo uso continuato dei Siti Wikimedia dopo la data di efficacia di qualsiasi versione successiva a questa Informativa sulla privacy, in seguito al preavviso indicato sopra, costituisce la tua accettazione di quella versione dell'Informativa sulla privacy. \n Contattaci \n Se avete domande o suggerimenti riguardanti questa Informativa sulla Privacy, o le informazioni raccolte ai sensi della presente Informativa, inviateci un'email all'indirizzo privacy@wikimedia.org oppure  contact us  direttamente. \n Grazie! \n Grazie per aver letto la nostra Informativa sulla Privacy. Buon divertimento con i siti di Wikimedia e grazie per la partecipazione allo sviluppo, al mantenimento e al lavoro costante per migliorare il più grande archivio di conoscenza libera nel mondo. \n Si prega di notare che in caso di eventuali differenze di significato o di interpretazione tra la versione originale inglese di questa Informativa sulla Privacy e la presente traduzione, la versione originale inglese prevale. \n Torna all'inizio   \n +/- \n Translate \n Privacy-related pages \n Politica sulla privacy   ·   FAQ   ·   Glossario dei termini chiave   ·   Subpoena FAQ   ·   Accesso alle informazioni private   ( Confidentiality agreement   ·   Come firmare )  ·   Data retention guidelines   ·   Politica sulla privacy del donatore \n\t\t\t\t\t\tRetrieved from \" https://meta.wikimedia.org/w/index.php?title=Privacy_policy/it&oldid=16801548 \"\t\t\t\t\t \n Categories :  Policy proposals/it Privacy policy/it   \n Navigation menu \n Personal tools \n English Not logged in Talk Contributions Create account Log in   \n Namespaces \n Content page Discussion   \n Variants \n Views \n Read Translate View history   \n More \n Search \n Navigation \n Main page Wikimedia News Translations Recent changes Random page Help Babel   \n Community \n Wikimedia Forum Mailing lists Requests Babylon Reports Research Planet Wikimedia   \n Beyond the Web \n Meet Wikimedians Events Movement affiliates Donate   \n Print/export \n Create a book Download as PDF Printable version   \n Tools \n What links here Related changes Special pages Permanent link Page information Cite this page   \n In other languages \n Add links   \n  This page was last edited on 23 May 2017, at 09:48. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.\nSee  Terms of Use  for details. \n Privacy policy \n About Meta \n Disclaimers \n Developers \n Cookie statement \n Mobile view"}