{"url": "http://www.rtl-longueuil.qc.ca/en-CA/rtl/confidentiality/", "content": "Confidentiality - RTL \n Skip to main content \n Home  |  \n RTL  |  \n Press room  |  \n Careers  |  \n Contact us  |  \n Mobile Site  |  \n A \n A \n A \r\n        |\r\n Français \n Customer Center \n Connexion \n  /  \n Inscription \n Services Schedules and Maps RTL Mobile Express service Shared Taxi Students Zone Chrono List of Holidays Carpooling Multi-Modal Transfer Universal accessibility Helpful Tips Network Map FAQ Fares Fare schedule RTL fares and special offers Access to student rates 65 years old + OPUS  Solo Flex card Membership Offers Transfer  Points of Sale Tax Credit Paratransit Service Services and Territory Application and file updates Online service Trips Fares Helpful tips Safety mesures Contact us Customer Service Information Twitter feeds Road work Comment Complaint Lost and Found Bus Rental Lost item form \n Line number \n 1 Victoria / Churchill \n 2 Tiffin / St-Georges \n 3 Montgomery \n 4 Taschereau / Payer \n 5 mtée St-Hubert / Maisonneuve \n 6 Victoria \n 8 ch. de Chambly / Promenades St-Bruno \n 9 Secteurs L-M / St-Hubert \n 10 Roland-Therrien / Belcourt \n 13 Riverside \n 14 Rome / DIX30 \n 15 Churchill \n 16 Nobert / King-George / Adoncour \n 17 Roland-Therrien / Roberval \n 19 Davis \n 20 Jean-Paul-Vincent / Beauharnois \n 21 Grande Allée \n 23 Ste-Hélène / Jacques-Cartier \n 25 Parcs industriels \n 28 ch. de Chambly / Aéroport \n 29 Collectivité nouvelle \n 30 Secteurs P-V \n 31 Secteurs R-S-T / boul. St-Laurent \n 32 Secteur B / Mountainview \n 33 Secteurs M-N-O \n 34 Secteur A / Bellevue \n 35 Secteur L / DIX30 / TCV \n 37 Simard / du Béarn \n 38 boul. Chevrier / Secteur B \n 39 Panama / Quartier DIX30 \n 41 de Rome / Milan \n 42 Gaétan Boucher / Parc de la Cité \n 43 Milan / de Rome \n 44 Secteurs M-N-O \n 45 Express Panama / TCV \n 46 Secteurs R-S-T \n 47 Secteurs R-S-T \n 49 Secteurs R-S \n 50 Prince-Charles \n 54 Taschereau \n 55 Victoria / Wellington \n 59 Gareau \n 60 Milan / Gaétan-Boucher / Promenades St-Bruno \n 61 Boucherville / Terminus Radisson \n 71 Curé-Poirier \n 73 Joliette / de Lyon \n 74 St-Laurent / Bellerive \n 75 Quinn / Brébeuf \n 76 Roberval / Beliveau / R.-Therrien \n 77 Taschereau / Matte \n 78 Adoncour / du Colisée \n 80 De Montarville / Carrefour de la Rive-Sud \n 81 du Fort-St-Louis / Marie-Victorin \n 82 Marie-Victorin / du Fort-St-Louis \n 83 De Montarville / Samuel-De Champlain \n 84 Samuel-De Champlain / De Montarville \n 85 de Gascogne \n 86 Samuel-De Champlain / De Montarville / Montréal \n 87 Marie-Victorin / du Fort St-Louis / Montréal \n 88 ch. de Chambly / Mountainview \n 90 Express Chevrier / TCV \n 91 Gare St-Bruno \n 92 Yvonne-Duckett / Montarville / Gare St-Bruno \n 98 Promenades St-Bruno / Parc industriel \n 99 Saint-Bruno \n 106 Secteur B / Victoria \n 115 Churchill \n 120 Lalande \n 123 Jacques-Cartier / Parcs industriels \n 125 Pratt & Whitney \n 128 Zone aéroportuaire \n 132 Parc de la Cité / Westley \n 135 Secteur L / DIX30 / TCV \n 142 Gaétan Boucher / Pacific \n 144 des Prairies / Océanie / Naples / Malo \n 150 Orchard \n 170 Ste-Hélène / Jacques-Cartier \n 177 Taschereau / Ste-Foy \n 180 Boucherville - des Sureaux \n 185 Ampère / Gay-Lussac \n 192 Yvonne-Duckett / Montarville \n 199 Seigneurial / Grand Boulevard \n 410 Express Roland-Therrien / Belcourt \n 417 Express Roland-Therrien / Roberval \n 500 École Saint-Lambert International High School \n 501 Écoles privées \n 503 École Centennial \n 504 École Centennial \n 505 École Centennial \n 506 Écoles privées \n 521 École Centennial \n 524 École Centennial \n 525 École Centennial \n 526 École Centennial \n 530 École Centennial \n 532 École Centennial \n 533 École Centennial \n 534 École Centennial \n 535 École Centennial \n 536 École Centennial \n 538 École Heritage Regional High School \n 539 École Heritage Regional High School \n 540 École Heritage Regional High School \n 542 École Heritage Regional High School \n 544 École Centennial \n 546 École Centennial \n 547 École Centennial \n 549 École Centennial \n 550 École Centennial \n 551 École Centennial \n 560 École Saint-Lambert International High School \n 565 École Saint-Lambert International High School \n 570 École Saint-Lambert International High School \n 572 École Saint-Lambert International High School \n 575 École Saint-Lambert International High School \n 580 École Saint-Lambert International High School \n 600 Écoles privées \n 601 École Participative Agora \n 602 École Participative Agora \n 603 École Mgr-A.-M.Parent \n 604 École Participative Agora \n 605 École Participative Agora \n 606 Écoles privées \n 608 École André-Laurendeau et CEGEP Édouard-Montpetit \n 613 Écoles privées \n 614 Écoles privées \n 616 École Gérard-Filion \n 618 Écoles privées \n 620 Collège Français \n 621 École Mgr-A.-M.Parent \n 622 École Jacques-Rousseau et CEGEP Édouard-Montpetit \n 624 École St-Jean-Baptiste \n 626 Collège Français \n 628 École Jacques-Rousseau \n 640 École Antoine-Brossard \n 644 École Antoine-Brossard \n 650 École Antoine-Brossard \n 653 École Antoine-Brossard \n 656 École Antoine-Brossard \n 660 École Antoine-Brossard \n 664 École Antoine-Brossard \n 665 École Antoine-Brossard \n 670 École Antoine-Brossard \n 674 École Antoine-Brossard \n 677 Jacques-Rousseau et CEGEP Édouard-Montpetit \n 681 CEGEP Édouard-Montpetit \n 682 CEGEP Édouard-Montpetit \n 683 CEGEP Édouard-Montpetit \n 684 École Antoine-Brossard \n 690 École Antoine-Brossard \n 691 École Lucille-Teasdale \n 692 École Lucille-Teasdale \n 693 École Lucille-Teasdale \n 694 École Lucille-Tesdale \n 695 École Lucille-Tesdale \n 696 École Lucille-Tesdale \n T18 Taxi - Aéroport \n T19 Taxi - Jacques-Cartier \n T20 Taxi - ch. de Chambly - Pacific \n T21 Taxi - Parc industriel :  J.-A.-Bombardier \n T22 Taxi - Parc industriel :  Leclerc \n T23 Taxi - Vauquelin \n T48 Taxi - Terminus Panama - Marie-Victorin \n T77 Taxi - Matte \n T89 Taxi - Parc industriel : Eiffel \n T90 Taxi - des Ateliers \n T92 Taxi - Parc industriel : Gay-Lussac \n T93 Taxi - de Mortagne - du Boisé - ch. de Touraine \n T94 Taxi - St-Bruno - St-Basile \n T97 Taxi - Gare de St-Basile-le-Grand \n Date \n Schedule \n Map \n Itinerary \n Bus Stop \n Home Page \n RTL 1   Confidentiality \n Mission and values Board of directors Members of the Board Schedule of public meetings Public question period Streaming of public meetings Executive team Equipment Vehicles Bus Shelter Maintenance Activities Infrastructures Terminal Park and Ride Train Station Reserved Bus Lanes Sustainable Development Contracts and Tenders Standards & Regulations Service Standards Rules on board Regulations Properties Fare regulations Advertising on Buses Other carriers  History \n Confidentiality \n Introduction \n Respect of privacy is of the outmost importance for the RTL which is responsible for this site. RTL is concerned about confidential information issues.  The site’s privacy policy informs you of RTL’s practices with respect to the personal information you give when you use the address  http://www.rtl-longueuil.qc.ca  \n Scope of this policy \n This policy applies only to the RTL’s website. It respects the requirements of the  Loi sur l'accès aux documents des organismes publics et sur la protection des renseignements personnels  (also called « Access Act ») and all other applicable laws. \n This site does not have a secured zone allowing separate and confidential exchanges between the user’s computer and the RTL’s computer system. Transmission of data through the Internet network cannot be completely secured. RTL’s commitment on the protection of personal information rests only on the processing of information that is in its possession and the one obtained according to the provisions of the applicable laws.  Only authorized members of our personnel will have access to this information, and only in the exercise of their functions. \n A user is not required to disclose any personal information to access the contents of the RTL’s website.  However, the RTL offers, through this website, certain services and special advantages requiring a user to provide personal information should he/she wish to benefit from them, such as the e-mail notification service “Comments” or “Complaints”, or when a user wants to subscribe to a distribution list in order to receive information on the RTL and its transit network, or when the user wants to participate in a contest or a survey.  Any omission or false declaration made by the user when providing the required information could lead to refusal to process the request.  With respect to contests, names of the winners are broadcasted to users through different means of communication.  However, when pictures or images are used, the winner(s) is (are) always contacted beforehand to sign an authorization form for advertising purposes.  Note however that the recorded information in these sections is subject to the RTL’s privacy policy. \n If you use a computer in a public place or shared with other users, be sure to erase all traces of browsing saved in the historic before login out. \n Links to other sites \n This site also suggests relevant links to other sites. When you click on one of those hyperlinks, a message informs you that you are now leaving the RTL’s virtual space. The exchanged information is no longer subject to RTL’s privacy policy pertaining to its site, but to the visited site’s policy. \n Use of cookies \n RTL uses cookies to make it easier to browse through the site’s pages. These cookies gather none of your personal information. You can, at any time, configure your browser to block cookies. However, doing so may prevent you from accessing certain functions offered on the site. \r\nFurthermore, information transmitted automatically between computers cannot identify you personally. It is gathered only for technological purposes related to Internet browsing. \n Automatic data exchanges \n When you access the site, your computer and the site’s server automatically exchange information. This automatic communication is necessary for the server to send files that are compatible with the type of computer equipment you use. The exchanged information is as follows: \n name of the domain supplier that gives you access to Internet; \n your IP address (ex. 123.45.67.890), a unique number assigned to your computer when linked to Internet; \n the type of browser (ex. : Firefox, Explorer) and the operating system (ex. : Windows, Mac OS) that you use; \n the pages you visit; \n the date and time you access these pages; \n the address of the referring site when you access the site from another website. \n The RTL keeps this data in a log file for statistical purposes only. It assists in tabulating the number of visits, the pages most often visited, the technology used by the users, the referring sites and the visitors’ country of origin.  However, it is not possible to personally identify the user.  The RTL is not trying to establish a user’s personal identity, except if it detects an activity contrary to the site’s terms of use. \n Information sent by e-mail \n Site users can contact the RTL by e-mail using the form found in sections “ Comments ” and “ Complaints ” or when they want to subscribe to a distribution list in order to receive information on the RTL and its transit network, or when they wish to participate in a contest or in a survey.  Only authorized members of our personnel will have access to this information and only in the exercise of their functions. \n RTL’s authorized personnel treat these e-mails with the same confidentiality rules as for regular mail. \r\nYour personal information (name, address and phone number) are used by the RTL and its authorized representatives strictly to process your request. \r\n  \r\nThe RTL will not pass on this information to another organization unless your request is addressed to it and it is necessary in order to process your request. In this case, the RTL will keep this data for follow-up purposes. \n When you send us personal information, this information will not show in the reply you will receive by e-mail. When we must pass on confidential information, we use other means of communication than electronic mail to answer you. \r\n  \r\nThis information will be stored securely and only our Customer Service will be able to access it. \r\nRectification access right \r\nWith respect to personal information created, gathered and kept by the RTL under the Act respecting access to documents held by public bodies and the protection of personal information (L.R.Q., c. A-2-1), any natural person has a right to access and, in certain cases, to rectify the personal information the RTL has on that person.  This information is kept for a period of time in line with RTL’s retention schedule in accordance with the Archives Act (L.R.Q., c. A-21.1). \r\nThe RTL does not sell, rent, exchange, loan nor dispose of any personnel information obtained through electronic means of communication, unless the sender of such information consents to it or that the RTL is required to do so under the law or following the decision of a competent court. \n For more information concerning this policy \n If you have questions regarding this policy, we invite you to contact us using one or the other means of communication suggested on the page  Contact us . \r\n  \r\n  \n  Services \n  Schedules and Maps \n  RTL Mobile \n  Express service \n  Shared Taxi \n  Students Zone \n  Universal accessibility \n  Network Map \n  FAQ \n  Fares \n  Fare schedule \n  Access to student rates \n  OPUS  Solo Flex card \n  Membership Offers \n  Transfer  \n  Points of Sale \n  Customer Service \n  Information \n  Road work \n  Comment \n  Complaint \n  Lost and Found \n  Bus Rental \n  RTL \n  Board of directors \n  Equipment \n  Sustainable Development \n  Standards & Regulations \n  Advertising on Buses \n  Press room \n  Press Releases \n  Public Notice \n  Documents and practical information \n  Public consultations \n  Media resources \n RTL © 2017 \n About Website  |  \n Legal Notice  |  \n Web Accessibility  |  \n Confidentiality  |  \n Site map  |  \n GTFS  |  \n Français"}