{"url": "http://www.osc.gov.on.ca/en/NewsEvents_nr_20170727_csa-publish-guidance.htm", "content": "CSA News Release: Canadian securities regulators publish guidance on conflict of interest transactions \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   News & Events   /   News Releases   /   2017   /   CSA News Release: Canadian securities regulators publish guidance on conflict of interest transactions \n            News & Events\n Hide Section Menu   × \n News Releases \n OSC News Releases \n Organizational News Releases \n Regulatory News Releases \n Enforcement News Releases \n OSC Investor Alerts \n CSA News Releases \n Speeches & Events \n Media Room \n Social Media \n OSC in the Community \n Reports and Publications \n OSC Annual Report \n Statement of Priorities \n OSC Investor News \n OSC Dialogue 2017 \n   Section Menu \n For Immediate Release \nJuly 27, 2017 \n Canadian securities regulators publish guidance on conflict of interest transactions \n Toronto  – The securities regulatory authorities  in Ontario, Québec, Alberta, Manitoba and New Brunswick (the participating  jurisdictions) today published  CSA Multilateral Staff Notice 61-302  Staff Review and Commentary on Multilateral  Instrument 61-101 Protection of Minority Security Holders in Special  Transactions . \n The notice outlines  the approach used to review material conflict of interest transactions, including  insider bids, issuer bids, business combinations and related party transactions  that give rise to concerns regarding the protection of minority security holders.  The notice also advises market participants of the participating jurisdictions’  views on special committees of independent directors and enhanced disclosure  requirements. \n “Our regulatory  framework for conflict of interest transactions is designed to protect minority  security holders when a related party of the issuer, who may have superior  access to information or significant influence, is involved in such a  transaction,” said Louis Morisset, CSA Chair and President and CEO of the  Autorité des marchés financiers.  \n The notice  describes how staff review conflict of interest transactions to assess  compliance with Multilateral Instrument 61-101  Protection of Minority Security Holders in Special Transactions  (MI  61-101), including the timing and scope of such reviews, the  information-gathering process and potential remedies in the event of  non-compliance.   \n The notice also  contains a discussion of staff’s views on special committees of independent  directors and enhanced disclosure requirements based on the requirements of MI  61-101 and associated guidance, decisions of securities regulatory authorities,  and issues identified in reviews of material conflict of interest transactions.  The discussion addresses the role, composition and mandate of special  committees, and disclosure regarding the background, approval process and  fairness opinions for conflict of interest transactions. \n The notice can  be found on the websites of the participating jurisdictions. \nThe CSA, the council of the securities regulators of Canada’s provinces and  territories, co-ordinates and harmonizes regulation for the Canadian capital  markets. \n - 30 - \n For more information: \n Kristen\n            Rose \n            Ontario Securities Commission \n            416-593-2336 \n            Hilary McMeekin \n            Alberta Securities Commission \n            403-592-8186\n Alison Walker \n            British Columbia Securities Commission \n            604-899-6713   \n            Sylvain Théberge \n            Autorité des marchés financiers \n            514-940-2176\n Jason (Jay) Booth \n            Manitoba Securities Commission \n            204-945-1660 \n Andrew\n            Nicholson \n            Financial and Consumer Services \n            Commission, New Brunswick \n            506-658-3021\n David Harrison \n            Nova Scotia Securities Commission \n            902-424-8586\n            Steve Dowling  \n            Office of the Superintendent of\n            Securities \n            P.E.I \n            902-368-6288\n            John O’Brien \n            Office of the Superintendent of\n            Securities \n            Newfoundland and Labrador \n            709-729-4909\n            Rhonda Horte \n            Office of the Yukon Superintendent \n            of Securities \n            867-667-5466\n            Jeff Mason \n            Nunavut Securities Office \n            867-975-6591 \n Tom\n            Hall \n            Northwest Territories Securities Office \n            867-767-9305\n            Shannon McMillan \n            Financial and Consumer Affairs \n            Authority of Saskatchewan \n            306-798-4160\n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}