{"url": "https://www.audible.com/", "content": "Audiobooks & Original Audio | Free book with 30 day Trial | Audible.com \n Browse Audible \n                                                AUDIOBOOK CATEGORIES\n Mysteries & Thrillers \n Sci-Fi & Fantasy \n History \n Science & Technology \n Classics \n Bios & Memoirs \n Business \n Self Development \n Romance \n Fiction \n Teens \n Kids \n Nonfiction \n Comedy \n Foreign Language \n More Categories \n Help \n Sign In \n LISTENING IS THE NEW READING \n Try Audible Free \n                            Sign in with your   account\r\n $14.95 per month after 30 days. Cancel anytime. \n                Try an Audible book—on us.\n                Choose from some of our favorites.\n    Best Sellers \n    Great First Listens\n    Latest Releases\n    Narrator:\n Rosario Dawson \n    Artemis\n    By:\n                                Andy Weir\n                                5164\n                                ratings\n    Narrator:\n                                Rosario Dawson\n    Duration:\n                            8 hrs and 59 mins\n    Format:\n                            Unabridged\n                            Jazz Bashara is a criminal. Well, sort of. Life on Artemis, the first and only city on the moon, is tough if you're not a rich tourist or an eccentric billionaire. So smuggling in the occasional harmless bit of contraband barely counts, right? Not when you've got debts to pay and your job as a porter barely covers the rent. Everything changes when Jazz sees the chance to commit the perfect crime, with a reward too lucrative to turn down.\n    Narrator:\n Joe Biden \n    Promise Me, Dad\n    By:\n                                Joe Biden\n                                374\n                                ratings\n    Narrator:\n                                Joe Biden\n    Duration:\n                            8 hrs and 53 mins\n    Format:\n                            Unabridged\n                            In November 2014, 13 members of the Biden family gathered on Nantucket for Thanksgiving, a tradition they had been celebrating for the past 40 years; it was the one constant in what had become a hectic, scrutinized, and overscheduled life. The Thanksgiving holiday was a much-needed respite, a time to connect, a time to reflect on what the year had brought, and what the future might hold. But this year felt different from all those that had come before.\n    Narrator:\n Steven Weber \n    It\n    By:\n                                Stephen King\n                                21256\n                                ratings\n    Narrator:\n                                Steven Weber\n    Duration:\n                            44 hrs and 57 mins\n    Format:\n                            Unabridged\n                            Welcome to Derry, Maine. It's a small city, a place as hauntingly familiar as your own hometown. Only in Derry the haunting is real. They were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But the promise they made 28 years ago calls them to reunite in the same place where, as teenagers, they battled an evil creature that preyed on the city's children.\n    Narrator:\n Brené Brown \n    Braving the Wilderness\n    By:\n                                Brené Brown\n                                5160\n                                ratings\n    Narrator:\n                                Brené Brown\n    Duration:\n                            4 hrs and 12 mins\n    Format:\n                            Unabridged\n                            \"True belonging doesn't require us to change who we are. It requires us to be who we are.\" Social scientist Brené Brown, PhD, LMSW, has sparked a global conversation about the experiences that bring meaning to our lives - experiences of courage, vulnerability, love, belonging, shame, and empathy. In  Braving the Wilderness , Brown redefines what it means to truly belong in an age of increased polarization.\n    Narrator:\n Jon Ronson \n    The Butterfly Effect with Jon Ronson\n    By:\n                                Jon Ronson\n                                9947\n                                ratings\n    Narrator:\n                                Jon Ronson\n    Duration:\n                            3 hrs and 27 mins\n    Format:\n                            Original\n                            [Contains explicit content] Hear the story of what happened when the tech industry gave the world what it wanted: free porn. Lives were mangled. Fortunes were made. All for your pleasure. Follow writer and narrator Jon Ronson as he uncovers our web of desire.\n    Narrator:\n John Lee \n    A Column of Fire\n    By:\n                                Ken Follett\n                                3527\n                                ratings\n    Narrator:\n                                John Lee\n    Duration:\n                            30 hrs and 19 mins\n    Format:\n                            Unabridged\n                            In 1558 the ancient stones of Kingsbridge Cathedral look down on a city torn apart by religious conflict. As power in England shifts precariously between Catholics and Protestants, high principles clash bloodily with friendship, loyalty, and love. Ned Willard wants nothing more than to marry Margery Fitzgerald. But when the lovers find themselves on opposing sides of the religious divide sweeping across the country, Ned goes to work for Princess Elizabeth. When she becomes queen, all Europe turns against England.\n    Narrator:\n Kevin Hart \n    I Can't Make This Up\n    By:\n                                Kevin Hart, \n                                Neil Strauss - contributor\n                                19847\n                                ratings\n    Narrator:\n                                Kevin Hart\n    Duration:\n                            11 hrs and 14 mins\n    Format:\n                            Unabridged\n                            Superstar comedian and Hollywood box-office star Kevin Hart turns his immense talent to the written word by writing some words. Some of those words include:  the ,  a ,  for ,  above , and even  even . Put them together and you have the funniest, most heartfelt, and most inspirational memoir on survival, success, and the importance of believing in yourself since  Old Yeller .\n    Narrator:\n Ray Porter \n    All These Worlds\n    By:\n                                Dennis E. Taylor\n                                21526\n                                ratings\n    Narrator:\n                                Ray Porter\n    Duration:\n                            7 hrs and 55 mins\n    Format:\n                            Unabridged\n                            Being a sentient spaceship really should be more fun. But after spreading out through space for almost a century, Bob and his clones just can't stay out of trouble. They've created enough colonies so humanity shouldn't go extinct. But political squabbles have a bad habit of dying hard, and the Brazilian probes are still trying to take out the competition. And the Bobs have picked a fight with an older, more powerful species with a large appetite and a short temper.\n    Narrator:\n Claire Danes \n    The Handmaid's Tale: Special Edition\n    By:\n                                Margaret Atwood, \n                                Valerie Martin - essay\n                                13379\n                                ratings\n    Narrator:\n                                Claire Danes, \n                                Margaret Atwood, \n                                 full cast\n    Duration:\n                            12 hrs and 12 mins\n    Format:\n                            Unabridged\n                            After a violent coup in the United States overthrows the Constitution and ushers in a new government regime, the Republic of Gilead imposes subservient roles on all women. Offred, now a Handmaid tasked with the singular role of procreation in the childless household of the enigmatic Commander and his bitter wife, can remember a time when she lived with her husband and daughter and had a job, before she lost everything, even her own name.\n    Narrator:\n Emily Rankin \n    Before We Were Yours\n    By:\n                                Lisa Wingate\n                                12030\n                                ratings\n    Narrator:\n                                Emily Rankin, \n                                Catherine Taber\n    Duration:\n                            14 hrs and 28 mins\n    Format:\n                            Unabridged\n                            Memphis, 1939. Twelve-year-old Rill Foss and her four younger siblings live a magical life aboard their family's Mississippi River shantyboat. But when their father must rush their mother to the hospital one stormy night, Rill is left in charge - until strangers arrive in force. Wrenched from all that is familiar and thrown into a Tennessee Children's Home Society orphanage, the Foss children are assured that they will soon be returned to their parents - but they quickly realize the dark truth.\n    Narrator:\n Trevor Noah \n    Born a Crime\n    By:\n                                Trevor Noah\n                                54045\n                                ratings\n    Narrator:\n                                Trevor Noah\n    Duration:\n                            8 hrs and 50 mins\n    Format:\n                            Unabridged\n                            One of the comedy world's fastest-rising stars tells his wild coming of age story during the twilight of apartheid in South Africa and the tumultuous days of freedom that followed. Noah provides something deeper than traditional memoirists: powerfully funny observations about how farcical political and social systems play out in our lives.\n    Narrator:\n Roger Wayne \n    The Subtle Art of Not Giving a F*ck\n    By:\n                                Mark Manson\n                                53659\n                                ratings\n    Narrator:\n                                Roger Wayne\n    Duration:\n                            5 hrs and 30 mins\n    Format:\n                            Unabridged\n                            For decades we've been told that positive thinking is the key to a happy, rich life. \"F*ck positivity,\" Mark Manson says. \"Let's be honest, shit is f*cked, and we have to live with it.\" In his wildly popular Internet blog, Manson doesn't sugarcoat or equivocate. He tells it like it is - a dose of raw, refreshing, honest truth that is sorely lacking today.  The Subtle Art of Not Giving a F*ck  is his antidote to the coddling, let's-all-feel-good mind-set that has infected modern society and spoiled a generation, rewarding them with gold medals just for showing up.\n    Narrator:\n David Pittu \n    The Goldfinch\n    By:\n                                Donna Tartt\n                                22010\n                                ratings\n    Narrator:\n                                David Pittu\n    Duration:\n                            32 hrs and 29 mins\n    Format:\n                            Unabridged\n The Goldfinch  is a haunted odyssey through present-day America and a drama of enthralling force and acuity. It begins with a boy. Theo Decker, a 13-year-old New Yorker, miraculously survives an accident that kills his mother. Abandoned by his father, Theo is taken in by the family of a wealthy friend. Bewildered by his strange new home on Park Avenue, disturbed by schoolmates who don't know how to talk to him, and tormented above all by his unbearable longing for his mother, he clings to one thing that reminds him of her: a small, mysteriously captivating painting that ultimately draws Theo into the underworld of art.\n    Narrator:\n Edoardo Ballerini \n    Beautiful Ruins\n    By:\n                                Jess Walter\n                                10290\n                                ratings\n    Narrator:\n                                Edoardo Ballerini\n    Duration:\n                            12 hrs and 53 mins\n    Format:\n                            Unabridged\n                            The story begins in 1962. On a rocky patch of the sun-drenched Italian coastline, a young innkeeper, chest-deep in daydreams, looks out over the incandescent waters of the Ligurian Sea and spies an apparition: a tall, thin woman, a vision in white, approaching him on a boat. She is an actress, he soon learns, an American starlet, and she is dying. And the story begins again today, half a world away, when an elderly Italian man shows up on a movie studio's back lot - searching for the mysterious woman he last saw at his hotel decades earlier.\n    Narrator:\n Trevor Noah \n    Born a Crime\n    By:\n                                Trevor Noah\n                                54045\n                                ratings\n    Narrator:\n                                Trevor Noah\n    Duration:\n                            8 hrs and 50 mins\n    Format:\n                            Unabridged\n                            One of the comedy world's fastest-rising stars tells his wild coming of age story during the twilight of apartheid in South Africa and the tumultuous days of freedom that followed. Noah provides something deeper than traditional memoirists: powerfully funny observations about how farcical political and social systems play out in our lives.\n    Narrator:\n Amy Schumer \n    The Girl with the Lower Back Tattoo\n    By:\n                                Amy Schumer\n                                15400\n                                ratings\n    Narrator:\n                                Amy Schumer\n    Duration:\n                            8 hrs and 6 mins\n    Format:\n                            Unabridged\n                            In  The Girl with the Lower Back Tattoo , Amy mines her past for stories about her teenage years, her family, relationships, and sex and shares the experiences that have shaped who she is - a woman with the courage to bare her soul to stand up for what she believes in, all while making us laugh. Down to earth and relatable, frank and unapologetic, Amy Schumer is one of us: She relies on her sister for advice, still hangs out with her high school pals, and continues to navigate the ever-changing boundaries in love, work, and life.\n    Narrator:\n Julia Whelan \n    Gone Girl\n    By:\n                                Gillian Flynn\n                                44212\n                                ratings\n    Narrator:\n                                Julia Whelan, \n                                Kirby Heyborne\n    Duration:\n                            19 hrs and 11 mins\n    Format:\n                            Unabridged\n                            It is Nick and Amy Dunne's fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick's clever and beautiful wife disappears from their rented McMansion on the Mississippi River. Husband-of-the-Year Nick isn't doing himself any favors with cringe-worthy daydreams. Under mounting pressure from the police and the media - as well as Amy's fiercely doting parents - the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he's definitely bitter - but is he really a killer?\n    Narrator:\n George Guidall \n    American Assassin\n    By:\n                                Vince Flynn\n                                13717\n                                ratings\n    Narrator:\n                                George Guidall\n    Duration:\n                            11 hrs and 43 mins\n    Format:\n                            Unabridged\n                            Before he was considered a CIA superagent, before he was thought of as a terrorist's worst nightmare, and before he was both loathed and admired by the politicians on Capitol Hill, Mitch Rapp was a gifted college athlete without a care in the world...and then tragedy struck.\n    Narrator:\n Jake Gyllenhaal \n    The Great Gatsby\n    By:\n                                F. Scott Fitzgerald\n                                9174\n                                ratings\n    Narrator:\n                                Jake Gyllenhaal\n    Duration:\n                            4 hrs and 52 mins\n    Format:\n                            Unabridged\n                            F. Scott Fitzgerald’s classic American novel of the Roaring Twenties is beloved by generations of readers and stands as his crowning work. This new audio edition, authorized by the Fitzgerald estate, is narrated by Oscar-nominated actor Jake Gyllenhaal ( Brokeback Mountain ). Gyllenhaal's performance is a faithful delivery in the voice of Nick Carraway, the Midwesterner turned New York bond salesman, who rents a small house next door to the mysterious millionaire Jay Gatsby....\n    Narrator:\n Will Patton \n    Mr. Mercedes\n    By:\n                                Stephen King\n                                24008\n                                ratings\n    Narrator:\n                                Will Patton\n    Duration:\n                            14 hrs and 22 mins\n    Format:\n                            Unabridged\n                            In the frigid pre-dawn hours, in a distressed Midwestern city, hundreds of desperate unemployed folks are lined up for a spot at a job fair. Without warning, a lone driver plows through the crowd in a stolen Mercedes, running over the innocent, backing up, and charging again. Eight people are killed; fifteen are wounded. The killer escapes.  Mr. Mercedes  is a war between good and evil, from the master of suspense whose insight into the mind of this obsessed, insane killer is chilling and unforgettable.\n    Narrator:\n Wil Wheaton \n    Ready Player One\n    By:\n                                Ernest Cline\n                                113850\n                                ratings\n    Narrator:\n                                Wil Wheaton\n    Duration:\n                            15 hrs and 46 mins\n    Format:\n                            Unabridged\n                            At once wildly original and stuffed with irresistible nostalgia,  Ready Player One  is a spectacularly genre-busting, ambitious, and charming debut—part quest novel, part love story, and part virtual space opera set in a universe where spell-slinging mages battle giant Japanese robots, entire planets are inspired by  Blade Runner , and flying DeLoreans achieve light speed.\n    Narrator:\n Edward Herrmann \n    The Boys in the Boat\n    By:\n                                Daniel James Brown\n                                22264\n                                ratings\n    Narrator:\n                                Edward Herrmann\n    Duration:\n                            14 hrs and 30 mins\n    Format:\n                            Unabridged\n                            Daniel James Brown's robust book tells the story of the University of Washington's 1936 eight-oar crew and their epic quest for an Olympic gold medal, a team that transformed the sport and grabbed the attention of millions of Americans. The sons of loggers, shipyard workers, and farmers, the boys defeated elite rivals first from eastern and British universities and finally the German crew rowing for Adolf Hitler in the Olympic games in Berlin, 1936.\n    Narrator:\n Mike Chamberlain \n    Smarter Faster Better\n    By:\n                                Charles Duhigg\n                                11846\n                                ratings\n    Narrator:\n                                Mike Chamberlain\n    Duration:\n                            10 hrs and 22 mins\n    Format:\n                            Unabridged\n                            Drawing on the latest findings in neuroscience, psychology, and behavioral economics - as well as the experiences of CEOs, educational reformers, four-star generals, FBI agents, airplane pilots, and Broadway songwriters - this painstakingly researched book explains that the most productive people, companies, and organizations don't merely act differently. They view the world, and their choices, in profoundly different ways.\n    Narrator:\n Dan Harris \n    10% Happier\n    By:\n                                Dan Harris\n                                12998\n                                ratings\n    Narrator:\n                                Dan Harris\n    Duration:\n                            7 hrs and 50 mins\n    Format:\n                            Unabridged\n                            After having a nationally televised panic attack on  Good Morning America , Dan Harris knew he had to make some changes. A lifelong nonbeliever, he found himself on a bizarre adventure, involving a disgraced pastor, a mysterious self-help guru, and a gaggle of brain scientists.\n    Narrator:\n Rosario Dawson \n    Artemis\n    By:\n                                Andy Weir\n                                5164\n                                ratings\n    Narrator:\n                                Rosario Dawson\n    Duration:\n                            8 hrs and 59 mins\n    Format:\n                            Unabridged\n                            Jazz Bashara is a criminal. Well, sort of. Life on Artemis, the first and only city on the moon, is tough if you're not a rich tourist or an eccentric billionaire. So smuggling in the occasional harmless bit of contraband barely counts, right? Not when you've got debts to pay and your job as a porter barely covers the rent. Everything changes when Jazz sees the chance to commit the perfect crime, with a reward too lucrative to turn down.\n    Narrator:\n Joe Biden \n    Promise Me, Dad\n    By:\n                                Joe Biden\n                                374\n                                ratings\n    Narrator:\n                                Joe Biden\n    Duration:\n                            8 hrs and 53 mins\n    Format:\n                            Unabridged\n                            In November 2014, 13 members of the Biden family gathered on Nantucket for Thanksgiving, a tradition they had been celebrating for the past 40 years; it was the one constant in what had become a hectic, scrutinized, and overscheduled life. The Thanksgiving holiday was a much-needed respite, a time to connect, a time to reflect on what the year had brought, and what the future might hold. But this year felt different from all those that had come before.\n    Narrator:\n Kate Reading \n    Oathbringer\n    By:\n                                Brandon Sanderson\n                                1406\n                                ratings\n    Narrator:\n                                Kate Reading, \n                                Michael Kramer\n    Duration:\n                            55 hrs and 2 mins\n    Format:\n                            Unabridged\n                            Dalinar Kholin's Alethi armies won a fleeting victory at a terrible cost. The enemy Parshendi summoned the violent Everstorm, which now sweeps the world with destruction and in its passing awakens the once peaceful and subservient parshmen to the horror of their millennia-long enslavement by humans. While on a desperate flight to warn his family of the threat, Kaladin Stormblessed must come to grips with the fact that the newly kindled anger of the parshmen may be wholly justified.\n    Narrator:\n Lorelei King \n    Hardcore Twenty-Four\n    By:\n                                Janet Evanovich\n                                564\n                                ratings\n    Narrator:\n                                Lorelei King\n    Duration:\n                            6 hrs and 8 mins\n    Format:\n                            Unabridged\n                            This Jersey girl hits hard - 24/7. The blockbuster Stephanie Plum series continues with  Hardcore Twenty-Four  from number one  New York Times  best-selling Janet Evanovich.\n    Narrator:\n Natalie Roy Camargo \n    Fierce\n    By:\n                                Aly Raisman\n                                19\n                                ratings\n    Narrator:\n                                Natalie Roy Camargo, \n                                Aly Raisman\n    Duration:\n                            8 hrs and 14 mins\n    Format:\n                            Unabridged\n                            Discover Aly Raisman's inspiring story of dedication, perseverance, and learning to think positive even in the toughest times on her path to gold medal success in two Olympic Games - and beyond. Aly Raisman first stepped onto a gymnastics mat as a toddler in a \"mommy and me\" gymnastics class. No one could have predicted then that 16 years later, she'd be standing on an Olympic podium, having achieved her dreams.\n    Narrator:\n Soneela Nankani \n    The City of Brass\n    By:\n                                S. A. Chakraborty\n                                11\n                                ratings\n    Narrator:\n                                Soneela Nankani\n    Duration:\n                            19 hrs and 35 mins\n    Format:\n                            Unabridged\n                            Nahri has never believed in magic. Certainly she has power; on the streets of 18th-century Cairo, she's a con woman of unsurpassed talent. But she knows better than anyone that the trade she uses to get by - palm readings, zars, healings - are all tricks, sleights of hand, learned skills, a means to the delightful end of swindling Ottoman nobles and a reliable way to survive. But when Nahri accidentally summons an equally sly, darkly mysterious djinn warrior to her side during one of her cons, she's forced to question all she believes.\n    Narrator:\n Kyf Brewer \n    End Game\n    By:\n                                David Baldacci\n                                478\n                                ratings\n    Narrator:\n                                Kyf Brewer, \n                                Orlagh Cassidy\n    Duration:\n                            11 hrs and 54 mins\n    Format:\n                            Unabridged\n                            Will Robie and Jessica Reel are two of the most lethal people alive. They're the ones the government calls in when the utmost secrecy is required to take out those who plot violence and mass destruction against the United States. And through every mission, one man has always had their backs: their handler, code-named Blue Man. But now, Blue Man is missing.\n    Narrator:\n Sartaj Garewal \n    Count to Ten\n    By:\n                                James Patterson, \n                                Ashwin Sanghi\n                                24\n                                ratings\n    Narrator:\n                                Sartaj Garewal\n    Duration:\n                            7 hrs and 7 mins\n    Format:\n                            Unabridged\n                            Santosh Wagh quit his job as head of Private India after harrowing events in Mumbai almost got him killed. But Jack Morgan, global head of the world's finest investigation agency, needs him back. Jack is setting up a new office in Delhi, and Santosh is the only person he can trust. Still battling his demons, Santosh accepts, and it's not long before the agency takes on a case that could make or break them. Plastic barrels containing dissolved human remains have been found in the basement of a house in an upmarket area of South Delhi.\n    Narrator:\n Brandon Maloney \n    Madison Park\n    By:\n                                Eric L. Motley, \n                                Walter Isaacson - foreword\n                                1\n                                rating\n    Narrator:\n                                Brandon Maloney\n    Duration:\n                            7 hrs and 52 mins\n    Format:\n                            Unabridged\n                            Welcome to Madison Park, a small community in Alabama founded by freed slaves in 1880. And meet Eric Motley, a native son who came of age in this remarkable place where constant lessons in self-determination, hope, and unceasing belief in the American dream taught him everything he needed for his journey to the Oval Office as a special assistant to President George W. Bush.\n    Narrator:\n Dominic Hoffman \n    Higher Is Waiting\n    By:\n                                Tyler Perry\n                                51\n                                ratings\n    Narrator:\n                                Dominic Hoffman\n    Duration:\n                            4 hrs and 39 mins\n    Format:\n                            Unabridged\n Higher Is Waiting  is a spiritual guidebook, a collection of teachings culled from the experiences of a lifetime, meant to inspire listeners to climb higher in their own lives and pull themselves up to a better, more fulfilling place. In this gem of a book, Tyler Perry writes of how his faith has sustained him in hard times, centered him in good times, and enriched his life.\n    Narrator:\n Rachel Jeffs \n    Breaking Free\n    By:\n                                Rachel Jeffs\n                                80\n                                ratings\n    Narrator:\n                                Rachel Jeffs\n    Duration:\n                            8 hrs and 3 mins\n    Format:\n                            Unabridged\n                            In this searing memoir of survival in the spirit of  Stolen Innocence , the daughter of Warren Jeffs, the self-proclaimed Prophet of the FLDS Church, takes you deep inside the secretive polygamist Mormon fundamentalist cult run by her family and how she escaped it. Born into the Fundamentalist Church of Jesus Christ of Latter-Day Saints, Rachel Jeffs was raised in a strict patriarchal culture defined by subordinate sister wives and men they must obey.\n    Narrator:\n Jenifer Lewis \n    The Mother of Black Hollywood\n    By:\n                                Jenifer Lewis\n                                119\n                                ratings\n    Narrator:\n                                Jenifer Lewis\n    Duration:\n                            10 hrs and 47 mins\n    Format:\n                            Unabridged\n                            Jenifer Lewis keeps it real in this provocative and touching memoir by a Midwestern girl with a dream whose journey from poverty to Hollywood will move, shock, and inspire listeners. Told in the audacious voice her fans adore, Jenifer describes a road to fame made treacherous by dysfunction and undiagnosed mental illness, including a sex addiction. Yet, supported by loving friends and strengthened by \"inner soldiers\", Jenifer never stopped entertaining and creating.\n  Why Audible?\n  Anytime, anywhere listening.\n                    Listen to your books wherever you are with our free app—at home, in the car, at the gym. Even if you switch devices, you'll never lose your place.\n  Biggest. Selection. Ever.\n                    No one's got more listens than Audible. Don't like one? No-questions-asked returns means exchanges are easy.\n Try Audible Free \n                        $14.95/month after 30 days. Cancel anytime.\n  You're protected.\n                    Audible is a trusted Amazon company so you can count on privacy, security and satisfaction.\n Try Audible Free \n $14.95/month after 30 days. Cancel anytime. \n Try Audible Free \n                            $14.95/month after 30 days. Cancel anytime.\n About Audible \n Affiliates \n Careers \n Business Inquiries \n Contact Us \n Help \n Site Map \n How to Listen \n Membership Plans \n Gift Center \n Redeem a Promo Code \n Audible Range \n Audible for Enterprise \n Best Sellers \n New at Audible \n eBooks by Kindle \n Whispersync for Voice \n Foreign Language \n Romance Package \n  Press Coverage \n Mysteries & Thrillers \n Sci-fi & Fantasy \n History \n Classics \n Bios & Memoirs \n Business \n Self Development \n Romance \n Fiction \n For Your Kids - NEW \n © Copyright 1997 - 2017 Audible Inc. \n  Conditions of Use  \n  Privacy Notice"}