{"url": "https://war.wikipedia.org/wiki/Portsmouth", "content": "Portsmouth - Wikipedia \n Portsmouth   \n Tikang ha Wikipedia   \n\t\t\t\t\tLaktaw ngadto ha:\t\t\t\t\t paglayag , \t\t\t\t\t bilnga \n An  Portsmouth  amo an usa ka syudad han  Reino Unido . \n   Usa ka  turók  ini nga barasahon. Dako it imo  maibubulig  ha Wikipedia pinaagi han  pagparabong hini . \n An Wikimedia Commons mayda media nga nahahanungod han:  Portsmouth \n\t\t\t\t\t\tGinkuha tikang ha \" https://war.wikipedia.org/w/index.php?title=Portsmouth&oldid=2089262 \"\t\t\t\t\t \n Kaarangay:  Mga turók   \n Menu hit nabigasyon \n Mga pankalugaringon nga garamiton \n Diri naka-log in Hiruhimangraw Mga amot Himo-a an akawnt Sakob   \n Mga ngaran-lat'ang \n Barasahon Hiruhimangraw   \n Mga pagkadirudilain \n Mga paglantaw \n Basaha Igliwat Igliwat an wikitext Kitaa an kaagi   \n Damo pa \n Bilnga \n paglayag \n Syahan nga Pakli Ganghaan han Komunidad Mga panhitabo Mga kabag-ohan Bisan ano nga pakli Bulig Mga Donasyon   \n Pagpatika/pag-ambit \n Ayaw paandara an naghimo han libro Igkarga-paubos komo PDF Maipapatik nga bersyon   \n Ha iba nga mga proyekto \n Wikimedia Commons   \n Garamiton \n Mga nasumpay dinhi Mga may kalabotan nga binag-o Pagkarga hin file Mga pinaurog nga pakli Sumpay nga unob Impormasyon han pakli Wikidata item Ig-cite ini nga pakli   \n Ha iba nga mga yinaknan \n Afrikaans العربية Asturianu Azərbaycanca Беларуская Беларуская (тарашкевіца)‎ Български বাংলা Brezhoneg Català Нохчийн Cebuano کوردی Čeština Cymraeg Dansk Deutsch Ελληνικά English Esperanto Español Eesti Euskara فارسی Suomi Français Frysk Gaeilge Galego 客家語/Hak-kâ-ngî עברית Hrvatski Magyar Հայերեն Bahasa Indonesia Íslenska Italiano 日本語 Basa Jawa Қазақша 한국어 Latina Lëtzebuergesch Limburgs Lietuvių Latviešu मराठी مازِرونی Nederlands Norsk nynorsk Norsk Nouormand Polski Português Runa Simi Română Русский Scots Srpskohrvatski / српскохрватски Simple English Slovenčina Српски / srpski Svenska Kiswahili தமிழ் ไทย Tagalog Türkçe Українська اردو Oʻzbekcha/ўзбекча Vepsän kel’ Tiếng Việt Volapük 吴语 中文 Bân-lâm-gú 粵語   \n Igliwat an mga sumpay   \n  Ini nga pakli kataposan nga ginliwat dida han  14:21, 11 Marso 2013. \n An teksto in available ha ilarom han  Creative Commons Attribution-ShareAlike License ;\nkadugangan nga terms in puyde mag-apply.\nKitaa an Mga Terms of Use  para han mga detalye. \n Polisiya hin pribasidad \n Bahin han Wikipedia \n Mga Disclaimer \n Mga developer \n Cookie statement \n Mobile view"}