{"url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/consistent-behavior-consistent-functionality.html", "content": "Understanding Success Criterion 3.2.4  | Understanding WCAG 2.0\n    \t\t\t\t Understanding WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  SC  3.2.3 [Consistent Navigation] Next:  SC  3.2.5 [Change on Request] On this page: Intent Examples Related Resources Techniques & Failures Key terms   -   Consistent Identification : Understanding  SC  3.2.4 \n 3.2.4  Consistent Identification:  Components that have the  same functionality  within a set of  Web pages  are identified consistently. \n\t\t\t\t\t(Level AA)\n\t\t\t\tIntent of this Success Criterion\n\t\t\t The intent of this Success Criterion is to ensure consistent identification of functional components that appear repeatedly within a set of Web pages. A strategy that people who use screen readers use when operating a Web site is to rely heavily on their familiarity with functions that may appear on different Web pages. If identical functions have different labels on different Web pages, the site will be considerably more difficult to use. It may also be confusing and increase the cognitive load for people with cognitive limitations. Therefore, consistent labeling will help. \n           This consistency extends to the text alternatives. If icons or other non-text items have the same functionality, then their text alternatives should be consistent as well. If there are two components on a web page that both have the same functionality as a component on another page in a set of web pages, then all 3 must be consistent. Hence the two on the same page will be consistent. While it is desirable and best practice always to be consistent within a single web page, 3.2.4 only addresses consistency within a set of web pages where something is repeated on more than one page in the set. \n\t\t\t\tSpecific Benefits of Success Criterion 3.2.4:\n\t\t\t People who learn functionality on one page on a site can find the desired functions on other pages if they are present. When non-text content is used in a consistent way to identify components with the same functionality, people with difficulty reading text or detecting text alternatives can interact with the Web without depending on text alternatives. People who depend on text alternatives can have a more predictable experience. They can also search for the component if it has a consistent label on different pages. \n\t\t\t\tExamples of Success Criterion 3.2.4 \n Example 1: Document Icon \n A document icon is used to indicate document download throughout a site. The text alternative for the icon always begins with the word “Download,\" followed by a shortened form of the document title. Using different text alternatives to identify document names for different documents is a consistent use of text alternatives. \n Example 2: Check Mark \n A check mark icon functions as \"approved\", on one page but as \"included\" on another. Since they serve different functions, they have different text alternatives.\n Example 3: Consistent references to other pages \n  A Web site publishes articles on-line. Each article spans multiple Web pages and each page contains a link to the first page, the next page and the previous page of the article. If the references to the next page read \"page 2\", \"page 3\", \"page 4\" etcetera, the labels are not the same but they are consistent. Therefore, these references are not failures of this Success Criterion.  \n Example 4: Icons with similar functions \n An e-commerce application uses a printer icon that allows the user to print receipts and invoices. In one part of the application, the printer icon is labeled \"Print receipt\" and is used to print receipts, while in another part it is labeled \"Print invoice\" and is used to print invoices. The labeling is consistent (\"Print x\"), but the labels are different to reflect the different functions of the icons. Therefore, this example does not fail the Success Criterion.\n Example 5: Save icon \n A common \"save\" icon is used through out the site where page save function is provided on multiple Web pages. \n Example 6: Icon and adjacent link to same destination \n An icon with alt text and a link are next to each other and go to the same location. The best practice would be to group them into one link as per  H2: Combining adjacent image and text links for the same resource   (HTML)\n\t\t\t. However if they are visually positioned one above the other but separated in the source, this may not be possible. To meet the Success Criterion, the link text for these two links need only be consistent, not identical. But best practice is to have identical text so that when users encounter the second one, it is clear that it goes to the same place as the first. \n Example 7: Example of a Failure \n A submit \"search\" button on one Web page and a \"find\" button on another Web page both have a field to enter a term and list topics in the Web site related to the term submitted. In this case, the buttons have the same functionality but are not labeled consistently. \n\t\t\t\tRelated Resources\n\t\t\t Resources are for information purposes only, no endorsement implied. (none currently documented) \n\t\t\t\tTechniques and Failures for Success Criterion 3.2.4 - Consistent Identification Each numbered item in this section represents a technique or combination of techniques that the  WCAG  Working Group deems sufficient for meeting this Success Criterion. However, it is not necessary to use these particular techniques. For information on using other techniques, see  Understanding Techniques for WCAG Success Criteria , particularly the \"Other Techniques\" section. \n\t\t\t\tSufficient Techniques  \n G197: Using labels, names, and text alternatives consistently for content that has the same functionality \n AND  following the  sufficient techniques for Success Criterion 1.1.1  and  sufficient techniques for Success Criterion 4.1.2  for providing labels, names, and text alternatives. Note 1:\n\t\t\t\t\t Text alternatives that are \"consistent\" are not always \"identical.\" For instance, you may have an graphical arrow at the bottom of a Web page that links to the next Web page. The text alternative may say \"Go to page 4.\" Naturally, it would not be appropriate to repeat this exact text alternative on the next Web page. It would be more appropriate to say \"Go to page 5\". Although these text alternatives would not be identical, they would be consistent, and therefore would satisfy this Success Criterion. Note 2:\n\t\t\t\t\t  A single non-text-content-item may be used to serve different functions. In such cases, different text alternatives are necessary and should be used. Examples can be commonly found with the use of icons such as check marks, cross marks, and traffic signs. Their functions can be different depending on the context of the Web page. A check mark icon may function as \"approved\", \"completed\", or \"included\", to name a few, depending on the situation. Using \"check mark\" as text alternative across all Web pages does not help users understand the function of the icon. Different text alternatives can be used when the same non-text content serves multiple functions. \n\t\t\t\t Additional Techniques (Advisory) for 3.2.4 Although not required for conformance, the following additional techniques should be considered in order to make content more accessible. Not all techniques can be used or would be effective in all situations. \n        Ensuring that the text alternative conveys the function of the component and what will happen when the user activates it (future link)\n        Using the same non-text content for a given function whenever possible (future link)\n\t\t\t\t Common Failures for  SC  3.2.4 The following are common mistakes that are considered failures of Success Criterion 3.2.4 by the  WCAG  Working Group. \n F31: Failure of Success Criterion 3.2.4 due to using two different labels for the same function on different Web pages within a set of Web pages  \n Key Terms   Web page \n              a non-embedded resource \n                obtained from a single URI using HTTP plus any other resources that are used in the rendering or intended to be rendered together with it by a  user agent \n Note 1:\n\t\t\t\t\t Although any \"other resources\" would be rendered together with the primary resource, they would not necessarily be rendered simultaneously with each other. Note 2:\n\t\t\t\t\t For the purposes of conformance with these guidelines, a resource must be \"non-embedded\" within the scope of conformance to be considered a Web page. Example 1:\n\t\t\t\t\t A Web resource including all embedded images and media. Example 2:\n\t\t\t\t\t A Web mail program built using Asynchronous JavaScript and XML (AJAX). The program lives entirely at http://example.com/mail, but includes an inbox, a contacts area and a calendar. Links or buttons are provided that cause the inbox, contacts, or calendar to display, but do not change the URI of the page as a whole. Example 3:\n\t\t\t\t\t A customizable portal site, where users can choose content to display from a set of different content modules. Example 4:\n\t\t\t\t\t When you enter \"http://shopping.example.com/\" in your browser, you enter a movie-like interactive shopping environment where you visually move around in a store dragging products off of the shelves around you and into a visual shopping cart in front of you. Clicking on a product causes it to be demonstrated with a specification sheet floating alongside. This might be a single-page Web site or just one page within a Web site.   same functionality  \n              same result when used \n             Example:  A submit \"search\" button on one Web page and a \"find\" button on another Web page may both have a field to enter a term and list topics in the Web site related to the term submitted. In this case, they would have the same functionality but would not be labeled consistently. Top Contents Intro Previous:  SC  3.2.3 [Consistent Navigation] Next:  SC  3.2.5 [Change on Request] This Web page is part of  Understanding WCAG 2.0: A guide to understanding and implementing WCAG 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}