{"url": "http://cujah.org/page/2/", "content": "CUJAH – Page 2 – Concordia Undergraduate Journal of Art History \n Skip to content \n CUJAH \n About CUJAH \n About Us \n Contact Us \n Volumes \n Volume XII \n Volume XI \n Volume X \n Volume IX \n Volume VIII \n Volume VII \n Volume VI \n Volume V \n Volume IV \n Volume III \n Volume II \n Volume I \n Conference \n Events \n Submissions \n Submit \n Submission Guidelines \n Concordia Undergraduate Journal of Art History \n CUJAH Vol. XIV is looking for an Assistant Graphic Designer & Web Programmer   Job Title: Assistant Graphic Designer \n Working with the Head Graphic Designer, the Assistant Graphic Designer will contribute to redesigning CUJAH. This includes, but is not limited to the creation of: minimum 2 posters and our annual conference publication. \n The Assistant Graphic Designer will receive compensation of  $400  for their work paid over two installments. \n N.B.  The Assistant Graphic Designer’s work for CUJAH  can qualify as an independent study.   However, it is their responsibility to obtain the permission and supervision of a faculty member in the Department of Design and Computation Arts. \n Job Title: Web Programmer \n Build your portfolio, make money, leave your mark—redesign CUJAH! \n Working with the Head Graphic Designer and Assistant Graphic Designer, the Web Programmer will contribute to redesigning CUJAH. This includes, but is not limited to the renovation of CUJAH’s current website  cujah.org , its upkeep and maintenance. \n The Web Programmer will receive compensation of  $1,400  for their work paid over three installments \n HOW TO APPLY: \nPlease send the following documents in a single PDF to  thecujah@gmail.com  by  September 13, 2017 at 11:00 p.m : \n 01  CV \n 02  Short bio (200 words maximum) stating your academic interests and current student status \n 03  Contact information (name, phone number, email address, student ID) \n Older posts   \n Newer posts   \n CUJAH @ Copyright 2017. - Created by  SliceJack"}