{"url": "https://rufus.akeo.ie/", "content": "Rufus - Create bootable USB drives the easy way \n  English (International) \n  Albanian (Shqip) \n  Arabic (العربية) \n  Armenian (Հայերեն) \n  Azerbaijani (Azərbaycan) \n  Bangla (বাংলা) \n  Bosnian (Bosánski) \n  Bulgarian (Български) \n  Catalan (Català) \n  Chinese Simplified (简体中文) \n  Chinese Traditional (正體中文) \n  Croatian (Hrvatski) \n  Czech (Čeština) \n  Danish (Dansk) \n  Dutch (Nederlands) \n  Estonian (eesti keel) \n  Finnish (Suomi) \n  French (Français) \n  Galician (Galego) \n  German (Deutsch) \n  Greek (Ελληνικά) \n  Hebrew (עברית) \n  Hungarian (Magyar) \n  Indonesian (Bahasa Indonesia) \n  Italian (Italiano) \n  Japanese (日本語) \n  Korean (한국어) \n  Latvian (Latviešu) \n  Lithuanian (Lietuvių) \n  Malay (Bahasa Malaysia) \n  Norwegian (Norsk) \n  Persian (فارسی) \n  Polish (Polski) \n  Portuguese [BR] (Português [BR]) \n  Portuguese [PT] (Português [PT]) \n  Romanian (Română) \n  Russian (Русский) \n  Serbian [Latin] (Srpski [Latinica]) \n  Slovak (Slovensky) \n  Slovenian (Slovenščina) \n  Spanish (Español) \n  Swedish (Svenska) \n  Thai (ไทย) \n  Turkish (Türkçe) \n  Ukrainian (Українська) \n  Vietnamese (Tiếng Việt) \n Want your language here?   \n  \n (Placeholder for ads — Just like you, I wish this site could exist without them...) \n Rufus \n\t\tCreate bootable USB drives the easy way\t \n   Rufus is a utility that helps format and create bootable USB flash drives, such as USB keys/pendrives, memory sticks, etc. \n It can be especially useful for cases where:\t\t\t \n you need to create USB installation media from bootable ISOs (Windows, Linux, UEFI, etc.) \n you need to work on a system that doesn't have an OS installed \n you need to flash a BIOS or other firmware from DOS \n you want to run a low-level utility \n Despite its small size, Rufus provides everything you need! \n Oh, and Rufus is  fast . For instance it's about twice as fast as  UNetbootin ,  Universal USB Installer  or  Windows 7 USB download tool , on the creation of a Windows 7 USB installation drive from an ISO. It is also marginally faster on the creation of Linux bootable USB from ISOs.  (1) \n\t\tA non exhaustive list of Rufus supported ISOs is also provided at the bottom of this page.  (2) \n Download \n Last updated 2017.11.07: \n Rufus 2.18   (945 KB) \n Rufus 2.18 Portable   (945 KB) \n Other versions \n Supported Languages: \n Azərbaycanca ,  \n Bahasa Indonesia ,  \n Bahasa Malaysia ,  \n Български ,  \n Čeština ,  \n Dansk ,  \n Deutsch ,  \n Ελληνικά ,  \n English ,  \n Español ,  \n Français ,  \n Hrvatski ,  \n Italiano ,  \n Latviešu ,  \n Lietuvių ,  \n Magyar ,  \n Nederlands ,  \n Norsk ,  \n Polski ,  \n Português ,  \n Português do Brasil ,  \n Русский ,  \n Română ,  \n Slovensky ,  \n Slovenščina ,  \n Srpski ,  \n Suomi ,  \n Svenska ,  \n Tiếng Việt ,  \n Türkçe ,  \n Українська ,  \n 简体中文 ,  \n 正體中文 ,  \n 日本語 ,  \n 한국어 ,  \n ไทย ,  \n עברית ,  \n العربية ,  \n فارسی . \n System Requirements: \n Windows XP or later, 32 or 64 bit doesn't matter. Once downloaded, the application is ready to use. \n I will take this opportunity to express my gratitude to the translators who made it possible for Rufus, as well as this webpage, to be translated in various languages. If you find that you can use Rufus in your own language, you should really thank them! \n Usage \n Download the executable and run it – no installation is necessary. \n The executable is digitally signed and the signature should state:\t\t\t \"Akeo Consulting\"  (v1.3.0 or later) \n \"Pete Batard - Open Source Developer\"  (v1.2.0 or earlier) \n Notes on DOS support: \n If you create a DOS bootable drive and use a non-US keyboard, Rufus will attempt to select a keyboard layout according to the locale of your system. In that case,  FreeDOS , which is the default selection, is recommended over MS-DOS, as it supports more keyboard layouts. \n Notes on ISO Support: \n All versions of Rufus since v1.1.0 allow the creation of a bootable USB from an  ISO image  (.iso). \n Creating an ISO image from a physical disc or from a set of files is very easy to do however, through the use of a CD burning application, such as the freely available  CDBurnerXP  or  ImgBurn . \n Notes on UEFI & GPT support: \n Since version 1.3.2, Rufus support UEFI as well as GPT for installation media, meaning that it will allow you to install Windows 7, Windows 8 or Linux in full EFI mode. \n\t\tHowever, Windows Vista or later is required for full UEFI/GPT support. Because of OS limitations, Windows XP restricts the creation of UEFI bootable drives to MBR mode. \n Frequently Asked Questions (FAQ) \n A Rufus FAQ is available  HERE . \n To provide feedback, report a bug or request an enhancement, please use the github  issue tracker . Or you can  send an e-mail . \n License \n GNU General Public License (GPL) version 3  or later. You are free to distribute, modify or even sell the software, insofar as you respect the GPLv3 license. \n Rufus is produced in a 100% transparent manner, from its  public source , using a  MinGW32  environment. \n Changelog \n Version 2.18  (2017.11.07) \n Ensure that the same drive is reselected on device refresh \n Add a cheat mode to cycle the USB port of currently selected device \n Make lookup for updatable .cfg file more generic (e.g. ESET SysRescue) \n Fix handling of multiextent ISOs (e.g. BlackArch Linux) \n Fix propagation of image decompression errors \n Update grub4dos to latest \n RUFUS 2.18 IS THE LAST RELEASE TO SUPPORT  WINDOWS XP  AND  WINDOWS VISTA . FUTURE RELEASES WILL  NO LONGER  BE COMPATIBLE WITH THESE PLATFORMS! \n\t\t\t\t\t\t \n\t\t\t Other versions \n Source Code \n Rufus 2.18   (2.4 MB) \n Alternatively, you can clone the  git  repository using:\t\t\t $ git clone git://github.com/pbatard/rufus \n For more information, see the  github project . \n\t\t\tIf you are a developer, you are very much encouraged to tinker with Rufus and submit patches.\n Donations \n Since I'm getting asked about this on regular basis, there is  no  donation button on this page. \n The main reason is that I feel that the donation system doesn't actually help software development and worse, can be guilt-inducing for users who choose not to donate. \n Instead, I think that  \" mécénat \" ; or developer patronage, from  companies  which benefit most from a healthy  FLOSS  ecosystem, is what we should be aiming for. This is because, unless they are backed by a company, developers who want to provide quality Open Source software cannot realistically sustain full time development, no matter how generous their software users are. \n Also, unless you are  blocking them  (hint, hint), you'll notice that there are ads on this page, which I consider sufficient revenue enough. \n Finally the fact that I have the freedom to develop  Free Software  in my spare time should indicate that I'm well-off enough, and therefore that you should direct your generosity towards people who need it a lot more than I do. If you really insist, you can always make a donation to the  Free Software Foundation , as they are the main reason software like Rufus is possible. \n At any rate, I'll take this opportunity to say  thank you  for your continuing support and enthusiasm about this little program: it is much appreciated! \n But please continue to feel free to use Rufus without any guilt about not contributing for it financially – you should never have to! \n   \n (1) Speed comparison between Rufus and other applications \n The following tests carried out on a Windows 7 x64 Core 2 duo/4 GB RAM platform, with an USB 3.0 controller and a  16 GB USB 3.0 ADATA S102 flash drive . \n •  Windows 7 x64 :  en_windows_7_ultimate_with_sp1_x64_dvd_618240.iso \n Windows 7 USB/DVD Download Tool v1.0.30 00:08:10 \n Universal USB Installer v1.8.7.5 00:07:10 \n UNetbootin v1.1.1.1 00:06:20 \n RMPrepUSB v2.1.638 00:04:10 \n WiNToBootic v1.2 00:03:35 \n Rufus v1.1.1 00:03:25 \n •  Ubuntu 11.10 x86 :  ubuntu-11.10-desktop-i386.iso \n UNetbootin v1.1.1.1 00:01:45 \n RMPrepUSB v2.1.638  00:01:35 \n Universal USB Installer v1.8.7.5 00:01:20 \n Rufus v1.1.1 00:01:15 \n •  Slackware 13.37 x86 :  slackware-13.37-install-dvd.iso \n UNetbootin v1.1.1.1 01:00:00+ \n Universal USB Installer v1.8.7.5 00:24:35 \n RMPrepUSB v2.1.638 00:22:45 \n Rufus v1.1.1 00:20:15 \n   \n (2) Non exhaustive list of ISOs Rufus is known to work with \n Arch Linux ,  \n Archbang ,  \n BartPE/pebuilder ,  \n CentOS ,  \n Damn Small Linux ,  \n Debian ,  \n Fedora ,  \n FreeDOS ,  \n FreeNAS ,  \n Gentoo ,  \n GParted ,  \n gNewSense ,  \n Hiren's Boot CD ,  \n LiveXP ,  \n Knoppix ,  \n KolibriOS ,  \n Kubuntu ,  \n Linux Mint ,  \n NT Password Registry Editor ,  \n Parted Magic ,  \n Partition Wizard ,  \n Raspbian ,  \n ReactOS ,  \n Red Hat ,  \n rEFInd ,  \n Slackware ,  \n Super Grub2 Disk ,  \n Tails ,  \n Trinity Rescue Kit ,  \n Ubuntu ,  \n Ultimate Boot CD ,  \n Windows XP  (SP2+) ,  \n Windows Vista ,  \n Windows Server 2008 ,  \n Windows 7 ,  \n Windows 8 ,  \n Windows 8.1 ,  \n Windows Server 2012 ,  \n Windows 10 ,  \n Windows Server 2016 ,  \n … \n Copyright  ©  2011-2017  Pete Batard \n\t\t\t\t\t\tUSB icon by  PC Unleashed \n\t\t\tHosting by  Neosurge"}