{"url": "http://cujah.org/", "content": "CUJAH – Concordia Undergraduate Journal of Art History \n Skip to content \n CUJAH \n About CUJAH \n About Us \n Contact Us \n Volumes \n Volume XII \n Volume XI \n Volume X \n Volume IX \n Volume VIII \n Volume VII \n Volume VI \n Volume V \n Volume IV \n Volume III \n Volume II \n Volume I \n Conference \n Events \n Submissions \n Submit \n Submission Guidelines \n Concordia Undergraduate Journal of Art History \n CUJAH Vol. XIV is looking to hire students to fill positions on our Executive Team!   CUJAH is on the lookout for a Managing Editor, Conference Coordinator, Events Coordinator, and Communications Coordinator to form our 2017-2018 Executive Team! See below for position descriptions and task breakdowns. \n Job Title: Managing Editor \n Working with closely the Editor-in-Chief, the Managing Editor will chiefly be responsible for managing all CUJAH editors, overseeing all final edits of CUJAH’s annual publication and managing the CUJAH Archive Project. \n Tasks: \n Coordinate and oversee editorial activities \n Work directly with Editor-in-Chief in all facets of CUJAH \n Take lead on the CUJAH Archive Project \n N.B.  The Managing Editor’s work for CUJAH  can qualify as an independent study.   However, it is their responsibility to obtain the permission and supervision of a faculty member in the Department of Art History. \n Job Title: Conference Coordinator \n The Conference Coordinator organizes and brings to fruition CUJAH’s annual Undergraduate Art History Undergraduate Conference, which usually takes place at the end of February / beginning of March. \n Tasks: \n Organize and oversee CUJAH’s 7th annual Undergraduate Art History Conference \n Create budget, organize room rental, contact speakers, secure refreshments & beverages, etc. \n Work with Assistant Graphic Designer in the creation of conference booklets \n The Conference Coordinator will receive an honorarium of  $150 . \n Job Title: Events Coordinator \n The Events Coordinator is responsible for organizing all CUJAH events throughout the year and maintaining connections with collaborators. \n Tasks: \n Organize and oversee CUJAH events: concept development, budget creation, room reservation, etc. \n Work directly with Communications Coordinator and event collaborators \n Ensure online access to events with Web Programmer \n Job Title: Communications Coordinator \n The Communications Coordinator is responsible for promoting CUJAH and all of CUJAH’s activities throughout the year on a consistent basis. \n Tasks: \n Maintain CUJAH Social Media presence, working directly with Graphic Designers in creating a visual identity for CUJAH \n Maintain external communications: press, news & media \n Maintain internal communications: Concordia, FASA affiliates, CUJAH teams, etc. \n HOW TO APPLY: \n Please send the following documents in a single PDF to  thecujah@gmail.com  by: \n Sunday September 17, 2017 at 11:00 p.m : \n 01  CV \n 02  Short bio (200 words maximum) stating your academic interests and current student status, and  indicate which position you are applying for \n 03  Contact information (name, phone number, email address, student ID) \n If you have questions about any of these positions, please contact us at  thecujah@gmail.com , we would be glad to answer them! \n Older posts   \n CUJAH @ Copyright 2017. - Created by  SliceJack"}