{"url": "http://ev.buaa.edu.cn/Alumni/Alumni.htm", "content": "Alumni-BEIHANG \n About BUAA \n Overview \n President's Welcome \n BUAA Today \n Current Leaders \n Administration \n Statistics \n Maps \n Admission \n Why BUAA \n Undergraduate \n Graduate \n Chinese Training \n International Education \n Exchange Program \n Scholarship \n Research \n NLAA \n IRI \n Labs & Centers \n Key Disciplines \n News & Events \n News \n Events \n Campus Life \n General Information \n Campus Map \n Alumni \n Alumni \n Donate \n Share To \n   中文版 \n Alumni \n Introduction to Alumni GeneralAssociation \n The alumniassociation of Beijing University of Aeronautics and Astronautics was foundedin October 1985. It is a national Class I association with corporate capacityapproved and registered by Ministry of Civil Affairs of PRC in May 1993 (RegistrationCertificate: Association Certificate No. 4387). The current chairman is thepresident of school, AcademicianHuai Jinpeng.The alumnigeneral association currently owns 60 regional member units in domestic, 9 regionalmember units overseas, and 5 industry associations. It includes almost 200thousand alumni. The alumni general association mainly strives to carry forwardfine tradition and learning style of alma mater, takes college and local alumniassociation as significant support, contacts alumni at home and abroad,develops all kinds of alumni fellowship activities, enhances alumni cohesion;it conducts vigorous propaganda of the latest development of alma mater,enhances the understanding of alumni to alma mater, promotes the communicationand cooperation between alumni and alma mater in respects of teaching,scientific research, academic and social work, etc; it serves the alumni positivelyand encourages them to achieve achievements in career continuously. \n In order to strengthenalumni affairs, the school set up secretariat of alumni general association as specialagency for alumni affairs; it also set up alumni affairs office in 2012. Thework purpose of secretariat is to strengthen the connections between alumni andalma mater, enhance emotion communication information, make mutual development,establish school image, carry forward fine tradition of alma mater, contributeto prosperous & development of alma mater and prosperous and progress ofnation. \n Office Address ofBeihang Alumni General Association – Dong Xiao Lou \n Alumni GeneralAssociation:82338260 \n Email:xyh@buaa.edu.cn \n Education Foundation:82339531 \n Website ofAlumniGeneral Association: http://xyh.buaa.edu.cn \n Sina Weibo:http://e.weibo.com/727897388"}