{"url": "http://www.opendesignnow.org", "content": "Apache2 Ubuntu Default Page: It works \n          Apache2 Ubuntu Default Page\n          It works!\n                This is the default welcome page used to test the correct \n                operation of the Apache2 server after installation on Ubuntu systems.\n                It is based on the equivalent page on Debian, from which the Ubuntu Apache\n                packaging is derived.\n                If you can read this page, it means that the Apache HTTP server installed at\n                this site is working properly. You should  replace this file  (located at\n                 /var/www/html/index.html ) before continuing to operate your HTTP server.\n                If you are a normal user of this web site and don't know what this page is\n                about, this probably means that the site is currently unavailable due to\n                maintenance.\n                If the problem persists, please contact the site's administrator.\n                Configuration Overview\n                Ubuntu's Apache2 default configuration is different from the\n                upstream default configuration, and split into several files optimized for\n                interaction with Ubuntu tools. The configuration system is\n                 fully documented in\n                /usr/share/doc/apache2/README.Debian.gz . Refer to this for the full\n                documentation. Documentation for the web server itself can be\n                found by accessing the  manual  if the  apache2-doc \n                package was installed on this server.\n                The configuration layout for an Apache2 web server installation on Ubuntu systems is as follows:\n/etc/apache2/\n|-- apache2.conf\n|       `--  ports.conf\n|-- mods-enabled\n|       |-- *.load\n|       `-- *.conf\n|-- conf-enabled\n|       `-- *.conf\n|-- sites-enabled\n|       `-- *.conf\n apache2.conf  is the main configuration\n                           file. It puts the pieces together by including all remaining configuration\n                           files when starting up the web server.\n ports.conf  is always included from the\n                           main configuration file. It is used to determine the listening ports for\n                           incoming connections, and this file can be customized anytime.\n                           Configuration files in the  mods-enabled/ ,\n                            conf-enabled/  and  sites-enabled/  directories contain\n                           particular configuration snippets which manage modules, global configuration\n                           fragments, or virtual host configurations, respectively.\n                           They are activated by symlinking available\n                           configuration files from their respective\n                           *-available/ counterparts. These should be managed\n                           by using our helpers\n a2enmod ,\n                                 a2dismod ,\n a2ensite ,\n                                 a2dissite ,\n                                and\n a2enconf ,\n                                 a2disconf \n . See their respective man pages for detailed information.\n                           The binary is called apache2. Due to the use of\n                           environment variables, in the default configuration, apache2 needs to be\n                           started/stopped with  /etc/init.d/apache2  or  apache2ctl .\n                            Calling  /usr/bin/apache2  directly will not work  with the\n                           default configuration.\n                Document Roots\n                By default, Ubuntu does not allow access through the web browser to\n                 any  file apart of those located in  /var/www ,\n                 public_html \n                directories (when enabled) and  /usr/share  (for web\n                applications). If your site is using a web document root\n                located elsewhere (such as in  /srv ) you may need to whitelist your\n                document root directory in  /etc/apache2/apache2.conf .\n                The default Ubuntu document root is  /var/www/html . You\n                can make your own virtual hosts under /var/www. This is different\n                to previous releases which provides better security out of the box.\n                Reporting Problems\n                Please use the  ubuntu-bug  tool to report bugs in the\n                Apache2 package with Ubuntu. However, check  existing\n                bug reports  before reporting a new bug.\n                Please report bugs specific to modules (such as PHP and others)\n                to respective packages, not to the web server itself."}