{"url": "http://www.boxofficemojo.com/about/advertise.htm?ref=ft", "content": "Advertising Opportunities on Box Office Mojo \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n Advertise on Box Office Mojo \nBox Office Mojo is an online publication with a focus on movies and the box office. We are more than just a source for raw data; we have more than 1 million movie fans each month who want to know how well their favorite movie, actor, director, etc. is doing at the box office.  \n Our audience also ranges from students to well-known directors and writers to independent producers and studio executives. Hollywood uses Box Office Mojo to analyze past and current trends as well as to help measure the potential for future projects. The media also uses Box Office Mojo as a source for stats and analysis. If you want to reach key influencers in the industry, this is your site. \n The Mojo Brand:   \n Box Office Mojo is the foremost authority on box office, commanding the most comprehensive and accurate database available to the general public. We are a full box office tracking firm, collecting our raw data from movie studios and theaters and publishing them to our readers. Box Office Mojo is regularly referenced and quoted by the mass media, including USA Today, Los Angeles Times, Wall Street Journal, Forbes, Drudge Report, Bloomberg, E!, CNN and Fox News Channel and many more across the country. \n Ad Specifications:   \n From IAB-standard placements to custom ad units, Box Office Mojo offers a wide variety of advertising placements designed to highlight your brand to our highly engaged audience. \n We also give you access to our parent company IMDb and their global portfolio of online sites and award-winning mobile applications.  \n If you advertise on IMDb, ask your account executive how you can include Box Office Mojo in your next advertising package. \n Contact:   \n Please contact  IMDb-advertising@imdb.com  for advertising inquires.  \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}