{"url": "http://www.osc.gov.on.ca/en/30337.htm", "content": "Form 52-109FV2 - For periods relating to financial years beginning on or after January 1, 2011 \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   Securities Law & Instruments   /   Electronic Filing   /   Reporting Issuer and Issuer Forms   /   Form 52-109FV2 - For periods relating to financial years beginning on or after January 1, 2011 \n   Section Menu \n Form 52-109FV2 - Certification of Interim Filings Venture Issuer Basic Certificate \nFor periods relating to financial years beginning  on or after  January 1, 2011 \n Helpful tips on completing this form for submission to SEDAR \n            This form is being provided to you for your convenience in HTML only. Please follow the steps below when completing this form.  \n Step #1 \n            Copy the text of the form between the two lines provided. \n Step #2 \n            Paste the text of the form into your word processing software.  \n            Step #3 \n            Complete the form. Once the form has been completed you may want to save a copy for your records before submission. \n Step #4 \n            Once the form has been completed and is ready for submission to SEDAR, SEDAR requires the form to be converted into an \"Acceptable Electronic Format\". To achieve this the completed form must be converted into .pdf format using Adobe Acrobat. Please refer to the  SEDAR Filer Manual  (Chapter 7 - Preparation of Documents for Electronic Filing) before submission to complete this process.  \n Start to copy after the line provided below   \n FORM 52-109FV2 \nCERTIFICATION OF INTERIM FILINGS \nVENTURE ISSUER BASIC CERTIFICATE \nI,  < identify (i) the certifying officer, (ii) his or her position at the issuer, (iii) the name of the issuer and (iv) if the certifying officer’s title is not “chief executive officer” or “chief financial officer”, indicate in which of these capacities the certifying officer is providing the certificate > , certify the following: \n Review:  I have reviewed the interim financial report and interim MD&A (together, the “interim filings”) of  < identify the issuer >  (the “issuer”) for the interim period ended  < state the relevant date > .  \n No misrepresentations:  Based on my knowledge, having exercised reasonable diligence, the interim filings do not contain any untrue statement of a material fact or omit to state a material fact required to be stated or that is necessary to make a statement not misleading in light of the circumstances under which it was made, with respect to the period covered by the interim filings.  \n Fair presentation:  Based on my knowledge, having exercised reasonable diligence, the interim financial report together with the other financial information included in the interim filings fairly present in all material respects the financial condition, financial performance and cash flows of the issuer, as of the date of and for the periods presented in the interim filings.  \nDate:  < insert date of filing > \n_______________________ \n[Signature] \n[Title]  \n < If the certifying officer’s title is not “chief executive officer” or “chief financial officer”, indicate in which of these capacities the certifying officer is providing the certificate. >   \n NOTE TO READER \n In contrast to the certificate required for non-venture issuers under National Instrument 52-109  Certification of Disclosure in Issuers’ Annual and Interim Filings  (NI 52-109), this Venture Issuer Basic Certificate does not include representations relating to the establishment and maintenance of disclosure controls and procedures (DC&P) and internal control over financial reporting (ICFR), as defined in NI 52-109. In particular, the certifying officers filing this certificate are not making any representations relating to the establishment and maintenance of \n controls and other procedures designed to provide reasonable assurance that information required to be disclosed by the issuer in its annual filings, interim filings or other reports filed or submitted under securities legislation is recorded, processed, summarized and reported within the time periods specified in securities legislation; and   \n a process to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with the issuer’s GAAP.   \n            The issuer’s certifying officers are responsible for ensuring that processes are in place to provide them with sufficient knowledge to support the representations they are making in this certificate. Investors should be aware that inherent limitations on the ability of certifying officers of a venture issuer to design and implement on a cost effective basis DC&P and ICFR as defined in NI 52-109 may result in additional risks to the quality, reliability, transparency and timeliness of interim and annual filings and other reports provided under securities legislation.  \n Stop copying before the line provided below   \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}