{"url": "http://parcolympique.qc.ca/bon-voisinage/", "content": "Bon voisinage |  Parc olympique de Montréal \n Notre organisme \n Comment se rendre \n FAQ \n English \n Menu Le Parc La Tour de Montréal L'Esplanade Financière Sun Life Le Stade Le Centre sportif Autres attraits  Close Nouvelles Activités Événements Parcours touristiques Organiser un événement \n Bon voisinage \n Le Stade olympique est situé à proximité à la fois d'un parc (au nord de Sherbrooke), d'un quartier industriel (à l’est de Viau et au sud de Pierre-De Coubertin) et d'un quartier résidentiel (au sud de Pierre-De Coubertin et à l'ouest de Pie- IX). \n Le Stade olympique, son Esplanade et les installations sportives attenantes (Stade Saputo, Centre Pierre-Charbonneau, Aréna Maurice-Richard, Centre sportif du Parc olympique, terrain d'entraînement de l'Impact), culturelles, muséales et touristiques accueillent plus de trois millions de visiteurs par année. De tous temps, les planificateurs urbains de Maisonneuve et de Montréal avaient prévu faire de ce grand quadrilatère un lieu festif, sportif et naturel, comme en font foi les maquettes du Stade olympique réalisées pour soumettre la candidature de Montréal dès les Jeux olympiques de 1956. La nature événementielle du lieu ainsi que la mission des organismes qui y résident d'organiser des événements et d'attirer de larges publics ne va pas sans causer quelques désagréments aux résidents. \n Aussi, dans une approche de bon voisinage, le Parc olympique s’engage à respecter ce qui suit : \n aucun bruit événementiel ou de travaux majeurs avant 7 h du lundi au vendredi. \n aucun bruit événementiel avant 8 h les samedis et dimanche, ainsi que les jours fériés. \n aucun bruit après 23 h. \n si pour des raisons de sécurité des travaux doivent être réalisés en dehors de ces plages horaires, de l’information à cet effet sera diffusée aux citoyens riverains par les médias électroniques. \n mener avec les autorités compétentes, et tout particulièrement avec la Ville de Montréal, l'arrondissement de Mercier–Hochelaga-Maisonneuve, la STM et BIXI, des campagnes pour inciter le plus grand nombre de spectateurs à se rendre dans le Quartier olympique en utilisant les modes de transport actifs et collectifs. \n inscrire au calendrier du Parc l'horaire de début et de fin (prévus) des activités qui se déroulent au Parc olympique. \n Nous remercions tous nos voisins et visiteurs qui viennent profiter de ces installations tout-à-fait uniques dans le respect et l’harmonie, afin d’en faire bénéficier le plus grand nombre. \n Le Stade \n La Tour de Montréal \n L'Esplanade \n Le Centre sportif \n Autres attraits \n Comment se rendre \n À propos \n Partenaires \n Bon voisinage \n Salle de presse \n Offres d'emploi \n Règlement   \n Contactez-nous \n\t\t\t\t\t4141, avenue Pierre-De Coubertin \r\n\t\t\t\t\tMontréal, Québec \r\n\t\t\t\t\tH1V 3N7\r\n\t\t\t\t\tTéléphone : 514 252-4141 ou 1 877 997-0919 \r\n\t\t\t\t\tTélécopieur : 514 252-0372 \r\n\t\t\t\t\tCourriel :  rio@rio.gouv.qc.ca"}