{"url": "http://www.itprotoday.com/windows-10/quick-tip-how-turn-dark-app-mode-theme-windows-10-anniversary-update", "content": "Windows 10 | Now your apps and system pages have a dark mode option | IT Pro \n Discover: \n Dev Pro \n SharePoint Pro \n SQL Server Pro \n IT/Dev Connections \n Online Training \n More \n Menu \n Log In  or  Register   \n Cloud & Data Center Business Intelligence Collaboration Management and Mobility Software Development Security Internet of Things (IoT) Podcasts Business Resources e-Learning Webcasts Industry Perspectives Research Whitepapers Subscribe Advertise About Us Privacy Policy Terms of Service   \n Search   \n Log In   \n Register   \n Recent \n Recent \n            IBM to retire two Watson IoT services             \n Nov 25, 2017   \n            Why Apple's HomePod Is Three Years Behind Amazon's Echo             \n Nov 22, 2017   \n            Digital Transformation Success Comes to Organizations with Daring Leaders             \n Nov 22, 2017   \n            Metavine GO Helps Enterprise Users Build Apps, No Coding Skills Necessary             \n Nov 22, 2017   \n            Capital One Previews Fintech Tuned Container Platform             \n Nov 21, 2017   \n Featured \n            Welcome to the New ITPro             \n Nov 02, 2017   \n            IT Pros That Skip Training, Certification Miss Out on Salary Increases             \n Oct 10, 2017   \n            The Windows 10 Fall Creators Update for Internet of Things Devices             \n Nov 02, 2017   \n            Checklist: Select the Most Secure Hardware to Use with Windows 10             \n Nov 08, 2017   \n Management & Mobility > Windows Server   Quick Tip: How to Turn on Dark App Mode (Theme) in Windows 10 Anniversary Update \n Richard Hay  |  Aug 01, 2016 \n In the Windows 10 Anniversary Update Microsoft has included an option for having a Dark App Mode in the year old operating system. \n Another term that has been used for this new personalization option is  Dark Theme  and when it is enabled all of your Windows 10 system related pages will be displayed with a dark interface instead of the typical bright white one. \n Most of Microsoft's first party apps also support a dark theme option either through the apps own settings or based on this option being turned on in the Windows Settings app. You will also notice that many third party app developers are now offering dark themes for their apps as well. \n One side benefit of a dark theme is that it actually uses less battery power than a light or white based theme does. \n Here is how to turn on the Dark App Mode in the Windows 10 Anniversary Update. \n Step One: Open Windows Settings app and select Personalization \n Click or tap the  Personalization  option in the Windows Settings app. \n Step Two: Select Colors Option and Change App Mode Setting \n One you are on the  Personalization  settings page click/tap on  Colors  (1) and then scroll to the bottom of that settings page to find  Chose your app mode  (2). \n Select Dark to switch your system over to Dark App mode and the changeover happens immediately as shown in the image below. \n Microsoft has added an updated feature for developers that will allow them to incorporate this setting with their apps and use either the Light or Dark mode for their apps on your system. However,  many may not be using this option yet so you should still check their app settings as I mentioned earlier and see if they are offering a dark theme option. \n Be sure to check out all of our  Windows 10 Anniversary Update Coverage . \n But, wait...there's probably more so be sure to follow me on  Twitter  and  Google+ . \n 0 comments   \n Hide comments \n Comment  * \n More information about text formats \n Text format  \n Comments Plain text \n Comments Allowed HTML tags: <em> <strong> <blockquote> <br> <p> Plain text No HTML tags allowed. Web page addresses and e-mail addresses turn into links automatically. Lines and paragraphs break automatically. \n Publish Log in or register to comment   \n Home page  \n Save \n Related Microsoft releases first Insider build for Redstone 4 update of Windows Server Nov 17, 2017 Windows Server Insider Preview Build Release Tracker (2017) Sep 05, 2017 SDNv2 infrastructure requirements for SCVMM and multiple clusters Aug 16, 2017 How to add additional components using SCVMM SDN Express Aug 16, 2017   \n Load More \n About   \n Advertise   \n Contact Us   \n Sitemap   \n Privacy Policy   \n Terms of Service   \n Ad Choices   \n Follow us: \n          Copyright © 2017 Penton"}