{"url": "http://www.osc.gov.on.ca/", "content": "Ontario Securities Commission \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n The Ontario Securities Commission administers and enforces securities law in the province of Ontario. Our mandate is to provide protection to investors from unfair, improper and fraudulent practices, and foster fair and efficient capital markets and confidence in capital markets \n Are you a Whistleblower? Learn more. \n OSC announces new SME Institute webinars \n ‹ \n › \n In Focus \n OSC publishes 2017 Annual Report \n OSC Publishes 2017-2018 Statement of Priorities \n OSC Publishes Corporate Finance Branch 2016-2017 Annual Report \n Vacancies - Securities Advisory Committee \n Vacancies - Fintech Advisory Committee \n OSC Publishes Summary Report for Dealers, Advisers and Investment Fund Managers \n OTC Derivatives Market Concentration Use Case Note \n 2017 Ontario Exempt Market Report \n Status Report - Proposed Best Interest Standard and Targeted Reforms \n Behavioural Insights in Financial Policy-Making and Regulation \n OSC publishes paper on Responsive Market Regulation \n Topical Guide for Registrants \n Director's decisions for registrants \n Transcript: Roundtable on Proposed Business Conduct Rules for Derivatives Dealers and Advisers \n What's New \n News Releases \n Notices from Proceedings \n Upcoming Proceedings \n Regulatory Updates \n Out for Comment \n New for Investors \n November 23, 2017 \n OSC News Release: Carlos Da Silva pleads guilty to two counts under the Criminal Code \n November 22, 2017 \n OSC News Release: OSC Requests Applications for Fintech Advisory Committee \n November 7, 2017 \n OSC News Release: OSC Adopts Rules of Procedure and Practice Guideline \n November 6, 2017 \n OSC Media Release: Term Extended for OSC Chair and CEO \n November 2, 2017 \n CSA News Release: Regulators sign an agreement with the Abu Dhabi Global Market Financial Services Regulatory Authority \n View More  \n November 24, 2017 \n Notice from the Office of the Secretary: Pro-Financial Asset Management Inc. et al. \n November 24, 2017 \n Notice from the Office of the Secretary: Land and Buildings Investment Management, LLC, File No. 2017-65 \n November 23, 2017 \n Notice from the Office of the Secretary: Omega Securities Inc., File No. 2017-64 \n November 22, 2017 \n Notice from the Office of the Secretary: Land and Buildings Investment Management, LLC, File No. 2017-65 \n November 22, 2017 \n Notice from the Office of the Secretary: Omega Securities Inc., File No. 2017-66 \n November 21, 2017 \n Notice from the Office of the Secretary: Omega Securities Inc., File No. 2017-66 \n November 21, 2017 \n Notice from the Office of the Secretary: Omega Securities Inc., File No. 2017-64 \n View More  \n November 20, 2017 \n 11:00 AM - Sino-Forest Corporation, Allen Chan, Albert Ip, Alfred C.T. Hung, George Ho, Simon Yeung and David Horsley \n November 29-30, 2017 \n 10:00 AM - Land and Buildings Investment Management, LLC \n November 29, 2017 \n 4:30 PM - Omega Securities Inc. \n December 18, 2017 \n 10:00 AM - Dennis L. Meharchand and Valt.X Holdings Inc. \n February 7, 2018 \n 12:00 PM - Sital Singh Dhillon \n February 14, 2018 \n 10:00 AM - Pro-Financial Asset Management Inc., Stuart Mckinnon and John Farrell \n February 26, 2018 \n 9:00 AM - Donna Hutchinson, Cameron Edward Cornish, David Paul George Sidders and Patrick Jelf Caruso \n View More  \n November 14, 2017 \n OSC Staff Notice 23-706 Omega Securities Inc. \n November 9, 2017 \n Amendments to NI 81-104 Commodity Pools\t \n November 9, 2017 \n Amendments to NI 81-102 Investment Funds \n November 9, 2017 \n Notice of Ministerial Approval of Amendments to NI 81-102 Investment Funds and NI 81-104 Commodity Pools \n October 26, 2017 \n CSA Consultation Paper 52-404 Approach to Director and Audit Committee Member Independence\t \n October 19, 2017 \n CSA Staff Notice 33-321 Cyber Security and Social Media \n October 16, 2017 \n Backgrounder: CSA Staff Notice 51-352 Issuers with U.S. Marijuana-Related Activities \n View More  \n Comments close: January 10, 2018   Proposed Amendments to National Instrument 94-101 Mandatory Central Counterparty Clearing of Derivatives and Proposed Changes to Companion Policy 94-101 Mandatory Central Counterparty Clearing of Derivatives \n Comments close: January 25, 2018   CSA Consultation Paper 52-404 Approach to Director and Audit Committee Member Independence \n November 8, 2017:   Investor News: Financial Literacy Month; Educational Tools and Resources; Warning Signs of Fraud; Teletownhall; Familiarity Bias; OBSI \n October 17, 2017:   Investor News: Investing in the Marijuana Industry; Investment Risks; Check Before You Invest; TFSA Calculator; OSC Annual Report; Women on Boards \n October 3, 2017:   Investor News: World Investor Week; Fund Facts; Binary Options Ban; Inertia; Investment Info Found on Social Media; New Research - Investing As We Age \n September 26, 2017:   Investor News: New Research - Investing As We Age; Using Your Home to Fund Retirement; Investor Protection Clinic; Non-GAAP Measures; Cryptocurrencies \n September 7, 2017:   Investor News: Cryptocurrency Offerings (ICOs/ITOs); \"Back to School\" for Investors; Meet Letty Dewar, IAP Chair; SEAC; Meet Carlie Weinreb \n August 16, 2017:   Investor News: In Case You Missed It - Our most notable and most visited articles, publications, initiatives, interviews and more from the past year \n July 14, 2017:   Investor News: OSC Priorities; How Rising Interest Rates Can Affect Investments; World Investor Week; New IAP Members and Chair; Paying Down Debt  \n View More  \n The exempt market - learn more \n Quick Links \n Instruments, Rules & Policies \n Proposed and final securities instruments, rules and policies overseen by the OSC. \n Investors \n Information regarding OSC efforts to protect and raise awareness among investors. \n FAQs \n Frequently asked questions about investing in the market and the securities industry. \n Check Registration \n Search to determine of if an individual or firm is registered in Canada. \n Dealers, Advisers and Investment Fund Managers \n A basic outline of how the OSC regulates and works with Dealers, Advisers and Investment Fund Managers.  \n Questions & Complaints \n How investors can reach the OSC to get help regarding a company, product or individual. \n OSC’s Electronic Filing Portal \n Documents for filing electronically through the OSC's web filing portal. \n Marketplaces, SROs & Clearing Agencies \n Information on how the OSC oversees marketplaces, SROs, clearing agencies, and investor protection funds in Ontario. \n Working at the OSC \n Learn more about career opportunities at the OSC. \n OSC Bulletin \n The official record of the activities of the OSC, published weekly online. \n Companies \n A basic guide including how to comply with Ontario securities law and file certain documents with the OSC. \n Investor Warnings \n Information about individuals and companies that appear to be engaging in activities that may pose a risk to investors. \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}