{"url": "https://www.ncbi.nlm.nih.gov/pubmed/11378470", "content": "Aluminium tolerance in plants and the complexing role of organic acids.  - PubMed - NCBI\n Warning: \n\tThe NCBI web site requires JavaScript to function. \n\t more... \n NCBI Skip to main\n                        content Skip to\n                        navigation Resources All Resources Chemicals & Bioassays BioSystems PubChem BioAssay PubChem Compound PubChem Structure Search PubChem Substance All Chemicals & Bioassays Resources... DNA & RNA BLAST (Basic Local Alignment Search Tool) BLAST (Stand-alone) E-Utilities GenBank GenBank: BankIt GenBank: Sequin GenBank: tbl2asn Genome Workbench Influenza Virus Nucleotide Database PopSet Primer-BLAST ProSplign Reference Sequence (RefSeq) RefSeqGene Sequence Read Archive (SRA) Splign Trace Archive UniGene All DNA & RNA Resources... Data & Software BLAST (Basic Local Alignment Search Tool) BLAST (Stand-alone) Cn3D Conserved Domain Search Service (CD Search) E-Utilities GenBank: BankIt GenBank: Sequin GenBank: tbl2asn Genome ProtMap Genome Workbench Primer-BLAST ProSplign PubChem Structure Search SNP Submission Tool Splign Vector Alignment Search Tool (VAST) All Data & Software Resources... Domains & Structures BioSystems Cn3D Conserved Domain Database (CDD) Conserved Domain Search Service (CD Search) Structure (Molecular Modeling Database) Vector Alignment Search Tool (VAST) All Domains & Structures Resources... Genes & Expression BioSystems Database of Genotypes and Phenotypes (dbGaP) E-Utilities Gene Gene Expression Omnibus (GEO) Database  Gene Expression Omnibus (GEO) Datasets Gene Expression Omnibus (GEO) Profiles Genome Workbench HomoloGene Map Viewer Online Mendelian Inheritance in Man (OMIM) RefSeqGene UniGene All Genes & Expression Resources... Genetics & Medicine Bookshelf Database of Genotypes and Phenotypes (dbGaP) Genetic Testing Registry Influenza Virus Map Viewer Online Mendelian Inheritance in Man (OMIM) PubMed PubMed Central (PMC) PubMed Clinical Queries RefSeqGene All Genetics & Medicine Resources... Genomes & Maps Database of Genomic Structural Variation (dbVar) GenBank: tbl2asn Genome Genome Project Genome ProtMap Genome Workbench Influenza Virus Map Viewer Nucleotide Database PopSet ProSplign Sequence Read Archive (SRA) Splign Trace Archive All Genomes & Maps Resources... Homology BLAST (Basic Local Alignment Search Tool) BLAST (Stand-alone) BLAST Link (BLink) Conserved Domain Database (CDD) Conserved Domain Search Service (CD Search) Genome ProtMap HomoloGene Protein Clusters All Homology Resources... Literature Bookshelf E-Utilities Journals in NCBI Databases MeSH Database NCBI Handbook NCBI Help Manual NCBI News & Blog PubMed PubMed Central (PMC) PubMed Clinical Queries PubMed Health All Literature Resources... Proteins BioSystems BLAST (Basic Local Alignment Search Tool) BLAST (Stand-alone) BLAST Link (BLink) Conserved Domain Database (CDD) Conserved Domain Search Service (CD Search) E-Utilities ProSplign Protein Clusters Protein Database Reference Sequence (RefSeq) All Proteins Resources... Sequence Analysis BLAST (Basic Local Alignment Search Tool) BLAST (Stand-alone) BLAST Link (BLink) Conserved Domain Search Service (CD Search) Genome ProtMap Genome Workbench Influenza Virus Primer-BLAST ProSplign Splign All Sequence Analysis Resources... Taxonomy Taxonomy Taxonomy Browser Taxonomy Common Tree All Taxonomy Resources... Training & Tutorials NCBI Education Page NCBI Handbook NCBI Help Manual NCBI News & Blog All Training & Tutorials Resources... Variation Database of Genomic Structural Variation (dbVar) Database of Genotypes and Phenotypes (dbGaP) Database of Single Nucleotide Polymorphisms (dbSNP) SNP Submission Tool All Variation Resources... How To All How To Chemicals & Bioassays DNA & RNA Data & Software Domains & Structures Genes & Expression Genetics & Medicine Genomes & Maps Homology Literature Proteins Sequence Analysis Taxonomy Training & Tutorials Variation About NCBI Accesskeys My NCBI Sign in to NCBI Sign Out \n PubMed \n US National Library of Medicine \n National Institutes of Health \n Search database All Databases Assembly Biocollections BioProject BioSample BioSystems Books ClinVar Clone Conserved Domains dbGaP dbVar EST Gene Genome GEO DataSets GEO Profiles GSS GTR HomoloGene Identical Protein Groups MedGen MeSH NCBI Web Site NLM Catalog Nucleotide OMIM PMC PopSet Probe Protein Protein Clusters PubChem BioAssay PubChem Compound PubChem Substance PubMed PubMed Health SNP Sparcle SRA Structure Taxonomy ToolKitAll ToolKitBookgh UniGene Search term Search Advanced Help \n Result Filters \n Format :  Abstract Format Summary Summary (text) Abstract Abstract (text) MEDLINE XML PMID List Apply Send to Choose Destination File Clipboard Collections E-mail Order My Bibliography Citation manager Format Summary (text) Abstract (text) MEDLINE XML PMID List CSV Create File 1 selected item: 11378470 Format Summary Summary (text) Abstract Abstract (text) MEDLINE XML PMID List MeSH and Other Data E-mail Subject Additional text E-mail Didn't get the message? Find out why... Add to Clipboard Add to Collections Order articles Add to My Bibliography Generate a file for use with external citation management software. Create File \n See comment in PubMed Commons below Trends Plant Sci.  2001 Jun;6(6):273-8. Aluminium tolerance in plants and the complexing role of organic acids. Ma JF 1 ,  Ryan PR ,  Delhaize E . Author information 1 Faculty of Agriculture, Kagawa University, Ikenobe 2393, Miki-cho, Kita-gun, 761-0795, Kagawa, Japan. maj@ag.kagawa-u.ac.jp Abstract The aluminium cation Al(3+) is toxic to many plants at micromolar concentrations. A range of plant species has evolved mechanisms that enable them to grow on acid soils where toxic concentrations of Al(3+) can limit plant growth. Organic acids play a central role in these aluminium tolerance mechanisms. Some plants detoxify aluminium in the rhizosphere by releasing organic acids that chelate aluminium. In at least two species, wheat and maize, the transport of organic acid anions out of the root cells is mediated by aluminium-activated anion channels in the plasma membrane. Other plants, including species that accumulate aluminium in their leaves, detoxify aluminium internally by forming complexes with organic acids. PMID:   11378470    [Indexed for MEDLINE]  Share Publication types, MeSH terms, Substances Publication types Comparative Study Research Support, Non-U.S. Gov't MeSH terms Acetyl Coenzyme A/metabolism Aluminum/metabolism* Aluminum/toxicity Anions/metabolism Carboxylic Acids/chemistry Carboxylic Acids/metabolism* Citric Acid/metabolism Cytosol/metabolism Edible Grain/metabolism Hydrogen-Ion Concentration Ion Channels/metabolism Organelles/metabolism Oxidation-Reduction Plant Physiological Phenomena* Plant Roots/metabolism Soil Substances Anions Carboxylic Acids Ion Channels Soil Citric Acid Acetyl Coenzyme A Aluminum LinkOut - more resources Full Text Sources Elsevier Science Miscellaneous ALUMINUM, ELEMENTAL - Hazardous Substances Data Bank CITRIC ACID - Hazardous Substances Data Bank PubMed Commons home \n                               PubMed Commons\n                                0  comments How to join PubMed Commons How to cite this comment: \n Supplemental Content \n Full text links   \n You are here: \n             NCBI  >  Literature  > PubMed \n Support Center \n Simple NCBI Directory \n Getting Started \n NCBI Education \n NCBI Help Manual \n NCBI Handbook \n Training & Tutorials \n Submit Data \n Resources \n Chemicals & Bioassays Data & Software DNA & RNA Domains & Structures Genes & Expression Genetics & Medicine Genomes & Maps Homology Literature Proteins Sequence Analysis Taxonomy Variation \n Popular \n PubMed \n Bookshelf \n PubMed Central \n PubMed Health \n BLAST \n Nucleotide \n Genome \n SNP \n Gene \n Protein \n PubChem \n Featured \n Genetic Testing Registry \n PubMed Health \n GenBank \n Reference Sequences \n Gene Expression Omnibus \n Map Viewer \n Human Genome \n Mouse Genome \n Influenza Virus \n Primer-BLAST \n Sequence Read Archive \n NCBI Information \n About NCBI \n Research at NCBI \n NCBI News & Blog \n NCBI FTP Site \n NCBI on Facebook \n NCBI on Twitter \n NCBI on YouTube \n        External link. Please review our  privacy policy .\n NLM \n NIH \n DHHS \n USA.gov \n National Center for\n                        Biotechnology Information ,\n                   U.S. National Library of Medicine \n 8600 Rockville Pike ,  Bethesda \n MD ,  20894 \n USA \n Policies and Guidelines  |  Contact"}