{"url": "http://ev.buaa.edu.cn/info/1035/1629.htm", "content": "Professor Wenfei Fan was Honored Membership of Academia Europaea-BEIHANG \n About BUAA \n Overview \n President's Welcome \n BUAA Today \n Current Leaders \n Administration \n Statistics \n Maps \n Admission \n Why BUAA \n Undergraduate \n Graduate \n Chinese Training \n International Education \n Exchange Program \n Scholarship \n Research \n NLAA \n IRI \n Labs & Centers \n Key Disciplines \n News & Events \n News \n Events \n Campus Life \n General Information \n Campus Map \n Alumni \n Alumni \n Donate \n Share To \n   中文版 \n                                                News\r\n Professor Wenfei Fan was Honored Membership of Academia Europaea \n Release time：September 28, 2017  /    \n Professor Wenfei Fan was elected Member of Academia Europaea in August, 2017, due to his “outstanding achievements as a researcher”.   \r\n    \n    \n    \n Professor Fan has made fundamental contributions to both foundations and practice of data management. He is recognized for initiating the formal approach to scalable querying of big data, reshaping the field of data quality, and opening up the field of constraints for semi-structured data. He developed a bounded evaluation theory for querying big data. Based on the theory, a new query evaluation paradigm has been developed, and is verified by industry to be able to improve the performance by orders of magnitude. He proposed a parallel computation model based on simultaneous fixpoint computation with partial evaluation and incremental computation. It is able to parallelize existing sequential (single-machine) graph algorithms, and makes parallel graph computations accessible to a large group of users. He established foundations for each and every of the five central issues of data quality (data consistency, accuracy, timeliness, completeness and entity resolution). He proposed a now standard notion of conditional dependencies that apply to data cleaning, and developed a package of practical methods for improving data quality. He was a pioneer of the field of integrity constraints for XML and graphs, now a mature area well represented in the full spectrum of database research. His work is characterized by developing theories that go beyond theory papers and find practical applications in industry products and standards.    \r\n     \n    \n Professor Wenfei Fan is one of the world's top “all-around” database researchers. He is one of the two “Grand Slam” title winners who have collected major awards from all four leading international database theory and systems conferences in the history of database research. He is recipient of the Best Paper Award for ACM SIGMOD Conference on Management of Data (2017), the Alberto O. Mendelzon Test-of-Time Award of ACM Symposium on Principles of Database Systems (PODS) for papers with the highest impact over 10 years (2015 and 2010), the Best Paper Award for International Conference on Very Large Data Bases (VLDB, 2010), and the Best Paper Award of IEEE International Conference on Data Engineering (ICDE, 2007). He is the Chair of Web Data Management at the University of Edinburgh, Fellow of the Royal Society of Edinburgh (UK), and Fellow of the ACM (USA).   \r\n     \n    \n As Yangtze River Scholar and national expert of Global Talent 1000 Program, Professor Fan has been contributing to state key research projects, and promoting China-based research to the world. His team at Beihang University is currently developing a parallel graph engine (GRAPE) and a system for querying big relations with bounded resources (BEAS). The team is committed to delivering the first big-data analytics systems made in China, and taking the global lead in this important area of computing, both in academia and industry.   \r\n     \n    \n Founded in 1988, Academia Europaea is the Academy of Europe. It currently has 3470 members, including leading experts from the physical sciences and technology, biological sciences and medicine, mathematics, the letters and humanities, social and cognitive sciences, economics and the law. Its members are usually from the states of the Council of Europe, and foreign members from other nations across the world.    \r\n     \n    \n Election to Academia Europaea is competitive, with a primary criterion for membership: “sustained academic excellence in the candidate’s field” (2009 Regulations, Section 2). A candidate must be nominated by two members of the Academia, one of whom must be resident in a different country from that of the candidate. Nominated candidates are assessed and ranked by committee members of corresponding Section. Individual Section ranks its candidates and submits a report to its respective Class Chair. After a meeting convened by the Class Chair, a moderated, consolidated single class list of candidates is recommended to Council, for election to the Academy.   \r\n     \n    \n An organization of eminent, individual scientists and scholars, its membership includes 73 Nobel laureates, 6 A. M. Turing Award winners, and 15 Fields Medal winners. It covers the full range of academic disciplines including humanities, social sciences, natural sciences, and science and technology. The Academy organizes meetings  and workshops, provides scientific and scholarly advice, and publishes the ‘European Review’.   \r\n     \n    \n    \n September 26, 2017 \n Cranfield Delegation Visits BUAA"}