{"url": "https://en.wikipedia.org/wiki/Courtship_disorder", "content": "Courtship disorder - Wikipedia \n Courtship disorder   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Courtship disorder  is a theoretical construct in  sexology  in which a certain set of  paraphilias  are seen as specific instances of anomalous  courtship  instincts in men. [1]  The specific paraphilias are  biastophilia  (paraphilic  rape ),  exhibitionism ,  frotteurism ,  telephone scatologia , and  voyeurism . According to the  courtship disorder hypothesis , there is a species-typical courtship process in human males consisting of four phases, and anomalies in different phases result in one of these paraphilic sexual interests. That is, instead of being independent paraphilias, this theory sees these sexual interests as individual symptoms of a single underlying disorder. [2] \n Contents \n 1   Courtship disorder hypothesis \n 2   Evidence and acceptance of the theory \n 3   See also \n 4   References \n Courtship disorder hypothesis [ edit ] \n According to the  courtship disorder hypothesis , there is a species-typical courtship process in humans consisting of four phases. [3] [4]  These phases are: \"(1) looking for and appraising potential sexual partners; (2) pretactile interaction with those partners, such as by smiling at and talking to them; (3) tactile interaction with them, such as by embracing or petting; (4) and then sexual intercourse.\" [5] \n The associations between these phases and these paraphilias were first outlined by  Kurt Freund , [6] [7]  the originator of the theory: A disturbance of the search phase of courtship manifests as  voyeurism , a disturbance of the pretactile interaction phase manifests as  exhibitionism  or  telephone scatologia , a disturbance of the tactile interaction phase manifests as toucheurism or  frotteurism , and the absence of the courtship behavior phases manifests as paraphilic  rape  (i.e.,  biastophilia ). According to Freund, these paraphilias \"can be conceptualized as a preference for a pattern of behavior or  erotic fantasy  in which one of these four phases of sexual interaction is intensified and distorted to such an extent that it appears to be a caricature of the normal, while the remaining phases are either omitted entirely or are retained only in a vestigial way.\" [8] \n Freund noted that  troilism  (a paraphilia for observing one’s sexual/romantic partner sexually interacting with a third party, usually unbeknownst to the third party) [9]  might also be a courtship disorder, [8] [10]  troilism being a variant of voyeurism. \n Appropriate behaviors depend on the social and cultural context, including time and place. Some behaviors that are unacceptable under most circumstances, such as  public nudity  or sexual contact between dancers, may be accepted or even encouraged during celebrations like  Carnival  or  Mardi Gras . Where such cultural festivals alter normative courtship behaviors, the signs of courtship disorder may be masked or altered. [11] \n Evidence and acceptance of the theory [ edit ] \n Paraphilias within the Courtship Disorder spectrum co-occur with each other more frequently than with paraphilias outside the courtship disorder spectrum. [12] [13] [14] [15]  The courtship disorder model offers an underlying common cause for these paraphilias in men to explain this co-occurrence. [6] [7] \n Courtship disorder is widely cited by  sexologists  and forensic scientists as one of the predominant models of the paraphilias. [16] [17] [18] [19] [20]  Murphy and Page wrote that \"The 'Courtship Disorder Theory' of Freund is one of the only theories specific to exhibitionism.\" [21]  According to Lavin (2008), \"Freund's theory, more than the others, makes it clear that the ordering of activities ... has clinical significance.\" [22] \n Another theoretically based taxonomy of the paraphilias was proposed by  John Money , who described the range of paraphilic interests as  love maps . [23] \n See also [ edit ] \n John Hinckley, Jr. \n References [ edit ] \n ^   Aggrawal, Anil (2009).  Forensic and Medico-legal Aspects of Sexual Crimes and Unusual Sexual Practices . Boca Raton:  CRC Press .  ISBN   1-4200-4308-0 .   \n ^   Freund, K., & Kolářský, A. (1965). \"Grundzüge eines einfachen bezugsystems für die analyse sexueller deviationen ['Basic features of a reference system for considering anomalous erotic preferences']\".  Psychiatrie, Neurologie, and Medizinische Psychologie .  17 : 221–225.   CS1 maint: Uses authors parameter ( link ) \n ^   Freund, K. (1976). \"Diagnosis and treatment of forensically significant anomalous erotic preferences.\"  Canadian Journal of Criminology and Corrections , 18, 181–189. \n ^   Freund, K., & Blanchard, R. (1986). \"The concept of courtship disorder.\"  Journal of Sex & Marital Therapy , 12, 79–92. \n ^   Cantor, J. M., Blanchard, R., & Barbaree, H. E. (2009). Sexual disorders. In P. H. Blaney & T. Millon (Eds.),  Oxford Textbook of Psychopathology  (2nd ed.) (pp. 527–548). New York: Oxford University Press. \n ^  a   b   Freund, K. (1988). \"Courtship disorder: Is the hypothesis valid?\"  Annals of the New York Academy of Sciences , 528, 172–182. \n ^  a   b   Freund, K., Scher, H., & Hucker, S. (1983). The courtship disorders.  Archives of Sexual Behavior , 12, 369–379. \n ^  a   b   Freund, K. (1990). \"Courtship disorder.\" In W. L. Marshall, D. R. Laws, & H. E. Barbaree (Eds.),  Handbook of Sexual Assault: Issues, Theories, and Treatment of the Offender  (pp. 195–207). NY: Plenum. \n ^   Hirschfeld, M. (1938).  Sexual Anomalies and Perversions: Physical and Psychological Development, Diagnosis and Treatment  (new and revised ed.). London: Encyclopaedic Press. \n ^   Freund, K., & Watson, R. (1990). \"Mapping the boundaries of courtship disorder.\"  The Journal of Sex Research , 27, 589–606. \n ^   Maharajh, H. D., & Konings, M. (2007).  Dancing frotteurism and courtship disorder in Trinidad and Tobago. [ permanent dead link ]   Journal of Chinese Clinical Medicine , 7(2). \n ^   Abel, G. G., & Osborn, C. (1992). \"The paraphilias: The extent and nature of sexually deviant and criminal behavior.\"  Psychiatric Clinics of North America , 15, 675–689. \n ^   Abel, G. G., Becker, J. V., Cunningham-Rathner, J., Mittelman, M., & Rouleau, J.-L. (1988). \"Multiple paraphilic diagnoses among sex offenders.\"  Bulletin of the American Academy of Psychiatry and the Law , 16, 153–168. \n ^   Templeman, T. L., & Stinnet, R. D. (1991). \"Patterns of sexual arousal and history in a \"normal' sample of young men.\"  Archives of Sexual Behavior , 20, 137–150. \n ^   Fedora, O., Reddon, J. R., Morrison, J. W., Fedora, S. K., Pascoe, H., Yeudall, L. T. (1992). Sadism and other paraphilias in normal controls and nonaggressive sex offenders.  Archives of Sexual Behavior , 21, 1–15. \n ^   Maea, M., & Coccaro, E. F. (1998).  Neurobiology and clinical views on aggression and impulsivity  (Clinical & neurobiological advances in psychiatry series). New York: Wiley. \n ^   McConaghy, N. (1993).  Sexual Behavior: Problems and Management . New York: Plenum. \n ^   Coleman, E., Dwyer, S. M., & Pallone, N. J. (Eds.) (1996).  Sex Offender Treatment: Biological Dysfunction, Intrapsychic Conflict, and Interpersonal Violence . \n ^   Krueger, R. B., Kaplan, M. (2001). \"The paraphilic and hypersexual disorders: An overview.\"  Journal of Psychiatric Practice , 7, 391–403. \n ^   Wiederman, M. W. (2003). Paraphilia and Fetishism.  The Family Journal , 11, 315–321. \n ^   Murphy, W. D., & Page, I J. (2008). \"Exhibitionism: Psychopathology and theory.\" In D. R. Laws and W. T. O'Donohue (Eds.),  Sexual deviance: Theory, assessment, and treatment  (2nd ed.). New York: Guilford \n ^   Lavin, M. (2008). \"Voyeurism: Psychopathology and theory.\" In D. R. Laws and W. T. O'Donohue (Eds.),  Sexual Deviance: Theory, Assessment, and Treatment  (2nd ed.). New York: Guilford. \n ^   Money, John (1986).  Love Maps: Clinical Concepts of Sexual/Erotic Health and Pathology, Paraphilia, and Gender Transposition in Childhood, Adolescence, and Maturity . New York: Prometheus Books. \n v \n t \n e \n Paraphilias \n List of paraphilias \n Abasiophilia \n Acarophilia \n Acrotomophilia \n Agalmatophilia \n Algolagnia \n Andromimetophilia/Gynemimetophilia/Transvestophilia \n Apotemnophilia \n Autassassinophilia \n Autoandrophilia/Autogynephilia \n Biastophilia \n Capnolagnia \n Chremastistophilia \n Chronophilia \n Coprophagia \n Coprophilia \n Crush fetish \n Dacryphilia \n Dendrophilia \n Dippoldism \n Emetophilia \n Eproctophilia \n Erotic asphyxiation \n Erotophonophilia \n Exhibitionism \n Formicophilia \n Frotteurism \n Gerontophilia \n Homeovestism \n Hybristophilia \n Infantophilia \n Katoptronophilia \n Kleptolagnia \n Klismaphilia \n Lactaphilia \n Macrophilia \n Masochism \n Mechanophilia \n Microphilia \n Narratophilia \n Nasophilia \n Necrophilia \n Object sexuality \n Odaxelagnia \n Olfactophilia \n Omorashi \n Paraphilic infantilism \n Partialism \n Pecattiphilia \n Pedophilia \n Plushophilia \n Pygophilia \n Pyrophilia \n Sadism \n Salirophilia/Mysophilia \n Scopophilia \n Sexual fetishism \n Somnophilia \n Sthenolagnia \n Symphorophilia \n Tamakeri \n Telephone scatologia \n Transvestic fetishism \n Trichophilia \n Troilism \n Urolagnia \n Urophagia \n Vorarephilia \n Voyeurism \n Zoophilia \n Zoosadism \n See also \n Courtship disorder \n Human sexual activity \n Sexology \n Sexual fetishism \n Book \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Courtship_disorder&oldid=795380866 \"\t\t\t\t\t \n Categories :  Human sexuality Interpersonal relationships Men and sexuality Paraphilias Psychology Sex Sexology Sexual and gender identity disorders Sexual attraction Sexual fetishism Sexual orientation Sexual roleplay Sexuality Sexuality and society Hidden categories:  CS1 maint: Uses authors parameter All articles with dead external links Articles with dead external links from August 2017 Articles with permanently dead external links   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Add links   \n  This page was last edited on 13 August 2017, at 21:41. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}