{"url": "http://articles.latimes.com/2010/dec/02/news/la-en-fantasy-actors-20101202", "content": "Critic's Notebook: Can 'Harry Potter' ever capture Oscar magic? - latimes \n Advertisement \n YOU ARE HERE:  LAT Home → Collections Critic's Notebook: Can 'Harry Potter' ever capture Oscar magic? The academy is notorious for thumbing its nose at the fantasy genre, but six films with no wins is an outrage. Maybe the penultimate 'Deathly Hallows' can cast its spell on voters. December 02, 2010 | By Mary McNamara, Los Angeles Times Television Critic \n Ralph Fiennes is frightening looking as Lord Voldemort.  (Associated Press ) There is something touching about the fact that \" Harry Potter and the Deathly Hallows — Part 1\" opened in mid-November. It's the unofficial beginning of Oscar season, after all. Whether Warner Bros. is thumbing its nose at the Academy of Motion Picture Arts and Sciences or is still holding out hope for getting voters' attention, it's hard to imagine that this year will be any different from the previous six because Oscar just does not like Harry.  Think about it. Six films and no Oscars. None. Moving staircases, talking pictures, heart-stopping Quidditch games, villains that scare even adults and no Oscars. There have been nominations — for art direction, score and costume — but no wins, which, frankly, is hard to fathom. How could none of these films have won for costume? Screenwriter Steve Kloves, an Oscar nominee for \"Wonder Boys,\" has adapted all but one of the books, a feat unprecedented in the annals of the Writers Guild, and he's never been nominated for them. Ditto any of the directors. Or actors.  That's right, none of the actors in six of the most popular films of all time has been nominated for an Oscar for their \"Potter\" roles. It's not surprising that the young leads — Daniel Radcliffe, Emma Watson, Rupert Grint — have been passed over; the academy prefers to nominate children in supporting roles and even then only in such scrappy emo-heavy indies as \"The Piano\" or \"Little Miss Sunshine.\"  But the supporting adult characters have consistently been played by some of the best actors around from Britain and Ireland. Richard Harris, Michael Gambon, Maggie Smith, Alan Rickman, Ralph Fiennes, Robbie Coltrane, Emma Thompson, Julie Walters, Brendan Gleeson, Kenneth Branagh, Imelda Staunton, Jim Broadbent and now Bill Nighy — the list borders on the absurd. All of these performers are, or have been, brilliant in roles that so easily could be over-played or phoned in or made ridiculous. Consider the trappings — Rickman has pitch-black hair and a cape; Ralph Fiennes looks like a snake; Coltrane is a hairy half-giant; Brendan Gleeson has a revolving fake eye. These are not easy things to work around. And yet, they do.  No doubt some academy members regret not nominating Harris for his final role before his death, but Gambon has been consistently passed over too. As Albus Dumbledore, the two actors wore a ZZ Top beard, sometimes with little charms hung in it, and funny hats, and yet in both cases created a fully believable headmaster who is not just the wisest and most humble of men, but also the kindest, projecting a sorrowful optimism up until the moment of his death.  Granted, none of the adults have a lot of screen time, but if Judi Dench can win supporting actress for uttering five lines and wearing an enormous side-bustle as Queen Elizabeth in \"Shakespeare in Love,\" then Gambon's death scene, Broadbent's combination of hubris and shame, or Rickman's pained fury deserve at least a nomination.  Unfortunately, while the academy loves a good high-brow costume drama, it has never been too fond of fantasy, especially in the acting category. \"Lord of the Rings: The Return of the King\" may have cleaned up in 2004, but none of its actors were even nominated. Imagine, a best picture and none of the actors nominated. Ian McKellen got a nod for the first installment, \"The Fellowship of the Ring,\" but after that, nothing. Three of these films and nothing for Viggo Mortensen, Orlando Bloom, Elijah Wood or Bernard Hill, who's King Theoden still brings tears to my eyes. \"Now for wrath, now for ruin and a red dawn\" — these are lines that require professional courage and an ability to transcend place and time in a way that most modern drama, no matter how good, simply doesn't have to do.  It's ironic, or infuriating, depending on what side of the screen you're on, because the key to great fantasy is characters who are both extraordinary and utterly human. It's one thing to play a serial killer or a corrupt company gal; it's another when that character also has to be believable as an evil wizard or officious witch. Putting real meaning into an actual curse is way tougher than uttering an expletive, and waving a deadly wand in all seriousness takes more guts — and more acting finesse — than firing a gun.  Perhaps the academy is waiting until the final \" Harry Potter,\" just as it waited for the third \"Lord of the Rings.\" Or maybe now with 10 best picture nominees there will be room not only for animated films but for fantasy as well. Either way, there must be some acknowledgment not just of the success of this film franchise but also of the brilliance and effort it has required of so many.   Accio , Oscar.   mary.mcnamara@latimes.com \n MORE: Seizure Led to FloJo's Death His 104 scores make his case Restaurant review: South Beverly Grill Brutal Murder by Teen-Age Girls Adds to Britons' Shock Comaneci Confirms Suicide Attempt, Magazine Says Advertisement \n FROM THE ARCHIVES Detective work in the Oscar makeup category January 23, 2012 The Gold Standard: Major races begin to gel November 10, 2011 Oscars not lacking for excitement November 10, 2011 Hollywood conjures up an extra 'Potter' March 13, 2008 Copyright 2017 Los Angeles Times Terms of Service | Privacy Policy | Index by Date | Index by Keyword"}