{"url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-without-color.html", "content": "Understanding Success Criterion 1.4.1  | Understanding WCAG 2.0\n    \t\t\t\t Understanding WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  Guideline  1.4 [Distinguishable] Next:  SC  1.4.2 [Audio Control] On this page: Intent Examples Related Resources Techniques & Failures   -   Use of Color : Understanding  SC  1.4.1 \n 1.4.1  Use of Color:  \n                Color is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element.\n\t\t\t\t\t(Level A)\n\t\t\t\t Note:  This success criterion addresses color perception specifically. Other forms of perception are covered in  Guideline 1.3  including programmatic access to color and other visual presentation coding. \n\t\t\t\tIntent of this Success Criterion\n\t\t\t The intent of this Success Criterion is to ensure that all users can access information that is conveyed by color differences, that is, by the use of color where each color has a meaning assigned to it. If the information is conveyed through color differences in an image (or other non-text format), the color may not be seen by users with color deficiencies. In this case, providing the information conveyed with color through another visual means ensures users who cannot see color can still perceive the information. Color is an important asset in design of Web content, enhancing its aesthetic appeal, its usability, and its accessibility. However, some users have difficulty perceiving color. People with partial sight often experience limited color vision, and many older users do not see color well. In addition, people using text-only, limited-color or monochrome displays and browsers will be unable to access information that is presented only in color. Examples of information conveyed by color differences: “required fields are red\", “error is shown in red\", and “Mary's sales are in red, Tom's are in blue\". Examples of indications of an action include: using color to indicate that a link will open in a new window or that a database entry has been updated successfully. An example of prompting a response would be: using highlighting on form fields to indicate that a required field had been left blank. Note:  This should not in any way discourage the use of color on a page, or even color coding if it is redundant with other visual indication. \n\t\t\t\tSpecific Benefits of Success Criterion 1.4.1:\n\t\t\t Users with partial sight often experience limited color vision. Some older users may not be able to see color well. Users who have color-blindness benefit when information conveyed by color is available in other visual ways. People using text-only, limited color, or monochrome displays may be unable to access color-dependent information. Users who have problems distinguishing between colors can look or listen for text cues. People using Braille displays or other tactile interfaces can detect text cues by touch. \n\t\t\t\tExamples of Success Criterion 1.4.1 \n A form that uses color and text to indicate required fields \n A form contains both required and optional fields. Instructions at the top of the form explain that required fields are labeled with red text and also with an icon whose text alternative says, \"Required.\" Both the red text and the icon are programmatically associated with the appropriate form fields so that assistive technology users can determine the required fields. \n  An examination. \n Students view an SVG image of a chemical compound and identify the chemical elements present based on the colors and numbers used in the diagram. The text alternatives associated with each element name the color of the element and indicate the element's position in the diagram. Students who cannot perceive color have the same information about the compound as their classmates. (This technique also satisfies  Guideline 1.1  Level A.) \n  Disabled Form elements. \n                Form elements which are disabled via markup or scripting, are greyed out and made inactive by the user agent. When in the disabled state these elements do not receive focus. Assistive technologies can programmatically determine the state of disabled elements and will provide this information to the user as the elements are encountered on the page. The change in color and loss of focus provides redundant, visual information about the state of the control.\n\t\t\t\tRelated Resources\n\t\t\t Resources are for information purposes only, no endorsement implied. \n Vischeck \n AWARE Color Laboratory \n Wikipedia: Color Blindness \n Microsoft: Can Color-Blind Users See Your Site? \n Causes of Color: How do people inherit colorblindness? How often?: Genetics \n How to make figures and presentations that are friendly to Colorblind people \n The Color Tutor application \n\t\t\t\tTechniques and Failures for Success Criterion 1.4.1 - Use of Color Each numbered item in this section represents a technique or combination of techniques that the  WCAG  Working Group deems sufficient for meeting this Success Criterion. However, it is not necessary to use these particular techniques. For information on using other techniques, see  Understanding Techniques for WCAG Success Criteria , particularly the \"Other Techniques\" section. \n\t\t\t\tSufficient Techniques  \n\t\t\t Instructions:  Select the situation below that matches your content. Each situation includes techniques or combinations of techniques that are known and documented to be sufficient for that situation. \n   Situation A: If the color of particular words, backgrounds, or other content is used to indicate information: \n G14: Ensuring that information conveyed by color differences is also available in text \n G205: Including a text cue for colored form control labels \n G182: Ensuring that additional visual cues are available when text color differences are used to convey information \n G183: Using a contrast ratio of 3:1 with surrounding text and providing additional visual cues on focus for links or controls where color alone is used to identify them \n   Situation B: If color is used within an image to convey information: \n G111: Using color and pattern \n G14: Ensuring that information conveyed by color differences is also available in text \n\t\t\t\t Additional Techniques (Advisory) for 1.4.1 Although not required for conformance, the following additional techniques should be considered in order to make content more accessible. Not all techniques can be used or would be effective in all situations. \n        Conveying information redundantly using color (future link)\n C15: Using CSS to change the presentation of a user interface component when it receives focus   (CSS)\n\t\t\t\t Common Failures for  SC  1.4.1 The following are common mistakes that are considered failures of Success Criterion 1.4.1 by the  WCAG  Working Group. \n F13: Failure of Success Criterion 1.1.1 and 1.4.1 due to having a text alternative that does not\n                    include information that is conveyed by color differences in the image \n F73: Failure of Success Criterion 1.4.1 due to creating links that are not visually evident without color vision \n F81: Failure of Success Criterion 1.4.1 due to identifying required or error fields using color differences only \n Top Contents Intro Previous:  Guideline  1.4 [Distinguishable] Next:  SC  1.4.2 [Audio Control] This Web page is part of  Understanding WCAG 2.0: A guide to understanding and implementing WCAG 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}