{"url": "https://it.wikipedia.org/wiki/Wikipedia:Contatti", "content": "Wikipedia:Contatti - Wikipedia \n Wikipedia:Contatti   \n Da Wikipedia, l'enciclopedia libera.   \n\t\t\t\t\tVai a:\t\t\t\t\t navigazione , \t\t\t\t\t ricerca \n Come contattare Wikipedia, l'enciclopedia libera \n Informazioni importanti: \n Wikipedia non ha un comitato di redazione né un responsabile editoriale.  Non esiste una redazione . \n Wikipedia è scritta e curata  esclusivamente da volontari  da tutto il mondo. \n Wikipedia è consultabile gratuitamente ed è priva di pubblicità, è un progetto sostenuto da una organizzazione  non-profit  statunitense: la  Wikimedia Foundation . \n Per ulteriori informazioni, vedi \" a proposito di Wikipedia \" e le  FAQ  (domande frequenti). \n Per la stampa \n Informazioni e contatti per la stampa .\n Per favore, scrivete solo per argomenti correlati a Wikipedia.  Non inviate comunicati o lettere di presentazione, che saranno ignorati. \n Per i lettori \n Consultare le sezioni specifiche per ogni richiesta: \n Segnalare un problema con una voce ,\n per esempio: errori, violazioni di copyright, imprecisioni. \n Caricare una fotografia \n di te stesso o di qualcuno che rappresenti per una voce relativa ad una biografia, o caricare un'immagine o un file. \n Fare una domanda \n per esempio: \"Come funziona Wikipedia?\" o \"Come posso riutilizzare i testi delle voci di Wikipedia?\". \n Contattare uno \n specifico utente di Wikipedia . \n Per contattare il \n rappresentante legale di Wikipedia \n presso la  Wikimedia Foundation . Per problemi riguardanti una voce ti invitiamo a  segnalare il problema alla comunità  per provare a risolverlo più velocemente ed efficacemente. \n Lasciare un parere sull'enciclopedia . \n Wikimedia Foundation \n Puoi anche contattare la  Wikimedia Foundation , fondazione che gestisce i server e tutta l'infrastruttura su cui è ospitata Wikipedia. \n Per i contributori \n Verificare o concedere la licenza d'uso \n per testi e/o immagini usate su Wikipedia e riprodotta da un'altra fonte. \n Se ricevi messaggi di avviso \n come \"la tua voce è stato proposta per la  cancellazione \", \"le tue modifiche sono considerate  vandalismi \" o \"il tuo account è stato  bloccato  in scrittura\". \n Risolvere un conflitto \n con altri utenti. \n Il mio account è stato \n bloccato ,\n come posso chiederne lo \n sblocco? . \n La mia pagina è stata cancellata . \n Fare domande su \n come modificare le pagine . \n Risolvere \n problemi di login  o  con l'e-mail . \n Cancellare  o  rinominare \n il tuo account. \n Segnalare un \n problema tecnico con il software . \n Dove posso \n chiedere aiuto \n su questioni tecniche relative a Wikipedia o al markup delle pagine? (Si veda anche  Aiuto:Markup ). \n Voglio sostenere e promuovere i progetti WMF, \n come fare? \n Voglio realizzare un progetto scolastico/accademico con Wikipedia, \n chi contatto ? \n Per webmaster di siti di terze parti \n Segnalare una \n violazione di copyright . \n Sapere come \n inserire collegamenti in Wikipedia \n ad altri siti ; \n Ottenere il permesso di \n copiare voci o immagini \n (si veda anche \" Come citare Wikipedia ). \n Autorizzare l'uso su Wikipedia \n di testi o immagini già pubblicati su altre fonti e coperti da copyright. \n Per utilizzare il marchio Wikipedia o per altre attività (anche commerciali) fuori dal sito \n in Italia e San Marino: contatta  Wikimedia Italia \n in Svizzera: contatta  Wikimedia Svizzera \n Domande frequenti \n Consulta le risposte alle \n\" Domande frequenti \" . \n Dove fare una domanda :\n ti sei perso nelle pagine di aiuto? Non trovi quello che cerchi? Niente panico, i wikipediani sono pronti ad aiutarti! \n Social network \n Pagine in italiano sui social network (per pagine non italiane, si può consultare  Meta ): \n Seguici su:  Identi.ca \n https://identi.ca/wikimediaitalia \n Twitter \n http://twitter.com/WikimediaItalia   account ufficiale dell'associazione Wikimedia Italia \n Facebook \n Wikimedia Italia, pagina  -  gruppo \n http://www.facebook.com/groups/wikipedia.in.italiano/   gruppo non ufficiale \n\t\t\t\t\t\tEstratto da \" https://it.wikipedia.org/w/index.php?title=Wikipedia:Contatti&oldid=91061018 \"\t\t\t\t\t \n Categorie :  Pubbliche relazioni Wikipedia Categoria nascosta:  Pagine di servizio protette   \n Menu di navigazione \n Strumenti personali \n Accesso non effettuato discussioni contributi registrati entra   \n Namespace \n Pagina di servizio Discussione   \n Varianti \n Visite \n Leggi Visualizza wikitesto Cronologia   \n Altro \n Ricerca \n Navigazione \n Pagina principale Ultime modifiche Una voce a caso Vetrina Aiuto Sportello informazioni   \n Comunità \n Portale Comunità Bar Il Wikipediano Fai una donazione Contatti   \n Strumenti \n Puntano qui Modifiche correlate Pagine speciali Link permanente Informazioni pagina Elemento Wikidata   \n Stampa/esporta \n Crea un libro Scarica come PDF Versione stampabile   \n In altri progetti \n Wikimedia Commons Meta-Wiki Wikibooks Wikiquote Wikisource Wikiversità Wikivoyage Wikizionario   \n In altre lingue \n Alemannisch العربية تۆرکجه Български भोजपुरी Bahasa Banjar বাংলা Català کوردی Čeština Cymraeg Dansk Deutsch Ελληνικά English Esperanto Español Eesti فارسی Suomi Français עברית हिन्दी Hrvatski Magyar Bahasa Indonesia 日本語 Basa Jawa 한국어 Lëtzebuergesch Latviešu Basa Banyumasan Bahasa Melayu Malti Plattdüütsch Nederlands Norsk nynorsk Norsk Occitan ଓଡ଼ିଆ Polski پښتو Português Română Русский Русиньскый Scots سنڌي Davvisámegiella Simple English Slovenčina Slovenščina Shqip Српски / srpski Svenska Тоҷикӣ ไทย Tagalog Türkçe Татарча/tatarça Українська اردو Oʻzbekcha/ўзбекча Vèneto Tiếng Việt ייִדיש 中文 粵語   \n Modifica collegamenti   \n  Questa pagina è stata modificata per l'ultima volta il 7 set 2017 alle 10:34. \n Il testo è disponibile secondo la  licenza Creative Commons Attribuzione-Condividi allo stesso modo ; possono applicarsi condizioni ulteriori. Vedi le  condizioni d'uso  per i dettagli. \n Informativa sulla privacy \n Informazioni su Wikipedia \n Avvertenze \n Sviluppatori \n Dichiarazione sui cookie \n Versione mobile"}