{"url": "https://en.wikipedia.org/wiki/Cyberattack", "content": "Cyberattack - Wikipedia \n Cyberattack   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n It has been suggested that  Cyberheist  be  merged  into this article. ( Discuss )  Proposed since November 2015. \n It has been suggested that  Attack (computing)  be  merged  into this article. ( Discuss )  Proposed since December 2016. \n This article  is written like a personal reflection or opinion essay  that states a Wikipedia editor's personal feelings about a topic.  Please  help improve it  by rewriting it in an  encyclopedic style .   (May 2013)   ( Learn how and when to remove this template message ) \n A  cyberattack  is any type of offensive manoeuvre employed by nation-states, individuals, groups, or organizations that targets computer information systems, infrastructures, computer networks, and/or personal computer devices by various means of malicious acts usually originating from an anonymous source that either steals, alters, or destroys a specified target by  hacking  into a susceptible system. [1]  These can be labelled as either a  cyber campaign ,  cyberwarfare  or  cyberterrorism  in different context. Cyberattacks can range from installing  spyware  on a PC to attempts to destroy the infrastructure of entire nations. Cyberattacks have become increasingly sophisticated and dangerous as the  Stuxnet  worm recently demonstrated. [2]   User behavior analytics  and  SIEM  are used to prevent these attacks. Legal experts are seeking to limit use of the term to incidents causing physical damage, distinguishing it from the more routine  data breaches  and broader  hacking  activities. [3] \n Contents \n 1   Cyberwarfare and cyberterrorism \n 2   Factors \n 2.1   Fear factor \n 2.2   Spectacular factor \n 2.3   Vulnerability factor \n 3   Professional hackers to cyberterrorists \n 4   Syntactic attacks \n 4.1   Viruses \n 4.2   Worms \n 4.3   Trojan horses \n 5   Semantic attacks \n 5.1   Israel and the Palestinian Authority \n 5.2   India and Pakistan \n 6   China, United States and others \n 6.1   China \n 6.2   United States \n 6.3   Ukraine \n 6.4   North Korea \n 7   Infrastructures as targets \n 7.1   Control systems \n 7.2   Energy \n 7.3   Finance \n 7.4   Telecommunications \n 7.5   Transportation \n 7.6   Water \n 8   See also \n 9   References \n 10   Further reading \n 11   External links \n Cyberwarfare and cyberterrorism [ edit ] \n Main articles:  Cyberwarfare  and  Cyberterrorism \n Cyberwarfare utilizes techniques of defending and attacking information and computer networks that inhabit cyberspace, often through a prolonged  cyber campaign  or series of related campaigns. It denies an opponent's ability to do the same, while employing technological instruments of war to attack an opponent's critical computer systems. Cyberterrorism, on the other hand, is \"the use of computer network tools to shut down critical national infrastructures (such as energy, transportation, government operations) or to coerce or intimidate a government or civilian population\". [4]  That means the end result of both cyberwarfare and cyberterrorism is the same, to damage critical infrastructures and computer systems linked together within the confines of cyberspace. \n Factors [ edit ] \n This section  needs additional citations for  verification .  Please help  improve this article  by  adding citations to reliable sources . Unsourced material may be challenged and removed.   (July 2014)   ( Learn how and when to remove this template message ) \n Three factors contribute to why cyber-attacks are launched against a state or an individual: the fear factor, spectacular factor, and vulnerability factor. \n Fear factor [ edit ] \n The most common, fear factor, a cyberterrorist will create fear amongst individuals, groups, or societies. The bombing of a Bali nightclub in 2002 created fear amongst the foreign tourists who frequently visited the venue. Once the bomb went off and casualties ensued, the influx of tourists to Bali significantly reduced due to fear of death.  Korstanje Maximiliano  argues that cyber-terrorism is not very different than  terrorism . Basically, cyber-attacks are aimed at instilling fear in order to impose demands or claims of any type. In view of that, this expert says that in those societies oriented to rationalization and plannification, the probabilities terrorism surfaces are higher than traditional past-oriented communities. What disturbs the social order is that citizens do not know when the next blow will take place, nor where. [5] [6] \n Spectacular factor [ edit ] \n With spectacular factors, it is the actual damage of the attack, meaning the attacks created direct losses and gained negative publicity. In 1999 a denial of service attack rendered Amazon.com unusable. Amazon experienced cyberutas losses because of suspended trading and it was publicized worldwide. \n Vulnerability factor [ edit ] \n Vulnerability factor exploits how vulnerable an organization or government establishment is to cyber-attacks. An organization can be vulnerable to a denial of service attack, and a government establishment can be defaced on a web page. A computer network attack disrupts the integrity or authenticity of data, usually through malicious code that alters program logic that controls data, leading to errors in output. [7] \n Professional hackers to cyberterrorists [ edit ] \n This section  possibly contains  original research .  Please  improve it  by  verifying  the claims made and adding  inline citations . Statements consisting only of original research should be removed.   (March 2015)   ( Learn how and when to remove this template message ) \n Professional hackers, either working on their own or employed by the government or military service, can find computer systems with vulnerabilities lacking the appropriate security software. Once found, they can infect systems with malicious code and then remotely control the system or computer by sending commands to view content or to disrupt other computers. There needs to be a pre-existing system flaw within the computer such as no antivirus protection or faulty system configuration for the viral code to work. Many professional hackers will promote themselves to cyberterrorists where a new set of rules govern their actions. Cyberterrorists have premeditated plans and their attacks are not born of rage. They need to develop their plans step-by-step and acquire the appropriate software to carry out an attack. They usually have political agendas, targeting political structures. Cyber terrorists are hackers with a political motivation, their attacks can impact political structure through this corruption and destruction. [8]  They also target civilians, civilian interests and civilian installations. As previously stated cyberterrorists attack persons or property and cause enough harm to generate fear. \n Syntactic attacks [ edit ] \nIntrusion  kill chain  for information security [9] \n In detail, there are a number of techniques to utilize in cyber-attacks and a variety of ways to administer them to individuals or establishments on a broader scale. Attacks are broken down into two categories: syntactic attacks and semantic attacks.  Syntactic attacks  are straightforward; it is considered malicious software which includes viruses, worms, and Trojan horses. \n Viruses [ edit ] \n A virus is a self-replicating program that can attach itself to another program or file in order to reproduce. The virus can hide in unlikely locations in the memory of a computer system and attach itself to whatever file it sees fit to execute its code. It can also change its digital footprint each time it replicates making it harder to track down in the computer. \n Worms [ edit ] \n A worm does not need another file or program to copy itself; it is a self-sustaining running program. Worms replicate over a network using protocols. The latest incarnation of worms make use of known vulnerabilities in systems to penetrate, execute their code, and replicate to other systems such as the Code Red II worm that infected more than 259 000 systems in less than 14 hours. [10]  On a much larger scale, worms can be designed for industrial espionage to monitor and collect server and traffic activities then transmit it back to its creator. \n Trojan horses [ edit ] \n A Trojan horse is designed to perform legitimate tasks but it also performs unknown and unwanted activity. It can be the basis of many viruses and worms installing onto the computer as keyboard loggers and backdoor software. In a commercial sense, Trojans can be imbedded in trial versions of software and can gather additional intelligence about the target without the person even knowing it happening. All three of these are likely to attack an individual and establishment through emails, web browsers, chat clients, remote software, and updates. \n Semantic attacks [ edit ] \n Semantic attack  is the modification and dissemination of correct and incorrect information. Information modified could have been done without the use of computers even though new opportunities can be found by using them. To set someone into the wrong direction or to cover your tracks, the dissemination of incorrect information can be utilized. \n Israel and the Palestinian Authority [ edit ] \n In the conflict between Israel and the Palestinian Authority cyber attacks were conducted in October 2000 when Israeli hackers launched DOS attacks on computers owned by Palestinian resistance organizations (Hamas) and Lebanese resistance organizations (Hezbullah). Anti-Israel hackers responded by crashing several Israeli web sites by flooding them with bogus traffic. [8] \n India and Pakistan [ edit ] \n Main article:  India–Pakistan relations \n There were two such instances between India and Pakistan that involved cyberspace conflicts, started in 1990s. Earlier cyber attacks came to known as early as in 1999. [8]  Since then, India and Pakistan were engaged in a long-term dispute over Kashmir which moved into  cyberspace . Historical accounts indicated that each country's hackers have been repeatedly involved in attacking each other's computing database system. The number of attacks has grown yearly: 45 in 1999, 133 in 2000, 275 by the end of August 2001. [8]  In 2010, Indian hackers laid a cyber attack at least 36 government database websites going by the name \"Indian Cyber Army\". [11]  In 2013, Indian hackers hacked the official website of  Election Commission  of Pakistan in an attempt to retrieve sensitive database information. [12]  In retaliation, Pakistani hackers, calling themselves \"True Cyber Army\" hacked and defaced ~1,059 websites of Indian election bodies. [12] \n According to the media, Pakistan's has been working on effective  cyber security  system, in a program called the \"Cyber Secure Pakistan\" (CSP). [13]  The program was launched in April 2013 by Pakistan Information Security Association and the program as expanded to country's universities. \n China, United States and others [ edit ] \n Within cyberwarfare, the individual must recognize the state actors involved in committing these cyber-attacks against one another. The two predominant players that will be discussed is the age-old  comparison of East versus West , China's cyber capabilities compared to United States' capabilities. There are many other state and non-state actors involved in cyberwarfare, such as Russia, Iran, Iraq, and Al Qaeda; since China and the U.S. are leading the foreground in cyberwarfare capabilities, they will be the only two state actors discussed. \n But in Q2 2013,  Akamai Technologies  reported that Indonesia toppled China with portion 38 percent of cyber attack, a high increase from 21 percent portion in previous quarter. China set 33 percent and US set at 6.9 percent. 79 percent of attack came from Asia Pacific region. Indonesia dominated the attacking to ports 80 and 443 by about 90 percent. [14] \n China [ edit ] \n Main article:  Cyberwarfare in China \n This section, except for one footnote,  needs additional citations for  verification .  Please help  improve this article  by  adding citations to reliable sources . Unsourced material may be challenged and removed.   (July 2013)   ( Learn how and when to remove this template message ) \n China's  People's Liberation Army  (PLA) has developed a strategy called \"Integrated Network Electronic Warfare\" which guides computer network operations and  cyberwarfare  tools. This strategy helps link together network warfare tools and electronic warfare weapons against an opponent's information systems during conflict. They believe the fundamentals for achieving success is about seizing control of an opponent's information flow and establishing information dominance.  The Science of Military  and  The Science of Campaigns  both identify enemy logistics systems networks as the highest priority for cyber-attacks and states that cyberwarfare must mark the start if a campaign, used properly, can enable overall operational success. [15]  Focusing on attacking the opponent's infrastructure to disrupt transmissions and processes of information that dictate decision-making operations, the PLA would secure cyber dominance over their adversary. The predominant techniques that would be utilized during a conflict to gain the upper hand are as follows, the PLA would strike with electronic jammers, electronic deception and suppression techniques to interrupt the transfer processes of information. They would launch virus attacks or hacking techniques to sabotage information processes, all in the hopes of destroying enemy information platforms and facilities. The PLA's  Science of Campaigns  noted that one role for cyberwarfare is to create windows of opportunity for other forces to operate without detection or with a lowered risk of counterattack by exploiting the enemy's periods of \"blindness,\" \"deafness\" or \"paralysis\" created by cyber-attacks. [15]  That is one of the main focal points of cyberwarefare, to be able to weaken your enemy to the full extent possible so that your physical offensive will have a higher percentage of success. \n The PLA conduct regular training exercises in a variety of environments emphasizing the use of cyberwarfare tactics and techniques in countering such tactics if it is employed against them. Faculty research has been focusing on designs for rootkit usage and detection for their Kylin Operating System which helps to further train these individuals' cyberwarfare techniques. China perceives cyberwarfare as a deterrent to nuclear weapons, possessing the ability for greater precision, leaving fewer casualties, and allowing for long ranged attacks. \n United States [ edit ] \n In the West, the United States provides a different \"tone of voice\" when cyberwarfare is on the tip of everyone's tongue. The United States provides security plans strictly in the response to cyberwarfare, basically going on the defensive when they are being attacked by devious cyber methods. In the U.S., the responsibility of cybersecurity is divided between the Department of Homeland Security, the Federal Bureau of Investigation, and the Department of Defense. In recent years, a new department was created to specifically tend to cyber threats, this department is known as Cyber Command. Cyber Command is a military subcommand under US Strategic Command and is responsible for dealing with threats to the military cyber infrastructure. Cyber Command's service elements include Army Forces Cyber Command, the Twenty-fourth Air Force, Fleet Cyber Command and Marine Forces Cyber Command. [16]  It ensures that the President can navigate and control information systems and that he also has military options available when defense of the nation needs to be enacted in cyberspace. Individuals at Cyber Command must pay attention to state and non-state actors who are developing cyberwarfare capabilities in conducting cyber espionage and other cyber-attacks against the nation and its allies. Cyber Command seeks to be a deterrence factor to dissuade potential adversaries from attacking the U.S., while being a multi-faceted department in conducting cyber operations of its own. \n Three prominent events took place which may have been catalysts in the creation of the idea of Cyber Command. There was a failure of critical infrastructure reported by the CIA where malicious activities against information technology systems disrupted electrical power capabilities overseas. This resulted in multi-city power outages across multiple regions. The second event was the exploitation of global financial services. In November 2008, an international bank had a compromised payment processor that allowed fraudulent transactions to be made at more than 130 automated teller machines in 49 cities within a 30-minute period. [17]  The last event was the systemic loss of U.S. economic value when an industry in 2008 estimated $1 trillion in losses of intellectual property to data theft. Even though all these events were internal catastrophes, they were very real in nature, meaning nothing can stop state or non-state actors to do the same thing on an even grander scale. Other initiatives like the Cyber Training Advisory Council were created to improve the quality, efficiency, and sufficiency of training for computer network defense, attack, and exploitation of enemy cyber operations. \n On both ends of the spectrum, East and West nations show a \"sword and shield\" contrast in ideals. The Chinese have a more offensive minded idea for cyberwarfare, trying to get the pre-emptive strike in the early stages of conflict to gain the upper-hand. In the U.S. there are more reactionary measures being taken at creating systems with impenetrable barriers to protect the nation and its civilians from cyber-attacks. \n According to  Homeland Preparedness News , many mid-sized U.S. companies have a difficult time defending their systems against cyber attacks. Around 80 percent of assets vulnerable to a cyber attack are owned by private companies and organizations. Former New York State Deputy Secretary for Public Safety Michael Balboni said that private entities \"do not have the type of capability, bandwidth, interest or experience to develop a proactive cyber analysis.\" [18] \n In response to cyber-attacks on April 1, 2015, President Obama issued an Executive Order establishing the first-ever economic sanctions. The Executive Order will impact individuals and entities (\"designees\") responsible for cyber-attacks that threaten the national security, foreign policy, economic health, or financial stability of the US. Specifically, the Executive Order authorizes the Treasury Department to freeze designees' assets. [19] \n Ukraine [ edit ] \n Main article:  2017 cyberattacks on Ukraine \n A series of powerful cyber attacks began 27 June 2017 that swamped websites of Ukrainian organizations, including banks, ministries, newspapers and electricity firms. \n North Korea [ edit ] \n Further information:  Sony Pictures hack \n Infrastructures as targets [ edit ] \n Once a cyber-attack has been initiated, there are certain targets that need to be attacked to cripple the opponent. Certain infrastructures as targets have been highlighted as critical infrastructures in time of conflict that can severely cripple a nation. Control systems, energy resources, finance, telecommunications, transportation, and water facilities are seen as critical infrastructure targets during conflict. A new report on the industrial cybersecurity problems, produced by the British Columbia Institute of Technology, and the PA Consulting Group, using data from as far back as 1981, reportedly [ weasel words ]  has found a 10-fold increase in the number of successful cyber-attacks on infrastructure Supervisory Control and Data Acquisition (SCADA) systems since 2000. [7]  Cyberattacks that have an adverse physical effect are known as cyber-physical attacks. [20] \n Control systems [ edit ] \n Control systems are responsible for activating and monitoring industrial or mechanical controls. Many devices are integrated with computer platforms to control valves and gates to certain physical infrastructures. Control systems are usually designed as remote telemetry devices that link to other physical devices through internet access or modems. Little security can be offered when dealing with these devices, enabling many hackers or cyberterrorists to seek out systematic vulnerabilities. Paul Blomgren, manager of sales engineering at cybersecurity firm explained how his people drove to a remote substation, saw a wireless network antenna and immediately plugged in their wireless LAN cards. They took out their laptops and connected to the system because it wasn't using passwords. \"Within 10 minutes, they had mapped every piece of equipment in the facility,\" Blomgren said. \"Within 15 minutes, they mapped every piece of equipment in the operational control network. Within 20 minutes, they were talking to the business network and had pulled off several business reports. They never even left the vehicle.\" [21] \n Energy [ edit ] \n Energy is seen as the second infrastructure that could be attacked. It is broken down into two categories, electricity and natural gas.  Electricity  also known as electric grids power cities, regions, and households; it powers machines and other mechanisms used in day-to-day life. Using U.S. as an example, in a conflict cyberterrorists can access data through the Daily Report of System Status that shows power flows throughout the system and can pinpoint the busiest sections of the grid. By shutting those grids down, they can cause mass hysteria, backlog, and confusion; also being able to locate critical areas of operation to further attacks in a more direct method. Cyberterrorists can access instructions on how to connect to the Bonneville Power Administration which helps direct them on how to not fault the system in the process. This is a major advantage that can be utilized when cyber-attacks are being made because foreign attackers with no prior knowledge of the system can attack with the highest accuracy without drawbacks. Cyberattacks on  natural gas  installations go much the same way as it would with attacks on electrical grids. Cyberterrorists can shutdown these installations stopping the flow or they can even reroute gas flows to another section that can be occupied by one of their allies. There was a case in Russia with a gas supplier known as Gazprom, they lost control of their central switchboard which routes gas flow, after an inside operator and Trojan horse program bypassed security. [21] \n Finance [ edit ] \n Financial infrastructures could be hit hard by cyber-attacks as the financial system is linked by computer systems.  [22]  is constant money being exchanged in these institutions and if cyberterrorists were to attack and if transactions were rerouted and large amounts of money stolen, financial industries would collapse and civilians would be without jobs and security. Operations would stall from region to region causing nationwide economical degradation. In the U.S. alone, the average daily volume of transactions hit $3 trillion and 99% of it is non-cash flow. [21]  To be able to disrupt that amount of money for one day or for a period of days can cause lasting damage making investors pull out of funding and erode public confidence. \n Telecommunications [ edit ] \n Cyberattacking telecommunication infrastructures have straightforward results. Telecommunication integration is becoming common practice, systems such as voice and IP networks are merging. Everything is being run through the internet because the speeds and storage capabilities are endless. Denial-of-service attacks can be administered as previously mentioned, but more complex attacks can be made on BGP routing protocols or DNS infrastructures. It is less likely that an attack would target or compromise the traditional telephony network of SS7 switches, or an attempted attack on physical devices such as microwave stations or satellite facilities. The ability would still be there to shut down those physical facilities to disrupt telephony networks. The whole idea on these cyber-attacks is to cut people off from one another, to disrupt communication, and by doing so, to impede critical information being sent and received. In cyberwarfare, this is a critical way of gaining the upper-hand in a conflict. By controlling the flow of information and communication, a nation can plan more accurate strikes and enact better counter-attack measures on their enemies. \n Transportation [ edit ] \n Transportation infrastructure mirrors telecommunication facilities; by impeding transportation for individuals in a city or region, the economy will slightly degrade over time. Successful cyber-attacks can impact scheduling and accessibility, creating a disruption in the economic chain. Carrying methods will be impacted, making it hard for cargo to be sent from one place to another. In January 2003 during the \"slammer\" virus, Continental Airlines was forced to shut down flights due to computer problems. [21]  Cyberterrorists can target railroads by disrupting switches, target flight software to impede airplanes, and target road usage to impede more conventional transportation methods. In May 2015, a man, Chris Roberts, who was a cyberconsultant, revealed to the FBI that he had repeatedly, from 2011 to 2014, managed to hack into Boeing and Airbus flights' controls via the onboard entertainment system, allegedly, and had at least once ordered a flight to climb. The FBI, after detaining him in April 2015 in Syracuse, had interviewed him about the allegations. [23] \n Water [ edit ] \n Water as an infrastructure could be one of the most critical infrastructures to be attacked. It is seen as one of the greatest security hazards among all of the computer-controlled systems. There is the potential to have massive amounts of water unleashed into an area which could be unprotected causing loss of life and property damage. It is not even water supplies that could be attacked; sewer systems can be compromised too. There was no calculation given to the cost of damages, but the estimated cost to replace critical water systems could be in the hundreds of billions of dollars. [21]  Most of these water infrastructures are well developed making it hard for cyber-attacks to cause any significant damage, at most, equipment failure can occur causing power outlets to be disrupted for a short time. \n See also [ edit ] \n List of cyber-attacks \n References [ edit ] \n ^   Financial Weapons of War, 100 Minnesota Law Review 1377 (2016) \n ^   S. Karnouskos:  Stuxnet Worm Impact on Industrial Cyber-Physical System Security .  In: 37th Annual Conference of the IEEE Industrial Electronics Society (IECON 2011), Melbourne, Australia , 7-10 Nov 2011. Retrieved 20 Apr 2014. \n ^   SATTER, RAPHAEL (28 March 2017).  \"What makes a cyberattack? Experts lobby to restrict the term\" . Retrieved  7 July  2017 .   \n ^   Lewis, James. United States. Center for Strategic and International Studies. Assessing the Risks of Cyber Terrorism, Cyber War and Other Cyber Threats. Washington, D.C.: , 2002. Web. \n ^   Korstanje M E (2014) Why risk Research is more prominent in English speaking countries in the digital societies. International Journal of Cyber Warfare and Terrorism. . Volume 4, Issue 1. April 2014 \n ^   Korstanje M (2017) English Speaking Countries and the culture of Fear: understanding technology and terrorism”. Threat Mitigation and Detection of Cyber Warfare and Terrorism. Chapter 5 (pp. 93-111) IGI Global, Hershey, Pennsylvania, US,  ISBN   978-1522519386 \n ^  a   b   Linden, Edward. Focus on Terrorism. New York: Nova Science Publishers, Inc., 2007. Web. \n ^  a   b   c   d   Prichard, Janet, and Laurie MacDonald. \"Cyber Terrorism: A Study of the Extent of Coverage in Computer Security Textbooks.\" Journal of Information Technology Education. 3. (2004): n. page. Web. \n ^   U.S. Senate-Committee on Commerce, Science, and Transportation-A \"Kill Chain\" Analysis of the 2013 Target Data Breach-March 26, 2014 \n ^   Janczewski, Lech, and Andrew Colarik. Cyber Warfare and Cyber Terrorism. Hershey, New York: Information Science Reference, 2008. Web. \n ^   Staff (November 30, 2010).  \"Cyber Indian Army\" .  Express Tirbune . Retrieved  8 June  2013 .   \n ^  a   b   Waseem Abbasi (April 6, 2013).  \"Pakistani hackers defaced over 1,000 Indian websites\" .  The News International 2013 . Retrieved  8 June  2013 .   \n ^   Staff (April 22, 2013).  \"Cyber Secure Pakistan' initiative launched\" .  The News International, April 2013 . Retrieved  10 June  2013 .   \n ^   \"Indonesia Tops China as Cyber Attack Capital\" .  PC Magazine . October 16, 2013.   \n ^  a   b   Krekel, Bryan. People's Republic of China. The US-China Economic and Security Review Commission.Capability of the People's Republic of China to Conduct Cyber Warfare and Computer Network Exploitation . Virginia: Northrop Grumman, 2009. Web. \n ^   Lewis, James, and Katrina Timlin. United States. Center for Strategic and International Studies. Cybersecurity and Cyberwarfare: Preliminary Assessment of National Doctrine and Organization. Washington, D.C.: , 2011. Web. \n ^   United States. Review Team of Government Cybersecurity Experts. Cyberspace Policy Review: Assuring a Trusted and Resilient Information and Communications Infrastructure. Washington, D.C.: , Web. \n ^   Rozens, Tracy (2016-05-19).  \"Expert: More work needed to get private sector cyber secure\" .  Homeland Preparedness News . Retrieved  2016-07-19 .   \n ^   \"Sanctions: U.S. action on cyber crime\"   (PDF) . PwC Financial Services Regulatory Practice, April, 2015.   \n ^   Loukas, George (June 2015).  Cyber-Physical Attacks A growing invisible threat . Oxford, UK: Butterworh-Heinemann (Elsevier). p. 65.  ISBN   9780128012901 .   \n ^  a   b   c   d   e   Lyons, Marty. United States. Homeland Security. Threat Assessment of Cyber Warfare. Washington, D.C.: , 2005. Web. \n ^   Financial Weapons of War, 100 Minnesota Law Review 1377 (2016) \n ^   Evan Perez (May 18, 2015).  \"FBI: Hacker claimed to have taken over flight's engine controls\" .  CNN .   \n Further reading [ edit ] \n Alexander, Keith. United States. Senate Committee on Armed Service . United States Cyber Command. 2012. Web. \n Korstanje Maximiliano. 2017. Threat Mitigation and Detection of Cyber-Warfare and Terrorism Activities. Hershey, PE: IGI Global. \n External links [ edit ] \n July 2015 Cyber Attacks Statistics  – Hackmageddon \n Norse Attack Map \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Cyberattack&oldid=809495409 \"\t\t\t\t\t \n Categories :  Cyberattacks Hidden categories:  Articles to be merged from November 2015 All articles to be merged Articles to be merged from December 2016 Wikipedia articles needing style editing from May 2013 All articles needing style editing Articles needing additional references from July 2014 All articles needing additional references Articles that may contain original research from March 2015 All articles that may contain original research Articles needing additional references from July 2013 All articles with specifically marked weasel-worded phrases Articles with specifically marked weasel-worded phrases from May 2013   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Čeština Deutsch Eesti Français Bahasa Indonesia Italiano Latina Lietuvių မြန်မာဘာသာ Norsk Русский Українська Tiếng Việt 中文   \n Edit links   \n  This page was last edited on 9 November 2017, at 14:03. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}