{"url": "https://transit.land/", "content": "Transitland \n      MENU\n home \n feed registry \n playground \n Documentation \n news & updates \n A COMMUNITY-EDITED DATA SERVICE \n AGGREGATING \n  TRANSIT NETWORKS  \n ACROSS METROPOLITAN  \n AND RURAL  \n AREAS AROUND THE WORLD. \n Hello from the San Francisco Bay Area \n  Where half of the ground is heading northbound and the other is inching southward. (Remember from elementary school? That's what causes earthquakes.) \n Also epically disjoint is our mass transit: over 30 public agencies, an ever-increasing number of private shuttles, not to mention jitneys and carpools welcoming those in the know. \n Our goal at Transitland is to make sense of the jumble here in the SF Bay Area. We're mapping those buses, trains, streetcars, ferries, and even cable cars. \n Connecting the (Data) Dots \n We're aggregating existing geographic and temporal data from authoritative sources; we're connecting the dots using common identifiers; and we're equipping ourselves, our collaborators, and perhaps also you to edit and improve this \"community datastore\" with knowledge from boots on the ground. \n It's with these station locations, agency identifiers, and route schedules that we can join together the \"tectonic plates\" of mass transit. Transitland is for you to build your apps (the next big thing?), your sat. nav. gadgets, your flashy visualizations, and even your plans and analyses (that, with luck, Congress will fund some day). \n HOW IT WORKS \n        The Bay Area is our laboratory. The world is our goal. Seriously, transit-network data is useful in many places big, small, rich, poor. So, we're trying to create a modular, open-source data service that can work all over.\n  Learn More \n PLAYGROUND \n        Take a look at our playground. The API playground is the tip of the iceberg, demonstrating all the pieces of the data architecture working together.\n  Give it a try! \n PARTICIPATE \n Transitland is in its early stages. We welcome transit enthusiasts, community builders, public servants, and collaborative companies to help shape its future. \n  Learn More \n  technology  \n Feed Registry \n Datastore \n Playground   \n Onestop ID scheme   \n  legal  \n  An Open Project \n API Developer Agreement \n Data Contributor Agreement \n  resources  \n News & Updates  \n Documentation   \n  participate  \n   How to Participate \n     GitHub \n     Twitter   \n     Email \n      Transitland is sponsored by  Mapzen ."}