{"url": "http://www.osc.gov.on.ca/en/NewsEvents_nr_20170706_designated_rating_organizations.htm", "content": "CSA News Release: Canadian securities regulators seek comments relating to designated rating organizations \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   News & Events   /   News Releases   /   2017   /   CSA News Release: Canadian securities regulators seek comments relating to designated rating organizations \n            News & Events\n Hide Section Menu   × \n News Releases \n OSC News Releases \n Organizational News Releases \n Regulatory News Releases \n Enforcement News Releases \n OSC Investor Alerts \n CSA News Releases \n Speeches & Events \n Media Room \n Social Media \n OSC in the Community \n Reports and Publications \n OSC Annual Report \n Statement of Priorities \n OSC Investor News \n OSC Dialogue 2017 \n   Section Menu \n For Immediate Release \nJuly 6, 2017 \n Canadian securities regulators seek comments relating to designated rating organizations \n Toronto  – The Canadian Securities  Administrators (CSA) today  published  for comment proposed rule amendments and policy  changes related to designated rating organizations (DROs) and credit ratings of  DROs. \n CSA staff are  proposing to amend  National Instrument 25-101  Designated Rating Organizations  (NI 25-101)  to reflect new European  Union (EU) requirements for credit rating organizations, to ensure the EU  continues to recognize the Canadian regime as “equivalent” for regulatory  purposes after these new requirements go into effect on June 1, 2018. The  proposed amendments would allow credit ratings of a Canadian office of a DRO to  continue to be used for regulatory purposes in the EU. \n To ensure that NI  25-101 continues to reflect the International Organization of Securities  Commissions (IOSCO)  Code of Conduct  Fundamentals for Credit Rating Agencies  (the Code), the proposed amendments  also reflect new provisions in the March 2015 version of the Code.  \n “The IOSCO Code  offers a robust framework to protect the integrity of the credit rating  process, ensure investors and issuers are treated fairly, and safeguard  confidential information that rated issuers provide to credit rating  organizations,” said Louis Morisset, CSA Chair and President and CEO of the  Autorité des marchés financiers. “We believe it is important that Canadian  rules reflect the high standards of the IOSCO Code.”    \n CSA staff are  also proposing to amend  National Instrument 44-101  Short Form Prospectus Distributions  and  National Instrument 44-102  Shelf Distributions  to recognize the  credit ratings of Kroll Bond Rating Agency, Inc. (Kroll), but only for the purposes  of the alternative eligibility criteria for issuers of asset-backed securities  to file a short form prospectus or shelf prospectus, respectively. The proposed  amendments also address other matters. \n Kroll would only  be designated as a DRO if the proposed rule amendments are enacted as final  rule amendments and come into effect following any necessary Ministerial  approvals. At this time, CSA staff do not anticipate proposing that Kroll be  designated as a DRO for purposes of other credit rating provisions in  securities rules and policies.  \n Stakeholders are  invited to submit their comments in writing by October 4, 2017.  \n The notice and  request for comment can be found on CSA members’ websites. \nThe CSA, the council of the securities regulators of Canada’s provinces  and territories, co-ordinates and harmonizes regulation for the Canadian  capital markets. \n - 30 - \n For more information: \n Kristen\n            Rose \n            Ontario Securities Commission \n            416-593-2336 \n Hilary McMeekin \n            Alberta Securities Commission \n            403-592-8186 \n Alison Walker \n            British Columbia Securities Commission \n            604-899-6713  \n            Sylvain Théberge \n            Autorité des marchés financiers \n            514-940-2176\n Jason (Jay) Booth \n            Manitoba Securities Commission \n            204-945-1660 \n Andrew\n            Nicholson \n            Financial and Consumer Services \n            Commission, New Brunswick \n            506-658-3021\n David Harrison \n            Nova Scotia Securities Commission \n            902-424-8586\n            Janice Callbeck \n            Office of the Superintendent of\n            Securities \n            P.E.I \n            902-368-6288\n            John O’Brien \n            Office of the Superintendent of\n            Securities \n            Newfoundland and Labrador \n            709-729-4909\n            Rhonda Horte \n            Office of the Yukon Superintendent \n            of Securities \n            867-667-5466\n            Jeff Mason \n            Nunavut Securities Office \n            867-975-6591 \n Tom\n            Hall \n            Northwest Territories Securities Office \n            867-767-9305\n            Shannon McMillan \n            Financial and Consumer Affairs \n            Authority of Saskatchewan \n            306-798-4160\n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}