{"url": "https://support.nlm.nih.gov/ics/support/KBList.asp?Time=2017-11-25T17:48:38-05:00&Snapshot=%2Fprojects%2Fentrez%2Fpubmed%2FPubMedGroup@1.118&Host=portal209&ncbi_phid=3971B5ABA19F2721000000000084002D&ncbi_session=CE8E26F7A19F33D1_0115SID&from=https%3A%2F%2Fwww.ncbi.nlm.nih.gov%2Fpubmed%2F15482445&__baseurl=https%3A%2F%2Fsupport.nlm.nih.gov%2Fics%2Fsupport%2F&__page=KBList.asp&category=pubmed&deptID=28054&folderID=143&db=pubmed&Ncbi_App=entrez&Page=abstract&style=classic&report=abstract&querykey=2&query=1%20selected%20item:%2015482445;%20Page%20number:%201;%20Page%20size:%2020&pmid=15482445", "content": "Selected Folder \n        Skip to main page content\r\n U.S. National Library of Medicine \n Customer Support Home \n Contact NLM \n NLM Chat \n NLM Customer Support \n Search \n Search \n Search \n Search \n Search \n Search \n Search \n Search \n NIH NLM NLM Portal About NLM & NIH Drugs & Medical Devices Drugs Medical Devices Getting NLM Materials General Questions about Getting Materials Copyright & Licensing DOCLINE General DOCLINE Questions Technical DOCLINE Questions DOCLINE Requests Borrow EFTS Lend Receipt DOCLINE Reports Routing Status/Cancel Serial Holdings General Serials Information Update/View Holdings Batch Updates Holdings Reports Union List Products Institutions General Institution Information Institution Display Library Groups Routing/Routing Tables DOCLINE and Loansome Doc General Loansome Doc Loansome Doc Patron Administration Interlibrary Loan Interlibrary Loan Services Interlibrary Loan Billing International Document Delivery Non-DOCLINE Requests Loansome Doc Article Ordering Service General Loansome Doc/Registration Loansome Doc Ordering/Order Status My Loansome Doc Account Grants & Funding Applying For a Grant Reviewing Your Application Managing Your Application New / Early Stage Investigator R01 grants K99 / R00 grants K01 grants Health ClinicalTrials.gov Patients Researchers General Registration and Submission Results Compliance MedlinePlus Health Information Questions General MedlinePlus Questions Using MedlinePlus How We Select Information MedlinePlus Technical Questions MedlinePlus Connect General MedlinePlus Connect Questions Using MedlinePlus Connect MedlinePlus Connect Technical Questions MedlinePlus Connect Users Other MedlinePlus Connect Questions MedlinePlus en español Preguntas generales Cómo usar MedlinePlus Cómo seleccionamos la información Preguntas técnicas Genetics Home Reference NIHSeniorHealth Health Services Research and Public Health Health Services Research Information Central HSRProj Health Services and Sciences Research Resources PHPartners Household Products Database TOXNET WISER TOXMAP History of Medicine General Information - NLM Historical Collections Getting and Using Historical Materials How to Look for Historical Materials Using IndexCat Using the History of Medicine Reading Room Directory of History of Medicine Collections Indexing & Cataloging Indexing Policy Cataloging Authority Records Cataloging and NLM Classification Cataloging-in-Publication (CIP) Bibliographic Record Distribution Program Searching LocatorPlus Downloading Catalog Records    PubMed  General PubMed My NCBI Searching PubMed LinkOut for Libraries General LinkOut Information Using LinkOut Viewing Icons Accessing Articles Missing and Broken Links Managing your LinkOut Account Submission Utility Online Holdings Print Holdings LinkOut Statistics Creating Library Icons Localizing PubMed MEDLINE Content Terminologies Rx Norm SNOMED CT About SNOMED CT Get SNOMED CT Using SNOMED CT Licensing SNOMED CT Mappings and Crosswalks - SNOMED CT UMLS VSAC Training & Outreach PubMed   \n NIH NLM NLM Portal PubMed General PubMed  I found an error or mistake in PubMed; how do I get it fixed? Can I get advice about my disease? How do I get the full text of an article? Does NLM provide literature searches or reviews for researchers or librarians? Which is the correct publication date for a PubMed article? More... My NCBI How do I recover or reset my MyNCBI username or password? Searching PubMed Can I search PubMed to find out how many times an article, author, or journal has been cited? How does the PubMed Best Match feature work? Why can't I find a citation in PubMed when other citations from the same journal are there? Does PubMed support adjacency searching? Does PubMed limit the number of authors? More... LinkOut for Libraries General LinkOut Information   What is LinkOut? General LinkOut Information   What is Outside Tool? General LinkOut Information   What is LinkOut via Submission Utility? Localizing PubMed   Can I have my library's icon appear on all citations with links to free full text? LinkOut Statistics   Are LinkOut statistics available for my library? More... MEDLINE Content How long does it take for articles to be MeSH indexed after their publication? What is the difference between MEDLINE, PubMed, and PMC? How do I suggest a new MeSH term? How do I report an error in the MeSH terms assigned to an article in PubMed? How can I identify older medical journal articles? More...   \n Home \n Online Support \n Request Support \n Sign in \n Exit \n Knowledge Base \n Glossary \n Troubleshooter \n Submit a Ticket \n Submit Feedback \n              Advanced Search\r\n Help Desk and Customer Support Software by Parature \n Copyright , \r\n                 Privacy , \r\n                 Accessibility , \r\n                 Site Map , \r\n                 Viewers and Players \n                U.S. National Library of Medicine, 8600 Rockville Pike, Bethesda, MD 20894\r\n National Institutes of Health , \r\n                 Health & Human Services \n Freedom of Information Act"}