{"url": "http://www.concordia.ca/fr/web/conditions.html", "content": "Conditions d'utilisation \n Concordia University \n http://www.concordia.ca/content/concordia/fr/web/conditions.html \n Ressources étudiantes \n Annuaire des études supérieures \n Annuaire des études de 1 er  cycle \n Avis d’annulation de cours \n Horaire des cours \n Inscription aux cours \n Calendrier universitaire \n Autres ressources Services sur les campus \n Magasins \n Services de TI \n Occasions d’emploi \n Sécurité \n Navette \n Centre de services aux étudiants Birks \n Autres services Quoi de neuf \n Calendrier des activités  \n Actualités récentes \n Relations médias Facultés, écoles et collèges \n Arts et sciences \n Génie et informatique \n Beaux-arts \n École de gestion John-Molson \n École des études supérieures \n Tout sur les écoles, collèges et départements \n Liens utiles   \n Mon courriel \n Bibliothèque \n Cspace \n Ressources étudiantes    \n Annuaire des études supérieures \n Annuaire des études de 1 er  cycle \n Avis d’annulation de cours \n Horaire des cours \n Inscription aux cours \n Calendrier universitaire \n Autres ressources Services sur les campus    \n Magasins \n Services de TI \n Occasions d’emploi \n Sécurité \n Navette \n Centre de services aux étudiants Birks \n Autres services Quoi de neuf    \n Calendrier des activités  \n Actualités récentes \n Relations médias Facultés, écoles et collèges    \n Arts et sciences \n Génie et informatique \n Beaux-arts \n École de gestion John-Molson \n École des études supérieures \n Tout sur les écoles, collèges et départements \n Liens utiles  \n La Campagne pour Concordia \n MyConcordia \n Cspace \n Mon courriel \n Bibliothèque \n Répertoires \n A-Z \n Cartes \n Futurs étudiants \n Carrefour étudiant \n Diplômés et amis \n Parents \n Personnel \n Médias \n Université Concordia \n Université Concordia \n MyConcordia \n Navette \n Cartes \n À propos  \n Études \n Admission \n Vie étudiante \n Recherche \n International \n en \n La Campagne pour Concordia \n Ressources étudiantes \n Annuaire des études supérieures \n Annuaire des études de 1 er  cycle \n Avis d’annulation de cours \n Horaire des cours \n Inscription aux cours \n Calendrier universitaire \n Autres ressources Services sur les campus \n Magasins \n Services de TI \n Occasions d’emploi \n Sécurité \n Navette \n Centre de services aux étudiants Birks \n Autres services Quoi de neuf \n Calendrier des activités  \n Actualités récentes \n Relations médias Facultés, écoles et collèges \n Arts et sciences \n Génie et informatique \n Beaux-arts \n École de gestion John-Molson \n École des études supérieures \n Tout sur les écoles, collèges et départements \n Liens utiles   \n Mon courriel \n Bibliothèque \n Cspace \n Ressources étudiantes    \n Annuaire des études supérieures \n Annuaire des études de 1 er  cycle \n Avis d’annulation de cours \n Horaire des cours \n Inscription aux cours \n Calendrier universitaire \n Autres ressources Services sur les campus    \n Magasins \n Services de TI \n Occasions d’emploi \n Sécurité \n Navette \n Centre de services aux étudiants Birks \n Autres services Quoi de neuf    \n Calendrier des activités  \n Actualités récentes \n Relations médias Facultés, écoles et collèges    \n Arts et sciences \n Génie et informatique \n Beaux-arts \n École de gestion John-Molson \n École des études supérieures \n Tout sur les écoles, collèges et départements \n Information pour...   \n Futurs étudiants \n Carrefour étudiant \n Diplômés et amis \n Parents \n Personnel \n Médias \n                    Concordia\r\n                    Directories\r\n Recherche \n Université Concordia \n                    Accueil\r\n\t         / \r\n                    Web\r\n\t         / \r\n                    Conditions d'utilisation\r\n Facebook \n Twitter \n LinkedIn \n GooglePlus \n Conditions d'utilisation \n Remarque  : Le masculin est utilisé pour faciliter la lecture. \n Toute personne qui accède au site Web de l’Université Concordia (ci-après, Concordia) est réputée accepter les  politiques  de celle-ci ainsi que les présentes conditions générales. Ces conditions doivent être interprétées en vertu des lois du Canada et de la province de Québec. \n Commentaires \n Les fonctions permettant l’ajout de commentaires sur le site Web de Concordia – notamment dans le cadre d’un blogue ou d’un forum – ont pour but de favoriser les discussions intelligentes entre membres de la communauté de Concordia. Dès lors, quand vous apportez un commentaire, vous adhérez implicitement aux quatre principes ci-après. \n Respectez la loi. N’écrivez pas de commentaires calomnieux, diffamatoires, obscènes, pornographiques, offensants ou présentant, de quelque manière que ce soit, un contenu illicite. \n Témoignez du respect. Que ce soit par écrit, de vive voix ou autrement, ne menacez ni n’injuriez tout auteur ou commentateur. N’agissez pas de sorte qu’un autre commentateur se sente importun ou en danger. Dans la mesure du possible, employez une langue appropriée à des échanges entre membres d’une communauté universitaire. Strictement défendus, les propos haineux entraîneront le retrait du commentaire en cause et la possibilité de votre bannissement permanent en tant que commentateur. Comprenez bien qu’il y a un monde entre « débattre » et « attaquer ». \n Faites preuve d’à-propos. Il s’agit de commenter le sujet de la discussion; pas de faire votre autopromotion. Les publicités et les commentaires « poubelle » sont d’ailleurs strictement interdits. Quand vous apportez un commentaire, il doit encourager la discussion sur une question d’intérêt pour la communauté universitaire. Comme nous en faisons partie, il nous semble que l’ajout de commentaires devrait favoriser l’expérience pédagogique. \n Mesurez les implications. Concordia se réserve le droit d’utiliser, de copier, de transmettre, d’extraire, de publier, de distribuer, de présenter ou d’afficher en public, d’héberger, d’indexer, de stocker en mémoire cache, de baliser, de coder, de modifier ou d’adapter – dans quelque forme ou média, existant ou futur, que ce soit – tout commentaire laissé par vous sur tout site appartenant à Concordia ou régi par celle-ci, notamment Concordia.ca, de même que de créer des œuvres dérivées à partir d’un tel commentaire. De plus, Concordia se réserve en tout temps le droit de vous bannir du nombre des commentateurs de l’un ou l’autre de ses sites, et ce, sans avertissement ni possibilité de recours. \n Enfin, veuillez noter que Concordia est susceptible de modérer les commentaires et que toute décision prise par son modérateur sera considérée comme définitive.  \n Droit d'auteur \n Toutes les pages du site Web de Concordia et leur contenu sont la propriété de Concordia sauf attribution contraire. À moins qu’il y ait une indication contraire, tous les documents sur les sites Web de Concordia ont été produits et compilés par Concordia et sont protégés par le droit d’auteur. \n Toute la documentation sur les sites Web de Concordia est protégée par la Loi sur les droits d’auteur du Canada, par les lois, règlements et politiques du Canada et du Québec, par les ententes et traités internationaux et par les politiques et règlements de Concordia. \n Aucun document apparaissant sur ce site Web ou sur tout autre site détenu, exploité ou géré par Concordia ne peut être copié, vendu, reproduit, téléchargé, affiché, transmis ou distribué par quelque moyen que ce soit, à l’exception du téléchargement ou de l’impression du contenu à des fins personnelles et non commerciales. Cette utilisation doit prendre en compte que Concordia se réserve les droits d’auteur et les droits à l’exclusivité sur le matériel. \n Concordia n’autorise pas la reproduction sur d’autres sites du matériel affiché sur son site Web ou sur les sites Web qu’elle détient, exploite ou gère. Toute reproduction exige une autorisation écrite d’un représentant dûment autorisé de Concordia. Concordia interdit également l’affichage direct de tout matériel issu de ses sites Web dans un encadré sur un autre site Web ou l’utilisation de toute autre méthode qui n’indique pas que le matériel reproduit est la propriété de Concordia. \n L’utilisateur des sites Web de Concordia n’acquiert aucun autre droit ou licence dans le site de Concordia que ceux indiqués expressément dans les présentes modalités.  \n Logos et marques de commerce \n Le nom de l’Université Concordia, ses logos, ses armoiries, ses écussons, son emblème et les autres symboles utilisés par Concordia et ses filiales ou organismes et départements affiliés sont uniquement la propriété de Concordia et sont protégés par la Loi sur les marques de commerce du Canada dont l’article 9 stipule que : \n (1) Nul ne peut adopter à l’égard d’une entreprise, comme marque de commerce ou autrement, une marque composée de ce qui suit, ou dont la ressemblance est telle qu’on pourrait vraisemblablement la confondre avec ce qui suit : […] n) tout insigne, écusson, marque ou emblème : […] (ii) d’une université […] à l’égard duquel le registraire, sur la demande de Sa Majesté ou de l’université ou autorité publique, selon le cas, a donné un avis public d’adoption et emploi. \n Personne ne peut utiliser, afficher, promouvoir, publier, diffuser ou reproduire le nom de Concordia, ses logos, ses armoiries, ses écussons, son emblème et les autres symboles utilisés par Concordia et ses filiales ou organismes et départements affiliés peu importe sous quelle forme, y compris électroniquement, mécaniquement ou sur papier, sans l’autorisation écrite d’un représentant autorisé de Concordia. \n Ce site Web peut contenir des images qui appartiennent à la marque de commerce de tierces parties. Rien sur ce site ne doit être interprété comme une autorisation explicite ou implicite à afficher, promouvoir, publier, diffuser ou reproduire ces marques sous quelque forme que ce soit.  \n Liens \n Les sites Web de Concordia peuvent contenir des liens vers d’autres sites. Concordia n’est responsable ni du contenu ni des directives en matière de vie privée de ces sites. Les utilisateurs vérifieront les politiques sur la vie privée des sites placés en lien par Concordia et exerceront leur jugement quant à l’exactitude et à la fiabilité des renseignements qu’ils renferment.  \n Back to top \n © Université Concordia \n Université Concordia  - Contactez-nous au 514-848-2424 \n À propos \n Études \n Admission \n Vie étudiante \n Recherche \n International \n Futurs étudiants \n Carrefour étudiant \n Diplômés et amis \n Parents  \n Personnel \n Médias \n Sir George Williams Campus \n 1455 De Maisonneuve Blvd. W. \n Montreal ,  Quebec ,  Canada \n H3G 1M8 \n See SGW Campus map  \n Loyola Campus \n 7141 Sherbrooke Street W. \n Montreal ,  Quebec ,  Canada \n H4B 1R6 \n See Loyola Campus map  \n facebook \n twitter \n google \n youtube \n linkedin \n pinterest \n instagram \n © Université Concordia \n Conditions d’utilisation \n Confidentialité \n Accessibilité \n Commentaires sur le site Web \n Share this page \n Concordia.ca \n Contactez-nous au \n 514-848-2424 \n Sir George Williams Campus \n 1455 De Maisonneuve Blvd. W. \n Montreal ,  Quebec ,  Canada \n H3G 1M8 \n See SGW Campus map  \n Loyola Campus \n 7141 Sherbrooke Street W. \n Montreal ,  Quebec ,  Canada \n H4B 1R6 \n See Loyola Campus map  \n Commentaires sur le site Web \n Conditions d’utilisation \n Confidentialité \n Accessibilité \n © Université Concordia"}