{"url": "https://m.wikihow.com/Open-DLL-Files", "content": "The 2 Best Ways to Open DLL Files - wikiHow \n Home Random Browse Articles Notifications Add to This Page Add Tip Easy Ways to Help Approve Questions Review Tech Feedback Fix Spelling More Things to Try...   \n Log in / Sign up   \n Desktop Site   \n Talk How to Open DLL Files   \n The Dynamic Link Library, or DLL file, is a mainstay of traditional Windows programming. These files are used by programs to gain additional functionality and libraries without having to have them built-in to the program itself. Oftentimes, DLL files are shared across many different programs. For most users, DLLs work in the background, and you should rarely have to deal with them. Occasionally, however, you may need to register a DLL in order for a program you've installed to work properly. If you're interested in coding, exploring how DLLs are constructed can also be very illuminating. \n Steps Edit \n Method One of Two: Using DLL Files Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4f\\/Open-DLL-Files-Step-1-Version-7.jpg\\/v4-460px-Open-DLL-Files-Step-1-Version-7.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4f\\/Open-DLL-Files-Step-1-Version-7.jpg\\/v4-760px-Open-DLL-Files-Step-1-Version-7.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Understand what a DLL file is.  A DLL (dynamic link library) is a Windows file that is used by program to call upon existing functions. Essentially, they allow Windows and other programs to gain functionality without having to have that functionality built-in.\n DLL files are an essential part of Windows programming, and lead to sleeker, more efficient programs. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Open-DLL-Files-Step-2-Version-6.jpg\\/v4-460px-Open-DLL-Files-Step-2-Version-6.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Open-DLL-Files-Step-2-Version-6.jpg\\/v4-760px-Open-DLL-Files-Step-2-Version-6.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Know that the average user doesn't need to open or interact with DLL files.  For most users, DLL files will exist in the background. Programs will install and call upon them automatically, and moving them can cause serious problems with the system.\n Sometimes you may be asked during the installation of community-made programs to place DLL files in specific locations. Make sure that you trust the program before following these instructions, as DLL files can be malicious. \n If you're interested in learning how DLL files are constructed, see the next section. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b1\\/Open-DLL-Files-Step-3-Version-6.jpg\\/v4-460px-Open-DLL-Files-Step-3-Version-6.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b1\\/Open-DLL-Files-Step-3-Version-6.jpg\\/v4-760px-Open-DLL-Files-Step-3-Version-6.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Register a new DLL.  If you have had to manually copy a DLL file into a folder for a program to use, you may need to register it in the Windows Registry before it can be used. Refer to the program's documentation to determine if you'll need to perform this step (it is extremely uncommon for most Windows programs). [1] \n Open the Command Prompt. You can find this in the Start menu or by pressing the Windows key + R and typing  cmd .  Navigate  to the location of the new DLL file. \n If you are using Windows 7 or newer, open the folder containing the new DLL file, hold the Shift key and right-click in the folder, and select \"Open command window here\". The Command Prompt will open directly to that folder. \n Type  regsvr32  dllname .dll  and press Enter. This will add the DLL file to Windows Registry. \n Type  regsvr32 -u  dllname .dll  to remove the DLL file from the Windows Registry. \n Advertisement \n Method Two of Two: Decompiling DLL Files Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8c\\/Open-DLL-Files-Step-4-Version-6.jpg\\/v4-460px-Open-DLL-Files-Step-4-Version-6.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8c\\/Open-DLL-Files-Step-4-Version-6.jpg\\/v4-760px-Open-DLL-Files-Step-4-Version-6.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Download and install a decompiler.  A \"decompiler\" is a program that allows you to see the source code that was used to construct a file or program, in this case a DLL file. In order to see the code that makes a DLL file work, you will need to use a decompiler to revert it back into readable code. Opening a DLL file without a decompiler (such as opening it with Notepad) will result in a jumbled mess of unreadable characters.\n dotPeek is one of the more popular free decompilers. It is available from  jetbrains.com/decompiler/ . \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e7\\/Open-DLL-Files-Step-5-Version-3.jpg\\/v4-460px-Open-DLL-Files-Step-5-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e7\\/Open-DLL-Files-Step-5-Version-3.jpg\\/v4-760px-Open-DLL-Files-Step-5-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Open the DLL file in your decompiler.  If you're using dotPeek, simply click \"File\" → \"Open\" and then browse for the DLL file you want to decompile. You can explore the contents of the DLL file without affecting your system. [2] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7c\\/Open-DLL-Files-Step-6-Version-3.jpg\\/v4-460px-Open-DLL-Files-Step-6-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7c\\/Open-DLL-Files-Step-6-Version-3.jpg\\/v4-760px-Open-DLL-Files-Step-6-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Use the \"Assembly Explorer\" to browse the nodes of the DLL file.  DLL files are made of \"nodes\", or modules of code that work together to form the entire DLL file. You can expand each node to see any subnodes that it may contain.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/ac\\/Open-DLL-Files-Step-7-Version-3.jpg\\/v4-460px-Open-DLL-Files-Step-7-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/ac\\/Open-DLL-Files-Step-7-Version-3.jpg\\/v4-760px-Open-DLL-Files-Step-7-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Double-click a node to see the code for it.  The code for the node you select will appear in the right frame of dotPeek. You can scroll through the code to review it. dotPeek will display the code in C#, or it can download additional libraries in order for you to view the original source code.\n If the node requires additional libraries to view, dotPeek will attempt to download them automatically. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/01\\/Open-DLL-Files-Step-8-Version-3.jpg\\/v4-460px-Open-DLL-Files-Step-8-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/01\\/Open-DLL-Files-Step-8-Version-3.jpg\\/v4-760px-Open-DLL-Files-Step-8-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Get clarification for different pieces of the code.  If you've found a piece of code you don't understand, you can use the Quick Documentation feature to see what the command is doing.\n Place your cursor in the piece of code that you need documentation for in the Code Viewer frame. \n Press Ctrl + Q to load the Quick Documentation window. \n Follow the hyperlinks to learn more about each aspect of the code you are examining. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/d4\\/Open-DLL-Files-Step-9-Version-3.jpg\\/v4-460px-Open-DLL-Files-Step-9-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/d4\\/Open-DLL-Files-Step-9-Version-3.jpg\\/v4-760px-Open-DLL-Files-Step-9-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Export the code to Visual Basic.  If you want to manipulate, edit, and build the file on your own, you can export it into Visual Studio. The exported code will be in C#, even if it was originally written in a different language originally.\n Right-click on the DLL file in the Assembly Explorer. \n Select \"Export to Project\" \n Choose your export options. You can have the project opened immediately in Visual Studio if you'd like to get started on it immediately. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e7\\/Open-DLL-Files-Step-10-Version-2.jpg\\/v4-460px-Open-DLL-Files-Step-10-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e7\\/Open-DLL-Files-Step-10-Version-2.jpg\\/v4-760px-Open-DLL-Files-Step-10-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 7 \n Edit the code in Visual Studio.  Once you have the project loaded in Visual Studio, you will have complete control over editing and building the DLL into your own creation.  Click here for detailed instructions on using Visual Studio .\n Advertisement \n Community Q&A \n Search \n Add New Question \n Can I change the source code of a windows DLL file? Can I change the source code of another application? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Yes, but making changes is risky because because these are compiled files. If you want to change code, first backup your original files, then you can use the \"Resource Editor\" to edit and save the DLL.  \n Thanks! \n 14 \n 11 \n Ask a Question \n 200 characters left \n Submit \n Related wikiHows Edit \n How to  Edit DLL Files \n How to  Restore DLL Files on Your Computer \n How to  Register a DLL \n How to  Delete DLL Files \n How to  Open SWF Files \n How to  Open BIN Files \n How to  Change a Word Document to JPEG Format \n How to  Compress Large Files \n Advertisement \n About This Article \n How helpful is this? \n\t\t\t\tCo-authors:   27 \n Updated:  \n\t\t\t\tViews:  726,572 \n\t\t\t\tCategories:  File Manipulation \n Sources and Attribution \n Reader Success Stories \n\t\t\t\t\t\tRE\n Rhys Edwards \n Sep 24 \n\t\t\t\t\"I am troubleshooting a web page user search issue that uses a custom DLL.  I needed to be able to reproduce the  issue more directly than through the web page, but I had no idea how the methods were being called. This article helped me find the tool I needed to decompile the DLL and understand how it was working.\" ...\"  more \n Rated this article:  \n\t\t\t\t\t\tRT\n Rohit Tulsyani \n Sep 16 \n\t\t\t\t\"I want to become a coder and for that I want to read some scripts of a dll file and i didn't know which software to  use. Thanks. \" ...\"  more \n Rated this article:  \n\t\t\t\t\t\tA\n Anonymous \n May 20 \n\t\t\t\t\"Just trying to figure out how to get up and running, thanks for the help.\"\n\t\t\t\t\t\tHS\n Hafiz Shafiq \n Aug 7 \n\t\t\t\t\"With pictures, it made it very easy to understand what I was searching.\"\n\t\t\t\t\t\tA\n Anonymous \n Jun 14 \n\t\t\t\t\"I didn't know that there is a way to manually execute DLL files.\"\n\t\t\t\t\t\tA\n Anonymous \n Dec 8, 2016 \n\t\t\t\t\"It was amazing getting to know the stuff, thanks.\"\n More reader stories \n All reader stories \n Hide reader stories \n Share your story \n Is this article up to date? \n Yes \n No \n\t\t\t\tNo\n\t\t\t\t\t\t{{questionText}}\n\t\t\t\t\t\t{{currentMethod}}\n\t\t\t\t\t{{cheerText}}\n\t\t\t\t\t{{oopsText}}\n\t\t\t\tYes\n Share \n Using DLL Files Decompiling DLL Files Community Q&A Related wikiHows \n Surprise Me! \n 195"}