{"url": "http://www.boxofficemojo.com/reviews/?id=63&p=.htm", "content": "Movie Review: Igby Goes Down \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n > REVIEWS \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n IGBY GOES DOWN \n U.S. Release Date: \n September 13, 2002 \n Distributor:  MGM \n Director:   Burr Steers Writer:   Burr Steers Cast:  Kieran Culkin,  Claire Danes ,  Jeff Goldblum ,  Jared Harris ,  Amanda Peet ,  Ryan Phillippe , Bill Pullman,  Susan Sarandon ,  Rory Culkin Running Time:  1 hour and 38 minutes MPAA Rating:  R (language, sexuality and drug content) \n Richie Glitch \nby  Billy Reeves   \nThe recipe for Burr Steers'  Igby Goes Down>  is simple. Start with  Richie Rich , add a mother who pops pills like candy, a schizophrenic father and an uptight ambitious brother. There you have it, the tragic and miserable world of Igby Slocumb, one that affirms the adage \"money doesn't buy happiness.\"  \n Igby (Kieran Culkin) has been kicked out of every private school on the east coast and is shaping up to be a mere shadow of his brother Oliver (Ryan Phillipe), a promising student at Columbia University. Mimi (Susan Sarandon), his strained matriarch of a mother considers his failures an embarrassment and ships him off to military school. He's a disappointment there as well, and when his Godfather D.H. Baines (Jeff Goldblum) offers to let him help renovate his home in the Hamptons for the summer, Igby sees it as a chance for escape. He hides out with Rachel (Amanda Peet), D.H.'s heroin addict mistress and Russel (Jared Harris), the drug-dealing \"performance artist.\" Somewhere between sleeping with Rachel and selling drugs for Russel, Igby falls head over heels for Sookie Sapperstein (Claire Daines), a college dropout who admires his cynicism and self-loathing, but who eventually betrays him for his older brother.  \n Igby's world is a frightening melee of fear, escape, longing, cynicism and discovery, all played to perfection by Culkin. Igby's sarcasm is protection for the vulnerability that lies beneath, and when it finally explodes on screen, it is obvious who has the talent in the Culkin family.  \n Even though he detests his mother and her posing, self-righteous ways, Culkin's character is interesting because we realize that he has a soft spot for her. Despite the bitter front that she puts up, it is obvious that Mimi also genuinely cares about Igby. He defies her repeatedly but that doesn't stop her from going to excessive lengths to try and find a school that will accept him and his many faults. There is something heartfelt about this dark comedy, and even in its conclusion you can breathe a sigh of relief that while absent of a happy ending, it's not without a spark of hope.  \n Steers keeps Igby's search for his place in the world intriguing at all times, and allows Culkin to shine with dialogue that breeds perfect comic timing. There's something honest and admirable about Igby, and you may find him something of a hero. Rather than put blinders on to the evils and shortcomings of life like the rest of his privileged family, he embraces them, even at the risk of self-endangerment.  \n Peet provides a really disgusting show, but does so skillfully. It's nice to see her play a character with some depth, and her downward spiral is the perfect compliment to Igby's own struggle. Hers is an important character because she helps solidify the hypocrisy Igby is convinced consumes his world. During one scene D.H. invites her to a party that his wife is also attending, and Igby finds the general display of apathy toward it hilarious.  \n Props go to Goldblum for also commandingly giving a performance with definite range. Even the ruthless, suave D.H. was allowed a moment of weakness that further fuels empathy for Igby.  \n The other performances are also impressive, but less memorable. Phillipe and Sarandon are perfectly convincing as the snobbish prudes that don't understand Igby's rebellious nature, but are overshadowed by the remainder of the cast.  \n I can't say I understand the logic in having Sookie fall for Oliver. You are likely to find it both confusing and contradictory to the Sookie that Steers had created up until that point. Oliver is opposite of Igby, and I find it difficult to believe she loves them both. The only reason she can give Igby to explain her actions is, \"Oliver is closer to my own age.\"  \n This isn't actually the story of Igby going down as the title would have you believe. From the beginning, he is already spiraling dangerously downward. What invariably takes place is Igby's struggle to exist on a path separate from that of his WASP family, and the question that you'll find enticing you to watch this film is, does Igby ever go back up?  \n MORE REVIEWS: So Close Charlie's Angels Hong Kong Style Once Upon a Time in Mexico A Fistful of Pesos Matchstick Men A Caper with Character Lost in Translation Sleepless in Tokyo Uptown Girls Breakfast at J.C. Penney's Freddy Vs. Jason The Horror, the Horror... \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n ADVERTISEMENT \n  \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}