{"url": "https://bookmanager.com/tbm/?q=h.tviewer&filt[lctags]=+_lctagsinbox&filt[lcowner_id]=+336&filt[_tl_isbn]=+quire&filt[_list_date_filt]=+0&using_sb=listcat&dyn=1", "content": "Bookmanager \n Most of this site's functionality requires JavaScript to be enabled. \n Keyword \n Title \n Author \n Publisher \n URL \n File \n Log In \n Home Browse Catalogues Business Directory About Contact Us Our Company For Bookstores Try Demo Software Data Webstore Gift Cards Hardware Analytics Stockchecker Pricing For Publishers Create An Account Remote Support Remote Support IP Address \n   \n Create An Account \n Invalid email/password \n\t  Log In\n I forgot my password \n Search by keyword for:  undefined No matches found. Please change your search terms. \n Searching tips \n Spelling counts!:  Our site does not perform a spell check or suggest similar words, so please try to be accurate. \n Less is more:  Omit common words such as \"the, of, a, and\". Try using only two or three words. Long words can be shortened, especially of you are not sure of the spelling or tense (e.g. using  magnif  will find all titles containing words starting with those letters, like \"magnify, magnificent, magnificently\").  \n Using exact words:  To find \"War\" and not \"Warriors\", use  War! .  The exclamation mark ensures that no variations of the word are included. \n Search types:  Searching by Keyword (usually the most effective) looks at title, author, series, subject and ISBN information for matches. Searching by Author, Title, and Publisher only looks at the respective type of information. \nTo Feature this list on your site (for your customers to use) you need to first Edit the list's Category name from \"Uncategorized\" to something more appropriate (e.g. \"Features\"). When done, click the Featured icon again.\nWhen you Share a list, all stores using Bookmanager's catalogues will have the list added to the their Inbox. First, be sure that your list is accurate and complete.\nUnsharing this list will remove it from the Inbox of others you have shared it with. However, if they have moved your list into another area (e.g. Archives or a personal folder), they will still have access to the list (e.g. to review what they ordered). Unsharing a list is recommended once the list is no longer useful to others.\nHey, your list needs some work before it can be shared: \nIt needs a category other than \"Uncategorized\" \nUse Edit to make corrections before sharing.\nHmm, your list has no titles. \nMaybe you forgot to add them. \nIf you want to share it regardless, click OK, otherwise Cancel and add some interesting stuff.\n Hey, it looks like your list is missing some crucial data... \n If you have any questions, please contact  data@bookmanager.com .  Thanks! \n Please wait while your image uploads. \n Please wait while your PDF document uploads. \n  Share with all stores  \n  Manual SAN Entry \n Check all \n Check only accounts \n Uncheck all \n   \n Bookmanager \t      411 Bernard Avenue \t      \t      \t      \t      Kelowna BC  V1Y 6N8\t       Canada   \n   \n\t    Phone: 250.763.4415\t    \t       \n\t      \t      Fax: 250.763.5211\t    \n\t     Email:  bWFpbEBib29rbWFuYWdlci5jb20=   Web:  bookmanager.com \n  Powered by  Bookmanager"}