{"url": "https://www.howtogeek.com/222614/how-to-enable-windows-10s-hidden-dark-theme/", "content": "How to Use a Dark Theme for (Almost) Everything in Windows 10  \n Skip to content \n Windows \n Mac \n iPhone \n Android \n Smarthome \n More… \n Linux \n Hardware \n Gaming \n Security \n Office \n Photography \n Search \n How to Use a Dark Theme for (Almost) Everything in Windows 10   by  Chris Hoffman  on  August 12th, 2016 \n With  Windows 10’s Anniversary Update , Microsoft now offers a dark theme–known as “dark mode”. This option was previously hidden and could only be enabled with a registry hack. Now, it’s a simple toggle. \n There’s just one catch: it doesn’t apply to every Windows application. But we’ve got you covered. Here’s how to get your whole desktop (or as much as possible) looking dark. \n Enable Dark Mode for Windows 10 Settings and Apps \n To enable the new dark theme, head to Settings > Personalization > Colors. Scroll down and select “Dark” under “Choose your app mode”. \n The Settings application itself will immediately turn dark, as will many other “Universal Windows Platform” applications. However, it’s up to each developer to support the dark theme, and some applications will continue using their normal colors. \n This option also doesn’t affect desktop applications, including Windows 10’s File Explorer, which will remain white. \n Enable the Dark Theme in Microsoft Edge \n The MIcrosoft Edge web browser included with Windows 10 also has a dark theme. However, its dark theme option is entirely separate from the main option in Settings…for some reason. \n To activate a dark theme in Edge, open the Microsoft Edge web browser, open the menu, and select “Settings”. Select “Dark” under “Choose a theme”. \n You can also choose to set your theme separately in the Groove music player and Movies & TV video player apps. However, they’ll just use your system theme setting by default. You don’t have to change the setting manually, as you do with Edge. \n Enable the Dark Theme in Microsoft Office \n Microsoft Office 2016 also contains a dark theme that isn’t enabled by default, and must be manually enabled. \n To enable it, open an Office application like Word or Excel and head to File > Options. On the General tab, click the “Office Theme” box under “Personalize your copy of Microsoft Office” and select the “Black” office theme. \n Your theme choice will apply to all Office applications. So, if you set this option in Word and later open Excel, Excel will also be using a dark theme. \n Install Dark Themes for Chrome, Firefox, and Other Applications \n Many other Windows desktop applications have their own theming options and theming engines. For example, to use a dark theme in Google Chrome, you’ll need to head to Google’s  Chrome themes site  and install a dark theme. For Firefox, you’ll need to head to Mozilla’s  Firefox themes site  and install a dark theme. \n For example, we installed the  Morpheon Dark theme  for Chrome. It makes Chrome look much more at home on a dark-themed desktop. \n Check to see whether the applications you frequently use offer their own theme options. \n Enable a Dark Theme for Windows Desktop Applications \n The real problem with the new “dark mode” setting is that it doesn’t affect the Windows desktop theme at all. Desktop applications like File Explorer will continue using the normal, light theme. \n Windows does have a built-in dark theme for desktop applications, but it probably isn’t ideal. To enable it, open the Control Panel and head to Appearance and Personalization > Change the Theme. Scroll down and choose one of the High Contrast themes, such as “High Contrast Black”. \n This will make applications like File Explorer have a dark background. However, they won’t look all that great–high contrast themes are an accessibility feature designed to increase contrast so the screen is easier to read and understand. They don’t look as slick as a modern dark theme would. \n RELATED ARTICLE How to Install Custom Themes and Visual Styles in Windows \n If you want a slicker dark theme for File Explorer and other desktop applications, you’ll have to go a bit off the beaten path. You’ll need to bypass the normal protection against using third-party themes–or “visual styles”– in Windows. You can then hunt down a third-party dark theme you like. Follow  our guide to installing third-party visual styles on Windows  for more help. \n For example, we installed  UxStyle  and the  Windows 10 – Dark Edition  visual style. There are many other dark themes you could choose. A theme like this one makes File Explorer and other applications look darker and fit in better, although there are still parts of Windows desktop applications that themes don’t (and can’t) modify. Just make sure you back up before installing something like this, as you’re messing with system files. \n Like many parts of Windows 10, the new dark theme–or dark “app mode”–feels incomplete. Microsoft could include a dark theme option for Windows desktop applications and the interface would look more cohesive. Perhaps Microsoft plans on replacing File Explorer with a new, Universal Windows Platform-based file manager in a future update to Windows 10. For now, though, this is what we’ve got. \n Share: \n Comments: \n 13 \n Chris Hoffman  is a technology writer and all-around computer geek. He's as at home using the Linux terminal as he is digging into the Windows registry.\nConnect with him on  Google+ . \n Did You Know \n In 1980s and 1990s U.S. politics, the term “Atari Democrat” was applied to young, liberal, and technology focused legislators who suggested the support and development of technology sectors would stimulate the economy. \n Best of How-To Geek \n The Five Most Useful Features in Nova Launcher for Android \n How to Send and Receive Faxes Online Without a Fax Machine or Phone Line \n How to Choose the Best VPN Service for Your Needs \n How to Factory Reset Your Android Phone or Tablet When It Won’t Boot \n How to Reset Your Web Browser To Its Default Settings \n Make Building in Minecraft Easier with WorldEdit \n Nest vs. Ecobee3 vs. Honeywell Lyric: Which Smart Thermostat Should You Buy? \n 10 Quick Ways to Speed Up a Slow PC Running Windows 7, 8, or 10 \n What Is NVRAM, and When Should I Reset It On My Mac? \n The PlayStation 4 Accessories You’ll Actually Need \n Get the HTG Newsletter \n Join 100,000 other subscribers \n Follow How-To Geek \n 160k+ \n 50k+ \n 90k+ \n More Articles You Might Like \n ABOUT \n About Us \n Contact Us \n Discussion Forum \n Review Geek \n How-To Geek Pro \n Advertising \n Privacy Policy \n Terms of Use \n GET ARTICLES BY EMAIL \n Enter your email address to get our daily newsletter. \n FOLLOW US \n Twitter \n Facebook \n Google+ \n RSS Feed \n Disclaimer: Most of the pages on the internet include affiliate links, including some on this site. \n Copyright © 2006-2017 How-To Geek, LLC  All Rights Reserved \n Join the How-To Geek Club! (It's Free)  ✕ \n Get exclusive articles before everybody else. \n Get downloadable ebooks for free! \n Get geeky trivia, fun facts, and much more."}