{"url": "https://www.ncbi.nlm.nih.gov/pubmed/?p$l=AjaxServer&portlets=id=pmfavad;id=pmdiscora:db=pubmed:pmid=15482445;id=pmcommonsad:page=none;id=pmdiscopmc:db=pubmed:pmid=15482445;id=pmdiscostruct:db=pubmed:pmid=15482445;id=pmdiscodblinks:db=pubmed:pmid=15482445;id=recentactivity&load=yes&page=full", "content": "Disc Col \n Save items Add to Favorites loading Similar articles Measurement of sexual arousal in postoperative male-to-female transsexuals using vaginal photoplethysmography. [Arch Sex Behav. 2005] Measurement of sexual arousal in postoperative male-to-female transsexuals using vaginal photoplethysmography. Lawrence AA, Latty EM, Chivers ML, Bailey JM.  Arch Sex Behav. 2005 Apr; 34(2):135-45.  Sex differences in patterns of genital sexual arousal: measurement artifacts or true phenomena? [Arch Sex Behav. 2009] Sex differences in patterns of genital sexual arousal: measurement artifacts or true phenomena? Suschinsky KD, Lalumière ML, Chivers ML.  Arch Sex Behav. 2009 Aug; 38(4):559-73. Epub 2008 Mar 15. Sexual arousal patterns of bisexual men. [Psychol Sci. 2005] Sexual arousal patterns of bisexual men. Rieger G, Chivers ML, Bailey JM.  Psychol Sci. 2005 Aug; 16(8):579-84.  Review  Sexual arousal in men: a review and conceptual analysis. [Horm Behav. 2011] Review  Sexual arousal in men: a review and conceptual analysis. Janssen E.  Horm Behav. 2011 May; 59(5):708-16. Epub 2011 Mar 21. Review  Functional neuroimaging studies of sexual arousal and orgasm in healthy men and women: a review and meta-analysis. [Neurosci Biobehav Rev. 2012] Review  Functional neuroimaging studies of sexual arousal and orgasm in healthy men and women: a review and meta-analysis. Stoléru S, Fonteille V, Cornélis C, Joyal C, Moulier V.  Neurosci Biobehav Rev. 2012 Jul; 36(6):1481-509. Epub 2012 Mar 28. See reviews... See all... Cited by 24 PubMed Central articles A Hierarchical Model Might Cast Some Light on the Anomaly. [Arch Sex Behav. 2017] A Hierarchical Model Might Cast Some Light on the Anomaly. Toates F.  Arch Sex Behav. 2017 Jul; 46(5):1203-1205. Epub 2017 Feb 21. Neural Correlates of Sexual Orientation in Heterosexual, Bisexual, and Homosexual Men. [Sci Rep. 2017] Neural Correlates of Sexual Orientation in Heterosexual, Bisexual, and Homosexual Men. Safron A, Sylva D, Klimaj V, Rosenthal AM, Li M, Walter M, Bailey JM.  Sci Rep. 2017 Feb 1; 7:41314. Epub 2017 Feb 1. Sexual Identity Mobility and Depressive Symptoms: A Longitudinal Analysis of Moderating Factors Among Sexual Minority Women. [Arch Sex Behav. 2016] Sexual Identity Mobility and Depressive Symptoms: A Longitudinal Analysis of Moderating Factors Among Sexual Minority Women. Everett BG, Talley AE, Hughes TL, Wilsnack SC, Johnson TP.  Arch Sex Behav. 2016 Oct; 45(7):1731-44. Epub 2016 Jun 2. See all... Related information Articles frequently viewed together Links to additional articles that others frequently viewed together with your selection. An experimental new feature from PubMed Labs . Cited in PMC PubMed links associated with PMC Recent Activity Clear Turn Off Turn On A sex difference in the specificity of sexual arousal. A sex difference in the specificity of sexual arousal. Psychol Sci. 2004 Nov;15(11):736-44. PubMed Aluminium tolerance in plants and the complexing role of organic acids. Aluminium tolerance in plants and the complexing role of organic acids. Trends Plant Sci. 2001 Jun;6(6):273-8. PubMed Your browsing activity is empty. Activity recording is turned off. Turn recording back on See more..."}