{"url": "https://cupaconcordia.wordpress.com/", "content": "Concordia Undergraduate Psychology Association \n Concordia Undergraduate Psychology Association \n Skip to content \n Home Contact Us \n Executives \n ←  Older posts \n\t\tMay 29, 2012 · 10:15 am\t \n Hoodies   \n Hello everyone. \n In case you did not know at this point we have all the round 2 hoodies. You can pick it up on Thursday between 1 20 and 1 50. Otherwise you will have to contact me. \n Advertisements \n Leave a comment \n Filed under  News \n\t\tFebruary 4, 2012 · 3:47 pm\t \n Hoodie Sale #2!!!   \n Hey everyone! \n We’re selling the next round of 100 hoodies on February 6th and 7th from 10 00 am till 4 00 pm on each day. We’re selling the hoodies on a first come first served basis. \n Hoodies are 30 dollars each and there is a limit of three orders per person. You must be a psychology student to place an order. Don’t forget to bring your ID card.  \n Leave a comment \n Filed under  News \n\t\tJanuary 12, 2012 · 1:21 pm\t \n Office Hours for Winter Semester   \n Hey everyone! Our new office hours for winter 2012 will be: \n Mondays: 10 – 1; 3 – 4 \n Tuesdays: 11:30 – 1 \n Wednesdays: 11 – 4 \n Thursday: 2 – 4  \n Leave a comment \n Filed under  News \n\t\tJanuary 4, 2012 · 11:59 am\t \n Loyola Icebreaker Wine & Cheese   \n Hello and happy new year to all the psychology students! \nWe hope you had a great break; sleep, food, family, friends, eggnog… \nAnyways, to welcome you back for a new semester we have an event already lined up for you: the Loyola Icebreaker Wine & Cheese! CUPA, along with the Applied Human Sciences Association and the Biology Students Association have organized an event happening at the Hive this Thursday the 5th from 6 – 10. There will be wine. There will be cheese. There will be beautiful people. And it’s all free. \nSo come by, meet some new faces and hang out with old ones. You can invite people as well. Hope to see you there! \n Leave a comment \n Filed under  News \n\t\tNovember 15, 2011 · 2:39 pm\t \n Psychology Hoodies!   \n Good news guys!!! \nWe have a date for our hoodie orders! We will be selling the hoodies on November 29th and 30th from 10am – 3pm on both days. We will have a table set up in the SP Atrium (near the security office). We’ll have a big CUPA banner and some demo hoodies (so you can get an idea of the colours and the sizes). Remember, this year you can get a quote on the back of your hoodie for no extra charge. As always, hoodies cost $30 each. More good news: unlike previous years, we will be having two shipments, one per semester. So if you’re going away this winter, you won’t have to wait until next year to pick up your hoodie. If you’re not going away, well, you’ll get to be stylish starting December 🙂 \nResources are limited so we can only take 100 orders this semester. 3 orders max per person. First come, first serve, so come quickly! And bring your Concordia IDs. Also, the hoodies are reserved for undergraduate psychology students at Concordia only \n Leave a comment \n Filed under  News \n\t\tSeptember 14, 2011 · 9:27 pm\t \n Office Hours   \n Hey everyone! \nWe have officially updated our weekly office hours. Check the “Contact Us” tab for information on how to, you know, contact us. \nThe new office hours will be there! \n Leave a comment \n Filed under  News \n\t\tSeptember 6, 2011 · 11:41 am\t \n Welcome back!   \n Hey everybody! \nWell, it’s been another short summer and here we are back again. We hope you enjoyed your time off 🙂 \nWe are planning some interesting activities and events this semester for you psychology people. Stay posted! We will also be updating our office hours shortly so keep an eye out for that if you want to speak to us in person. Enjoy your semester! \n Leave a comment \n Filed under  News \n ←  Older posts \n CUPA Tweets \n\t\t\t\tHey! We're selling the next round of 100 hoodies on February 6th and 7th from 10 00 am till 4 00 pm on each day. Student ID required! \t\t\t\t 5 years ago \n\t\t\t\tHey everyone! Your hoodies have arrived! Come by the office (PY-321) during office hours to pick yours up. Remember to bring your receipt \t\t\t\t 5 years ago \n\t\t\t\tInterested in a psychology co-op program? Please fill out this 3 minute survey if you've got the time!   tinyurl.com/bta3vj9   5 years ago \n\t\t\t\tCUPA hoodies are going on sale!\nCome by the SP Atrium on November 29th or 30th from 10 - 3 to place your orders. $30 each. Bring ID! \t\t\t\t 6 years ago \n\t\t\t\tHELLO PSYCHOLOGY PEOPLE!! -   eepurl.com/gOV0n   6 years ago \n Blogroll \n American Psychology Association \n Canadian Psychology Association \n Concordia Career and Placement Services \n Concordia Counselling and Development \n Concordia Library Psychology Research Guide \n Concordia Psychology Department \n Dr. Mumby Getting into Graduate School Blog \n Ordre des Psychologues du Quebec \n Participant Pool Credit \n Calendar \n November 2017 \n M \n T \n W \n T \n F \n S \n S \n « May \n   \n   \n   1 2 3 4 5 \n 6 7 8 9 10 11 12 \n 13 14 15 16 17 18 19 \n 20 21 22 23 24 25 26 \n 27 28 29 30 \n   \n Archives   \n May 2012 \n February 2012 \n January 2012 \n November 2011 \n September 2011 \n July 2011 \n June 2011 \n November 2010 \n October 2010 \n September 2010 \n March 2010 \n January 2010 \n October 2009 \n September 2009 \n April 2009 \n February 2009 \n January 2009 \n November 2008 \n October 2008 \n Concordia Undergraduate Psychology Association  · \t\t\t\t \n Create a free website or blog at WordPress.com.   \n\t\t\t\t\t\tConcordia Undergraduate Psychology Association\t\t\t\t\t \n Create a free website or blog at WordPress.com.   \n Post to \n Cancel"}