{"url": "https://www.mediawiki.org/wiki/Special:MyLanguage/Help:Related_changes", "content": "Help:Related changes - MediaWiki \n Help:Related changes   \n From MediaWiki.org   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Translate this page \n Other languages: \n English  • ‎ español  • ‎ français  • ‎ italiano  • ‎ 日本語  • ‎ occitan  • ‎ polski  • ‎ русский  • ‎ shqip  • ‎ 中文 \n Note:  When you edit this page, you agree to release your contribution under the  CC0 . See  Public Domain Help Pages  for more info. \n Some old revisions for this page were imported under CC BY-SA license. Only new contributions are PD. \n Edit  ·  Translate \n The \" Related changes \" feature lists all recent changes (before MediaWiki 1.5: only the last) in each page linked to  from  the specified page, or all recent changes in each page with a link  to  the specified page. \n Contents \n 1   Details \n 2   Watchlist-like functionality \n 3   Options \n 4   Caveats \n 5   See also \n Details [ edit ] \n The number of pages listed is specified in the preferences. However, the entries come from the  recentchanges Manual:recentchanges table  table and are therefore restricted to edits not older than  $wgRCMaxAge Manual:$wgRCMaxAge . \n Like in  Recent changes Help:Recent changes  and  Enhanced recent changes Help:Enhanced recent changes ,  watched pages  are bolded. \n Watchlist-like functionality [ edit ] \n This feature can be used to set up custom-watchlist-like functionality. It behaves like a watchlist which would contain every page linked to from the current page. However, Related changes does not automatically include talk pages; to watch also the corresponding talk pages, links to them also have to be in the page on which Related changes is applied. \n Options [ edit ] \n The option \"Hide minor edits\" that can be set in the  preferences  applies among other things to Related changes. \n See also  hide minor edits . \n Caveats [ edit ] \n Note that for a link to redirect, only a change in the redirect is given, not a change in the target article. In this regard a direct link to the target article is superior. \n The \"Related changes\" feature neither lists changes in images or sound files nor in image description pages (regardless of which of the three linking methods (image, :image or media)) is used. \n When applying the feature to a  subpage , the automatic link to the parent page is ignored, i.e., changes in the parent page are not listed unless there is also an explicit link to it. \n See also [ edit ] \n Help:Tracking categories Help:Tracking categories \n\t\t\t\t\t\tRetrieved from \" https://www.mediawiki.org/w/index.php?title=Help:Related_changes&oldid=2605879 \"\t\t\t\t\t \n Category :  Help   \n Navigation menu \n Personal tools \n English Not logged in Talk Contributions Create account Log in   \n Namespaces \n Help Discussion   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Get MediaWiki Get extensions Tech blog Contribute   \n Support \n User help FAQ Technical manual Support desk Communication   \n Development \n Bug tracker Code repository Code docs Statistics Wikimedia technology Wikimedia audiences   \n MediaWiki.org \n Community portal Recent changes Translate content Random page Current issues Sandbox   \n Print/export \n Create a book Download as PDF Printable version   \n Tools \n What links here Related changes Special pages Permanent link Page information Wikidata item   \n In other languages \n Add links   \n  This page was last edited on 31 October 2017, at 19:03. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.\nSee  Terms of Use  for details. \n Privacy policy \n About MediaWiki.org \n Disclaimers \n Code of Conduct \n Developers \n Cookie statement \n Mobile view"}