{"url": "https://en.wikipedia.org/wiki/Regulus_Arcturus_Black", "content": "Death Eater - Wikipedia \n Death Eater \n From Wikipedia, the free encyclopedia \n   (Redirected from  Regulus Arcturus Black ) \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article  needs additional citations for  verification .  Please help  improve this article  by  adding citations to reliable sources . Unsourced material may be challenged and removed.   (November 2017)   ( Learn how and when to remove this template message ) \n Death Eaters \n Lord Voldemort (centre) with Bellatrix Lestrange (left), Lucius Malfoy (right) and several masked Death Eaters (back) in  Harry Potter and the Order of the Phoenix \n Universe \n Harry Potter \n Founded \n Term first used in  Harry Potter and the Goblet of Fire , members of organisation appeared in first three series entries. \n Location \n Riddle House   [HP4] \n Malfoy Manor [1]   [HP7] \n Forbidden Forest   [HP7] \n Leader \n Lord Voldemort \n Key people \n Bellatrix Lestrange \n Lucius Malfoy \n Severus Snape \n Peter Pettigrew \n Fenrir Greyback \n Augustus Rookwood \n Igor Karkaroff \n Antonin Dolohov \n Thorfinn Rowle \n Goyle Sr. \n Crabbe Sr. \n Barty Crouch Jr. \n Purpose \n Preservation of blood purity, control of wizarding world, dominance of magical people over Muggles \n Powers \n Dark magic \n Affiliations \n Werewolves \n Inferi \n Giants \n Ministry of Magic \n Acromantula   [HP7] \n Enemies \n Harry Potter \n Order of the Phoenix \n Dumbledore's Army \n Ministry of Magic \n Auror Office \n Death Eaters  are fictional characters in the  Harry Potter  series of novels and films. They are a group of wizards and witches, led by the dark wizard  Lord Voldemort  (Tom Marvolo Riddle), who seek to purify the Wizarding community by eliminating the  Muggle-borns  (wizards or witches born to non-magical parents). They also try to create a new order through the  Ministry of Magic  and spread fear throughout the Wizarding community by  terrorising  and killing important officials and other enemies of the Death Eaters, chiefly the members of the  Order of the Phoenix . Although the reason why they are called \"Death Eaters\" has not been explained by  J.K. Rowling , there is some evidence to suggest that it is a reference to their ultimate goal of preventing death and achieving immortality. [2] [3] \n Death Eaters recognise one another by the  Dark Mark  on their left forearm, a sign created by Voldemort to summon him instantly to them or vice versa. Their typical attire includes black hooded robes and masks. The Death Eaters, as a group, first appeared in the novel  Harry Potter and the Goblet of Fire , although individual members of the group, such as  Lucius Malfoy ,  Peter Pettigrew , and  Severus Snape , had appeared in earlier books in the series. \n Contents \n 1   Synopsis \n 1.1   Pre-Harry Potter \n 1.2   Re-emergence \n 1.3   Ideology \n 1.4   Death Eaters and their crimes \n 2   Death Eaters \n 2.1   Alecto and Amycus Carrow \n 2.2   Barty Crouch Jr. \n 2.3   Antonin Dolohov \n 2.4   Fenrir Greyback \n 2.5   Igor Karkaroff \n 2.6   Bellatrix Lestrange \n 2.7   Draco Malfoy \n 2.8   Lucius Malfoy \n 2.9   Peter Pettigrew \n 2.10   Severus Snape \n 2.11   Corban Yaxley \n 3   References \n 4   External links \n Synopsis [ edit ] \n Death Eaters are wizards and witches led by Lord Voldemort. Among those closest to him are Lucius Malfoy and Bellatrix Lestrange. Death Eaters have a Dark Mark on their forearm, that Voldemort can use to summon all of them. Voldemort's failed attempt to kill the one-year-old Harry Potter resulted in the dark wizard's near-death, and the loss of much of his powers and the vitality of his physical body. When he regained a fully vital physical body at the end of  Goblet of Fire , he was angered that no Death Eater had come looking for him. \n Pre-Harry Potter [ edit ] \n The Death Eaters first existed 11 years before the events of the books, torturing and murdering Muggles (non-magical humans) as well as anyone who opposed them. They also did this to people who were blood traitors (wizards and witches who favoured the Muggles and Muggle-born). Around 10 years after the Death Eaters first surfaced, a Seer named  Sybill Trelawney  made a prophecy about a boy who would have the power to defeat Voldemort forever. The prophecy could have referred to two different boys, Harry Potter or  Neville Longbottom ; however, Voldemort chose Harry as said in the prophecy, that \"the Dark Lord would mark him as his equal\". As Voldemort was a half-blood, he chose his \"equal\", Harry, whose mother was a Muggle-born witch, instead of Neville, who came from a long line of pure-blooded wizards. Acting on information from  James  and  Lily Potter 's Secret-Keeper  Peter Pettigrew , Voldemort attempted to complete the prophecy and kill his infant rival. Due to Harry's mother's sacrifice to save her son, Voldemort's deadly curse rebounded off Harry and disembodied Voldemort. \n With Voldemort vanquished after failing to kill Harry, the Death Eaters largely disbanded. The Ministry rounded many of them up and imprisoned them in the Wizarding prison  Azkaban , but some eluded justice by claiming they were bewitched by the  Imperius Curse  (it is implied that Lucius Malfoy did so) or by turning in other Death Eaters, as  Igor Karkaroff  did; Harry witnesses Karkaroff's testimony against former Death Eaters in  Albus Dumbledore 's  Pensieve  during the course of the series. It appears that very few Death Eaters stood for their fallen master and proudly went to Azkaban for him (like  Bellatrix Lestrange ), since, in the sixth book, Snape states that if Voldemort had refused to welcome back all those who turned their backs on him when he fell, then he would have very few followers. The Lestranges are the only Death Eaters known to have willingly sacrificed their freedom for Voldemort. This is something that does not go unnoticed by him, as he claims, when he returns, that they will be recompensed for their loyalty. \n Re-emergence [ edit ] \n Early in  Harry Potter and the Goblet of Fire  a group of Death Eaters rallies after the  Quidditch World Cup . They gather to form a large spectacle and disturbance which spreads instant chaos and fear amongst the wizarding community. Their appearance alone creates hysteria, and their numbers grow while they torture muggles and muggle borns on site. It concludes when the Dark Mark is produced in the sky by Barty Crouch Jr, frightening Death Eaters and Ministry officials alike. \n Voldemort, having regained his full strength at the end of  Harry Potter and the Goblet of Fire , summoned his followers to him by touching Peter Pettigrew's Dark Mark. Except for Severus Snape (staying at Hogwarts to \"maintain his cover\"), those dead, imprisoned, or afraid to return, the majority returned to his service as Voldemort began his second attempt to claim power. \n Voldemort states at his rebirth, \"And here we have six missing Death Eaters...three dead in my service. One, too cowardly to return...he will pay. One, who I believe has left me forever...he will be killed, of course...and one, who remains my most faithful servant, and who has already reentered my service.\" Based on later happenings in the books, it can be deduced that the one \"too cowardly to return\" is Igor Karkaroff. The one \"who I believe has left me forever\" is Severus Snape, who returns two hours later to explain his absence and convince Voldemort that he is a spy for him. The \"most faithful servant\" is Barty Crouch Jr., who has already been in place at Hogwarts working for Voldemort. The three dead are Evan Rosier, Wilkes and possibly Reglus Black (as Voldemort never knew of his defection). \n The Minister for Magic ( Cornelius Fudge ) deluded himself into believing that Voldemort could not have come back and that it was all a lie cooked up by Dumbledore, who Fudge believed had designs on his political office. The Death Eaters use this tactical advantage throughout  Harry Potter and the Order of the Phoenix  to maintain their secrecy. Because of the Ministry's refusal to remove the  Dementors  from Azkaban, which Dumbledore advised immediately following Voldemort's return, the Death Eaters recruited the Dementors to their cause and made similar progress with the giants; the Dementors' revolt against the Ministry of Magic also allowed the Death Eaters to bolster their ranks with the mass break-out of several imprisoned Death Eaters, including Bellatrix. \n In  Harry Potter and the Order of the Phoenix , Voldemort sent a group of twelve Death Eaters, led by  Lucius Malfoy , into the Department of Mysteries, where he expected them to secure a prophecy of vital importance to him: having originally attacked Harry based upon a partial recounting of it, he now wanted to hear the full version to better, or even fully, understand the connection between Harry and himself. The raid on the Department failed, however; Harry and his friends delayed the Death Eaters and kept the prophecy out of their hands, finally destroying it, and were eventually aided by Dumbledore and the Order of the Phoenix. Dumbledore captured eleven of the twelve Death Eaters, sending Voldemort and Bellatrix fleeing after a fierce duel with the former, and ending the Death Eaters' enjoyed secrecy. Lucius, who had been important both to the Death Eaters and within the Ministry, was captured and imprisoned. However, the Death Eaters regrouped, assassinating and kidnapping important wizards, killing  Muggles , and in general spreading terror and chaos through the Wizarding world. Soon after Lucius' capture, his son Draco is made a Death Eater, and given the task of killing Dumbledore, although this task is eventually performed by Snape. \n Towards the end of  Harry Potter and the Half-Blood Prince , the Death Eaters attacked Hogwarts for the first time, leading to the death of Dumbledore and injuries to several of the school's defenders. A second, more deadly attack near the conclusion of  Harry Potter and the Deathly Hallows  resulted in over 50 deaths, including Voldemort, who died when the Killing Curse he threw at Harry rebounded on him. Voldemort's death signalled the end of the Death Eaters. \n Ideology [ edit ] \n Voldemort's Death Eaters practise illegal and dangerous spells known as dark magic. Their ideology is of racial supremacy. They believe wizards are, as a genealogy book within the story phrases it, \"Nature's Nobility\"; other magical creatures and the non-magical are inferior and should be subjugated. Within the wizarding community, only those who are born to wizard parents are worthy of magical power, despite the fact that parentage does not in fact determine who possess such powers. They categorise wizards according to  blood purity ; \"pure bloods\", or wizard borns, out-rank \"half-bloods\" (mixed parentage) and \"mudbloods\", a derogatory name for those born to non-magical parents (muggles); though mostly they seek complete power and control over the entire Wizarding world, wishing to restrict leadership to a small band of pure-bloods. The Death Eaters not only seek the restoration of pure-blood rule over the Wizarding community, but also the eventual subjugation of the Muggle community under Wizarding rule. \n In reality, the idea of blood purity is a misnomer – Voldemort himself is a  half-blood  – and it is unlikely that all of them could be pure-bloods, as very few, if any, such people could exist given the small gene pool. (In the second movie, Hagrid observes in the course of explaining the term \"mudblood\" to Harry, Ron, and Hermione that the very concept of pure-bloods is \" ... codswallop, to boot. 'Dirty blood!' Why, there isn't a wizard alive today that's not half-blood or less.\" [4] ) In  Half-Blood Prince , Rowling depicts the Gaunts as a family who are obsessed with their ancestry and driven to inbreeding to preserve its integrity. Rowling has stated on her website that there are no true pure-blood families left but that those who call themselves such simply strike Muggles,  Squibs , and half-bloods from their family records. \n The Death Eaters have also attacked pure-bloods who oppose them. Examples of this are pure-blooded members of the Order of the Phoenix such as  Sirius Black , the Prewett brothers, who were murdered because of their loyalties, and the entire Weasley family. Such people are often called \"blood traitors\" by those who subscribe to Death Eater ideologies. On the other hand, Rowling has said that a Muggle-born wizard can become a Death Eater \"in rare circumstances\". [5]  They are also not above recruiting creatures they deem inferior, as proven by  werewolf   Fenrir Greyback  and the  giant  clan from continental Europe, as long as they help further the larger Death Eater agenda. \n Death Eaters and their crimes [ edit ] \n The following characters are Death Eaters identified by name during the series, and the crimes they committed. \n Character \n Background and known crimes \n Avery \n A Death Eater named Avery claimed to have been under the Imperius Curse to avoid prison. Voldemort tortured him during his rebirth ritual. He participated in the break-in at the  Department of Mysteries , and later escaped Azkaban. He also wrongly told Voldemort that anyone could take the prophecy from the Department of Mysteries, while in fact only those concerned (i. e. Harry Potter and Voldemort) could do it. This once again causes him to be punished by Voldemort. Note: there are two different men named Avery in the books, presumably relatives such as father and son. One was a co-student and friend of Tom Riddle (this Avery was threatened by Slughorn with detention), and another was much later a co-student and friend of Severus Snape (this Avery was mentioned by Lily Evans). Either or both would become Death Eaters. \n Alecto and \nAmycus Carrow \n Brother and sister. Assaulted people within Hogwarts. Tortured students while teaching at Hogwarts. Also were on the top of the tower when Dumbledore was killed. Defeated before the Battle of Hogwarts by Harry Potter and Minerva McGonagall. \n Crabbe Sr. \n Vincent Crabbe 's father. Was not surprised when he found out that Crabbe had used a FiendFyre spell on himself. Cheered at Crabbes funeral. Present at Voldemort's rebirth. Participated in the break-in at the  Department of Mysteries , and later escaped Azkaban. \n Barty Crouch Jr. \n Participated in the torture and the permanent incapacitation of  Frank and Alice Longbottom  using the  Cruciatus Curse . Escaped Azkaban after the latter crime. Delivered Harry Potter to Voldemort. Impersonated  Alastor \"Mad-Eye\" Moody  using  Polyjuice Potion . Murdered his father,  Barty Crouch Senior . Stunned  Fleur Delacour  and performed the Imperius Curse on  Viktor Krum . Was hidden by his father and house elf. Later received the  Dementor's Kiss . \n Antonin Dolohov \n Could be one of Voldemort's earliest supporters (if not his father might have been). Helped murder  Gideon and Fabian Prewett . Tortured countless  Muggles  and non-supporters of Voldemort. Escaped prison fourteen years later to rejoin Voldemort. Seriously injured  Hermione Granger  and  Alastor Moody  with unknown curses in the break-in at the  Department of Mysteries , and later escaped Azkaban. Attacked Harry, Ron, and Hermione in Tottenham Court Road with Thorfinn Rowle, but failed to harm them. Killed  Remus Lupin  during the Battle of Hogwarts. [6]  Later defeated by Flitwick. \n Gibbon \n Assaulted people within Hogwarts. He fired the dark mark into the sky the night Dumbledore is killed. Accidentally killed by fellow Death Eater Thorfinn Rowle. \n Goyle Sr. \n Gregory Goyle 's father. Present at Voldemort's rebirth. \n Fenrir Greyback \n Known as the most savage werewolf, favoured hunting and attacking young children. Seriously maimed  Bill Weasley  and  Lavender Brown . Part of the Snatcher Gang that captured Harry, Ron, and Hermione. Participated in the Battle of Hogwarts where he is knocked down by Professor Trelawney, who drops a crystal ball on his head from the top of a tower. Later he is brought down by Ron Weasley and Neville Longbottom. Was responsible for turning Remus Lupin into a werewolf. \n Jugson \n Participated at the battle in the Department of Mysteries and later escaped Azkaban. \n Igor Karkaroff \n Captured and imprisoned in Azkaban. Later released for providing information on fellow Death Eaters, including Barty Crouch Jr. Became Headmaster of Durmstrang. After Voldemort's rebirth went into hiding but was later found murdered. \n Bellatrix Lestrange \n Voldemort's most fanatically devoted servant. Participated in the torture and the permanent incapacitation of  Frank and Alice Longbottom  using the  Cruciatus Curse . Escaped prison fourteen years later to rejoin Voldemort. Tortured Neville Longbottom, seriously injured  Nymphadora Tonks , and murdered  Sirius Black  in the break-in at the Department of Mysteries. Tortured Hermione Granger and  Griphook , and murdered  Dobby  at Malfoy Manor. Murdered Tonks and attempted to murder  Ginny Weasley  while duelling her, Hermione and Luna during the Battle of Hogwarts. [6]  Subsequently, killed by  Molly Weasley . \n Rodolphus and \nRabastan Lestrange \n Brothers. Participated in the torture and the permanent incapacitation of Frank and Alice Longbottom using the Cruciatus Curse. Escaped prison fourteen years later to rejoin Voldemort. Participated in the break-in at the Department of Mysteries, and again escaped from Azkaban. Rodolphus Lestrange is the husband of Bellatrix Lestrange. In the Riddle era, there is said to be another Lestrange among Voldemort's earlier supporters, who may be their father. \n Walden Macnair \n Employed as an executioner for the Committee for the Disposal of Dangerous Creatures; attempted to execute  Buckbeak  but failed as the hippogriff was freed. Present at Voldemort's rebirth. Persuaded the giants to join forces with the Death Eaters. Participated at the break-in at the Department of Mysteries, and later escaped Azkaban after the latter crime. Also participated at the Battle of Hogwarts. He was thrown across the room by Hagrid, leaving him unconscious. \n Draco Malfoy \n Draco was a true traitor. He lost his wand to Harry and begged to join the death eaters. Carried out two failed assassination attempts on  Albus Dumbledore ; unintentionally poisoning  Ron Weasley  with mead and gravely injuring  Katie Bell  with a cursed necklace. Provided the means for Death Eaters to enter Hogwarts. Imperioused Madam Rosmerta. Tortured fellow Death Eater Thorfinn Rowle on Voldemort's orders. Participated at the Battle of Hogwarts. He is played by  Tom Felton  in the Harry Potter movies. In the epilogue he is shown to have married Astoria Greengrass, with one son, Scorpius Malfoy. \n Lucius Malfoy \n For some time, one of the most influential Death Eaters. Gave  Voldemort's school diary  to  Ginny Weasley . Threatened school governors. Attempted to attack Harry Potter after losing his house-elf,  Dobby . Tortured a Muggle family and participated in a violent rampage at the Quidditch World Cup. Present for Voldemort's rebirth. Placed Order of the Phoenix member  Sturgis Podmore  and Department of Mysteries employee  Broderick Bode  under the Imperius Curse to attempt to capture the prophecy for his master. Headed the operation in the Department of Mysteries, and later escaped Azkaban after the latter crime. Numerous counts of bribery. Father of Draco Malfoy. Husband of  Narcissa Malfoy . \n Mulciber \n Specialised in the Imperius Curse. Escaped Azkaban fourteen years later to rejoin Voldemort. Participated in the break-in at the  Department of Mysteries , and again escaped from Azkaban. Also performed a dangerous hex on Mary McDonald while at Hogwarts. Like Avery there are two with the same name, one in Riddle's era and the other who is a friend of Severus Snape, mention by Lily Evens and could be father and son. \n Nott Sr. \n Theodore Nott's father. Rowling mentions on her website that he is an elderly widower. [7]  One of Voldemort's earlier supporters, Present at Voldemort's rebirth. Participated in the break-in at the Department of Mysteries, and later escaped Azkaban. \n Peter Pettigrew \n He is an unregistered Animagus and can turn into a rat. This rat was Ron's pet (named Scabbers), until  Prisoner of Azkaban,  when his true identity was revealed. Spied on the Order of the Phoenix for Voldemort. Betrayed the Potters as their Secret-Keeper. Framed  Sirius Black  for the betrayal and death of James and Lily Potter. Murdered twelve Muggles in the process of faking his own death and cutting off of his finger. Murdered  Cedric Diggory . Assisted Voldemort in creating a new body, voluntarily amputating his right hand in the process; and was gifted a magical silver hand in return by Voldemort. Was killed by said magically crafted hand when he acknowledged a life debt to Harry by hesitating to murder him in  Deathly Hallows. \n Augustus Rookwood \n A former Unspeakable that acted as though he was aiding the anti-Voldemort cause, but was revealed as a double agent, gaining information from  Ludo Bagman  and other unwitting agents throughout the Ministry. Escaped prison fourteen years later to rejoin Voldemort. Informed his master that Avery's information about  Bode  being able to steal the prophecy is incorrect. Participated in the break-in at the Department of Mysteries, and later escaped from Azkaban. Participated in the Battle of Hogwarts, his explosion was what killed Fred Weasley and is finally stunned by  Aberforth Dumbledore . \n Evan Rosier \n Destroyed part of Alastor Moody's nose during a fight with Aurors. Killed in the fight. In the Riddle era there is another Rosier mentioned who may be his father. \n Thorfinn Rowle \n Assaulted people within Hogwarts and accidentally killed the Death Eater Gibbon. Attacked Harry, Ron and Hermione in Tottenham Court Road, with Antonin Dolohov. Participated at the Battle of Hogwarts. \n Scabior \n At some point in his life Scabior was imprisoned in Azkaban for undisclosed crimes, but was released sometime prior or following Voldemort's infiltration of the Ministry of Magic. Part of the Snatcher gang that caught and returned Hermione, Harry, and Ron to Malfoy Mansion. Was a Slytherin. \n Selwyn \n Attacked  Rubeus Hagrid  and Harry Potter over the  Dursleys'  house (possibly killed Hedwig). Tortured  Xenophilius Lovegood . \n Severus Snape \n Gave Voldemort information about  Sybill Trelawney 's prophecy, which led to the deaths of James and Lily Potter. Killed Dumbledore on the astronomy tower in  Half Blood Prince , although it is later revealed that Dumbledore was dying and had asked Snape to kill him. Was killed by  Nagini , Voldemort's pet snake and a Horcrux. He and Lily Evans were childhood friends until they grew apart as teenagers. Despite having Voldemort's favour and trust, his unrequited and unconditional love for Lily was such that it caused him to betray Voldemort and become a double agent after Voldemort killed her. Even after her death, he always loved Lily. His dying memory contained the order from Dumbledore to let Voldemort kill Harry to destroy the horcrux residing inside him. \n Travers \n Helped murder the McKinnons. Escaped prison fourteen years later to rejoin Voldemort. Tortured Xenophilius Lovegood. Accompanied Hermione, who was disguised as Bellatrix, to Gringotts. Also participated at the Battle of Hogwarts. Presumably one of those who assaulted persons within Hogwarts, as he was arrested again sometime after the break-out of Azkaban \n Wilkes \n Killed by Aurors during the first Wizarding War. \n Corban Yaxley \n Assaulted people within Hogwarts. Placed Imperius Curse on  Pius Thicknesse . Head of Department of Magical Law Enforcement. Also participated at the Battle of Hogwarts. Later defeated by  Lee Jordan  and  George Weasley . \n Death Eaters [ edit ] \n Alecto and Amycus Carrow [ edit ] \n Alecto  and  Amycus Carrow  are siblings who participate in the assault on Hogwarts at the end of  Harry Potter and the Half-Blood Prince . Amycus is described as being squat and lumpy, with a lopsided leer and a wheezy giggle; Alecto is described as a \"stocky little woman\" and shares her brother's squatness and laugh. It is said that after Voldemort's first downfall, they believed that he was gone forever. [8] \n In  Harry Potter and the Deathly Hallows , Alecto and Amycus become \"teachers\" at Hogwarts, severely disciplining students who oppose Voldemort. Amycus teaches  Defence Against the Dark Arts , but as  Neville Longbottom  puts it, it becomes just \" The Dark Arts \" in which students are forced to perform the  Cruciatus Curse  against students who have been assigned to detention. Alecto teaches  Muggle Studies , which becomes a compulsory subject, and teaches students that  Muggles  are like animals. Right before the Battle of Hogwarts, Alecto waits in Ravenclaw Tower on Voldemort's orders, preparing to capture Harry, but is stunned by  Luna Lovegood  after touching her Dark Mark to summon Voldemort. Amycus, after seeing what happened, tries to conspire with  Minerva McGonagall  who helped him into the room to offer some Ravenclaw students as sacrifices to Voldemort while planning to use the lie that Ravenclaws had ambushed Alecto and forced her to press her Dark Mark. McGonagall refuses and argues with Amycus, who spits in her face. Enraged at this, Harry casts the Cruciatus Curse, with such power that Amycus passes out. Later, McGonagall places the Imperius Curse on him, then binds him with his sister and places him inside a net. \n Ralph Ineson  plays Amycus, and  Suzie Toase  appears as Alecto. \n Barty Crouch Jr. [ edit ] \n Bartemius \"Barty\" Crouch Jr.  was the main antagonist of  Harry Potter and the Goblet of Fire . He and  the Lestranges  tortured Frank and Alice Longbottom, parents of  Neville Longbottom , into insanity. His father,  Barty Crouch Sr. , who headed the Department of Magical Law Enforcement at the time, sentenced him to life imprisonment in  Azkaban . However, he later rescues his son as a favour to his dying wife. When they visit him in Azkaban, Mrs. Crouch used Polyjuice Potion to switch appearances with her son, enabling him to escape while she remains in his place. When she dies, she is buried under his identity. Crouch Jr. is nursed back to health by  Winky , the family's  house-elf . \n To prevent him from returning to Voldemort's service, Crouch Sr. controls his son with the  Imperius Curse  and keeps him hidden under an  invisibility cloak . When  Bertha Jorkins  discovers the truth, the news reaches Voldemort, who rescues Crouch Jr. and puts Crouch Sr. under the Imperius Curse. Crouch Jr. then imprisons  Alastor \"Mad-Eye\" Moody , a famous auror, and using Polyjuice Potion, assumes Moody's appearance and position to infiltrate Hogwarts as the new Defence Against the Dark Arts teacher. Despite not being a real teacher, Crouch Jr. does a fair job and the class learns vast amounts from him. Crouch Sr. escapes and, exhausted and delirious from the Imperius Curse, reaches Hogwarts to tell Dumbledore about Voldemort's return; but his loyal Death-Eater son murders him on the castle grounds, transfigures the body into a bone, and buries the bone in freshly turned earth in front of Hagrid's cabin. [9] \n The revived Triwizard Tournament is held at Hogwarts, and Voldemort tasks Crouch Jr. with making sure Harry wins. To do so, he bewitches  Viktor Krum  to attack  Cedric Diggory  in the maze and to stun  Fleur Delacour . When Harry and Cedric simultaneously touch the Triwizard Cup, which is a  portkey , it transports them to the graveyard in Little Hangleton, home of the Riddle family. There, after killing Cedric,  Death Eater Peter Pettigrew  uses Harry's blood in a ritual that re-embodies Voldemort. The Dark Lord attempts to kill Harry, but with the help of the ghost-echoes from Voldemort's wand, Harry escapes via the Portkey. \n When Harry reappears at Hogwarts, the still-disguised Crouch Jr. hopes to succeed where his master failed; but Dumbledore, Snape, and McGonagall foil his plot. Under the effects of  Veritaserum , he recounts his plan to them. Although he is closely guarded so he can later repeat his testimony, a  Dementor  acting as bodyguard to Minister of Magic  Cornelius Fudge  attacks Crouch and sucks out his soul before anyone can stop it. Crouch lives bereft of his memories or sense of self. \n In the film adaptation of  Harry Potter and the Goblet of Fire , Barty is played in his normal form by  David Tennant  and in his Moody form by  Brendan Gleeson . \n Antonin Dolohov [ edit ] \n Antonin Dolohov  has a long, pale, and twisted face, with a name that suggests he is of a Slavic nationality. He is confirmed in  Harry Potter and the Half-Blood Prince  to be one of Voldemort's first Death Eaters, being present at the Hog's Head when Voldemort comes to Hogwarts to request a teaching position and hide the  diadem   Horcrux , c. 1956. This makes him at least sixty years old at the time of the battle in the Department of Mysteries. Dolohov is one of the five Death Eaters who murder  Gideon and Fabian Prewett  ( Molly Weasley 's brothers). He also tortures many  Muggles  and opponents of Voldemort during the first war. Dolohov is imprisoned in Azkaban but escapes during the mass break-out. \n He participates in the battle of the  Department of Mysteries , where he causes injury to Hermione, but is imprisoned again, and returns to  Azkaban  prison. He escapes once more some time before the events of  Harry Potter and the Deathly Hallows . He tracks Harry, Ron, and Hermione to a Muggle cafe after they use Voldemort's name (which had recently been made taboo). He and his companion Rowle are stunned, and have their memories erased by Hermione and then are punished by Voldemort. Dolohov participates in the Battle of Hogwarts, killing  Remus Lupin , [6]  whom  Aberforth Dumbledore  last sees fighting with him. He is also seen dueling with  Dean Thomas  until  Parvati Patil  uses the Body-bind Curse on him. Dolohov and Yaxley are later sent to look for Harry, and they mistakenly thought the boy would not give himself up. When the battle recommences,  Professor Flitwick  finally defeats him. \n He is portrayed by  Arben Bajraktaraj  in the film adaptations of  Harry Potter and the Order of the Phoenix  and  Harry Potter and the Deathly Hallows – Part 1 . \n Fenrir Greyback [ edit ] \n Fenrir Greyback  is a  werewolf  who is involved with the Death Eaters. When attempting to recruit fellow werewolves, he claims Lord Voldemort promises fairness to werewolves around the country, but this is almost certainly a lie because Lord Voldemort is known to regard werewolves as no better than \"half-blood\" wizards. In fact, Greyback supports Lord Voldemort simply for the chance to attack more victims. He does not carry the Dark Mark as he is not a Death Eater, presumably because of his werewolf status. [10]  He is known as the most savage werewolf ever to live and is greatly feared throughout the wizarding world. He positions himself close to his victims when the moon is almost full. To fulfil his agenda of creating as many werewolves as possible, Greyback has infected scores of people including the young  Remus Lupin , when Lupin's father had angered Greyback. Greyback is known for targeting young children. Unlike most werewolves, Greyback thirsts for blood even in his human form. In  Harry Potter and the Half-Blood Prince , Greyback first appears on the night of Dumbledore's death, when he attacks Harry and badly scars  Bill Weasley . Although Greyback does not transmit his  lycanthropy  because he was in human form at the time, Bill is subsequently shown to display a preference for very  rare meat . \n In  Harry Potter and the Deathly Hallows , Greyback leads a Snatcher gang – Dark wizards looking for  Muggle-borns  and \"Undesirables\" in exchange for gold. When Harry accidentally uses Voldemort's name after it has been made taboo, Greyback is alerted and his gang attacks their camp. Harry, Ron, and Hermione are kidnapped by the Snatchers and are taken to  Malfoy Manor .  Bellatrix Lestrange  promises Hermione to Greyback in return for his services, but the prisoners fight their way out and escape, Greyback being hit by a triple Stunning Spell. Greyback is the main werewolf within the pack that agrees to aid Voldemort in the Battle of Hogwarts. During the battle, Hermione, using a blasting curse, prevents Greyback from attacking injured  Lavender Brown , and a crystal ball thrown by  Professor Trelawney  stuns him. He rejoins the battle in time for the Death Eaters' last stand, when  Ron Weasley  and  Neville Longbottom  combine forces to take him down by magic. \n Dave Legeno  portrayed Greyback in the film adaptation of  Harry Potter and the Half-Blood Prince . He reprised the role in both parts of  Harry Potter and the Deathly Hallows . \n Fenrir  is the name of a powerful wolf god in Norse mythology. \n Igor Karkaroff [ edit ] \n Igor Karkaroff  ( Cyrillic : Игорь Каркаров) is the Headmaster at  Durmstrang  Institute, one of the three schools (together with Hogwarts and  Beauxbatons  Academy) that enter the Triwizard Tournament. As Headmaster, Karkaroff is also one of the judges. He is described as a neat, fussy-looking man with an oily voice and manner who sports a small grey goatee. While unctuously pleasant most of the time, he is capable of violent rage. He is also described as a man with yellowish teeth whose smile does not reach his cold stare. Karkaroff is angered and threatens to withdraw from the tournament when Harry is selected as a fourth champion and second representative for Hogwarts. [11]  Although he is talked down and agrees to stay, he nevertheless shows evident favouritism towards the Durmstrang champion, Bulgarian  Quidditch  player  Viktor Krum .  Sirius Black  later identifies Karkaroff as a former Death Eater. [12]  Karkaroff was captured by  Auror   Alastor Moody  and imprisoned in  Azkaban . Karkaroff later told the  Ministry of Magic  that he had seen the error of his ways, and \"named names\", putting many people in Azkaban in exchange for his freedom. [13]  Karkaroff is thus also hated by the Death Eaters. Karkaroff's history gives him a connection with  Snape , also a former Death Eater. Karkaroff interrupts a Potions lesson demanding to talk to Snape, and shows him his Dark Mark reappearing. Igor also apparently has an unpleasant history with Alastor Moody, and tries to avoid him unsuccessfully for the entirety of the tournament, not knowing that it is Barty Crouch Jr. in disguise. [14]  At the end of the novel, following Voldemort's return, Karkaroff goes into hiding, leaving behind his student charges at Durmstrang. In the sixth novel,  Harry Potter and the Half-Blood Prince ,  Remus Lupin  states that Karkaroff was found dead in a shack with the Dark Mark hovering over it, an indication that he was killed by other Death Eaters. Lupin also expresses surprise that Karkaroff managed to live even a year after deserting Voldemort and that no one else has been known to avoid capture quite as long. [15] \n Karkaroff was featured in the  film adaptation  of  Harry Potter and the Goblet of Fire  and was portrayed by  Serbian  actor  Predrag Bjelac . \n Bellatrix Lestrange [ edit ] \n Bellatrix Lestrange  is the first female Death Eater introduced in the books. She was introduced in  Harry Potter and the Goblet of Fire . She is the most faithful member of Voldemort's inner circle. [16]  She is described as being highly attractive yet emaciated due to her time in Azkaban. Bellatrix is portrayed as paranoid and fanatically devoted to Voldemort, seeing service to him as the noblest duty for any true wizard or witch. Bellatrix takes an obvious pleasure in acts of torture and cruelty, as demonstrated when she kills her cousin, Sirius Black. She is a witch of prodigious ability, as demonstrated by her many victories in duels against other characters, and as noted by Harry in the final book. [17]  Her wand is  walnut , 12 3/4 inches, dragon heartstring, unyielding and according to  Ollivander  should be treated carefully. \n Bellatrix was born Bellatrix Black to Cygnus Black and Druella Rosier in the year 1951 and has two sisters,  Andromeda  (who was disowned by the family for marrying Muggle-born Ted Tonks, which her Pure-blood family saw as betrayal, therefore she was consequently blasted off the Family Tree) and  Narcissa . She is also a first cousin to  Sirius  and Regulus Black, and an aunt to  Draco Malfoy  and  Nymphadora Tonks . Bellatrix married Rodolphus Lestrange after leaving Hogwarts because it was \"expected of her to marry a pure-blood\". However, the marriage was loveless, and Rowling stated in an interview that Bellatrix's true love was Voldemort. [6]  In  Harry Potter and the Goblet of Fire , Dumbledore's  pensieve  is used as a  plot device  to reveal that Bellatrix, rather than deserting Voldemort after his downfall like many other Death Eaters, was part of the group – along with Barty Crouch Jr, Rodolphus and Rabastan Lestrange – that  tortured  the respected  Aurors   Frank and Alice Longbottom  (Neville Longbottom's parents) in an attempt to gain information about Voldemort's location. [13]  For using the Unforgivable  Cruciatus Curse  to torture the Longbottoms to insanity, Bellatrix and her three associates were sentenced to life imprisonment in Azkaban. During the trial, she said Voldemort would rise again and reward them. When Voldemort has his body renewed, he reflects that the Lestranges went to  Azkaban  rather than renounce him and that they will be deeply rewarded when Azkaban is broken open. \n Several months after her master's resurrection, Bellatrix is one of the many Death Eaters who escapes Azkaban and rejoins him. She is present at the battle of the  Department of Mysteries  in the climax of  Harry Potter and the Order of the Phoenix , in which a group of Death Eaters attempt to steal  Sybill Trelawney 's  prophecy  pertaining to Voldemort's downfall. Rowling demonstrates Bellatrix's ability during the mission when she overpowers her niece Tonks and  Kingsley Shacklebolt  in one-on-one duels, kills her cousin Sirius by blasting him through the veil in the Death Chamber, and deflects one of Dumbledore's spells as she makes her escape. Harry attempts to use the Cruciatus Curse on her in revenge for killing Sirius, but the curse is ineffective due to the lack of real cruelty behind it. Voldemort suddenly appears but moments later, Bellatrix is subdued by Dumbledore in the  Ministry of Magic 's Atrium as he prepares to duel Voldemort. Unable to overcome Dumbledore, Voldemort rescues Bellatrix by  disapparating  with her. \n At the beginning of  Harry Potter and the Half-Blood Prince , Bellatrix attempts to keep Narcissa from confiding Draco's secret mission to Snape at  Spinner's End , and she is furious to learn that Snape already knows about the plan. Rowling used the conversation between Snape and Bellatrix to imply that Voldemort is still furious at Bellatrix's failure in the previous book. [18]  That conversation also suggests that Bellatrix mistrusts Snape not only because of his low birth, but also for many valid questions about his loyalty to the Dark Lord. Snape surprises Bellatrix by replying to each of her arguments and by agreeing to create an  Unbreakable Vow  with Narcissa to assist Draco in his mission to assassinate  Dumbledore . Later in the book, it is mentioned by Snape that Bellatrix had been teaching  Occlumency  to Draco, in an effort to aid him with his mission. In the film, she and Fenrir Greyback arrive at the Burrow (the Weasley house) and burn it down. Harry and Ginny chase after them, with Bellatrix taunting \"I killed Sirius Black!\". In the film, she is one of several Death Eaters smuggled into Hogwarts using a pair of Vanishing Cabinets to assassinate Dumbledore, though she does not take part in this mission in the book. \n The first chapter of  Harry Potter and the Deathly Hallows  implies that Voldemort has yet to forgive Bellatrix for her failure, as he mocks her with the fact that her niece Tonks married werewolf  Remus Lupin . [19]  However, Voldemort gives Bellatrix a chance to \"prune\" her family tree during the Death Eaters' attempt to capture Harry as the boy departs from the  Dursleys ' home; during the attack, Bellatrix devotes much of her energies in efforts to kill Tonks, but is unsuccessful. [20]  In this book, Bellatrix inadvertently reveals she is the guardian of  Helga Hufflepuff 's cup, when the captured Harry, Ron, and Hermione are brought to Malfoy Manor. Bellatrix then tortures Hermione with the Cruciatus Curse, believing them to have sneaked into her vault at Gringotts due to their possession of  Godric Gryffindor's Sword , but  Dobby  appears and saves the prisoners, though not before being hit by a knife thrown by Bellatrix as they disapparate to safety. Later in the book, Harry, Ron, and Hermione use a stray hair of Bellatrix's to disguise Hermione as Bellatrix using Polyjuice Potion, to gain access to the Lestranges' Gringotts vault. Though Voldemort apparently punishes Bellatrix and the Malfoys severely for interrupting his hunt for  Elder Wand  only to have Potter escape and steal the cup, she nevertheless fights for her master in the Battle of Hogwarts towards the end of the novel. Rowling stated in an interview that, during the battle, it was Bellatrix who killed Tonks. [6]  When the battle resumes inside the Great Hall after Harry's supposed death, Bellatrix simultaneously duels with Hermione,  Ginny , and  Luna , proving more than a match for all three, and nearly hits Ginny with a  Killing Curse . An enraged  Molly Weasley  engages Bellatrix and fires a curse that hits Bellatrix right over the heart, killing her. [21]  Rowling has stated that she had Molly kill Bellatrix to show Molly's great powers as a witch and to confront Molly's consumption with \"maternal love\" and Bellatrix's obsession with Voldemort. [22] \n In the two-part play  Harry Potter and the Cursed Child , it is revealed that Bellatrix and Voldemort had a child together during their stay at Malfoy Manor. The child, named Delphini, would later attempt to change the course of history and prevent her father from losing his powers on the night he attempted to murder Harry. \n In the film series, Bellatrix is played by  Helena Bonham Carter .  Helen McCrory  auditioned for the role in  the fifth film  but dropped out due to pregnancy, making Bonham Carter win the role. McCrory was cast as her sister Narcissa Malfoy in the final three films instead. [23] \n IGN  listed Bellatrix Lestrange as their tenth top  Harry Potter  character, and IGN's Joe Utichi listed Bellatrix as his fourth favourite  Harry Potter  character, calling her the \"most pitiable\" of Voldemort's servants. [24] [25]  In NextMovie.com's  Harry Potter  Mega Poll, Bellatrix was voted as the No. 1 villain in the series. [26]  Novelist  Stephen King  notes that Bellatrix being called a \"bitch\" by Molly after she tries to kill Ginny was \"the most shocking  bitch  in recent fiction\", and that it shows how adult the books had become. [27] \n Draco Malfoy [ edit ] \n Main article:  Draco Malfoy \n Lucius Malfoy [ edit ] \n Lucius Malfoy  is a senior Death Eater and patriarch of a pure-blood Wizarding family; he lives with his wife  Narcissa Malfoy  (née Black) and their son  Draco  at the  Malfoy Manor  in Wiltshire. Lucius is a  school governor  of Hogwarts before he is sacked, and has very close connections at the  Ministry of Magic . To maintain his reputation and influence, he makes donations to the Ministry, to charity, and to  St Mungo's Hospital . He was educated at Hogwarts, where he was a prefect in Slytherin House. \n In  Harry Potter and the Chamber of Secrets , just before Draco and Harry's second year at Hogwarts, Lucius plants  Tom Riddle's diary  in  Ginny Weasley 's  potions  cauldron while she is shopping for school supplies at  Flourish & Blotts , in a plot to use her to reopen the  Chamber of Secrets , which would lead to attacks on  Muggle-born  students. Lucius knows the diary is cleverly enchanted, but is not aware that it is a  horcrux  containing a part of Voldemort's soul. He is careless with it and is later punished by Voldemort himself. Lucius intends to use the opening of the Chamber of Secrets by Ginny to discredit her father,  Arthur Weasley , and Dumbledore. Lucius' plans are ultimately thwarted with the help of the Malfoys'  house-elf  Dobby, and Harry, but not before the Chamber is opened and Lucius uses the ensuing terror (and threats to attack their families) to influence the school's Board of Governors to discredit and dismiss Dumbledore as Headmaster. Subsequently, Harry tricks Lucius into setting Dobby free. Upon this, Lucius attempts to attack Harry with his wand but Dobby disarms him before he can do any harm. Lucius is ultimately stripped of his title as a Hogwarts school governor. Despite his sacking, he still maintains strong ties with the Ministry of Magic. \n Lucius next appears in the beginning of  Harry Potter and the Goblet of Fire  during the  Quidditch  World Cup, sharing prime seats in the Top Box with Minister for Magic  Cornelius Fudge . Lucius was a faithful servant to Voldemort, and was one of the Death Eaters to suspend a muggle family of four sixty feet in the air. However, when Barty Crouch Jr. cast the Dark Mark into the sky later that night, he fled, as did most, Death Eaters and the people who only came to see the match alike. Later in that book, when Voldemort rises again and summons his Death Eaters, Malfoy rejoins him, claiming that he had done everything he could all along to find Voldemort and help him rise again (though Voldemort knows he is lying). Harry, who witnesses Malfoy's declaration of loyalty to Voldemort, tells Minister Fudge, who refuses to believe him, and the wealthy Malfoy continues to maintain strong ties with the Ministry. [28]  During the climax of  Harry Potter and the Order of the Phoenix , Malfoy is the leader of the Death Eaters who are sent to retrieve the prophecy from Harry in the Hall of Prophecy. Lucius tries several ways to get the prophecy from Harry without breaking it, but the boy and his friends manage to escape from the Hall. Malfoy finally meets him in the Death Chamber, where Harry is about to give it to Malfoy when the  Order of the Phoenix  breaks into the Ministry and begins to duel with the Death Eaters. Dumbledore himself arrives at the end of the battle and Malfoy is captured and sent to Azkaban. \n By the final book, Voldemort has given Malfoy his freedom, though he looks significantly the worse for wear, having lost Voldemort's favour. Voldemort treats him with great contempt by hijacking his house for Headquarters, and is forcing his son to do dark deeds against his nature, sparking sympathy for the notorious family for the first time in the series. Voldemort also borrows Lucius's wand which is accidentally destroyed by Harry Potter. Later in the book, Lucius, along with his wife and sister-in-law, accidentally allow Harry and his friends to escape from Malfoy Manor. Voldemort punishes them severely, eventually putting them under house arrest. Despite his long-standing position as a Death Eater and Voldemort's advocate of pure-blood supremacy, Lucius has decided his love for his family is more important than his involvement in the war. During the Battle of Hogwarts, he pleads with Voldemort to let him onto the battlefield to locate his son. He and the rest of his family are reunited at the end of the book. Following Voldemort's death, Lucius, Narcissa, and Draco all manage to \" weasel their way out \" of being sent to Azkaban due to Narcissa's aiding Harry in the  Forbidden Forest . [6] \n According to  Forbes  magazine, in 2006, Lucius Malfoy was number 12 on their  Forbes Fictional 15  list. [29] \n In the film series, Lucius is portrayed by  Jason Isaacs  as an adult. Scenes with Tony Coburn as a teenage Lucius were cut from the final movie. [30] \n IGN listed Lucius as their fifteenth top  Harry Potter  character, praising Jason Isaacs's portrayal of him. [24] \n Peter Pettigrew [ edit ] \n Peter Pettigrew , nicknamed  Wormtail , is the only Death Eater known to have been in a House other than Slytherin (Gryffindor) while at Hogwarts. There, he was a close friend of  Sirius Black ,  James Potter , and  Remus Lupin , although he was the least intelligent and least talented of the group. With Sirius and James' help, Pettigrew becomes an  Animagus , with the ability to transform at will into a  rat . After leaving Hogwarts, Pettigrew joins forces with Voldemort, and in exchange for his own life becomes Voldemort's spy within the Order of the Phoenix, of which Pettigrew is a member. When the Potters know that their son, Harry, is Voldemort's target, Sirius suggests to them to use Pettigrew as Secret-Keeper because he does not believe Voldemort would ever suspect a \"weak, talentless thing\" like Pettigrew. Pettigrew betrays the secret to Voldemort, an act that leads to James and Lily's death (and ironically, Voldemort's near-destruction). Sirius seeks revenge on Pettigrew, but during the confrontation, Pettigrew publicly accuses Sirius of the Potters' deaths, murders twelve Muggles, and cuts off his own index finger before transforming into a rat, thereby framing Sirius for the betrayal of the Potters, as well as for his own murder and that of the bystanders. Pettigrew is \"posthumously\" awarded the Order of Merlin, and hides during the next twelve years. Wanting to keep an eye on the wizarding world, he masquerades as a rat, first as  Percy Weasley 's pet, and then as  Ron Weasley 's. In this form (named \"Scabbers\" by the family), he is missing a toe from one paw due to the finger he cut off. \n Although Pettigrew appears in the first two books in the form of Scabbers, his identity is not revealed until  Prisoner of Azkaban . When a photograph of the Weasley family appears in the  Daily Prophet  newspaper, Sirius recognises Pettigrew's Animagus form and escapes from Azkaban to track him down. The two confront each other in the  Shrieking Shack , where Lupin and Black compel \"Scabbers\" to resume his human form. Pettigrew confesses his treachery, claiming to have committed it only to save his own life. With Sirius and Lupin about to take their revenge, Harry begs Sirius to turn Pettigrew over to the Ministry of Magic instead, to prove Sirius' innocence. Pettigrew escapes while being led out of the Shack when Lupin transforms into a werewolf. Harry's actions result in Pettigrew owing him a  life debt . \n Pettigrew returns to the service of Voldemort, seeking him out in the forests of  Albania  and helping him to return to a feeble baby's body. He abducts a Ministry of Magic employee named  Bertha Jorkins , who is able to provide Voldemort with valuable information. Pettigrew (almost always referred to as \"Wormtail\" hereafter) assists  Barty Crouch Jr.  in overpowering  Mad-Eye Moody , setting up the events in the fourth book,  Harry Potter and the Goblet of Fire . In the climactic confrontation in that book, Wormtail murders  Cedric Diggory  on Voldemort's orders, and brews the complex potion to regenerate Voldemort, severing his hand as one of the ingredients. Upon his return to corporeal form, Voldemort replaces Wormtail's missing hand with a silver one that possesses five intact fingers and great strength. Despite his actions, Wormtail's fortunes remain low; in  Harry Potter and the Half-Blood Prince  Snape treats him as a servant, and in  Harry Potter and the Deathly Hallows  he is tasked with keeping watch over prisoners in the cellar of Malfoy Manor. While Harry and Ron are being kept there, Wormtail checks on the prisoners and is attacked. Wormtail begins strangling Harry with the silver hand, but when reminded by Harry that he once saved his life, Wormtail hesitates for a moment. The silver hand turns against him and strangles him to death as punishment for his moment of pity. \n Pettigrew is portrayed by  Timothy Spall  as an adult, and by  Charles Hughes  as a teenager in the films. In  Harry Potter and the Deathly Hallows – Part 1 , Pettigrew is not strangled to death by his own silver hand in Malfoy Manor as in the book; he is instead struck by Dobby and collapses. It is unknown whether he was simply stunned or killed. He only appears in a  flashback  in  Harry Potter and the Deathly Hallows – Part 2 , and it could also be implied he was killed by Voldemort off-screen. \n IGN's Joe Utichi also listed him as his 10th top  Harry Potter  character. [25] \n Severus Snape [ edit ] \n Main article:  Severus Snape \n Severus Snape  is, as revealed in  Harry Potter and the Deathly Hallows , actually now a spy in Voldemort's ranks for Dumbledore. He is characterised as a person of considerable complexity, whose coldly sarcastic and controlled exterior conceals deep emotions and anguish. In the first novel of the series, Snape is a teacher who is hostile from the start toward  Harry  and is built up to be the primary  antagonist  until the final chapters. As the series progresses, Snape's portrayal evolves from that of a malicious and partisan teacher to that of a complex, pivotal character of moral ambiguity, whose true loyalties are not revealed until the end. \n Corban Yaxley [ edit ] \n Corban [31]   Yaxley  is the brutal-faced Death Eater who is present in the battle in which Snape killed Dumbledore. He is one of the more prominent Death Eaters, and one of Voldemort's spies in the  Ministry of Magic . In  Harry Potter and the Deathly Hallows , Yaxley is invited to Malfoy Manor to witness the murder of  Charity Burbage , and argues with Snape about the correct date of Harry's departure from the Dursley's, but  John Dawlish , an Auror who is tricked by an Order member, gives him incorrect information. Yaxley announces to an impressed assemblage of Death Eaters that he has placed the Imperius Curse upon  Pius Thicknesse , the Head of the  Department of Magical Law Enforcement . He uses Thicknesse to Imperius the other major department heads and they allow Voldemort to murder  Rufus Scrimgeour ; thus Thicknesse becomes Minister for Magic. \n When Harry, Ron, and Hermione, disguised as ministry officials, enter the Ministry to find Slytherin's locket, it is revealed that Yaxley has become Head of Magical Law Enforcement. He also assists  Dolores Umbridge  in leading the Muggle-Born Registration Commission, and the two seem to have a good relationship, together humiliating the Muggle-borns. Both are immobilised by Harry, but Yaxley recovers and grabs Hermione while she is Apparating her friends to safety. Yaxley arrives with them at Grimmauld Place, allowing him to reveal their headquarters to the Death Eaters, but not to the location that the trio subsequently Apparate to. \n He participates in the Battle of Hogwarts, where he duels with  Professor Flitwick  and is later seen among those who wait with Voldemort for Harry Potter to come to him, mistakenly believing that Harry would not come within the allotted time. When the battle resumes, he is defeated by  George Weasley  and  Lee Jordan . \n Peter Mullan  plays Yaxley in the film adaptation of  Deathly Hallows . \n References [ edit ] \n ^   Rowling, J. K.  (2007).  Harry Potter and the Deathly Hallows . London:  Bloomsbury /New York City:  Scholastic , et al. UK  ISBN   1-55192-976-7 /U.S.  ISBN   0-545-01022-5 ., chapter 1. \n ^   \"Why are Voldemort's followers called Death Eaters? - See answer by Eleftherios Tserkezis\" . 24 August 2016 . Retrieved  9 April  2017 .   \n ^   Rowling, Joanne (21 July 2007).  Harry Potter and the Deathly Hallows . USA:  Arthur A. Levine / \n Scholastic  (US). p. 328.  ISBN   0-545-01022-5 .   \n ^   Harry Potter and the Chamber of Secrets, Warner Bros., 2002. \n ^   J.K.Rowling Official Site (15 August 2004).  \"J K Rowling at the Edinburgh Book Festival\" . Archived from  the original  on 22 December 2011 . Retrieved  8 February  2017 .   \n ^  a   b   c   d   e   f   \"J.K. Rowling Web Chat Transcript\" .  The Leaky Cauldron . 30 July 2007 . Retrieved  30 July  2007 .   \n ^   Malfoy & Nott  (Chamber of Secrets/Goblet of Fire) \n ^   \"Rowling's website FAQ about Carrows\" . Archived from  the original  on 10 May 2007 . Retrieved  8 May  2006 .   \n ^   Rowling, J.K. Harry Potter and the Goblet of Fire (New York: Arthur A. Levine Books, 2000), pages 690 and 691 \n ^   Rowling, J. K.  (2007).  Harry Potter and the Deathly Hallows . London:  Bloomsbury /New York City:  Scholastic , et al. UK  ISBN   1-55192-976-7 /U.S.  ISBN   0-545-01022-5 ., chapter 23. \n ^   [HP4] , chapter 17 \n ^   [HP4] , chapter 19 \n ^  a   b   [HP4] , chapter 30 \n ^   [HP4] , chapter 27 \n ^   Rowling, J. K.  (2005).  Harry Potter and the Half-Blood Prince . London:  Bloomsbury /New York City:  Scholastic , et al. UK  ISBN   0-7475-8108-8 /U.S.  ISBN   0-439-78454-9 ., chapter 6 \n ^   [HP4] , chapter 33 \n ^   [HP7] , chapter 23 \n ^   [HP6] , chapter 2 \n ^   [HP7] , chapter 1 \n ^   [HP7] , chapter 5 \n ^   \" New Interview with J.K. Rowling for Release of Dutch Edition of 'Deathly Hallows' .\" (18 November 2007).  The Leaky Cauldron .  Retrieved 19 November 2007. \n ^   Parsons, Ryan (22 October 2007).  \"Dumbledore Out of the Closet\" . CanMag . Retrieved  7 June  2011 .   \n ^   Fox, Chloe (5 April 2015).  \"Helen McCrory interview: on motherhood, Damian Lewis and what makes her mad\" .  Telegraph.co.uk . Archived from  the original  on 12 January 2017 . Retrieved  8 February  2017 .   \n ^  a   b   Brian Linder; Phil Pirrello; Eric Goldman; Matt Fowler (14 July 2009).  \"Top 25 Harry Potter Characters\" .  IGN . Archived from  the original  on 19 July 2009 . Retrieved  3 April  2011 .   \n ^  a   b   Joe Utichi (3 November 2010).  \"The Top 10 Harry Potter Characters\" .  IGN . Archived from  the original  on 6 November 2010 . Retrieved  3 April  2011 .   \n ^   Scott Harris (14 July 2011).  \" ' Harry Potter' Mega Poll: The Mega Results!\" . NextMovie.com . Retrieved  25 July  2011 .   \n ^   King, Stephen (10 August 2007).  \"J.K. Rowling's Ministry of Magic\" .  Entertainment Weekly . Retrieved  24 January  2014 .   \n ^   [HP4] , chapter 36 \n ^   Forbes Fictional 15, No. 12 Malfoy, Lucius \n ^   Tony Coburn – Young Lucius \n ^   Pottermore Presents - Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists, Chapter 3 (Horace Slughorn) .   \n External links [ edit ] \n Harry Potter portal \n Fictional characters portal \n Death Eaters  on  Harry Potter Wiki,  an external wiki \n The Harry Potter Lexicon item  on Death Eaters \n How to pronounce Bellatrix's name  at the official  Scholastic  website \n PotterCast #40: Bag of 'trix  – A podcast debating Bellatrix's role in the series \n When Harry Met Osama. Terrorism comes to Hogwarts. \n v \n t \n e \n The  Harry Potter  series by  J. K. Rowling \n Books \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows \n Film series \n Films \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Music \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Related \n Cast members \n Production of  The Deathly Hallows \n Characters \n Main \n Harry Potter \n Ron Weasley \n Hermione Granger \n Lord Voldemort \n Albus Dumbledore \n Severus Snape \n Rubeus Hagrid \n Draco Malfoy \n Supporting \n Hogwarts staff \n Order of the Phoenix \n Dumbledore's Army \n Death Eaters \n Fictional universe \n Hogwarts \n Magic \n Magical creatures \n Magical objects \n Ministry of Magic \n Muggle \n Places \n Potions \n Quidditch \n Related works \n Fantastic Beasts and Where to Find Them \n Quidditch Through the Ages \n The Tales of Beedle the Bard \n Prequel \n Pottermore \n The Cursed Child \n Hogwarts: An Incomplete and Unreliable Guide \n Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists \n Short Stories from Hogwarts of Heroism, Hardship and Dangerous Hobbies \n Games and toys \n Quidditch World Cup \n Lego Creator: Harry Potter \n Lego Harry Potter: Years 1–4 \n Lego Harry Potter: Years 5–7 \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Book of Spells \n Book of Potions \n Trading Card Game \n Lego  Harry Potter \n Attractions \n The Wizarding World of Harry Potter \n Orlando \n Japan \n Hollywood \n Dragon Challenge \n Flight of the Hippogriff \n Harry Potter and the Escape from Gringotts \n Harry Potter and the Forbidden Journey \n Hogwarts Express \n Harry Potter Movie Magic Experience \n Warner Bros. Studio Tour London \n Fandom \n Harry Potter Alliance \n The Leaky Cauldron \n MuggleNet \n LeakyCon \n Wizard rock \n Wrockstock \n Voldemort: Origins of the Heir \n Related \n Influences and analogues \n Legal disputes \n Parodies \n Politics \n Religious debates \n Translation \n A Very Potter Musical \n The Harry Potter Lexicon \n The Magical Worlds of Harry Potter \n Potter Puppet Pals \n   Book \n   Category \n   Portal \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Death_Eater&oldid=811385604#Regulus_Black \"\t\t\t\t\t \n Categories :  Fictional British people Fictional English people Harry Potter characters Fictional henchmen Fictional mass murderers Fictional organized crime groups Fictional organizations designated as terrorist Lists of fictional villains Literary villains Fictional outlaws Fictional prison escapees Fictional torturers Hidden categories:  Articles needing additional references from November 2017 All articles needing additional references Use dmy dates from October 2013 Use British English from August 2013   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article \n Talk \n Variants \n Views \n Read \n Edit \n View history \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons   \n Languages \n العربية বাংলা Български Bosanski Català Čeština Dansk Eesti Ελληνικά Español فارسی Galego 한국어 हिन्दी Hrvatski Bahasa Indonesia Interlingua Íslenska Italiano ქართული Lietuvių Magyar Македонски Bahasa Melayu Nederlands 日本語 Norsk Polski Português Română Русский Slovenčina Slovenščina Српски / srpski Srpskohrvatski / српскохрватски Suomi Svenska தமிழ் ไทย Türkçe Українська Tiếng Việt 中文   \n Edit links   \n  This page was last edited on 21 November 2017, at 08:03. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}