{"url": "http://www.boxofficemojo.com/about/termsofuse.htm", "content": "Box Office Mojo Terms of Use \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n BOX OFFICE MOJO Conditions of Use   \n Welcome to BoxOfficeMojo.com. IMDb.com, Inc. and/or its affiliates (\"IMDb\") owns and operates this site, and we provide website features to you subject to the following conditions.  If you visit BoxOfficeMojo.com (the \"Site\"), you accept these conditions.  Please read them carefully. In addition, when you use any current or future site, service or business that we make available, you also will be subject to the guidelines, terms and agreements (\"Terms\") applicable to that site, service or business. If these conditions are inconsistent with those Terms, those Terms will control.  \n PRIVACY Please review our Privacy Notice, which also governs your visit to the Site, to understand our practices.  \n ELECTRONIC COMMUNICATIONS When you visit the Site or send e-mails to us, you are communicating with us electronically. You consent to receive communications from us electronically. We will communicate with you by e-mail or by posting notices on this Site. You agree that all agreements, notices, disclosures and other communications that we provide to you electronically satisfy any legal requirement that such communications be in writing.  \n COPYRIGHT All content included on this Site, such as text, graphics, logos, button icons, images, audio clips, video clips, digital downloads, data compilations, and software, is the property of IMDb or its content suppliers and protected by United States and international copyright laws. The compilation of all content on this Site is the exclusive property of IMDb and protected by U.S. and international copyright laws. All software used on this Site is the property of IMDb or its software suppliers and protected by United States and international copyright laws.  \n TRADEMARKS  BOX OFFICE MOJO and other site graphics, logos, page headers, button icons, scripts, and service names are trademarks, registered trademarks or trade dress of IMDb in the U.S. and other countries. IMDb's trademarks and trade dress may not be used in connection with any product or service that is not IMDb's, in any manner that is likely to cause confusion among customers, or in any manner that disparages or discredits IMDb. All other trademarks not owned by IMDb that appear on this Site are the property of their respective owners, who may or may not be affiliated with, connected to, or sponsored by IMDb.  \n PATENTS One or more patents owned by IMDb apply to this Site and to the features and services accessible via the Site. Portions of this Site operate under license of one or more patents.  LICENSE AND SITE ACCESS We grant you a limited license to access and make personal use of this Site and not to download (other than page caching) or modify it, or any portion of it, except with our express written consent. This Site or any portion of this Site may not be reproduced, duplicated, copied, sold, resold, visited, or otherwise exploited for any commercial purpose without our express written consent. This license does not include any resale or commercial use of this Site or its contents or any derivative use of this Site or its contents.  \n • Robots and Screen Scraping:  You may not use data mining, robots, screen scraping, or similar data gathering and extraction tools on this Site, except with our express written consent as noted below.  \n • Framing:  You may not frame or utilize framing techniques to enclose any trademark, logo, or other proprietary information (including images, text, page layout, or form) of IMDb without our express written consent.  \n • Meta Tags:  You may not use any meta tags or any other \"hidden text\" utilizing IMDb's name or trademarks without our express written consent. Any unauthorized use terminates the permission or license granted by us.  \n • Licensing IMDb's Content; Consent to Use Robots and Crawlers:  If you are interested in receiving our express written permission to use our content for your non-personal (including commercial) use, please  contact our Licensing Department . We do allow the limited use of robots and crawlers, such as those from certain search engines, with our express written consent.  \n • Linking to the Site:  You are granted a limited, revocable, and nonexclusive right to create a hyperlink to the Site, as long as the link does not portray the Site or its services in a false, misleading, derogatory, or otherwise offensive matter. You may not use any IMDb logo or other proprietary graphic or trademark as part of the link without our express written permission except as outlined in our  help section .  \n YOUR ACCOUNT If you have registered with this Site, you are responsible for maintaining the confidentiality of your account and password and for restricting access to your computer, and you agree to accept responsibility for all activities that occur under your account or password.  \n REVIEWS, COMMENTS, COMMUNICATIONS, AND OTHER CONTENT Visitors may post reviews, comments, photos, and other content; and submit suggestions, ideas, comments, questions, or other information, so long as the content is not illegal, obscene, threatening, defamatory, invasive of privacy, infringing of intellectual property rights, or otherwise injurious to third parties or objectionable and does not consist of or contain software viruses, political campaigning, commercial solicitation, chain letters, mass mailings, or any form of \"spam.\" You may not use a false e-mail address, impersonate any person or entity, or otherwise mislead as to the origin of your content. We reserve the right (but not the obligation) to remove or edit such content, but do not regularly review posted content.  \n If you do post content or submit material, and unless we indicate otherwise, you grant us a nonexclusive, royalty-free, perpetual, irrevocable, and fully sublicensable right to use, reproduce, modify, adapt, publish, translate, create derivative works from, distribute, and display such content throughout the world in any media. You grant us and our sublicensees the right to use the name that you submit in connection with such content, if they choose. You represent and warrant that you own or otherwise control all of the rights to the content that you post; that the content is accurate; that use of the content you supply does not violate IMDb's policies and will not cause injury to any person or entity; and that you will indemnify IMDb for all claims resulting from content you supply. IMDb has the right but not the obligation to monitor and edit or remove any activity or content. We take no responsibility and assume no liability for any content posted by you or any third party.  \n COPYRIGHT COMPLAINTS IMDb respects the intellectual property of others. If you believe that your work has been copied in a way that constitutes copyright infringement, please follow our  Notice and Procedure for Making Claims of Copyright Infringement .  \n DISCLAIMER OF WARRANTIES AND LIMITATION OF LIABILITY THIS SITE AND ALL INFORMATION, CONTENT, MATERIALS, PRODUCTS (INCLUDING SOFTWARE) AND SERVICES INCLUDED ON OR OTHERWISE MADE AVAILABLE TO YOU THROUGH THIS SITE ARE PROVIDED BY IMDb ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS. IMDb MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, AS TO THE OPERATION OF THIS SITE OR THE INFORMATION, CONTENT, MATERIALS, PRODUCTS (INCLUDING SOFTWARE) OR SERVICES INCLUDED ON OR OTHERWISE MADE AVAILABLE TO YOU THROUGH THIS SITE. YOU EXPRESSLY AGREE THAT YOUR USE OF THIS SITE IS AT YOUR SOLE RISK.  \n TO THE FULL EXTENT PERMISSIBLE BY APPLICABLE LAW, IMDb DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. IMDb DOES NOT WARRANT THAT THIS SITE; INFORMATION, CONTENT, MATERIALS, PRODUCTS (INCLUDING SOFTWARE) OR SERVICES INCLUDED ON OR OTHERWISE MADE AVAILABLE TO YOU THROUGH THIS SITE; THEIR SERVERS; OR E-MAIL SENT FROM IMDb ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS. IMDb WILL NOT BE LIABLE FOR ANY DAMAGES OF ANY KIND ARISING FROM THE USE OF THIS SITE OR FROM ANY INFORMATION, CONTENT, MATERIALS, PRODUCTS (INCLUDING SOFTWARE) OR SERVICES INCLUDED ON OR OTHERWISE MADE AVAILABLE TO YOU THROUGH THIS SITE, INCLUDING, BUT NOT LIMITED TO DIRECT, INDIRECT, INCIDENTAL, PUNITIVE, AND CONSEQUENTIAL DAMAGES  \n CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MIGHT HAVE ADDITIONAL RIGHTS.  \n APPLICABLE LAW By visiting this Site, you agree that the laws of the state of Washington, without regard to principles of conflict of laws, will govern these Conditions of Use and any dispute of any sort that might arise between you and IMDb.  \n DISPUTES Any dispute relating in any way to this Site, your visit to this Site, or your use of the services offered by this Site in which the aggregate total claim for relief sought on behalf of one or more parties exceeds $7,500 shall be adjudicated in any state or federal court in King County, Washington, and you consent to exclusive jurisdiction and venue in such courts.  \n SITE POLICIES, MODIFICATION, AND SEVERABILITY Please review our other policies. These policies also govern your visit to the Site. We reserve the right to make changes to our Site, policies, and these Conditions of Use at any time. If any of these conditions shall be deemed invalid, void, or for any reason unenforceable, that condition shall be deemed severable and shall not affect the validity and enforceability of any remaining condition.  \n OUR ADDRESS Box Office Mojo P.O. Box 81226 Seattle, WA 98108 www.boxofficemojo.com   \n Notice and Procedure for Making Claims of Copyright Infringement If you believe that your work has been copied in a way that constitutes copyright infringement, please provide IMDb's copyright agent the written information specified below. Please note that this procedure is exclusively for notifying IMDb that your copyrighted material has been infringed.  \n • An electronic or physical signature of the person authorized to act on behalf of the owner of the copyright interest; \n • A description of the copyrighted work that you claim has been infringed upon;  \n • A description of where the material that you claim is infringing is located on the Site; \n • Your address, telephone number, and e-mail address;  \n • A statement by you that you have a good-faith belief that the disputed use is not authorized by the copyright owner, its agent, or the law; \n • A statement by you, made under penalty of perjury, that the above information in your notice is accurate and that you are the copyright owner or authorized to act on the copyright owner's behalf.  \n IMDb's Copyright Agent for notice of claims of copyright infringement on its Site can be reached as follows:  \n Copyright Agent / Box Office Mojo c/o Legal Department P.O. Box 81226 Seattle, WA 98108 phone: (206) 266-4064 fax: (206) 266-7010 e-mail: copyright@imdb.com  \n Courier address: Copyright Agent / Box Office Mojo c/o Legal Department 1200 12th Avenue South, Suite 1200 Seattle, WA 98144-2734 USA  \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}