{"url": "https://en.wikipedia.org/wiki/Mini_CD", "content": "Mini CD - Wikipedia \n Mini CD   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Not to be confused with  MiniDisc . \n This article  needs additional citations for  verification .  Please help  improve this article  by  adding citations to reliable sources . Unsourced material may be challenged and removed.   (June 2014)   ( Learn how and when to remove this template message ) \nAn 80 mm mini CD on the left, compared with a standard 120 mm CD on the right \nA mini CD is a cost-effective solution for distributing small amounts of data, like device drivers. \nBusiness card CD \n Mini CD s, or  pocket CDs , are  CDs  with a smaller diameter and one third the storage capacity of a standard 120 mm disc. [ citation needed ] \n Contents \n 1   Formats \n 2   Compatibility \n 3   Retail availability \n 4   Devices that use MiniCD \n 4.1   Sony D-88 \n 4.2   Compaq iPaq PM-1 Mini CD MP3 Player \n 4.3   Memorex 8081 Mini CD MP3 Player \n 4.4   Sony Mavica \n 4.5   Imation RipGo \n 4.6   Sony Photo Vault \n 5   See also \n 6   References \n Formats [ edit ] \n Amongst the various formats are the \n Mini CD single , a small disc. The format is mainly used for audio CD singles in certain regions (singles are sold on normal 120 mm CDs in many countries), much like the old vinyl single. An 80 mm disc can hold up to 24 minutes of music, or 210  MiB  (210 × 2 20  bytes) of data. They are often referred to as  Maxi CDs  in some countries.\n The low density version holds 18 minutes, or 155 MB. \n Other formats are 185 MB (21 mins), which has the same data density as a 650 MB full-sized CD, and 210 MB (24 mins), with the same data density as a 700 MB full sized CD, used for \"Pocket\" data storage. (see also  miniDVD ) \n Business card CD  (or \"b-card\"), a truncated (to the shape and size of a  business card ) disc with a storage capacity from 30 MB to 100 MB.\n The long axis is 80 mm while the short axis (from flat side to flat side) is generally between 58 and 68 mm \n The disc may be rectangular with wings added on, to square off the rounded 80 mm disc. \n 60 mm disc , a round version of the business card, with comparable capacity (50 MB) \n In 1997 Dean Procter of Imaginet was offering business card sized square CDs with full screen hi-fi stereo video which played in quad speed CD ROMs or DVD drives with the centre well. A variety of laser cut shapes were developed. [1] \n When Mini CDs were first introduced in the  United States , they were initially marketed as CD3, in reference to their approximate size in inches; larger CDs were called CD5, despite the fact that both CD specifications are defined solely in terms of  metric  units. Now, they are known as either Mini CDs or 80 mm CDs. \n Compatibility [ edit ] \n Most tray-loading CD devices have 2 'circular indentation'; one sized for a regular 120 mm CD, and a smaller, deeper circular indentation for Mini CDs to fit into, except for some Blu-ray players. \n Devices that feature a spindle also support MiniCDs, as the disc can simply be placed onto the spindle as with a normal CD. \n Some vertically aligned tray-loading devices, such as the older pre-slimline  PlayStation 2  consoles when placed vertically, require an adapter for use with 80 mm CDs. \n Most slot-loading CD drives are generally incompatible (the  PlayStation 3  and  Wii  are exceptions), but adapters are available into which one can snap an 80 mm round Mini CD in order to extend the width to match that of a 120 mm CD, and thus work in many slot-loading devices. \n A popular adapter model, Memorex 30183001, was discontinued in 2006. \n Most CD players in the late 1980s and early 1990s didn't handle the Mini CD circular indentation and required the use of an adapter, or very careful placement of the CD in the exact middle of the tray. Not until after the major record labels discontinued them, did the CD Players start to have the 80 mm circular indentation as standard. \n Since the mid-1990s, all tray loading players have circular indentation for the Mini CD. \n Retail availability [ edit ] \n Mini CD-R, Mini CD-RW:  As of 2007, many manufacturers offer 80 mm CD-R and CD-RW discs for sale in retail electronics and office supply stores. These are sometimes marketed as \"Pocket CD-R/CD-RW\" (Memorex) or \"Mini CD-R\" (TDK). Most of the blank discs available in retail hold either 185 MB (21 minutes) or 210 MB (24 minutes) of data. The mini discs, despite having less weight and plastic, are generally more expensive than full size CD-R/CD-RW discs. \n Mini CD Replication Manufacturing:  Custom-manufactured Mini CDs with integral data are available to the retail market. There are two variations on how the finished product is created: \n Replicated to its finished size and shape:  Through a single-step replication process  [1]  the Mini CD is injection-molded to its finished size and shape and imprinted with data in exactly the same manner as full-size Audio CD or CDROM discs. \n Replicated and machine-cut to its finished size and shape:  Some CD replication companies make Mini CDs by taking full-size Audio CD or CDROM discs and machine-cutting them down to their finished size and shape. \n The short lived \"Lid Rock\" promotion that gave away CD singles on the underside of soda lids from Regal Movie Theaters used Mini CDs. \n Devices that use MiniCD [ edit ] \n While almost any spindle-based or tray-based CD device can utilize mini CD media, some devices have been designed expressly to use the smaller format, usually for portability reasons. \n Sony D-88 [ edit ] \n The first shirt-pocket CD player was the Sony D-88 (ca. 1990). It only played standard PCM audio ( Red Book ) CDs. It could play 120 mm discs if a guard was moved to allow the disc to protrude from the unit. \n Compaq iPaq PM-1 Mini CD MP3 Player [ edit ] \n In 2002, Compaq offered a compact, lightweight Mini CD player that made up for the capacity difference between 120 mm and 80 mm audio CDs by using MP3 compression, resulting in 1.1x to 3.5x the capacity of a standard audio CD, depending on compression ratio. \n Memorex 8081 Mini CD MP3 Player [ edit ] \n Memorex offered a portable CD player that matched the form factor for the 80 mm CD (Model MPD8081). The player was marketed as an MP3 device, and the user was encouraged to burn MP3 music files to a mini CD, and then play them in the player, which was noticeably smaller than a standard portable CD player. The player could also play Red Book audio content burned onto mini CDs. It can play both CD-R and CD-RW media, as well as pressed mini CDs. \n Sony Mavica [ edit ] \n Sony's Mavica line of digital cameras also offered some cameras that record directly to mini CD media. There were two models, the CD350 and the CD500, which offered 3.2 megapixels and 5.0 megapixels, respectively. These cameras could also record MPEG video directly to the Mini CD - a sort of precursor to mini DVD camcorders. The media size for these devices was quoted at 156 MB, rather than 185 MB. It is possible that these devices used a packet writing format which took away some available disk space for use by formatting information. A common problem for Mavica owners has been incorrect disc size. If a disc size other than 156 MB is used, the camera will appear to work, but data loss will likely occur. \n Imation RipGo [ edit ] \n The Imation RipGo! was a portable CD-R burner that was a similar form factor to that of the Memorex Mini CD player. Again, it was marketed as an MP3 device, and it could play MP3 and WMA files burned onto Mini CD media. It was powered by an internal lithium ion battery that could power the unit for five hours of playback. The device suffered some setbacks, most notably a slow CD initialize time (the time during which the drive analyzes the contents of an MP3 CD), maximum of 4X burning speed (due to the device using  USB  1.1 to connect to its host computer), and no support for CD-RW media. Some have also reported issues using the device with 24 minute (210 MB) mini CD media; the device was shipped with 21 minute (185 MB) media and seemed unreliable when burning on the slightly higher density media. \n Sony Photo Vault [ edit ] \n Sony also manufactured a mini CD burning device, designed to be \"PC-free.\" The device allowed the user to directly burn images from a Memory Stick or a USB flash drive or camera to a mini CD. It was a precursor to the various portable media storage devices such as the  iPod Photo  adapters and various other hard disk based photo storage units. \n See also [ edit ] \n Bootable business card \n Compact Disc \n Mini CD single \n DataPlay , a proprietary write-once mini optical disc format which is even smaller than mini CD media \n DVD card , the equivalent to the business card CD \n MiniDisc , the popular proprietary Sony mini optical media \n MiniDVD , the 80 mm  DVD  format, for video-singles \n Shaped CD \n References [ edit ] \n ^   \"Imaginet Internet, iE-Commerce and Multimedia Services Home Page\" . imaginet.com.au. 22 February 1999. Archived from the original on February 22, 1999.   CS1 maint: Unfit url ( link ) \n v \n t \n e \n Compact disc \n Discs \n CD \n CD-DA \n Red Book \n CD-R \n Orange Book \n CD-ROM \n Yellow Book \n CD-RW \n CD-MRW \n CD-MO \n CD-i \n Green Book \n CD-Text \n CD+ \n Blue Book \n CD+EG \n CD+G  (Karaoke) \n Gold CD \n MiniCD \n Mixed Mode CD \n Photo CD \n Beige Book \n PMCD \n shaped CD \n business card CD \n SVCD \n VCD \n White Book \n Technology \n Rainbow Books \n CD authoring \n CD burning \n CD copy protection \n CD emulation \n CD manufacturing \n CD ripping \n CD rot \n CD bronzing \n CD subcode \n C2 error \n CD-i Ready \n 4ch CD-DA \n El Torito \n ISO 9660 \n Joliet \n Romeo \n Rock Ridge \n ISO 13490 \n UDF \n XRCD \n Hardware/Software/Content \n CD Case \n CD drive \n CD player \n Portable CD player \n CD recorder \n CD ripper \n CD single \n Mini CD single \n Court cases \n Orange-Book-Standard \n Lists \n CD copy protection schemes \n CD player manufacturers \n Optical disc authoring software \n Variants based on CD \n 5.1 Music Disc \n Black Book \n CD Video \n Video Single Disc \n cDVD \n CDVU+ \n DD-CD \n Purple Book \n DSD-CD \n DualDisc \n HDCD \n Hybrid DVD-Audio \n Hybrid SACD \n Scarlet Book \n MovieCD \n MP3 CD \n Picture CD \n VinylDisc \n See also \n Blu-ray \n DVD \n HD DVD \n LaserDisc \n MiniDisc \n SACD \n UMD \n WORM \n   Category \n   Commons \n   Wiktionary \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Mini_CD&oldid=792017386 \"\t\t\t\t\t \n Categories :  Compact disc 80 mm discs Audio storage Hidden categories:  CS1 maint: Unfit url Articles needing additional references from June 2014 All articles needing additional references All articles with unsourced statements Articles with unsourced statements from March 2013   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n العربية Deutsch Español فارسی 한국어 日本語 Português Русский Simple English Türkçe 粵語 中文   \n Edit links   \n  This page was last edited on 23 July 2017, at 23:02. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}