{"url": "https://en.wikipedia.org/wiki/TRIZ", "content": "TRIZ - Wikipedia \n TRIZ   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article  needs additional citations for  verification .  Please help  improve this article  by  adding citations to reliable sources . Unsourced material may be challenged and removed.   (July 2012)   ( Learn how and when to remove this template message ) \n TRIZ  ( / ˈ t r iː z / ;  Russian :  теория решения изобретательских задач ,  teoriya resheniya izobretatelskikh zadach , literally: \"theory of the resolution of invention-related tasks\") is \"a problem-solving, analysis and forecasting tool derived from the study of patterns of invention in the global patent literature\". [1]  It was developed by the Soviet inventor and science-fiction author  Genrich Altshuller  (1926-1998) and his colleagues, beginning in 1946. In  English  the name is typically rendered as \"the  theory of inventive problem solving \", [2] [3]  and occasionally goes by the English acronym  TIPS . \n Following Altshuller's insight, the theory developed on a foundation of extensive research covering hundreds of thousands of inventions across many different fields to produce a theory which defines generalisable patterns in the nature of inventive solutions and the distinguishing characteristics of the problems that these inventions have overcome. \n An important part of the theory has been devoted to revealing patterns of  evolution  and one of the objectives which has been pursued by leading practitioners of TRIZ has been the development of an  algorithmic approach  to the invention of new  systems , and to the refinement of existing ones. \n TRIZ includes a practical  methodology , tool sets, a  knowledge base , and model-based technology for generating innovative solutions for  problem solving . It is intended [ by whom? ]  for application in problem formulation,  system analysis ,  failure analysis , and patterns of system evolution. There is a general similarity of purposes and methods with the field of  pattern language , a cross discipline practice for explicitly describing and sharing holistic patterns of design. \n The research has produced three primary findings: \n problems and solutions are repeated across industries and sciences \n patterns of technical evolution are also repeated across industries and sciences \n the innovations used scientific effects outside the field in which they were developed \n TRIZ practitioners apply all these findings in order to create and to improve products, services, and systems. [4] \n Contents \n 1   History \n 2   Basic principles \n 3   Essentials \n 3.1   Basic terms \n 3.2   Identifying a problem: contradictions \n 3.3   Inventive principles and the matrix of contradictions \n 3.4   Laws of technical system evolution \n 3.5   Substance-field analysis \n 3.6   ARIZ - algorithm of inventive problems solving \n 3.7   Use of TRIZ on Management Problems \n 4   Use of TRIZ methods in industry \n 5   European TRIZ Association \n 5.1   Goals \n 5.2   Modifications and derivatives \n 6   See also \n 7   References \n 8   Books on TRIZ \n 9   External links \n History [ edit ] \n TRIZ in its classical form was developed by the Soviet inventor and science fiction writer Genrich Altshuller and his associates. He started developing TRIZ in 1946 while working in the \"Inventions Inspection\" department of the  Caspian Sea flotilla  of the  Soviet Navy . His job was to help with the initiation of invention proposals, to rectify and document them, and to prepare applications to the patent office. During this time he realised that a problem requires an inventive solution if there is an unresolved contradiction in the sense that improving one parameter impacts negatively on another. He later called these \"technical contradictions\". \n His work on what later resulted in TRIZ was interrupted in 1950 by his arrest and sentencing to 25 years in the  Vorkuta   Gulag   labor camps . The arrest was partially triggered by letters which he and Raphael Shapiro sent to  Stalin , ministers and newspapers about certain decisions made by the Soviet Government, which they believed were erroneous. [5]  Altshuller and Shapiro were freed during the  Khrushchev Thaw  following Stalin's death in 1953  [6]  and returned to  Baku . \n The first paper on TRIZ titled \"On the psychology of inventive creation\" was published in 1956 in \"Issues in Psychology\" (Voprosi Psichologii) journal. [7] \n By 1969, Altshuller had reviewed about 40,000  patent  abstracts in order to find out in what way the  innovation  had taken place and developed the concept of technical contradictions, the concept of ideality of a system, contradiction matrix, and  40 principles of invention . In the years that followed he developed the concepts of physical contradictions, SuField analysis (structural substance-field analysis), standard solutions, several  laws of technical systems evolution , and numerous other theoretical and practical approaches. \n Altshuller also observed clever and creative people at work: he uncovered patterns in their thinking, and developed thinking tools and techniques to model this \"talented thinking\". These tools include Smart Little People  [8]  and Thinking in Time and Scale (or the Screens of Talented Thought). [9] \n In 1971 Altshuller convinced The Inventors Society to establish in Baku the first TRIZ teaching facility, called the Azerbaijan Public Institute for Inventive Creation and the first TRIZ research lab called The Public Lab for Inventive Creation. Altshuller was appointed the head of the lab by the society. The lab incubated the TRIZ movement and in the years that followed other TRIZ teaching institutes were established in all major cities of the USSR. \n From 1986 Altshuller switched his attention away from technical TRIZ, and started investigating the development of individual creativity. He also developed a version of TRIZ for children, which was trialled in various schools.[ [10] ] In 1989 the TRIZ Association was formed, with Altshuller chosen as President. \n Following the end of the  cold war , the waves of emigrants from the former Soviet Union brought TRIZ to other countries and drew attention to it overseas. [11]  In 1995 the Altshuller Institute for TRIZ Studies was established in  Boston , USA. \n Basic principles [ edit ] \n TRIZ presents a systematic approach for understanding and defining challenging problems: difficult problems require an inventive solution, and TRIZ provides a range of strategies and tools for finding these inventive solutions. One of the earliest findings of the massive research on which the theory is based is that the vast majority of problems that require inventive solutions typically reflect a need to overcome a dilemma or a trade-off between two contradictory elements. The central purpose of TRIZ-based analysis is to systematically apply the strategies and tools to find superior solutions that overcome the need for a compromise or trade-off between the two elements. \nPrism of TRIZ \n By the early 1970s two decades of research covering hundreds of thousands of patents had confirmed Altshuller's initial insight about the patterns of inventive solutions and one of the first analytical tools was published in the form of 40 inventive principles, which could account for virtually all of those patents that presented truly inventive solutions. Following this approach the \"Conceptual solution\" shown in the diagram can be found by defining the contradiction which needs to be resolved and systematically considering which of the 40 principles may be applied to provide a specific solution which will overcome the \"contradiction\" in the problem at hand, enabling a solution that is closer to the \"ultimate ideal result\". \nContradictions Matrix \n The combination of all of these concepts together – the analysis of the contradiction, the pursuit of an ideal solution and the search for one or more of the principles which will overcome the contradiction, are the key elements in a process which is designed to help the inventor to engage in the process with purposefulness and focus. \n40 principles of TRIZ method rendered schematically \n One of the tools which evolved as an extension of the 40 principles was a  contradiction matrix  in which the contradictory elements of a problem were categorized according to a list of 39 factors which could impact on each other. The combination of each pairing of these 39 elements is set out in a matrix (for example, the weight of a stationary object, the use of energy by a moving object, the ease of repair etc.) Each of the 39 elements is represented down the rows and across the columns (as the negatively affected element) and based upon the research and analysis of patents: wherever precedent solutions have been found that resolve a conflict between two of the elements, the relevant cells in the matrix typically contain a sub-set of three or four principles that have been applied most frequently in inventive solutions which resolve contradictions between those two elements. \n The main objective of the contradiction matrix was to simplify the process of selecting the most appropriate Principle to resolve a specific contradiction. It was the core of all modifications of ARIZ till 1973. But in 1973, after introducing the concept of physical contradictions and creating SuField analysis, Altshuller realized that the contradiction matrix was comparatively an inefficient tool and stopped working on it. Beginning ARIZ-71c contradiction matrix ceased to be the core of ARIZ and therefore was not a tool for solving inventive problems that Altshuller believed should be pursued. \n Physical contradictions and separation principles as well as SuField analysis, etc. became the core. Despite this, the  40 principles of invention  has remained the most popular tool taught in introductory seminars and has consistently attracted the most attention amongst the tens of thousands of individuals who visit TRIZ-focused web sites in a typical month. Therefore, many of those who learn TRIZ or have attended seminars are taught quite wrongly that TRIZ is primarily composed of the 40 principles and contradiction matrix, the truth is ARIZ is the core methodology of TRIZ. \n ARIZ  is an algorithmic approach to finding inventive solutions by identifying and resolving contradictions. This includes the \"system of inventive standards solutions\" which Altshuller used to replace the 40 principles and contradiction matrix, it consists of SuField modeling and the 76 inventive standards. A number of TRIZ-based computer programs have been developed whose purpose is to provide assistance to engineers and inventors in finding inventive solutions for technological problems. Some of these programs are also designed to apply another TRIZ methodology whose purpose is to reveal and forecast emergency situations and to anticipate circumstances which could result in undesirable outcomes. \n One of the important branches of TRIZ is focused on analysing and predicting trends of evolution in the characteristics that existing solutions are likely to develop in successive generations of a system. \n Essentials [ edit ] \n Basic terms [ edit ] \n Ideal final result  (IFR) - the ultimate idealistic solution of a problem when the desired result is achieved by itself. Note that the Ideal Final Result is also an ARIZ term for the formulation of the inventive problem in the form of a Technical Contradiction (IFR-1) and a Physical Contradiction (IFR-2); \n Administrative contradiction  - contradiction between the needs and abilities; \n Technical contradiction  - an inverse dependence between parameters/characteristics of a machine or technology; \n Physical contradiction  - opposite/contradictory physical requirements to an object; \n Separation principle  - a method of resolving physical contradictions by separating contradictory requirements; \n Vepol  or  Su-field  - a minimal technical system consisting of two material objects (substances) and a \"field\". \"Field\" is the source of energy whereas one of the substances is \"transmission\" and the other one is the \"tool\"; \n Fepol  or  Ferfiel  - a sort of Vepol (Su-field) where \"substances\" are ferromagnetic objects; \n Level of invention ; \n Standard solution  - a standard inventive solution of a higher level; \n Laws of technical systems evolution ; \n Algorithm of inventive problems solving  (ARIZ), which combines various specialized methods of TRIZ into one universal tool ; \n Talented Thinking or Thinking in Time and Scale ; \n Identifying a problem: contradictions [ edit ] \n Altshuller has shown that at the heart of some inventive problems lie  contradictions  (one of the basic TRIZ concepts) between two or more elements, such as, \"If we want more acceleration, we need a larger engine; but that will increase the cost of the car,\" that is, more of something desirable also brings more of something less desirable, or less of something else also desirable. \n These are called  technical contradictions  by Altshuller. He also defined so-called physical or inherent contradictions: More of one thing and less of the same thing may both be desired in the same system. For instance, a higher temperature may be needed to melt a compound more rapidly, but a lower temperature may be needed to achieve a homogeneous mixture. \n An  inventive situation  which challenges us to be inventive, might involve several such contradictions. Conventional solutions typically \"trade\" one contradictory parameter for another; no special inventiveness is needed for that. Rather, the inventor would develop a creative approach for resolving the contradiction, such as inventing an engine that produces more acceleration without increasing the cost of the engine. \n Inventive principles and the matrix of contradictions [ edit ] \n Altshuller screened patents in order to find out what kind of contradictions were resolved or dissolved by the invention and the way this had been achieved. From this he developed a set of 40 inventive principles and later a  matrix of contradictions . Rows of the matrix indicate the 39 system features that one typically wants to improve, such as speed, weight, accuracy of measurement and so on. Columns refer to typical undesired results. Each matrix cell points to principles that have been most frequently used in patents in order to resolve the contradiction. \n For instance, Dolgashev mentions the following contradiction: increasing accuracy of measurement of machined balls while avoiding the use of expensive microscopes and elaborate control equipment. The matrix cell in row \"accuracy of measurement\" and column \"complexity of control\" points to several principles, among them the Copying Principle, which states, \"Use a simple and inexpensive optical copy with a suitable scale instead of an object that is complex, expensive, fragile or inconvenient to operate.\" From this general invention principle, the following idea might solve the problem: Taking a high-resolution image of the machined ball. A screen with a grid might provide the required measurement. As mentioned above, Altshuler abandoned this method of defining and solving \"technical\" contradictions in the mid 1980s and instead used SuField modeling and the 76 inventive standards and a number of other tools included in the algorithm for solving inventive problems, ARIZ. \n Laws of technical system evolution [ edit ] \n Main article:  Laws of technical systems evolution \n Altshuller also studied the way technical systems have been developed and improved over time. From this, he discovered several trends (so called Laws of Technical Systems Evolution) that help engineers predict the most likely improvements that can be made to a given product. The most important of these laws involves the ideality of a system. \n Substance-field analysis [ edit ] \n One more technique that is frequently used by inventors involves the analysis of substances, fields and other resources that are currently not being used and that can be found within the system or nearby. TRIZ uses non-standard definitions for substances and fields. Altshuller developed methods to analyze resources; several of his invention principles involve the use of different substances and fields that help resolve contradictions and increase ideality of a technical system. For instance,  videotext  systems used television signals to transfer data, by taking advantage of the small time segments between TV frames in the signals. \n SuField analysis produces a structural model of the initial technological system, exposes its characteristics, and with the help of special laws, transforms the model of the problem. Through this transformation the structure of the solution that eliminates the shortcomings of the initial problem is revealed. SuField analysis is a special language of formulas with which it is possible to easily describe any technological system in terms of a specific (structural) model. A model produced in this manner is transformed according to special laws and regularities, thereby revealing the structural solution of the problem. \n ARIZ - algorithm of inventive problems solving [ edit ] \n ARIZ (Russian acronym of алгоритм решения изобретательских задач - АРИЗ) (algorithm of inventive problems solving) is a list of about 85 step-by-step procedures to solve complicated invention problems, where other tools of TRIZ alone (Sufield analysis, 40 inventive principles, etc.) are not sufficient. \n Various TRIZ software (see  Invention Machine 's Goldfire, ideation international, Guided Innovation Toolkit, TriSolver, Innovation Suite, TRIZ GB) are based on this algorithm. \n Starting with an updated matrix of contradictions, semantic analysis, subcategories of inventive principles and lists of scientific effects, some new interactive applications are other attempts to simplify the problem formulation phase and the transition from a generic problem to a whole set of specific solutions. (See the external links for details.) \n Use of TRIZ on Management Problems [ edit ] \n Although TRIZ was developed from the analysis of technical systems, it has been used widely as a method for understanding and solving complex management problems. Examples include finding additional cost savings for the legal department of a local government body: the inventive solution generated was to generate additional revenue [insert reference to cost-cutting in local government case study]. The results of the TRIZ work are expected to generate £1.7 m in profit in the first 5 years. [12] \n Use of TRIZ methods in industry [ edit ] \n Case studies on the use of TRIZ are difficult to acquire as many companies believe TRIZ gives them a competitive advantage and are reluctant to publicise their adoption of the method. However some examples are available: Samsung is the most famous success story, and has invested heavily in embedding TRIZ use throughout the company, right up to and including the CEO; \" In 2003 TRIZ led to 50 new patents for Samsung and in 2004 one project alone, a DVD pick-up innovation, saved Samsung over $100 million. TRIZ is now an obligatory skill set if you want to advance within Samsung. \". [ citation needed ] \n Rolls-Royce, BAE Systems and GE are all documented users of TRIZ  TRIZ is a Whizz article ; Mars has documented how applying TRIZ led to a  new patent for chocolate packaging . \n TRIZ has also been used successfully by Leafield Engineering, Smart Stabilizer Systems and Buro Happold to solve problems and generate new patents  (ref www.imeche.org articles). \n Various promoters of TRIZ reported that car companies  Rolls-Royce , [13]   Ford , and  Daimler-Chrysler ,  Johnson & Johnson , aeronautics companies  Boeing ,  NASA , technology companies  Hewlett Packard ,  Motorola ,  General Electric ,  Xerox ,  IBM ,  LG ,  Samsung ,  Intel ,  Procter and Gamble ,  Expedia  and  Kodak  have used TRIZ methods in some projects. [6] [14] [15] [16] \nThe application of TRIZ tools in numerous German industrial companies in the recent decade has followed the principles of the  Advanced Innovation Design Approach , which recommends application of the selected TRIZ tools in the early stage of the innovation process for the identification of customer needs, comprehensive problem definition and ideation, new concept development and optimization. \n European TRIZ Association [ edit ] \n The  European TRIZ Association ETRIA  is an non-profitable association [17]  based in  Germany , founded in 2000. [18]  ETRIA considers itself an open community to unite the efforts, suggest opportunities for global  standardization , conduct further  research and development , and provide mechanisms for the exchange of  information  and  knowledge  on TRIZ and TRIZ-based innovation technologies. [ citation needed ] \n ETRIA is developing a  web-based  collaborative environment targeted the creation of links between any and all  institutions  concerned with conceptual questions pertaining to the creation, organization, and efficient processing of innovation knowledge and innovation technologies. [ citation needed ] \n TRIZ is considered as a  cross-disciplinary , generic  methodology , but it has not previously been presented in terms of  logic  or any other  formal knowledge representation . [ citation needed ]  Most of the concepts introduced in TRIZ are fuzzy, and most of the techniques are still  heuristic  and only partially formalized. For further development and conceptual re-organization of the  TRIZ knowledge base , ETRIA involves and collaborates with TRIZ experts and professionals from the domains of  logic ,  organization science ,  informatics  and  linguistics . \n The Association holds conferences with associated publications. [19] \n Goals [ edit ] \n ETRIA has the following  goals : [ citation needed ] \n Research and development of innovation knowledge by integrating conceptual approaches to  classification  developed by  artificial intelligence  ( AI ) and  knowledge management  communities; \n International observation, analysis, evaluation and reporting of progress in these directions; \n Promotion and exchange of information and experience between  scientists  and  practitioners  in TRIZ,  universities  and other  educational  organizations; \n Development of TRIZ through contributions from dedicated experts and specialists in particular areas of expertise. \n Modifications and derivatives [ edit ] \n SIT  (systematic inventive thinking) \n USIT  (unified structured inventive thinking) \n Trizics  (Methodology for the systematic application of TRIZ) \n See also [ edit ] \n Thinking portal \n Systems theory \n Trial-and-error \n Brainstorming \n Morphological analysis \n Method of focal objects \n Lateral thinking \n C-K theory \n References [ edit ] \n ^   Hua, Z.; Yang, J.; Coulibaly, S.; Zhang, B. (2006).  \"Integration TRIZ with problem-solving tools: a literature review from 1995 to 2006\" .  International Journal of Business Innovation and Research .  1  (1-2): 111–128 . Retrieved  2 October  2010 .   \n ^   Barry, Katie; Domb, Ellen; Slocum, Michael S.  \"Triz - What is Triz\" .  The Triz Journal . Real Innovation Network . Retrieved  2 October  2010 .   \n ^   Sheng, I. L. S.; Kok-Soo, T. (2010).  \"Eco-Efficient Product Design Using theory of Inventive Problem Solving (TRIZ) Principles\"   (PDF) .  American Journal of Applied Sciences .  7  (6): 852–858 . Retrieved  30 September  2010 .   \n ^   http://www.triz-journal.com/whatistriz.htm \n ^   \"Генрих Саулович Альтшуллер (Genrich Saulovich Altshuller - short biography)\" . www.altshuller.ru.   \n ^  a   b   Wallace, Mark (June 29, 2000).  \"The science of invention\" .  Salon.com . Retrieved  3 October  2010 .   \n ^   Altshuller, G. S.; Shapiro, R. B. (1956).  \"О Психологии изобретательского творчества (On the psychology of inventive creation)\" .  Вопросы Психологии (The Psychological Issues)  (in Russian) (6): 37–39 . Retrieved  4 October  2010 .   \n ^   [reference to p 110] Alshuller, G.S. (1984)  Creativity as an Exact Science: the Theory of the Solution of Inventive Problems  Translated by Williams, A. Gordon and Breach Science Publishers Inc] \n ^   [reference to p 121] Alshuller, G.S. (1984) Creativity as an Exact Science: the Theory of the Solution of Inventive Problems Translated by Williams, A. Gordon and Breach Science Publishers Inc] \n ^   http://www.xtriz.com/BriefHistoryOfTRIZ.pdf \n ^   Webb, Alan (August 2002). \"TRIZ: an inventive approach to invention\".  Manufacturing Engineer : 171–177.     |access-date=  requires  |url=  ( help ) \n ^   [Reference  http://www.legalbusiness.co.uk/index.php/lb-blog-view/2727-the-overall-benefits-are-potentially-enormous-bucks-county-council-granted-abs-licence-with-emergency-services-group ] \n ^   Gadd, Karen (2011).  TRIZ for Engineers . United Kingdom: Wileys. p. 38.  ISBN   978-0470741887 .   \n ^   Jana, Reena (May 31, 2006).  \"The World According to TRIZ\" .  Bloomberg Businessweek . Retrieved  3 October  2010 .   \n ^   Hamm, Steve (December 25, 2008).  \"Tech Innovations for Tough Times\" .  Bloomberg Businessweek . Retrieved  3 October  2010 .   \n ^   Lewis, Peter (September 19, 2005).  \"A Perpetual Crisis Machine\" .  CNNMoney.com . Retrieved  3 October  2010 .   \n ^   European TRIZ Association ETRIA official website -  www.etria.eu \n ^   \"ETRIA – European TRIZ Association\" .  The TRIZ Journal . 21 January 2001 . Retrieved  19 March  2016 .   \n ^   \"European TRIZ Association\" .  WorldCat . Retrieved  19 March  2016 .   \n Books on TRIZ [ edit ] \n Altshuller, Genrich (1999).  The Innovation Algorithm: TRIZ, systematic innovation, and technical creativity . Worcester, MA: Technical Innovation Center.  ISBN   0-9640740-4-4 .   \n Altshuller, Genrich (1984).  Creativity as an Exact Science . New York, NY: Gordon & Breach.  ISBN   0-677-21230-5 .   \n Altshuller, Genrich (1994).  And Suddenly the Inventor Appeared . translated by Lev Shulyak. Worcester, MA: Technical Innovation Center.  ISBN   0-9640740-2-8 .   \n Altshuller, Genrich (2005).  40 Principles:Extended Edition . translated by Lev Shulyak with additions by Dana Clarke, Sr. Worcester, MA: Technical Innovation Center.  ISBN   0-9640740-5-2 .   \n Gadd, Karen (2011).  TRIZ for Engineers: Enabling Inventive problem Solving . United Kingdom: Wiley.  ISBN   978-0470741887 .   \n Cameron, Gordon (2015).  The Engineer at Large: The Essential Guide to Structured Problem Solving and Creative Innovation . United States: www.TRIZICS.com.  ISBN   978-1503318328 .   \n Cameron, Gordon (2010).  Trizics: Teach yourself TRIZ, how to invent, innovate and solve \"impossible\" technical problems systematically . United States: www.TRIZICS.com.  ISBN   978-1456319892 .   \n Royzen, Zinovy (2009).  Designing and Manufacturing Better Products Faster Using TRIZ . United States: TRIZ Consulting, Inc. www.trizconsulting.com.  ISBN   978-0-9728543-0-6 .   \n External links [ edit ] \n Official G.S. Altshuller foundation \n The Altshuller Institute for TRIZ Studies , Worcester, MA, USA \n The European TRIZ Association \n The TRIZ Journal \n Online TRIZ Tool \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=TRIZ&oldid=800746951 \"\t\t\t\t\t \n Categories :  1946 introductions TRIZ Problem solving Creativity techniques Soviet inventions Hidden categories:  CS1 Russian-language sources (ru) Pages using citations with accessdate and no URL Articles needing additional references from July 2012 All articles needing additional references Articles containing Russian-language text Articles with specifically marked weasel-worded phrases from May 2015 All articles with unsourced statements Articles with unsourced statements from July 2015 Articles with unsourced statements from March 2016   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons   \n Languages \n Afrikaans العربية تۆرکجه Čeština Deutsch Español فارسی Français Galego 한국어 Italiano Lietuvių 日本語 Polski Português Русский Slovenščina Svenska Türkçe Українська Tiếng Việt 中文   \n Edit links   \n  This page was last edited on 15 September 2017, at 12:18. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}