{"url": "http://www.w3.org/Consortium/Legal/2015/copyright-software-and-document", "content": "W3C Software and Document Notice and License \n W3C \n Standards \n Participate \n Membership \n About W3C \n Site Navigation \n Policies and Legal Information  \n Licenses for W3C Test Suites \n Policies for Contribution of Test Cases to W3C \n Intellectual Rights FAQ \n W3C Privacy Statements \n W3C Document License \n W3C Trademarks and Generic Terms \n W3C® Trademark and Service Mark License \n W3C Software Notice and License \n W3C Invited Expert and Collaborators Agreement \n W3C URI Persistence Policy \n Mirroring the W3C Site \n Translations of the Copyright Notice \n Antitrust and Competition Guidance \n Skip \n W3C   »   \n About W3C   »   \n Facts About W3C   »   \n Policies and Legal Information   »   \n W3C Software Notice and License \n W3C Software and Document Notice and License \n Status:  This license takes effect 13 May, 2015. \n This work is being provided by the copyright holders under the following\nlicense. \n License \nBy obtaining and/or copying this work, you (the licensee)\nagree that you have read, understood, and will comply with the following\nterms and conditions. \n Permission to copy, modify, and distribute this work, with or without modification, for any purpose and without\nfee or royalty is hereby granted, provided that you include the following on\nALL copies of the work or portions thereof, including\nmodifications: \n The full text of this NOTICE in a location\n    viewable to users of the redistributed or derivative\n    work. \n Any pre-existing intellectual property\n    disclaimers, notices, or terms and conditions. If none exist,\n    the  W3C Software and Document Short Notice  should be included. \n Notice of any changes or modifications, through a copyright statement on the new code or document such as \"This software or document includes material copied from or derived from [title and URI of the W3C document]. Copyright © [YEAR] W3C® (MIT, ERCIM, Keio, Beihang).\"  \n Disclaimers \n THIS WORK IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS\nMAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT\nLIMITED TO, WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR\nPURPOSE OR THAT THE USE OF THE SOFTWARE OR DOCUMENT WILL NOT INFRINGE\nANY THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS. \n COPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE SOFTWARE OR\nDOCUMENT. \n The name and trademarks of copyright holders may NOT be used in\nadvertising or publicity pertaining to the work without specific, written\nprior permission. Title to copyright in this work will at all times remain with copyright holders. \n Notes \n This version:  http://www.w3.org/Consortium/Legal/2015/copyright-software-and-document \n Previous version:  http://www.w3.org/Consortium/Legal/2002/copyright-software-20021231 \n This version makes clear that the license is applicable to both software and text, by changing the name and substituting \"work\" for instances of \"software and its documentation.\" It moves \"notice of changes or modifications to the files\" to the copyright notice, to make clear that the license is compatible with other liberal licenses. \n Footer Navigation \n Navigation \n Home \n Standards \n Participate \n Membership \n About W3C \n Contact W3C \n Contact \n Help and FAQ \n Sponsor / Donate \n Site Map \n Feedback \n W3C Updates \n Copyright © 2017 W3C  ®  ( \n MIT \n ,  \n  ERCIM \n ,  Keio ,  Beihang )  Usage policies apply ."}