{"url": "http://ev.buaa.edu.cn/info/1035/1641.htm", "content": "Several Cooperation Agreement Signed Between Beihang and Russian Universities-BEIHANG \n About BUAA \n Overview \n President's Welcome \n BUAA Today \n Current Leaders \n Administration \n Statistics \n Maps \n Admission \n Why BUAA \n Undergraduate \n Graduate \n Chinese Training \n International Education \n Exchange Program \n Scholarship \n Research \n NLAA \n IRI \n Labs & Centers \n Key Disciplines \n News & Events \n News \n Events \n Campus Life \n General Information \n Campus Map \n Alumni \n Alumni \n Donate \n Share To \n   中文版 \n                                                News\r\n Several Cooperation Agreement Signed Between Beihang and Russian Universities \n Release time：September 25, 2017  /  Mingzhu Li  \n Recently, Beihang University signed a university-level cooperation framework agreement and a letter of intent about the establishment of China-Russia Joint Laboratory for Aeronautic Science with Bauman Moscow State Technical University, a university-level cooperation agreement and a student exchange agreement with Peter the Great St. Petersburg Polytechnic University, and renewed the student exchange agreement with Moscow Aviation Institute.    \r\n    \n    \n Founded in 1830, Bauman Moscow State Technical University, a National Research University of Russia, has cultivated more than 200,000 excellent engineers, including Sergei Korolev, the father of carrier rocket, Sukhoi, a famous airplane designer in the Soviet Union and so on, and given birth to Russia’s first helicopter, first aerodynamic wind tunnel, first diesel locomotive and first gas turbine locomotive. Teachers of Beihang and Bauman have already cooperated in several programs in automatic electromechanical control, mechanisms and techniques of composite vibration processing and cutting, navigation instruments and micro and small satellites.    \r\n     \n    \n Since the two universities signed the agreement of student exchange in 2014, 25 students have participated in the student exchange program and the short-term exchange program. According to the agreement and the letter of intent signed this time, the two sides will cooperate comprehensively in both teaching and scientific research, and found the China-Russia Aeronautic Science Joint Laboratory. They will also hold international conferences, found international academic journals, publish academic papers and launch research projects together. \n    \n The main building of Bauman Moscow State Technical University \n    \n Peter the Great St. Petersburg Polytechnic University was founded in 1899 and selected as a National Research University of Russia and a Project 5-100 member. Formerly named Leningrad Polytechnic Institute, it received a number of Chinese students in 1950s, and Academician Qixian Zhang, a founder of the robotics discipline in Beihang, was its alumnus. In the academic year from 2016 to 2017, 45 Beihang students joined the summer school held by it. Following the signed agreements, the two universities will pursue all-round cooperation in the teaching and research of preponderant disciplines such as energy and powering, and organize exchange programs during semesters as well as winter and summer vacations.    \r\n     \n    \n Beihang students in the summer school held by Peter the Great St. Petersburg Polytechnic University \n    \n Moscow Aviation Institute (MAI) was founded in 1930, and is now a National Research University of Russia. It has cultivated 160,000 experts in aerospace, 250 chief designers, 100 test pilots and 21 astronauts, and its first professors were designers from the former Sukhoi, Tupolev, MiG and Yakovlev design bureaus. Since it signed the agreement of student exchange with Beihang in 2012, each side has sent 15 students to the other for the exchange program, and 60 MAI students have participated in short-term exchange programs like summer schools at Beihang. According to the renewed agreement, the exchange programs will continue on the basis of exchange of students, exemption of tuition fees and recognition of credits. \n    \n Moscow Aviation Institute \n    \n Written by Lingpei Wang \n  Edited by Qing Wang \n  Translated by Mingzhu Li \n    \n    \n    \n    \n September 23, 2017 \n Prof. Dongming Wang Elected Member of Academy of Europe"}