{"url": "https://www.snap.com/en-US/supplier-responsibility/labor-policy/", "content": "Supplier Responsibility – Anti-Slavery – Snap Inc. \n Snap Inc. Jobs News Investors Supplier Responsibility Supplier Code of Conduct Anti-Slavery Conflict Minerals Anti-Slavery \n Snap Inc. Statement Against Human Trafficking and Slavery \n Snap Inc. and its subsidiaries (“Snap”) categorically do not tolerate human-rights violations -- including but not limited to slavery, forced labor, and human trafficking -- in our own operations, in our supply chain, or in our partnerships. To this end, Snap Inc. has established a three-pronged approach to evaluate and eradicate risks related to slavery, forced labor, and human trafficking in our supply chain for branded products. This statement, published in accordance with the UK Modern Slavery Act of 2015, reflects Snap’s progress during the 2016 fiscal year. \n Policies.  Our commitment is set forth in our  Supplier Code of Business Conduct . The Code requires suppliers to commit not to use slavery, forced labor, and human trafficking; to ensure that their own suppliers follow the same rules; and to let Snap conduct assessments to ensure compliance. \n Training.  Snap provides training to our employees who interact with our supply chain. This training underscores our stand against slavery, forced labor, and human trafficking. It also helps to ensure that our employees will be able to recognize, and will know how to report, any human-rights violations and “red flags” at supplier sites. \n Verification.  Snap conducts third-party assessments to validate supplier compliance with legal requirements and our Code. \n This  statement  is signed by the CEO of Snap Inc. on behalf of the Snap Inc. Board of Directors. \n © 2017 Snap Inc. Privacy Policy Terms of Service Other Terms & Policies Impressum Dansk Deutsch English (US) English (UK) Español Français Italiano 日本語 Nederlands Norsk Polish Português (Brasil) Suomi Svenska"}