{"url": "http://www.w3.org/TR/2016/NOTE-WCAG20-TECHS-20161007/F41", "content": "F41: Failure of Success Criterion 2.2.1, 2.2.4, and 3.2.5 due to using meta refresh to reload the page | Techniques for WCAG 2.0\n               Techniques for WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  Failure F40 Next:  Failure F42 On this page: Important Information about Techniques Applicability Description Examples Related Techniques Tests -     F41: Failure of Success Criterion 2.2.1, 2.2.4, and 3.2.5 due to using meta refresh to reload the page Important Information about Techniques See  Understanding Techniques for WCAG Success Criteria  for important information about the usage of these informative techniques and how they relate to the normative WCAG 2.0 success criteria. The Applicability section explains the scope of the technique, and the presence of techniques for a specific technology does not imply that the technology can be used in all situations to create content that meets WCAG 2.0. Applicability HTML and XHTML This failure relates to: \n\t\t\t\tSuccess Criterion 2.2.1 (Timing Adjustable) \n\t\t\t\t\t\tHow to Meet 2.2.1 (Timing Adjustable)\n\t\t\t\t\t\tUnderstanding Success Criterion 2.2.1 (Timing Adjustable)\n\t\t\t\tSuccess Criterion 2.2.4 (Interruptions) \n\t\t\t\t\t\tHow to Meet 2.2.4 (Interruptions)\n\t\t\t\t\t\tUnderstanding Success Criterion 2.2.4 (Interruptions)\n\t\t\t\tSuccess Criterion 3.2.5 (Change on Request) \n\t\t\t\t\t\tHow to Meet 3.2.5 (Change on Request)\n\t\t\t\t\t\tUnderstanding Success Criterion 3.2.5 (Change on Request)\n\t\t\t\t\t Description \n meta \n http-equiv  of refresh is often used to periodically refresh\n                        pages or to redirect users to another page. If the time interval is too\n                        short, and there is no way to turn auto-refresh off, people who are blind will not have enough time to make their screen\n                        readers read the page before the page refreshes unexpectedly and causes the\n                        screen reader to begin reading at the top. Sighted users may also be\n                        disoriented by the unexpected refresh. Examples \n\t\t\t\t\tFailure Example 1  This is a deprecated example that changes the user's page at regular\n                                intervals. Content developers should not use this technique to\n                                simulate \"push\" technology. Developers cannot predict how much time\n                                a user will require to read a page; premature refresh can disorient\n                                users. Content developers should avoid periodic refresh and allow\n                                users to choose when they want the latest information. (The number\n                                in the  content  attribute is the refresh interval in\n                                seconds.) Example Code: \n<html xmlns=\"http://www.w3.org/1999/xhtml\" lang=\"en\">\n  <head>     \n    <title>HTML Techniques for WCAG 2.0</title>     \n    <meta http-equiv=\"refresh\" content=\"60\" />   \n  </head>   \n  <body>\n    ...     \n  </body> \n</html>\n Related Techniques (none currently listed) Tests Procedure  Find  meta  elements in the document.  For each  meta  element, check if it contains\n               the  http-equiv  attribute with value \"refresh\" (case-insensitive) and\n               the  content  attribute with a number (representing seconds) equals to or greater than 0 and without \"; url=\" (case-insensitive).  check to see if there is a mechanism to turn off the refresh.  Expected Results If step 2 is true and step 3 is false then this failure condition applies and content\n                                    fails these Success Criteria.  Top Contents Intro Previous:  Failure F40 Next:  Failure F42 This Web page is part of  Techniques and Failures for Web Content Accessibility Guidelines 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}