{"url": "https://en.wikipedia.org/wiki/Mukti-yogyas", "content": "Mukti-yogyas - Wikipedia \n Mukti-yogyas   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n In  Dvaita  theology,  Mukti-yogyas  is a class of souls classified by  Shri Madhvacharya  as eligible for mukti or  moksha . Madhva divides souls into three classes: one class of souls which qualify for liberation ( Mukti-yogyas ), another subject to eternal rebirth or eternal transmigration ( Nitya-samsarins ), and a third class that is eventually condemned to eternal  hell  or  Andhatamas  ( Tamo-yogyas ). [1] \n Mukti-yogyas are  Jivas  or souls who are receptive to spiritual values, and through repeated embodiments they evolve into better and better men, and finally through concentrated spiritual discipline and God's grace attain salvation. \n References [ edit ] \n ^   Tapasyananda, Swami.  Bhakti Schools of Vedanta  pg. 177. \n This  Hindu philosophy -related article is a  stub . You can help Wikipedia by  expanding it . \n v \n t \n e \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Mukti-yogyas&oldid=770294654 \"\t\t\t\t\t \n Categories :  Dvaita Hindu philosophical concepts Hindu philosophy stubs Hidden categories:  All stub articles   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Add links   \n  This page was last edited on 14 March 2017, at 15:52. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}