{"url": "https://www.osc.gov.on.ca/en/careers.htm", "content": "Careers \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   About   /   Careers \n  Join our team \n  Students \n    Apply   \n Join our team \n  These are exciting times in securities regulation. Evolving markets mean new ways of thinking and new ways of addressing complex challenges. Every day at the OSC is an opportunity to learn, innovate and grow professionally in a supportive, stimulating workplace. \n  Check out our current opportunities and  apply online . \n What we do makes a difference \n Come see for yourself why the OSC is not just a great place to build your career – it’s also an inspirational place to work. We are proud to showcase a few game-changing examples of how we are delivering strong investor protection and fostering confidence in capital markets. \n Whistleblower Program \n First of its kind for securities regulators in Canada!\nWe offer whistleblowers potential incentives of up to  \n$5 million and anti-retaliation protections for tips on possible violations of Ontario securities law. \n More info   \n OSC LaunchPad \n Another first in Canada! OSC LaunchPad is a dedicated team working to create a better regulatory experience for emerging businesses that provide services, products and applications for investors. \n More info   \n OSC in the Community \n Our staff visits communities across Ontario to speak directly with retail investors and educate them on investment fraud prevention. Find out where you can attend our next free seminar or dial in to a teletownhall. \n More info   \n Best interest standard \n Putting investors first is our priority. We’re exploring a new standard that would require advisors to put their clients’ interests ahead of their own when it comes to giving investment advice.  \n More info   \n Mutual fund fees review  \n Investors are concerned about conflicts of interests from embedded commissions. Through research and ongoing reviews, we’re examining ways to address these conflicts. \n More info   \n Women on boards \n We broke ground with new “comply-or-explain” disclosure requirements relating to representation of women on boards and in executive roles at public companies in Canada.  \n More info \n ‹ Previous   › Next   \n Life at the OSC \n The work we do is serious, but we also take time to celebrate our people and our successes, and have fun doing it. We get involved in local communities and support a number of worthy causes.  Picture yourself here! \n Chair Maureen Jensen joined staff, Executives & Commissioners to kick off our United Way campaign at Halloween. \n At a Halloween Scare Fair, staff get into the spirit of raising funds toward our $100k goal for United Way.  \n Accounting staff hosted a roundtable about promoting effective corporate governance and decision-making through diverse boards. \n OSC Employee Pride Group at our 2 nd  Annual Pride Celebration: \"We're very lucky to work in an inclusive workplace that values us for who we are. \n In 2017, we celebrated 72 employees who have dedicated a combined 775 years to the OSC and public service. \n OSC staff take steps to increase their daily activity and improve their health in the Global Challenge's 100-day walking journey. \n Enforcement Director Jeff Kehoe and General Counsel James Sinclair practise hitting the mark at a team-building event. \n Our Chair, Executive Director and Corporate Finance staff celebrated 2017 International Women’s Day. #BeBoldForChange \n The OSC is a proud United Way supporter and was happy to be nominated for a 2016 Spirit Award! In 2016, we raised $119k for our local communities. \n More than 70 staff, Commissioners and senior leaders participated in our 2017 speed mentoring event. \n Commissioner AnneMarie Ryan shared career advice with a mentee: “Take risks and go outside your comfort zone.” \n Staff gathered together to kick off the holiday season at the annual Employee Meeting & Festive Reception. \n Ontario Finance Minister Charles Sousa joined staff volunteers and the OSC LaunchPad team at our first regulatory hackathon, RegHackTO. \n We have a long tradition of supporting Davies' Annual Moot Court Competition. Our staff and commissioners enjoy mentoring the next generation of lawyers. \n What it’s like to work here \n We think the best way to get to know us is straight from our staff. Meet some of our employees and see why they chose the OSC to build their career. \n “There’s always something new coming down the pipeline, which challenges me to work in different ways and flex my skills.” \n   Darlene Watson   Project Specialist, Strategy and Risk    \n “It’s exciting to be on the front line of policy initiatives and to be involved in work that has a direct impact on protecting investors.\" \n   Jarrod Smith   Accountant, Compliance and \nRegistrant Regulation   \n “The OSC is a forward-looking organization that’s driven by innovation and modernization, which means each day is full of new and interesting challenges.” \n   Kevan Hannah   Advisor, Investor Office   \n Benefits of working at the OSC \n  Competitive compensation package  \nAttractive health and dental benefits \nPremier pension plan  \n  Interesting and meaningful work \nForward-thinking professionals \nCulture of learning  \n  Flexible work arrangements \nGenerous time off \nWellness initiatives  \n Apply   \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario"}