{"url": "http://www.w3.org/Style/2003/css3-color-comments.html", "content": "CSS3 Module: Color — Disposition of Comments             CSS3 Module: Color — Disposition of Comments     Date:   2003-04-14   Authors:   Tantek Çelik \r( Microsoft ) \r< tantekc@microsoft.com >       Copyright \r© 2003  W3C ®  ( MIT ,  ERCIM ,  Keio ),\rAll Rights Reserved. W3C  liability ,\r trademark ,\r document\ruse  and  software\rlicensing  rules apply.\r     Abstract   This document details the responses \rmade to issues in the  CSS3 Module: Color  \rLast Call specification. The comments were raised by the public (via \r www-style@w3.org ) \ror other W3C Working Groups.\r   Introduction   This document describes the disposition of comments in\rrelation to the Last Call Working Draft of  CSS3 Module: Color  \rthat were made during the Last Call period which ended 28 February 2003.\rEach issue is described by the name and\rcontact information of the commentator, a description of the\rissue, and either the resolution or the reason that the issue\rwas not resolved.     Comments regarding the Last Call are shown in the left column like this.\r       Items that are accepted are shown with a light green background like this.\rSuch items typically imply that as a result of the comment, a change was made in the specification.\r   While items declined are shown with a light red background like this.   Items deferred to a subsequent version (such as feature requests) are shown \rwith a light yellow background like this.   Finally, simply informative responses (answers to questions, elaborations, etc.) \r are styled with a light blue background like this.     Comments Received         \r[css3-colors] Comments on Last Call  From: Christoph Päper (christoph.paeper@tu-clausthal.de), \rDate: Sun, Feb 16 2003 and Responses  1 , \r 2 , \r 3 ,\r 4         #   Comment   Answer       1     · <alphavalue>, rgba, hsla etc.   \rI don't understand, why alpha values are noted as a number between 0 and 1,\rwhile for colors percentages are used. They're pretty much the same, except\rpercentages are 100 times the value and sufficed by '%'.\rHSL is the strangest: RGB allows you to decide, whether you use values\rbetween 0 and 255 or percentages. HSL OTOH requires a mixture of these.\rHSLA, as RGBA, even adds 0..1 for the alpha value--three different notations\rin one color definition.\r       \rAlpha values were introduced as values between 0 and 1 in the SVG 1.0 specification.  CSS3 Color continues with that convention.  Similarly, the rgb() color value format which takes percentages or integers 0..255 was introduced in CSS1 and CSS3 Color continues with that as well.  HSL was chosen to be consistent with the proposal made by Steven Pemberton.\r         2     3.1. Foreground color: the 'color' property   \rThe computed value for HTML4 keywords, RGB hex values\rand SVG color keywords is the equivalent six digit hex value.\rThe computed value of the keyword 'transparent' is rgba(0,0,0,0).\r   \rAm I the only one to whom this looks a bit strange (always hex, but for\r'transparent')? Not that there was an alternative, except introducing 4 and\r8 digit hex values with transparency.\r       \rActually, \"equivalent six digit hex value\" could be represented as an rgb() value internally as well.  CSS3 Color does not require a particular internal representation.  To clarify this, I have changed the wording in the text to say \"equivalent triplet of numerical RGB values\".\r         3     3.1.1. Gamma correction   \rI really don't see, why details for browser implementation across OSs have\rto be in the spec.\r       \rDW> Whilst strictly speaking they shouldn't be there, except as a  \rDW> non-normative appendix, this is an area that implementors are very \rDW> likely to get wrong, even with it explicitly in the standard.   \rThat is exactly why it has been in CSS ever since CSS1 (and still the\rimplementors get it wrong).\r \rDW> There is widespread ignorance about gamma, certainly amongst  \rDW> amateurs, marketing people, and programmers writing web pages (and \rDW> browsers). It is possible that some professional designers are \rDW> aware, but I suspect knowledge is rare there. Only really people \rDW> who specialise in colourimetry really know about it; browser \rDW> programmers are likely to have little technical knowledge in this \rDW> area.\r \rYes, agreed. And because color is complicated in general, such\rprogrammers ignore it completely, even the brain-dead simple stuff\rlike gamma correction.\r \rDW> It is very common to find gamma 1.0 or gamma 1.45 images on \rDW> commercial web sites, and most amateurs distribute images out of \rDW> their camera, which often have gamma 1.0, and loss of significance \rDW> on some channels (typically blue and green). On the other hand \rDW> very few people seem to realise that there is anything wrong with \rDW> their over-dark and poorly colour balanced images!   \rAn image with gamma 1.0 is not over dark or poorly balanced provided\rit *says* it is a gamma 1.0 image.\r \rDW> (One of the things that irritates me about image manipulation \rDW> programs is their poor support of gamma; I'd like to be able to \rDW> convert to gamma 1.0, adjust black and white levels, and then \rDW> return to gamma 2.2, without unecessary loss of significance, but \rDW> find I'm forced to to the steps individually - they really need to \rDW> either accumulate a transform, or work with more colour depth than \rDW> the images.)   \rWorking with more color depth is the usual solution to this.\r \rDW> I think every opportunity needs to be taken to stress gamma, if \rDW> one is to hope for good quality images.   \rI agree.\r \rDW> Incidentally, what is describe is the effect of both hardware and \rDW> OS; Macs have gamma 1.45 because of their hardware, not their \rDW> software.   \rYes, agreed.\r         4   3.4. The 'rendering-intent' property   Hm, all the other baby-blue tables have more details than just the property name.       \rI have double checked the property description table for 'rendering-intent' and it seems to show the values, initial value, media etc. just like the other properties.  Perhaps a problem with the W3C working draft style sheet and your browser?\r         5   4.1. HTML4 color keywords   The table should look like the one in 4.3.     \rThe table was taken from HTML4.01:\r http://www.w3.org/TR/html401/types.html#h-6.5 \rand kept that way to make it clear that it was the same table.\r       6   4.2.4. HSL color values   \rBy definition red=0=360, and the other colors are\rspread around the circle, so green=120, glue=240,\r   :-D\r   \rI've never heard of the ABC programming language before, as may others, and\rwould prefer to see the algorithms expressed in English, although ABC is\rsomehow close to that.\r   \rSince it sounds like ABC is acceptable to you, I prefer leaving it like that, since it is precisely defined as currently written, and I have received feedback from implementers that confirms that.\r       7     4.2.4.1. HSL Examples   \rI haven't checked why, but the color charts are all placed next to each\rother horizontally in my Opera 6.05.\r       \rThat is a bug in Opera 6.05. According to CSS1 (and latter versions) floats don't fit horizontally next to other floats inside their containing block are supposed to be placed below (essentially, wrapped to the next \"line\") where they will fit.  I believe this may be fixed in a newer versions.\r         8   4.3. SVG color keywords   \rJust wanted to express my objection against the /official/ inclusion of the\rmad X11 color names, again. I'd have rather seen CNS or the suggestion from\r http://lists.w3.org/Archives/Public/www-style/2002May/0201.html , which are\rmore user friendly and memorable.\r     \rThe /official/ inclusion of the X11 color names occurred quite some time ago in the SVG 1.0 specification which is a W3C Recommendation, and was reiterated in the SVG 1.1 specification which is also a W3C Recommendation.\r   http://www.w3.org/TR/2001/REC-SVG-20010904/   http://www.w3.org/TR/2003/REC-SVG11-20030114/           9   4.3. SVG color keywords   \rPlease adjust the case in the table header cells and use uppercase\rhexadecimal digits.\r     \rI have adjusted the case in the table header cells and hexadecimal digits as you suggested.\r         10   4.4. 'currentColor' color keyword   \rNothing against it, but camelCase isn't something CSS used to use, is it?\rSystem colors use it, but with the starting letter being capital =>\r'CurrentColor'.\r     \rValues in CSS are case-insensitive, thus you may use any of the following:\r     currentColor   CurrentColor   currentcolor   \rThe particular capitalization 'currentColor' is used in the spec simply because that is the same capitalization that is used for that value in the SVG specifications.\r         11   4.5. CSS System Colors   \rIf I have\r   \r  body {background: AppWorkspace;}\r   \rand the browser has a wallpaper for the MDI background (e.g. Opera allows\rthat), should/may this image be shown as page background or definitely just\rthe color?\r \rThis is of course a bit out of scope of the Color Module.\r     \rThe wallpaper should probably not be shown because that would be a system background-image, rather than a system background-color.\r \rHowever, you have revealed the problem with the system colors, and that is that they are an extreme oversimplification of the problem of default system appearance.  Even with \"loosely\" interpretation allowing a named \"color\" to represent a fill or a pattern, there are many aspects of the user interface which a simple color value is unable to represent.\r \rThus we are deprecating the system colors in preference to the upcoming CSS3 Basic UI appearance property.\r         12   5. Sample style sheet for HTML 4.0   \rWhy \"HTML 4.0\" and not \"XHTML 1\", \"XHTML 1.1\", \"XHTML 1.0\", \"HTML 4.01\" or\r\"HTML 4\"? Well, for XHTML the first selector should presumably read \"html,\rbody\".\r \rMore generally: Why is HTML4 used as normative source, e.g. for color names,\rinstead of XHTML1?\r     \rIn reverse order — you are right, HTML4 should be not used as a normative source, e.g. for color names, as this specification itself serves to define the color names and values.\r \rXHTML1 cannot be used as a normative source for color names because it has no definition of color names.  XHTML1 itself actually has very little defined meaning, and instead relies upon HTML4 for (nearly) all of its semantics.\r \rI have updated the sample style sheet to note that it can be used for XHTML as well as you suggested.\r           \rRe: CSS3: Color  \rFrom: \"fantasai\" <fantasai@escape.com>, \rDate: 17 February 2003 \rand Responses  1 , \r 2 ,\r 3         #   Comment   Answer       13   \rNone of the suggested changes to the color names made it in. How so?\r \rSpecifically, there seemed to be a consensus on www-style that X11\rcolors should be included *and* deprecated; this is not reflected\rin the draft. The first post here is representative.\r     \rRegarding the X11 colors:\r \rFrom the Changes section:\r   http://www.w3.org/TR/css3-color/#changes     \rColor names/values harmonized with SVG 1.0. There was substantial feedback\ron the previous draft that requested that CSS3 Color normatively list all\rthe normative color names/values which are accepted by SVG 1.0. This\rdocument now contains the following additional named colors: darkgrey,\rdarkslategrey, dimgrey, lightgray, lightslategrey, slategrey. Note that this\rchange was also made in accordance with the TAG finding regarding\rConsistency of Formatting Property Names, Values, and Semantics.\r   http://www.w3.org/2001/tag/doc/formatting-properties.html             14   The second one\rdiscusses the shortcomings of user preference color keywords, also\rnoting objections to the system color keywords in the last Last Call\rWorking Draft. Nothing in these sections changed, either. Why?\r     \rRegarding the message you quoted regarding user preference color keywords\rfor hyperlink colors:\r   http://lists.w3.org/Archives/Public/www-style/2002Sep/0061.html   \rI still have the same opinion regarding user preferences for hyperlink\rcolors, but that was my opinion, and one implementer has asked for these\rkeywords, and there didn't seem to be much other negative feedback regarding\rthe user preferences for hyperlink colors.\r \rIf folks think we should drop the user preferences for hyperlink colors, we\rcould certainly do so, between last call and CR.  However, my opinion alone\ris insufficient to do so. Additional feedback is needed.\r   \r...\r   Note: since this initial reply, there was follow up discussion where the following decisions have been made:   The Hyperlink colors have been removed.   The limited and insufficient CSS2 System Colors have been deprecated             \rRe: CSS3: Color  \rFrom: Andrew Thompson <lordpixel@mac.com>, \rDate: 18 February 2003 \rand Response  1         #   Comment   Answer       15   \rWell, I was going to stay out of it this time, but since you asked...\rNeither current mainstream OS (Win XP or Mac OS X) is in any way \radequately covered by the system colors. Both use textures, shadows, \rhighlights etc in ways the System Colors don't capture. I don't know \renough about Gnome or KDE to comment on these.\r   \rAbsolutely.  We even tried to extend the system colors to cover many more\rtypes of user interface elements and states etc. in a previous draft.\rHowever modern user interfaces use far more than just color (or fonts) for\rthe appearance of OS widgets.  Hence we decided to stick with the short list\rfrom before rather than extending it in a way which was still far from\radequate.\r   \r...\r   Update: The system colors have been deprecated for exactly these reasons.\r         16   \rWell, on reading I'd assumed the utility of these keywords is to enable \rme to style some arbitrary element in some way such that it looks more \rlike a hyperlink to the user - at least it uses the same colors. eg, I \rsuppose I could have an <object> element that behaves similarly to a \rhyperlink when the embedded content is clicked on. I might want to \rstyle it with in the appropriate colors borders so it looks like a \rhyperlink to the user.\r \rI took at look at your proposed alternate Tantek, and I'm not sure how \rI'd achieve something like that using your user stylesheet scheme. I'd \rassumed something like that was the use case for this feature.\r       \rYou've missed the point(s).\r \rThe alternate that I provided is for  implementers  seeking to understand\rhow to properly reflect user preferences for hyperlink colors via style\rrules prepended to the user style sheet.\r \rYou're speaking from the perspective of an author.  Authors simply do what\rfantasai suggested:\r   \r  That's it? This is what you're adding color names for? Why, that's easy\r  to do even now. Just don't override the user's link colors.\r   \rAnd as far as borders go, border-color has the initial value of \"the value\rof the color property\" so there is again no need to set it to anything.\rSimply set the 'border-style' to something other than 'none' and the\rappropriately colored border should show up.\r \rThe \"C\" in CSS stands for Cascading.  Using a system with a cascade means\rsometimes the answer is to *not* do something, to *not* interfere with the\rdefault/user-preferred style rules which are already cascading into place,\rrather than *doing* something, and then *doing* something else on top to fix\rit up.  Sometimes less code works better than more.  Often in fact.\r           \rRe: CSS3: Color  \rFrom: Ian Hickson <ian@hixie.ch>, \rDate: 19 February 2003 \r       #   Comment   Answer       17       I am still *for* dropping the CSS3 hyperlink colors.\r \rIt appears that fantasai is also for dropping them.\r \rDoes anyone else have an opinion either way?\r     \rI was one of the original proponents of the hyperlink keywords, but I\rretract my request for them, as you have since then convinced me that\rsimply using user stylesheets is the better solution for prefs, and\r'appearance' is the better solution for applications built with CSS.\r \rNote, though, that some properties still depend on prefs for the actual\rvalues of their keywords, for example font-size:medium, and the initial\rvalue of the 'color' and 'font' properties.\r     Accepted.  The hyperlink keywords have been dropped.\r         \rRegarding possible error: CSS3 module: Color (W3C Working Draft 14 February 2003)  \rFrom: Russ Weakley <russ@maxdesign.com.au>, \rDate: 14 February 2003 \rand Response  1         #   Comment   Answer       18   \rI would like to point out what looks like an error in your document:\r   http://www.w3.org/TR/2003/WD-css3-color-20030214/   CSS3 module: Color   W3C Working Draft 14 February 2003   \rThe relevant section reads:\r   \rThe format of an RGBA value in the functional notation is 'rgba(' followed by a comma-separated list of three numerical values (either three integer values or three percentage values), followed by an <alphavalue>, followed by ')'. The integer value 255 corresponds to 100%, rgb(255,255,255,0.8) = rgb(100%,100%,100%,0.8). Whitespace characters are allowed around the numerical values.\r   \rIt looks like the two \"RGB\" examples should be \"RGBA\". So the wording would be:\r   \rrgba(255,255,255,0.8) = rgba(100%,100%,100%,0.8)\r     \ryes, correct. thank you.\r         Re: CSS3: Color  \rFrom: Etan Wexler <ewexler@stickdog.comgt;, \rDate: 21 February 2003 \r       #   Comment   Answer       19       If folks think we should drop the user preferences for hyperlink colors, we\r could certainly do so, between last call and CR.  However, my opinion alone is insufficient to do so. Additional feedback is needed.\r   \rCount me in agreement with Tantek. This is a \"me too\" message because\rTantek stated the case so well originally.\r     \rAccepted.\r         RE: CSS3 module: Color  \rFrom: Jonathan Stanley <jon@asciigrackle.eclipse.co.uk>, \rDate: 26 February 2003 \rand Responses \r  1 , \r  2 ,\r  3         20   \rHi\r \rHad a good little read from a users point of view, and quite excited about\rsome of the things it'll bring (though how soon browsers support it is a\rslightly different matter :( )\r \rAnyway, I see within the RGB(A) model, the valid ranges are defined in\rsection 4.2.2:\r \r---\r \rem { color: rgb(255,0,0) }      /* integer range 0 - 255 */\rem { color: rgba(255,0,0,1)     /* the same, with explicit opacity of 1 */\rem { color: rgb(100%,0%,0%) }   /* float range 0.0% - 100.0% */\rem { color: rgba(100%,0%,0%,1) } /* the same, with explicit opacity of 1 */\r \r---\r   \rIf R, G and B can have values from 0.0% to 100.0% percent, then why is A,\ralpha, so limited within the bounds of 0.0 to 1.0, equivanlent to 0% to 100%\rin 10% steps. So perhaps a range from 0.00 to 1.00? Or alternatively, why\raren't percentages used for that (alpha) value too?\r     \rThe precision is not limited to 10% steps. It can be any value, for\rexample 0.123456\r   ...   \rAs already indicated, there are uncountably infinite possible values, as\rit is a real number.\r \rI think the reasons for the differences are historical.  The values for\rR, G, and B were adapted from the deprecated HTML attributes for colour\rand these were invented by people commercialising HTML for an unsophisticated\rmarket, and used values that were probably in the API they used and reflect\rhardware engineering considerations.  Alpha has come from a more\rsophisticated graphics tradition, which is not tied to DAC register sizes.\rYou will also find that colours in PostScript are in the inteval [0, 1].\r \rThe % values are probably an attempt to regain normalised colours, allowing\rthat the simple [0,1] range was taken.\r         21   \rShould opacity keywords be available? eg:\r   \rtransparent: alpha = 0\rvery-transparent: alpha = 0.25\rsemi-transparent(/semi-opaque?): alpha = 0.5\rvery-opaque: alpha = 0.75\ropaque: alpha = 1\r       \rThe specification does include the keyword 'transparent' as was defined originally in CSS1 for the background-color property, and extended in CSS2 to the the <border-color> value type, and the 'color' property in OEB1.0.1.  However, the specification does not add any more opacity/alpha keywords (for the moment).  We may reconsider doing so in the future if there is sufficient demand for them (and some set of symbolic keywords which might serve as handy mnemonics for authors).\r         22     \rThere also isn't bounds for values when using the HSL(A) colour model, other\rthan definition of hue, that 0 = 360, no definition of how negative values\rare handled, eg:\r   \r* { color: hsl(-240, 100%, 50%) }\r   \r... or going round \"more than once\" in the colour wheel:\r   \r* { color: hsl(840, 100%, 50%) }\r     \rI agree that this aspect should be more clearly specified. It seems\robvious that hue is a wraparound value but for consistency of\rimplementation, it should be explicitly stated.\r         23   \rThen the \"currentColor\" property which is treated as \"inherit\" at parse\rtime, would be better hypenated? That is: \"current-color\"\r   \rThere is an issue with hyphens in names, to do with scripting. In\rresponse to a request from the DOm working group, SVG WG changed all\rthe names that it had to camelCase, except for existing CSS names that\rwe did not control.\r \rSince the currentColor value comes from SVG, that is why it uses\rcamelCase.\r \rIt has been in SVG since 1999 and is implemented in 15 or so different\rimplementations.           CSS3 module: Color  \rFrom: Susan Lesch <lesch@w3.org>, \rDate: 27 February 2003 \rand Response\r  1         24   \rThese are minor editorial comments for your \"CSS3 module: Color\"\rLast Call Working Draft  [1] . Overall it is beautiful.\r \rThe justified text is a little choppy. It sometimes slows down\rreading, see screen shot  [3] . It makes the clipboard crazy in Mac IE\r5.1.6. Can you get by without text-align: justify in  [4] ?\r \rThe profile tables could use a few pixels of padding. Also in the\rprofile tables, some td's contain p's, some don't. The td's will look\rmore similar if they all don't.\r \rAs Simon Jessey reported for CSS3 Text, the property column in the\rProperty Index is cut off on the left. I am looking in IE 5.1.6, Mac OS\r9.2.1.\r \rI hope that when the CSS3 modules reach late maturity levels that they\rwill all use US English capitalization. W3C uses en-US. W3C entities\rshould match capitalization in the W3C Process Document  [2] . Those\rcorrections are included below except for headings.\r \rTypos, some global:\r   \rs/CSS3 module: Color/CSS3 Module: Color/\rs/Status of this document/Status of This Document/\rs/working draft/Working Draft/\rs/working group/Working Group/\rs/style activity/Style Activity/\rs/candidate recommendation/Candidate Recommendation/\rs/Table of contents/Table of Contents/\rs/UAs/user agent (UA)/ (spell out every time, or show both for the \rfirst occurrence)\rs/user-agent/user agent/\rs/by International Color Consortium/by the International Color Consortium/\rs/Whitespace/White space/\rs/must NOT/must <em>not</em>/\rs/glue=240/blue=240/\rs/System Colors/system colors/ (or the other way around)\rs/camel-case/CamelCase/ (some people prefer camelCase)\r\r [1] http://www.w3.org/TR/2003/WD-css3-color-20030214/ \r [2] http://www.w3.org/Consortium/Process/ \r [3] http://www.w3.org/2003/02/26-CSS3-Color-MacIE.PNG \r [4] http://www.w3.org/TR/2003/WD-css3-color-20030214/default.css \r     \rI believe we can get by without text-align:justify.  I have passed your request to Bert, who is maintaining that style sheet.\r \rI have removed the <p>'s from inside the profile tables and added 2px of padding to their table cells, but not all browsers seem to support the padding property on table cells.\r \rI have made the editorial changes as you requested.  Thanks for the finds.\r           Re: CSS3 module: Color  \rFrom: Boris Zbarsky <bzbarsky@MIT.EDU>, \rDate: 27 February 2003 \r       25   \rChris Lilley wrote:\r     JS> * { color: hsl(840, 100%, 50%) }   \rI agree that this aspect should be more clearly specified. It seems\robvious that hue is a wraparound value but for consistency of\rimplementation, it should be explicitly stated.\r     \rOh, yes indeed.  Because it was not at all obvious to me, and my current \rimplementation in fact does _not_ treat it as a wraparound value (I kept \rmeaning to send mail asking for clarification about that, but never to \raround to it....).\r \rFurther, the matter of whether the hue is an integer or a float should \ralso be clarified (eg for rgb() the non-percentage values are integers \rand it's easy to assume the same will hold for hsl(); not sure what the \rintent here is).\r     \rAs noted above, the detail about the wrapround value has been specified.\r   You are right that whether the hue is an integer or a float should be made clear, \rand the spec defines it syntactically as a <number> which is \r according to CSS2 4.3.1 :\r   \rA <number> can either be an <integer>, or it can be zero or more digits followed by a dot (.) followed by one or more digits. Both integers and real numbers may be preceded by a \"-\" or \"+\" to indicate the sign. \r           WD-css3-color-20030214 comments  \rFrom: Etan Wexler <ewexler@stickdog.com>, \rDate: 28 February 2003\rand Response\r  1         26   \rThis message contains  an edited copy of the CSS3 color\rspecification  found at\r< http://www.w3.org/TR/2003/WD-css3-color-20030214 >. The edited\rcopy is HTML, just like the original.\r \rChanges are for the most part marked with 'del' and 'ins'\relements. Substantive changes are in the class substance while\rthe class ednit is used for minor editorial suggestions.\r \rCommentary is marked with 'div' and 'span' elements. Substantive\rcommentary is in the class comment while the class editorial is\rused for minor editorial suggestions.\r \rAdded markup for elements of types 'a' and 'abbr' is employed\rwithout the use of 'del' or 'ins' elements. These newly marked\relements are in the ednit class.\r \rWriting and using a style sheet to highlight changes is left as\ran exercise for the reader. (There wasn't enough time.)\r   \rI read through the your edited copy, trying to find your suggestions.\r \rMost of the suggestions/changes I found I accepted and have made the respective edits to the draft.\r \rThere were too many small/incompatible markup edits for me to take them all.  For example, for the moment I have ignored all the additional <abbr> markup.\r \rFor future reference, this is a very poor way to provide feedback on a W3C draft, as I'm sure it was non-trivial to write in this fashion (as edits to the document), and it is certainly non-trivial for the editors to attempt to find your suggestions and evaluate them, especially when many of them are duplicates of what was already reported, and have already been addressed by in progress editing."}