{"url": "https://en.wikipedia.org/wiki/List_of_Compact_Disc_and_DVD_copy_protection_schemes", "content": "List of Compact Disc and DVD copy protection schemes - Wikipedia \n List of Compact Disc and DVD copy protection schemes   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This is a list of notable  copy protection  schemes for CD and DVD. \n For other medias, see  List of Copy Protection Schemes . \n Contents \n 1   Commercial CD protection schemes \n 2   Commercial DVD protection schemes \n 3   Commercial Audio CD/DVD protection schemes \n 4   Console CD protection schemes \n 5   References \n Commercial CD protection schemes [ edit ] \n CD-Cops \n Requires the user to enter CD-code (or reads embedded CD-code) that describes geometry of CD to correctly locate data on the disc. \n SafeDisc (versions 1-5) \n Adds unique digital signature at the time of manufacturing which is designed to be difficult to copy or transfer so that software is able to detect copied media. \n SafeCast \n The encryption key will expire after pre-determined date so the media can be used only temporarily. Also used to implement trial editions of programs. [1] \n SecuROM \n Limits the number of PCs activated at the same time from the same key. \n StarForce \n Asks for Serial ID at install or startup to verify the license. \n TAGES \n Verifies authentic copy by checking existence of \"twin sectors\" which are sectors with same logical address but different data. However, twin sectors may be hard to read in order to copy but are easy to write. \n Commercial DVD protection schemes [ edit ] \n Analog Protection System \n Adds pulses to analog video signals to negatively impact the  AGC  circuit of a recording device so the images on copied DVDs becomes garbled. \n Sony ARccOS Protection \n Inserting corrupted sectors in areas where normal players will not access but ripping software does to trigger errors during replication. \n Burst Cutting Area \n Writing barcode in circular area near the center of the disc (referred to as burst cutting area) which cannot be written without using special equipment. \n DVD-Cops \n See CD-Cops in previous section. \n DVD region code \n Restricts region where media can be played by matching region number with configuration flag in DVD players. \n LaserLock \n Includes hidden directory on the CD containing corrupted data which will cause errors while being copied. \n ProtectDISC Software \n Adds unique digital signature to the CD or DVD that cannot be transferred from copy to copy. A solution for software and games on CD or DVD provided by  Protect Software . \n ProtectDISC Video \n Prevents ripping software to analyze the structure of the DVD. A solution for Video-DVDs provided by  Protect Software . \n SafeDisc (version 4) \n See SafeDisc (versions 1-5) in previous section. \n SecuROM \n See previous section. \n TAGES \n See previous section. \n Commercial Audio CD/DVD protection schemes [ edit ] \n Cactus Data Shield \n By intentionally violating  Red Book  CD Digital Audio standards, such as erroneous disc navigation and corrupted data, prevents successful ripping of the data. However, the original disc itself does not play correctly in some CD/DVD players. \n Disc Wobble [ citation needed ] \n Encode hidden protection data in discs' grooves so only discs which reproduce the wobble in the disc's groove will be playable. \n Extended Copy Protection (XCP) \n Installs a software on the computer after agreement to  EULA  at the first time the media is inserted, and the software will watch for any ripper software trying to access the CD-drive. \n Key2Audio \n Intended to make the CD play only on CD players and not on computers by applying bogus data track onto the disc during manufacturing, which CD players will ignore as non-audio tracks. The system could be disabled by tracing the outer edge of a CD with a felt-tip marker. [2] \n MediaMax CD3 \n Installs software on the computer that tries to play the media so other software cannot read data directly from audio discs in the CD-ROM drive. Silently installing software on a computer created a controversy about modifying a computer's behaviour without a user's consent. \n Console CD protection schemes [ edit ] \n Dreamcast  ( GD-ROM ) \n Multiple  table of contents  (TOC) made normal cd player to not read beyond first track. However, one could read GD-ROM on CD reader by swapping the disc after reading fake TOC. \n FADE \n Creates fake scratches on the disk image which copying programs will automatically try to fix. Instead of alerting the user that the copied disc is detected, the program will play the game in buggy manner. [3] \n PlayStation  (CD-ROM) \n The authority pattern pressed on internal circumference of the media, which could not be copied, is used to detect authorized copies. Some titles also uses  Libcrypt  mechanism to validate the disc by using  checksum  as magic number to subroutines. \n PlayStation 2  (CD-ROM, DVD-ROM) \n A map file that contains all of the exact positions and file size info of the disc is stored at a position that is beyond the file limit. The game calls this place directly so that burned copy with no data beyond file limit cannot be played. \n PSP  ( Universal Media Disc ) \n Since no blank media or writer exists, the media itself cannot be copied, but one could make  ISO image  (a file version of the UMD) on a memory card. The unique format also made the media difficult to adapt and expensive. \n Xbox  (DVD) \n It has been theorized that the discs have a second partition that is read from the outside in (opposite current standards thus making the second partition unreadable in PC DVD drives). Also, the Xbox is said to use a different DVD file system (instead of UDF). \n References [ edit ] \n ^   \"Macrovision Unveils SAFECAST Copy Protection Solution; SAFECAST Technology Designed to Secure Pre-Release Software from Unauthorized Copying\" The Free Library 17 March 1999. 9 February 2013 < Unveils SAFECAST Copy Protection Solution; SAFECAST...-a054129804 >. \n ^   Coerner, Brendan (3 June 2002).  \"Can You Violate Copyright Law With a Magic Marker?\" . Retrieved  2013-02-11 .   \n ^   Grayson, Nathan (17 Nov 2011).  \"Interview: Bohemia Interactive's CEO on fighting piracy, creative DRM\" . Retrieved  2013-02-11 .   \n v \n t \n e \n Compact disc \n Discs \n CD \n CD-DA \n Red Book \n CD-R \n Orange Book \n CD-ROM \n Yellow Book \n CD-RW \n CD-MRW \n CD-MO \n CD-i \n Green Book \n CD-Text \n CD+ \n Blue Book \n CD+EG \n CD+G  (Karaoke) \n Gold CD \n MiniCD \n Mixed Mode CD \n Photo CD \n Beige Book \n PMCD \n shaped CD \n business card CD \n SVCD \n VCD \n White Book \n Technology \n Rainbow Books \n CD authoring \n CD burning \n CD copy protection \n CD emulation \n CD manufacturing \n CD ripping \n CD rot \n CD bronzing \n CD subcode \n C2 error \n CD-i Ready \n 4ch CD-DA \n El Torito \n ISO 9660 \n Joliet \n Romeo \n Rock Ridge \n ISO 13490 \n UDF \n XRCD \n Hardware/Software/Content \n CD Case \n CD drive \n CD player \n Portable CD player \n CD recorder \n CD ripper \n CD single \n Mini CD single \n Court cases \n Orange-Book-Standard \n Lists \n CD copy protection schemes \n CD player manufacturers \n Optical disc authoring software \n Variants based on CD \n 5.1 Music Disc \n Black Book \n CD Video \n Video Single Disc \n cDVD \n CDVU+ \n DD-CD \n Purple Book \n DSD-CD \n DualDisc \n HDCD \n Hybrid DVD-Audio \n Hybrid SACD \n Scarlet Book \n MovieCD \n MP3 CD \n Picture CD \n VinylDisc \n See also \n Blu-ray \n DVD \n HD DVD \n LaserDisc \n MiniDisc \n SACD \n UMD \n WORM \n   Category \n   Commons \n   Wiktionary \n v \n t \n e \n DVD \n Discs \n DVD \n MiniDVD \n DVD card \n DVD-ROM \n DVD-RAM \n DVD-Audio \n DVD-Video \n DVD-R \n DVD-R DS \n DVD-R DL \n DVD-RW \n DVD+R \n DVD+R DS \n DVD+R DL \n DVD+RW \n Inkjet printable DVD \n Technology \n UDF \n DVD region code \n DVD copy protection \n CSS \n HDCP \n AACS \n DVD authoring \n DVD burning \n DVD ripping \n DVD recordable \n DVD program \n Anamorphic DVD \n DVD Video OBject \n DVD-VR \n DVD+VR \n DVD±R \n DVD Multi \n DVD writing speed \n DVD emulation \n DVD rot \n Groups \n DVD Forum \n DVD Copy Control Association \n DVD+RW Alliance \n DVD club \n Hardware/ \nSoftware/ \nContent  \n DVD Case \n VCR/DVD combo \n DVD player \n Portable DVD player \n DVD recorder \n DVD drive \n External DVD \n DVD remote \n DVD ripper \n DVD game \n DVD single \n DVD magazine \n DVD documentary \n Straight to DVD \n Court cases \n DVD CCA v Bunner \n DVD CCA v Kaleidescape \n Real vs DVD CCA \n DeCSS \n Lists \n DVD manufacturers \n DVD recordable manufacturers \n DVD authoring software \n DVD burning software \n DVD copy protection schemes \n Variants \n cDVD \n SACD \n DualDisc \n EVD \n HVD \n FVD \n ML DVD \n HD/DVD \n 3× DVD \n BD5 \n BD9 \n Nintendo disc \n Digital Video Express  (DIVX) \n DVD-D \n See also \n HD DVD \n Blu-ray \n LaserDisc \n CD Video \n Compact disc \n VCD \n SVCD \n CD-DA \n CD-ROM \n   Category \n   WikiCommons \n   Wiktionary \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=List_of_Compact_Disc_and_DVD_copy_protection_schemes&oldid=777231158 \"\t\t\t\t\t \n Categories :  Compact Disc and DVD copy protection Computing-related lists Technology-related lists Compact disc DVD Copy protection Digital rights management systems Optical disc authoring software Hidden categories:  Use dmy dates from May 2013 All articles with unsourced statements Articles with unsourced statements from January 2016   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Add links   \n  This page was last edited on 26 April 2017, at 00:18. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}