{"url": "http://www.imdb.com/title/tt0120201/trivia", "content": "Starship Troopers (1997) - Trivia - IMDb \n IMDb \n More \n All \n Titles \n TV Episodes \n Names \n Companies \n Keywords \n Characters \n Quotes \n Bios \n Plots \n Movies ,\n                 TV \n                &  Showtimes \n MOVIES \n In Theaters \n Showtimes & Tickets \n Latest Trailers \n Coming Soon \n Release Calendar \n Top Rated Movies \n Top Rated Indian Movies \n Most Popular Movies \n CHARTS & TRENDS \n Box Office \n Oscar Winners \n Most Popular by Genre \n TV & VIDEO \n IMDb TV \n Top Rated TV Shows \n Most Popular TV Shows \n DVD & Blu-Ray \n SPECIAL FEATURES \n Amazon Originals \n Streaming \n Star Wars \n IMDb Picks \n Superheroes \n Celebs ,\n                 Events \n                &  Photos \n CELEBS \n Born Today \n Celebrity News \n Most Popular Celebs \n PHOTOS \n Latest Stills \n Latest Posters \n Photos We Love \n EVENTS \n Awards Central \n Festival Central \n Oscars \n Golden Globes \n Sundance \n Cannes \n Comic-Con \n Emmy Awards \n Venice Film Festival \n Toronto Film Festival \n Tribeca \n All Events \n News  & \n Community \n LATEST HEADLINES \n  ‘Coco’ Strikes Gold at Black Friday Box Office, Tops ‘Justice League’\n 6 hours ago \n  Paul Thomas Anderson Unveils Daniel Day-Lewis Fashion Romance ‘Phantom Thread’\n 19 hours ago \n  ‘The Bold’ and ‘Great Buddha+’ Triumph At Golden Horse Awards\n 6 hours ago \n NEWS \n Top News \n Movie News \n TV News \n Celebrity News \n Indie News \n COMMUNITY \n Contributor Zone \n Polls \n Watchlist \n            YOUR WATCHLIST\n The leading information resource for the entertainment industry \n Find industry contacts & talent representation \n Manage your photos, credits, & more \n Showcase yourself on IMDb & Amazon \n Go to IMDbPro \n | \n Help \n Sign in with Facebook \n Other Sign in options \n Edit \n Starship Troopers   \n             (1997)\n Trivia \n Showing all 150 items \nJump to:\n Cameo  (1)  | \n Spoilers  (28)   \nThe year in the movie is 2197.   \n  66 of 68 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDirector Paul Verhoeven's favorite movie of his own.   \n  73 of 76 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nNearly every military uniform has WW2 German military and SS paramilitary uniform references. The flag of the Federation has a symbol which closely resembles the Imperial Eagle from WWII Germany.   \n  119 of 126 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the novel, Dizzy is a man.   \n  95 of 100 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nJake Busey (Ace) learned how to play the violin for this movie.   \n  30 of 30 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nWhen Rico, Carmen and Carl meet with the recruiting officer after pledging, and the officer shakes hand with Rico, it is revealed that he has lost both his legs. This is not done with any means of special effect or other trickery, as  Robert David Hall --the actor who plays the officer--had both legs amputated after an accident in 1978.   \n  102 of 108 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe scenes involving explosions and fire after the destruction of Buenos Aires were actually videos taken from the Oakland Hills fire in October of 1991.   \n  80 of 84 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n Casper Van Dien  (Johnny) broke a rib during a stunt involving jumping off a \"tanker bug.\"   \n  67 of 70 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe cow that was killed by the Arachnid in the media break commercial was completely digital but was still censored. A bonus video feature form the DVD shows what occurred behind the censoring bar: an FX tech used a small hose to spray the walls with fake blood.   \n  26 of 26 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nMore ammunition was used in this film than in any previous movie.   \n  129 of 140 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nMost of the adults in authority positions in the movie are scarred in some way: Rasczak ( Michael Ironside ) lacks an arm; the biology teacher has scars on her face, and is blind; and the recruiting sergeant has lost both his legs. Director  Paul Verhoeven  included them as a symbol of the belligerent history of the Federation.   \n  74 of 80 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nMost of the arachnids appearing on film are CGI but a few life-sized, robotic models were built. However, during the battle scenes, the actors wound up looking at director  Paul Verhoeven  himself who would stand in front of them and jump and scream to elicit their reactions.   \n  75 of 82 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n Mark Wahlberg  turned down the role of Johnny Rico.   \n  108 of 120 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDuring filming Jake Busey (Ace) suffered heat stroke after working all day in 120 degrees desert sun, this stopped production for a week, when he recovered several large holes were cut into his uniform so he could cool off, many other cast members suits had this modification as well in order to prevent further cases on average there were 25 people per day being treated for heatstroke during filming.   \n  18 of 18 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe classroom walls display portraits of major philosophers; Aristotle, Baruch Spinoza, Friedrich Nietzsche and Hannah Arendt. All these thinkers are known for their influence on politics and political theory. Arendt notably worked on totalitarianism, an important theme of the movie.   \n  52 of 57 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe base that houses the Fleet Academy is named \"Tereshkova\" after Russian cosmonaut  Valentina Tereshkova , the first woman in space. There are many more examples in the movie of the future being gender-neutral (meaning there is no bigotry based on gender), such as the mixed-shower scene and the female captain.   \n  69 of 77 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe view that people acquired citizenship and the right to vote through military service reflected the views of \"Starship Troopers\" author Robert Heinlein his views were influenced by his years in military service during World War II and what he saw as the supposed \" laziness\" of civilians.   \n  16 of 16 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn a 2014 interview on the Adam Carolla show, Michael Ironside (Jean Rasczak) who read the book as a youth, said he asked director Paul Verhoeven- who grew up in a Nazi-occupied Netherlands, \"why are you doing a right-wing fascist movie\"?, Verhoeven replied \" if I tell the world that a right-wing fascist way of doing things doesn't work then no one will listen to me, so I'm going to make a perfect fascist world everyone is beautiful, everyone is shiny, everything has big guns and fancy ships but it's only good for killing Fucking bugs!\"   \n  24 of 25 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nCameo: (Dale Dye)-as High-ranking officer present at the capture of the brain bug at the end,say's to Carl-\"what's it thinking colonel\"?   \n  15 of 15 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nLieutenant Willy is played by  Steven Ford , the son of former President Gerald Ford.   \n  51 of 57 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nJames Cameron was attached to direct at one point.   \n  14 of 14 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe use of Nazi imagery for the film's American Heroes occasioned comment at the time of the film's theatrical release, the filmmakers did not explain their reasons for this choice with the result that some viewer's interpreted it as satire,while other's read it as a celebration of Fascism.   \n  14 of 14 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn 2012, Slant Magazine ranked the film #20 on its list of the 100 Best Films of the 1990s. However other critical reaction to the film has tended toward the negative.   \n  12 of 12 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nSome of the walls were reused from  Total Recall  (1990) (another film directed by  Paul Verhoeven ).   \n  55 of 64 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nRight before the battle of Klendathu, Lieutenant Willy (Stephen Ford) says to his troopers: \"Remember your training and you will make it back alive.\". Ironically, Lieutenant Willy is the first one to get killed during the battle by a warrior bug, showing he didn't remember his training.   \n  18 of 19 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe band at the graduation party plays a  David Bowie  song called \"I Have Not Been to Oxford Town.\" The lyrics are reworked a bit to refer to the 23rd century rather than the 21st.   \n  41 of 47 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe battle gear was later reused in Power Rangers: Lost Galaxy and the show Firefly in the episode The Train Job.   \n  36 of 41 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDirector Paul Verhoeven say's his satirical use of irony and Hyperbole is \"playing with fascism or fascist imagery to point out certain aspects of American society of course the movie is about lets all go war and let's all die\".   \n  17 of 18 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nCameo: Jon Davison-the producer, as a Buenos Aires survivor say's \"The only good bug is a dead bug!\".   \n  11 of 11 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the commentary track on the DVD or Blu-ray release, Director Paul Verhoeven remarks that he had hoped to cast actors who's age closely matched that of the characters and indeed of real-world soldiers but the producers felt such actors would look too young, the teacher and the lieutenant of the Roughnecks in the novel are combined into one role played by Michael Ironside.   \n  11 of 11 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe fort defense scene contains many references to  Zulu  (1964): \"we're all gonna die,\" \"fire at will\" and \"fall back into the compound,\" along with some similar camera angles.   \n  58 of 69 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nFednet was created to help establish the satire in a way similar to RoboCop (1987) another Paul Verhoeven film.   \n  10 of 10 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIt is debatable by fans whether the Arachnids were even responsible for the attack on Buenos Aires, given that the bug meteor is asserted to have been launched from Klendathu, on the other side of the galaxy and therefore tens of thousands of light-years away (especially considering that the asteroids where shown moving slower then light and where allegedly able to cross 80,000 light years without hitting anything or being pulled off course, yet still hit Earth with pinpoint accuracy) this, combined with the informative nature of the film narrative as a recruitment advert, can be interpreted as a commentary on the propagandistic nature of contemporary media and its role often as a willing accomplice to militarism. However, given that in one scene the Rodger Young is shown to be on a collision course with one of these asteroids, and that they are able to take evasive action after Carmen and Zander sight the asteroid visually would seem to suggest that the simpler explanation is that Director Paul Verhoeven just ignored the physics of the situation for cinematic effect or simply because that is what the plot required.   \n  10 of 10 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThis was the final American film Paul Verhoeven supervised; he never really fully recovered from Showgirls (1995) and moved back to Europe after this movie.   \n  10 of 10 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nWhen Carmen Ibanez is taking the starship out of dock the first time, she flicks a switch to release the hoses attached to the docking platform. That switch is the power switch from a 1982 era IBM PC, the very first PC to see widespread use in home and office.   \n  61 of 74 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the movie Jonny Rico's and some of the other characters' nationalities have been significantly altered from the original novel. In  Robert A. Heinlein 's novel the story focuses on the first-person narrative of Juan \"Jonnie\" Rico, a son of a wealthy Filipino family who enlisted in to the Mobile Infantry--a highly futuristic military unit equipped with powered armor and an arsenal of advanced weaponry. In the movie, instead of an elite fighting force equipped with Powered Suits they are a conventional army armed with conventional weapons but apparently without armored vehicles, artillery, most heavy weapons and other vital equipment. The Powered Suits would not feature in the series until  Starship Troopers 3: Marauder  (2008).   \n  47 of 56 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nFort Ticonderoga is a real fort in upstate New York that was active during the 18th century. It was used by the British during the Seven Years War with the French and then again by American troops during the American Revolutionary War against the British.   \n  30 of 35 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe \"Bug planet\" scenes (Klendathu, Tango Urilla, Planet P) were filmed in the Badlands of Hell's Half Acre in Natrona county Wyoming. During filming in the park, it was nearly a 110 degrees which prompted the production crew to let the actors and extras to wear only their black t-shirts under the armor, because the neck wrap and the jacket is made out of thick rubber wetsuit /clothing which is very hot to wear.   \n  14 of 15 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe lime-green violin that Ace plays the tune \"Las Golondrinas\"-the Shallows, is a Tucker Barrett electric violin.   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nCasper Van Dien (Rico), Dina Meyer (Flores), Denise Richards (Ibanez), and Denise Dowse (Sky Marshall Meru) all appeared in Beverly Hills 90210 (1990).   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the novel, The Mobile Infantry were also fighting a war against the Skinnies- a tall, green, humanoid species who were allied with the Arachnids. Also, the Arachnids weren't mindless, savage creatures they were rather intelligent and had advanced technology somewhat on par with the humans such as H-Bombs (which they used to attack Buenos Aires) ray guns, missiles and space ships.   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nOn the DVD commentary Paul Verhoeven stated about the Morita Assault Rifle being an excellent example of the films satire-\"Intentional or not\".   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nNeil Patrick Harris was often called \"Doogie Himmler\" whenever he wore the military intelligence uniform as it beared a resemblance to SS uniforms.   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe Boot camp Arthur Currie was named for Sir Arthur William Currie of the Canadian Expeditionary Force. Sir Arthur Currie had the unusual beginning of a pre-war militia gunner and eventually worked his way through the entire scale of ranks to eventually become Canada's first Four Star General. His nickname was \"Guts and Gaitors\".   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe Seattle indie rock band Minus the Bear used quotes from the film as song titles in their album Highly Refined Pirates including \"you kill bugs good man\" \"Damn bugs wacked us Johnny\" and \"Your some kind of big fat smart bug aren't you?\"   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nBody Count: (256).   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nBefore the battle of Klendathu, when Rico, Dizzy, Ace and Kitten are \"Getting cut together\", Kitten says: \"We're going to fight and we're going to win\" ironically durig the battle of Klendathu during the general retreat, Kitten gets killed by a warrior bug.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe film won Saturn Awards for Best Costumes and Best Visual Effects at the 1998 Academy of Science Fiction, fantasy and horror films, USA Awards.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe original text also included the Cap Troopers wearing Powered Armored The Mobile Infantry in the movie has nothing of the sort until Starship Troopers Marauder (2008) (even though they are experimental Mini-Mecha).   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nWhile it's never explicitly stated in the novel in the film its strongly implied that Fleet and the Mobile Infantry have a rivalry as Dizzy says to Rico after he fights with Zander, \"Mobile Infantry and Fleet don't mix\".   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe concept of the Plasma Bugs possibly originated from the Warriors in the original novel since they are capable of using energy weapons.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nAlthough we don't see Katrina Mclntire (Blake Lindsey) get killed when she is dragged into a bug hole by a Warrior bug even though it is stated bugs don't capture enemies and Starship Troopers Dominant Species, original script and commentaries have mentioned that those who don't retreat from the Battle of Klendathu are killed.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the 1988 OVA Starship Troopers,the boot camp Currie had instead of tents, the recruits lived in normal buildings. but in the movie the buildings are shaped like tents.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the original novel, Rico's father originally gives him a ticket to Mars instead of Zegema Beach as in the film.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the novel Rico can speak \"Tagalog\" at home and does not come from Buenos Aires.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDuring the newsbreak which focused on the massacre of Port Joe Smith it shows a spire with the Statue of Angel Moroni on its top. According to religious custom with the Church of Jesus Christ of Latter-day Saints, the statue of Moroni is only used on the top of dedicated temples and is not found on any other structure regardless of its purpose.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe short-lived Australian political party, One Nation mimicked the use of the \"would you like to know more?\" advertisements in a 1998 campaign at recruiting youth to the party presumably unaware of the satirical nature of those ads especially given the party had a nationalistic far-right ideology.   \n  8 of 8 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n Casper Van Dien  says he was often asked why a blonde-haired, blue-eyed actor would play the Argentinian Juan Rico. He suggests that his character was the descendant of exiled Germans. Argentina was famously a hiding place of German war criminals after World War II.   \n  16 of 18 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the DVD commentary, Director Paul Verhoeven state's his intentions clearly the film's message is that \"War makes fascists of us all\" he evoked Nazi Germany's fashion,Iconography and Propaganda because he saw it as a natural evolution of the post-WWII United States: \"I've heard this film nicknamed All quiet on the final frontier\" he said, even Screenwriter Edward Neumeier broadly concurs although he see's the film as a satire on human history rather soley on the U.S.   \n  12 of 13 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nFeatures two main villains from the \"Highlander\" movie franchise:  Clancy Brown  played the Kurgen in  Highlander  (1986) and  Michael Ironside  played Kitana in  Highlander II: The Quickening  (1991).   \n  38 of 48 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the movie, the soldiers are occasionally referred to as \"Cap Troopers\". In the book, this referred to the capsules they dropped in, but in the film the nickname becomes orphaned.   \n  7 of 7 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe Fleet Academy Tereshkova base where Carmen and Zander go is named after Soviet cosmonaut Valentina Tereshkova the first woman in space.   \n  7 of 7 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nWhen Lt. Rasczak gets his legs bitten off by the tanker bug maybe a reference to what happened to Jehal the acting commander of the Roughnecks in the original novel   \n  7 of 7 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the novel, the destruction of Buenos Aires is only mentioned with little description.   \n  7 of 7 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn Starship Troopers the miniature game, the Arachnids are referred as Arachnid Empire.   \n  7 of 7 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe combat helmets were repainted again and used by the SWAT team at the end of the 2001 remake of Planet of the Apes.   \n  7 of 7 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe song, \"I Have Not Been to Paradise,\" (a cover of the  David Bowie  song \"I Have Not Been to Oxford Town\") is sung by  Zoë Poledouris , the eldest daughter of  Basil Poledouris , the film's composer.   \n  27 of 34 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the scene when Rico is dancing with Diz, the tune Ace plays with the violin is a well-known folk Mexican song called \"Las Golondrinas\" (The Swallows).   \n  24 of 30 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThis movie, along with  RoboCop  (1987),  Basic Instinct  (1992),  Showgirls  (1995) and  Hollow Man  (2000), is one of five separate movie franchises in which the first movie of their respective series (directed by  Paul Verhoeven ) were more successful than their respective sequels (not directed by Verhoeven); all the sequels either had low box office numbers or were released directly to DVD.   \n  44 of 59 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe footage of the Port Joe Smith mutilation bodies was from the Whiskey Outpost.   \n  6 of 6 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the 2011 first person shooter video game Duke Nukem Forever when Duke is fighting against the aliens he says \"I'm from Las Vegas, and I say Kill 'em All!   \n  6 of 6 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nFilm composer Basil Poledouris daughter Zoe makes a cameo in the prom dance scene. She's on stage wearing a sparkling blue dress, and sings \"Into It\" and a cover of David Bowie's \"I have not been to Oxford Town\" from the 1997 album \"Outside\" minor lyrical changes have been made, woth the song changed to \"I have not been to Paradise\".   \n  6 of 6 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nTo avoid an NC-17 rating, 4 seconds had to be trimmed from a decapitation during the last battle at the Whiskey Outpost base. However the four seconds can be seen in the version on the FX network.   \n  6 of 6 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nSeveral scenes were modified to tone down the movie for showing on Russian television. Aside from cut down similar to the Australian version to tone down the violence, is a modification to the video feed scene (where Rico walks Carmen through his surroundings,camera in hand) when his squadmates take off their pants to moon the camera, static was added to cover the nudity up. also, the shower scene and the sex scene were slightly cut to remove frontal nudity.   \n  6 of 6 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDialogue changes in German version: when Mr. Rasczak is talking about failure of democracy and how the veterans took control. Only citizens are allowed to vote, in the German version all this is changed about some talking about the war against the bugs,democracy is not mentioned. \"Service guarantees citizenship\" is changed to \"Fight for the Future\" * also during the classroom scene when Mr. Rasczak is talking about violence he says \"I wonder what the city fathers of Hiroshima would say about that\" and Carmen replies \"They probably wouldn't say anything Hiroshima was destroyed\" this scene was removed from the Japanese version. In the German version Mr. Rasczak says \"I wonder what the citizens of Washington would say about that\". And Carmen replies \"They probably wouldn't say anything Washington was destroyed during the first Bug War\".   \n  6 of 6 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the director commentary on the Blu-ray DVD Paul Verhoeven stated showing the mutilated bodies on FedNet was to encourage more people to join the Federation, the cow being censored was due to PETA animal supporters, and the experiments on the Brain Bug were censored as it was classified information.   \n  6 of 6 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe German dubbing of this film, although changing a lot of the political issues of the story, is partly regarded as cult especially due to lines like \"Das ganze Gehirn weggelutscht\" (\"They sucked his brains out\") as performed by  Joachim Kerzel .   \n  30 of 40 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe design of the bugs are slightly edited revisions of an unused Shrieker design from \"Tremors 2: Aftershocks\". Both films special effects were supplied by 'Phil Tippett', who had been working on both films at the same time.   \n  9 of 10 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe line \"You want to live forever?\" (as \"You wanna live forever?\") was also uttered in  Paul Verhoeven 's earlier movie _Robocop (1987)_ by the character Emil.   \n  28 of 38 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the credits,  Amy Smart 's character is identified as \"Pilot Cadet.\". However, the FedNet announcer refers to her as \"Lt. Stack Lumbrezer.\" One of the movie's co-producers is  Stacy Lumbrezer .   \n  26 of 35 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe rifles featured in the movie are based off the Ruger Mini-14 in a custom bullpup stock similar to those available for other rifles/shotguns in the 1980s.   \n  29 of 40 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn a propaganda scene near the start of the movie, mormon extremists are reported to have been massacred by bugs on another planet. Space faring mormons are also depicted in the sci-fi series \"The Expanse\" (2015). In the mormon compound in the movie, a golden statue with a trumpet can be seen. The same golden statue is the figurehead of the mormon ship the \"Nauvoo\" in \"The Expanse\".   \n  5 of 5 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nWhen Carmen meets Johnny at the Spaceport she tells Johnny that \"My dad had to help me pack suddenly he's afraid he's never going to see me again\" it foreshadows the destruction of Buenos Aires which kills Johnny's parents and Carmen's father.   \n  10 of 12 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe powered armor technology that is Central to the book is completely absent in the movie, according to Verhoeven this- and the fascist tone of the book reflected his own experience in Nazi-occupied Netherlands during World War II.   \n  10 of 12 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nMichael Ironside (Jean Rasczak) was considered for the part of Alex Murphy/RoboCop in Robocop (1987) another Paul Verhoeven movie   \n  10 of 12 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the back-story of Jean Rasczak (Michael Ironside): Rascazk lost his left arm which had been grabbed by a Warrior Bug, during a mission on Klendathu and retired from the Mobile Infantry and became a teacher of History and Moral Philosophy in Buenos Aires.   \n  14 of 18 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nCyrano, Carl's pet ferret, was originally scripted as being a frog.   \n  21 of 30 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nSome changes from the novel:   1) Carl is killed in a bug raid on a research station. 2) After Rico is promoted to sergeant He is sent to O.C.S. At a transfer station he sees his father has joined the M.I. There is a brief reunion.   3) The wore battlesuits in the novel. Each suit gave a soldier with incredible strength and tremendous firepower. Thus the name Mobile Infantry.  4) Carmen wasn't Rico's girlfriend. She was everyone's friend. After joining up they meet when he's a \"third lieutenant\" on a ship bound for combat.   \n  14 of 19 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe Federation's flag likely drew some inspiration from the flags of the Russia Coast Guard, Imperial Russian Regiments, Imperial German regiments, and the Confederate States of America.   \n  4 of 4 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nAce is based on two characters from the novel, Ace and Pat Leivy while his question about knife throwing toward Zim is a reference to Ted Hendrick in the novel.   \n  4 of 4 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nRico's service number is 0589 as revealed on his Death Certificate when he's mistakenly listed as K.I.A.   \n  4 of 4 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe Federal Service oath is as followed:  \"I, being of legal age, of my own free will, after having been duly advised and warned of the meaning and consequences of this oath, enroll in the federal service for not less than 2 years and as much longer as may be required by the needs of the Federation.\"   \n  4 of 4 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the German version the news commentator you hear all the time was dubbed by  Egon Hoegen . This results in additional comic relief because he is the man who, with his rather dry and sarcastic voice, narrates every episode of  Der 7. Sinn  (1966) (a very well known traffic education show).   \n  28 of 43 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe heavy weapons mounted on towers featured in the bug assault on the base at Planet P were Browning M2 .50 cal machine guns mocked up to look like Degtyaryov-Shpagin Krupnokalibernyi DShK's (\"Degtyaryov-Shpagin Large Caliber\"), in a twin-gun arrangement on a gimbal mount. The DShK was designed in the Soviet Union in the 1930s and fires a 12.7x108mm cartridge, roughly the Soviet equivalent of the American .50-cal. BMG. At the time of filming, real DShK's - as well as blank ammunition for them - were all but impossible to obtain, so most appearances of them in film feature M2's with a mocked-up barrel.   \n  21 of 31 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDuring the scene at Whiskey Base where the general is discovered in a \"closet,\" the prop used for the closet was actually an industrial refrigerator commonly found in the restaurant kitchens.   \n  21 of 32 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe tune Ace plays during R&R time is \"Dixie,\" known as the de facto national anthem of the Confederate States of America and still played often in the Southern US. This is a reference to Ace's Southern heritage.   \n  14 of 20 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nAn actual Bug from the movie was exhibited in the entry of the main gallery at the 1997 World Science Fiction Convention held in San Antonio, TX over Labor Day Weekend.   \n  3 of 3 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the movie Dizzy's full name was Isabel Flores.   \n  3 of 3 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe name \"Arachnid\" derived from spider in Greek, apparently originated from \"Pseudo-Arachnids\", the giant spiders from the novel., none of the arachnid species resemble a spider by far however it's meant to be a racial slur against the enemy and it dosent have to be taxonomically correct.   \n  3 of 3 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nSome critics in The Netherlands,  Paul Verhoeven 's native country, jokingly referred to the movie as 'Soldier of Orange in Space', referring to  Soldier of Orange  (1977), one of Verhoeven's earlier Dutch movies. Both movies are about a group of friends who each go their separate ways when war is declared. Some end up working together, while others find themselves at odds with each other.   \n  5 of 6 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the beginning of the film, the high school in which the characters Rico, Carmen, Carl and Dizzy attend is actually a Kaiser Permanente hospital.   \n  11 of 17 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n James Marsden  was considered for the role of Johnny Rico.   \n  21 of 37 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nOnly theatrical movie of the Starship Troopers trilogy - the second two were were direct to video.   \n  15 of 27 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe screen of Rico's computer in the classroom shows the word \"fedpaint\" at the lower border.   \n  14 of 25 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe film was released into cinemas uncut in the UK with a '15' rating, but the BBFC (the British censors) felt they had been too lenient and the same version was upgraded to an '18' rating for video and DVD.   \n  9 of 15 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe film is dedicated to  Gavin Gharrity  and  Tom O'Halloran , two camera operators who worked on  Paul Verhoeven 's  Showgirls  (1995).   \n  12 of 23 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIbanez is the Spanish version of the surname \"Evans.\"   \n  18 of 42 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn an early Federation broadcast, there is a psychic who says, \"If you think you're psychic, maybe you are.\" The psychic is played by Timothy Omundson, who stars in the TV series 'Psych'. In the series, he plays a police detective who is constantly at odds with 'psychic' Shawn Spencer and determined to prove him a fraud.   \n  2 of 3 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe line \"C'mon you apes! You wanna live forever?\" is a tribute to Sgt. Maj. Daniel Daly, who is remembered for yelling a similar quote when he led his USMC company against the Germans in the Battle of Belleau Wood in World War I.   \n  1 of 1 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn an interview with ComingSoon, Casper Van Dien spilled the beans on how the newspaper helped underage audiences see a violent R rated movie. \"The New York Times did a piece where they gave 1000 13 and 14-year-old boys tickets to Mr. Bean to see if they could sneak into Starship Troopers because people were doing that a lot at multiplexes then. After that they had to put the kibosh on it. They think we would have doubled our income so instead of 25 million it would have been 50 if it had been a PG 13 film.\"   \n  1 of 1 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nAt 129 minutes this is the longest Starship Troopers movie.   \n  1 of 1 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nAfter Breckinridge is accidentally shot and killed during the live fire exercise, Rico is blamed for having ordered Breckinridge to remove his helmet. But when the scene is reviewed it's clear that Breckinridge was shot through his right eye. Since the helmet doesn't have goggles or a face shield, the removal or wearing of the helmet had no effect upon the fatality of the head wound, so Rico was not to blame for Breckinridge's death.   \n  1 of 1 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nMazzy Star's \"Fade Into You\" plays during the fight between Rico and Xander.   \n  6 of 15 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nMichael Ironside, Clancy Brown, Dina Meyer, and Brenda Strong were in DC comics based animated and live-action series. Michael was the voice of the evil tyrant Darkseid on Superman: The Animated Series and Justice League/Justice League: Unlimited, Dark Knight Returns Batman in one episode of The Superman/Batman Adventures. He also played as General Sam Lane in Smallville. And, he played the father of the villain Leonard Snart/Captain Cold in The Flash. Clancy was the voice of Lex Luthor in Superman: The Animated Series and Justice League/Justice League Unlimited. Also, played as General Wade Eiling in The Flash. Dina played the Batgirl/Oracle in the series Birds of Prey. And, Brenda Strong plays as the mother of the villain Lex Luthor Lillian in Supergirl (2015).   \n  2 of 7 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe United Kingdom Laserdisc was £34.99.   \n  10 of 78 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nAt the beginning of the battle, the Commanding Officer stands and says \"follow me.\" That is the motto of the U.S. Army Infantry. His pose mimics the statue at Ft Benning, GA.   \n  2 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe Japanese Laserdisc was ¥4700.   \n  7 of 71 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n\"Do you want to live forever?\" is attributed to Marine Sargent Major Dan Daly in the WWI battle Bellau Wood. He is one of two Marines to have won the Medal of Honor twice.   \n  Is this interesting? \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nUnlike other film characters originating from the novel, Lieutenant Willy's novel counterpart, Willie (also known as Captain James K. Will in the 1976 board game), is never directly mentioned throughout the book.   \n  Is this interesting? \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nBecause the movie originated from an unrelated script, with names and superficial details from the novel being added retroactively, there are many significant differences between the original book and the film. While the original novel has been accused of promoting militarism, fascism and military rule, the film is attributed to satirize these concepts by featuring grandiose displays of nationalism as well as news reports that are intensely fascist, xenophobic, and propagandistic.   \n  Is this interesting? \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n Bobby Cannavale  auditioned for a part.   \n  1 of 14 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n Cameo  \n Edward Neumeier : The screenwriter appears as the criminal sentenced to death during one media break.   \n  32 of 43 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n Spoilers  \n The trivia items below may give away important plot points. \nA miniature Millenium Falcon can be seen on the backside of one of the starships' bridges.   \n  126 of 129 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDirector  Paul Verhoeven  admits to never finishing the novel, claiming he read through the first few chapters and became both bored and depressed and told screenwriter Edward Neumeier to tell him the rest \"It's a very right-wing book\". Verhoeven told Empire magazine.   \n  141 of 146 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDirector  Paul Verhoeven  and cinematographer  Jost Vacano  shot one take of the co-ed shower scene in the nude themselves (on a dare from star  Dina Meyer ).   \n  144 of 152 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nDuring the scene where  Michael Ironside 's character falls into the hole and gets his legs bitten off,  Dina Meyer  hit her head, was knocked unconscious, and suffered a concussion.   \n  66 of 69 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nSeveral references are made to WWII Medal of Honor recipient Rodger Wilton Young. During WWII as a small arms instructor, Sgt. Young was denied the opportunity to deploy with his unit when Japan entered the war. He requested that he be voluntarily demoted to private in order to see combat. His wish was granted. Career Sgt. Zim makes a similar request when Buenos Aires is destroyed. His wish is also granted. Also, during WWII, Young gave his life in combat by single-handedly bombarding a Japanese machine gun position with rifle fire and grenades during an ambush, allowing his platoon to escape. While rescuing Carmen from the Brain-bug, Sugar Watkins gives his life in an almost identical fashion by laying down rifle fire and detonating the Nuke so his friends can escape; The starship that Carmen is assigned is also named the Rodger Young.   \n  76 of 80 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the shower scene, Shujimi ( Anthony Ruivivar  ) says that he joined the Mobile Infantry so that the federation would pay for his studies, which would otherwise have cost him \"an arm and a leg.\" Shujimi later has his limbs ripped off by the bugs.   \n  81 of 86 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nBesides Rico, Ace is the only one of Rico's squadmates from boot camp to survive the entire movie from Klendathu to Planet P.   \n  22 of 22 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n17 gallons of fake blood were used throughout the movie.   \n  19 of 19 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe opening recruitment scene of the Mobile Infantry is modeled after the propaganda movie Triumph of the Will (1935).   \n  23 of 25 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nSeveral scenes were filmed following Carmen ( Denise Richards ) coming to grips with the supposed death of Johnny Rico ( Casper Van Dien ), while starting a relationship with Zander ( Patrick Muldoon ). However, test audiences started to hate her character for hooking up with another man so soon after the death of her former lover, and were very vocal about it. The scenes were subsequently deleted, although a relationship between Carmen and Zander is still implied in the rest of the movie.   \n  11 of 11 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nTest audience reactions led to several minor changes before the film was released. Originally, it was clear that Carmen was torn between Rico and Zander. Test audiences, regardless of gender, strongly felt that a woman could not love two men at once, so scenes which portrayed this were cut. These audiences also felt it was immoral for Carmen to choose a career ahead of being loyal to Rico, to the extent that many commented that, in so doing, Carmen should have been the one to die instead of Dizzy. While admitting it may have been a bad commercial decision not to change the film to accommodate this, the directors did cut a scene from after Zander's death where Carmen and Rico kiss, which the audience believed made the previous betrayal even more immoral.   \n  11 of 11 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the film, during live training, Djana'D (Tami Adrian George) shoots and kills Breckinridge accidentally, resulting in Rico's flogging. In real life, the two actors are together and have a child. They met on this film.   \n  34 of 39 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the original script, Capt. Deladier was supposed to have her brains sucked out instead of Zander Barcalow.   \n  37 of 43 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nRico's career in the mobile infantry looks something like this:  Cadet, Cadet - squad leader, wash out, Cadet, Private, Corporal, acting Seargent, Corporal, Lieutenant.   \n  9 of 9 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nWhen Rico's father says he would rather take ten lashes in public square than see him ruin his life, it foreshadows what happens to Rico after Breckenridge's death; Rico himself receives ten lashes in a public square, and ruining Djana'D (Tami-Adrian George) (who killed Breckenridge) chances of becoming a citizen to go into politics.   \n  31 of 39 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n Michael Ironside 's character is missing and arm and later has both legs bitten off by a tanker bug. During a fight with  Arnold Schwarzenegger  in  Total Recall  (1990) (also directed by  Paul Verhoeven ) Ironside's character has both arms severed.   \n  48 of 64 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe reason Carmen's (Denise Richards) father detests Johnny is further elaborated in a deleted scene. Johnny parents aren't citizens; they have money. This is why Ace continuously says to Johnny \"you got some guts for a rich kid\" and during training \"you rich kids are all the same\".   \n  28 of 36 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the Novel, Rico is Filipino.   \n  21 of 27 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nIn the scene where Carl influences his ferret Cyrano to go \"bug\" his mom; Rico tells Carl not to do anything like that to him. This foreshadows a scene near the end, wherein Rico saves Carmen as Carl psychically guides him though. Carl later says it's \"classified.\"   \n  19 of 25 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe Federation symbol is commonly mistaken as having being taken from Nazi Germany of the 20th century. Many of its symbols, such as the eagles on the Federal Armed Services uniforms, are actually based off of those used in 20th century American culture and military institutions. In any case, Paul Verhoeven admited using the Nazi Orpo flag as an inspiration for the Ferderation flag design.   \n  5 of 5 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe sport Johnny plays, which is a combination of football and gymnastics, is called \"jumpball.\" His team is \"the Tigers\" and Zanders' is \"the Giants.\"   \n  18 of 25 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe tune Ace plays while Johnny Rico is dancing with Diz is the Mexican song \"Las Golondrinas\" (The Swallows). Since this melody is mostly played in farewells and closures as a way to say 'good-bye' to someone, it foreshadows the fate of Diz.   \n  19 of 28 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe recruiting sergeant says to Carl, who was chosen for military intelligence, \"next time we meet, I'll probably be saluting you.\" Ironically, near the end, Sergeant Zim (who busted himself to Private to get combat) salutes Johnny Rico, who is now a lieutenant.   \n  23 of 38 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nAce says \"shoot a nuke down a bug hole, you got a lot of dead bugs,\" which is what Rico does later in the movie on Tango Urilla.   \n  18 of 30 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe bloodiest of all of Paul Verhoeven's movies.   \n  18 of 32 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nThe same walls were also used in Total Recall.   \n  17 of 30 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n Michael Ironside ,  Marshall Bell , and  Dean Norris  all three appeared in  Total Recall  (1990), also directed by  Paul Verhoeven .   \n  11 of 18 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \nWhen Sergeant Zim is roughing up the recruits, he hits Shujumi in the right leg with his baton. This is interesting as Shujumi later gets his right leg cut off by an Arachnid during the battle of Klendathu.   \n  18 of 37 found this interesting \n Interesting? \n Yes \n No \n |   Share this \n    Share this:  Facebook \n      |  \n     Twitter \n      |  \n     Permalink \n Hide options \n See also \n Goofs \n |   \n Crazy Credits \n |   \n Quotes \n |   \n Alternate Versions \n |   \n Connections \n |   \n Soundtracks \n Getting Started \n | \n Contributor Zone  » \n Contribute to This Page \n Edit page \n Starship Troopers   \n Did You Know? \n Trivia \n Goofs \n Crazy Credits \n Quotes \n Alternate Versions \n Connections \n Soundtracks \n Details \n Full Cast and Crew \n Release Dates \n Official Sites \n Box Office/Business \n Company Credits \n Filming Locations \n Technical Specs \n Literature \n Storyline \n Taglines \n Plot Summary \n Synopsis \n Plot Keywords \n Parents Guide \n Photo & Video \n Photo Gallery \n Trailers and Videos \n Opinion \n Awards \n FAQ \n User Reviews \n User Ratings \n External Reviews \n Metacritic Reviews \n TV \n TV Schedule \n Related Items \n News \n Showtimes \n External Sites \n Explore More \n Show Less \n Share  this page: \n Create a list  »\n User Lists \n Related lists from IMDb users \nGrands classiques\n            a list of 34 titles\n             created 23 Mar 2013\n   \nFavourite Movies. To buy on Blu-Ray. Add to collection\n            a list of 29 titles\n             created 23 Jul 2013\n   \nBEST 90S SCI FI MOVIES\n            a list of 25 titles\n             created 09 Feb 2015\n   \nA het mesterlovesze\n            a list of 28 titles\n             created 29 Aug 2016\n   \nMom VHS\n            a list of 21 titles\n             created 4 months ago\n   \n See all related lists  »\n Clear your history \n Recently Viewed \n   \n IMDb Everywhere \n Find showtimes, watch trailers, browse photos, track your Watchlist and rate your favorite movies and TV shows on your phone or tablet! \n IMDb Mobile site \n      Follow IMDb on\n Home \n Top Rated Movies \n Box Office \n TV \n Coming Soon \n Site Index \n Search \n In Theaters \n Contact Us \n   Register \n News \n Press Room \n Advertising \n Jobs \n IMDbPro \n   Box Office Mojo \n   Withoutabox \n Conditions of Use \n Privacy Policy \n   Interest-Based Ads \n Copyright ©  1990-2017\n                 IMDb.com, Inc. \n                An  Amazon.com  company.\n                Amazon Affiliates\n Amazon Video \n Watch Movies & TV Online \n Prime Video \n Unlimited Streaming of Movies & TV \n Amazon Germany \n Buy Movies on DVD & Blu-ray \n Amazon Italy \n Buy Movies on DVD & Blu-ray \n Amazon France \n Buy Movies on DVD & Blu-ray \n Amazon India \n Buy Movie and TV Show DVDs \n DPReview \n Digital Photography \n Audible \n Download Audio Books"}