{"url": "http://www.w3.org/TR/2016/NOTE-WCAG20-TECHS-20161007/F22", "content": "F22: Failure of Success Criterion 3.2.5 due to opening windows that are not requested by the\n                    user | Techniques for WCAG 2.0\n               Techniques for WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  Failure F20 Next:  Failure F23 On this page: Important Information about Techniques Applicability Description Examples Resources Related Techniques Tests -     F22: Failure of Success Criterion 3.2.5 due to opening windows that are not requested by the\n                    user Important Information about Techniques See  Understanding Techniques for WCAG Success Criteria  for important information about the usage of these informative techniques and how they relate to the normative WCAG 2.0 success criteria. The Applicability section explains the scope of the technique, and the presence of techniques for a specific technology does not imply that the technology can be used in all situations to create content that meets WCAG 2.0. Applicability General  This failure relates to: \n\t\t\t\tSuccess Criterion 3.2.5 (Change on Request) \n\t\t\t\t\t\tHow to Meet 3.2.5 (Change on Request)\n\t\t\t\t\t\tUnderstanding Success Criterion 3.2.5 (Change on Request)\n\t\t\t\t\t Description  Failure due to opening new windows when the user does not expect them. New\n                        windows take the focus away from what the user is reading or doing. This is\n                        fine when the user has interacted with a piece of User Interface and expects\n                        to get a new window, such as an options dialogue. The failure comes when\n                        pop-ups appear unexpectedly.  Examples \n\t\t\t\t\tFailure Example 1:  When a user navigates to a page, a new window appears over the\n                                existing user agent window, and the focus is moved to the new\n                                window. \n\t\t\t\t\tFailure Example 2:   A user clicks on a link, and a new window appears. The original link\n                                has no associated text saying that it will open a new window.  \n\t\t\t\t\tFailure Example 3:  A user clicks on the body of a page and a new window appears. No\n                                indication that the area that was clicked has functionality is\n                                present.  \n\t\t\t\t\tFailure Example 4:  A user clicks on undecorated text within the page and a new window\n                                appears. The page has no visible indication that the area is functional.     Resources No resources available for this technique. Related Techniques SCR24: Using progressive enhancement to open new windows on user request Tests Procedure  Load the Web page.   Check if new (additional) windows open.   Find every actionable element, such as links and buttons, in the\n                                    Web page.   Activate each element.   Check if activating the element opens a new window.   Check if elements that open new windows have associated text\n                                    saying that will happen. The text can be displayed in the link,\n                                    or available through a hidden association such as an HTML title\n                                    attribute.  Expected Results  If step #2 is true, the failure condition applies and the content\n                                    fails the Success Criterion   If step #5 is true and step #6 is false, the failure condition applies and\n                                    the content fails the Success Criterion  Top Contents Intro Previous:  Failure F20 Next:  Failure F23 This Web page is part of  Techniques and Failures for Web Content Accessibility Guidelines 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}