{"url": "http://www.unesco.org/education/information/nfsunesco/doc/isced_1997.htm", "content": "International Standard Classification of EducationI S C E D 1997 \n   \n   \n International Standard\r\n    Classification of Education \r\n    I S C E D 1997\r\n November 1997 \n   \n   \n   \n Preface \n   \n The International Standard Classification of Education (ISCED) was\r\ndesigned by UNESCO in the early 1970\u0092s to serve \u0091as an instrument suitable for\r\nassembling, compiling and presenting statistics of education both within individual\r\ncountries and internationally\u0092. It was approved by the International Conference on\r\nEducation (Geneva, 1975), and was subsequently endorsed by UNESCO\u0092s General\r\nConference when it adopted the Revised   Recommendation concerning the International\r\nStandardization of Educational Statistics at its twentieth session (Paris, 1978). \n Experience over the years with the application of ISCED by national\r\nauthorities and international organizations has shown the need for its updating and\r\nrevision. This would further facilitate the international compilation and comparison of\r\neducation statistics and take into account new developments and changes in education and\r\nanticipate future trends in the various regions of the world, such as  \n the multiplication and growth of different forms of vocational\r\n    education and training, \n the increasing diversity of education providers, and \n the increasing recourse to distance education and other modalities\r\n    based on new technologies. \n The present classification, now known as ISCED 1997, was approved by\r\nthe UNESCO General Conference at its 29 th  session in November 1997. It was\r\nprepared by a Task Force established by the Director-General to that effect and is the\r\nresult of extensive consultations of worldwide representation. ISCED 1997 covers primarily\r\ntwo cross-classification variables: levels and fields of education. \n UNESCO's data-collection programme will be adjusted to these new\r\nstandards and Member States are invited to apply them in the reporting of education\r\nstatistics so as to increase their international comparability. To this end, an\r\noperational manual, aimed at giving guidance on the interpretation and practical\r\napplication of ISCED 1997, will be prepared in close collaboration with national experts. \n During the 1998/99 biennium work on additional aspects such as types of\r\neducation and education providers will be undertaken and incorporated in the present\r\nclassification. \n   \n   \n   \n   \n   \n TABLE OF CONTENTS \n Page \n Introduction 1 \n Scope and coverage 3 \n What ISCED covers 3 \n How ISCED works 4 \n The concept of the \u0091educational programme\u0092 in ISCED 5 \n Application of ISCED to programmes outside regular education 7 \n   \n Cross-classification variables 9 \n   \n I. Levels of education 10 \n How to assess the level of content of a programme 11 \n How to apply the proxies in practice 12 \n Level 0 - Pre-primary education 14 \n Level 1 - Primary education or first stage of basic education 16 \n Level 2 - Lower secondary or second stage of basic education 18 \n Level 3 - (Upper) secondary education 22 \n Level 4 - Post-secondary non-tertiary education 25 \n Level 5 - First stage of tertiary education 28 \n Level 6 - Second stage of tertiary education 33 \n II. Broad groups and fields of education 35 \n Glossary 41 \n   \n   \n INTRODUCTION \n   \n 1. ISCED is designed to serve as an instrument suitable for assembling,\r\n    compiling and presenting comparable indicators and statistics of education both within\r\n    individual countries and internationally. It   presents standard concepts,\r\n    definitions and classifications. ISCED covers all organized and sustained learning\r\n    opportunities for children, youth and adults including those with special needs education,\r\n    irrespective of the institution or entity providing them or the form in which they are\r\n    delivered. \n 2. ISCED is a multi-purpose system, designed for education policy\r\n    analysis and decision making, whatever the structure of the national education systems and\r\n    whatever the stage of economic development of a country. It can be utilized for statistics\r\n    on many different aspects of education such as statistics on pupil enrolment, on human or\r\n    financial resources invested in education or on the educational attainment of the\r\n    population. The basic concept and definitions of ISCED have therefore been designed to be\r\n    universally valid and invariant to the particular circumstances of a national education\r\n    system. However, it is necessary for a general system to include definitions and\r\n    instructions that cover the full range of education systems. \n 3. The original version of ISCED classified educational programmes by\r\n    their content along two main axes: levels of education and fields of education. These\r\n    axes, referred to as cross-classification variables, are retained in the revised taxonomy.\r\n    In the light of experience with the implementation and application of the original version\r\n    of ISCED in a majority of countries over the last two decades, the rules and criteria for\r\n    allocating programmes to a level of education have been clarified and tightened and the\r\n    fields of education have been further elaborated. \n 4. Information compiled according to ISCED can be utilized for\r\n    assembling statistics on many different aspects of education of interest to policy-makers\r\n    and other users. Whilst ISCED may be easier to use for collecting enrolment data, it\r\n    should be stressed that it is a classification of educational programmes and does not deal\r\n    with the flow of students through the education system (see paragraph 22). As regards the\r\n    collection of data on the educational attainment of the population, there is need to adapt\r\n    ISCED and this will be detailed in the operational manual. \n   \n 5. Taking into account that the comprehensive operational manual will\r\n    be prepared, the text of the revised ISCED has been made as concise as possible and is\r\n    structured in five sections: \n What ISCED covers \n How ISCED works \n The concept of the \u0091Educational Programme\u0092 in ISCED \n Application of ISCED to programmes outside regular education \n Cross-classification variables \n I  - Levels of education \n II - Broad groups and fields of education \n   \n   \n   \n   \n SCOPE AND COVERAGE \n   \n   \n WHAT ISCED COVERS \n 6. ISCED does not intend to provide a comprehensive definition of\r\n    education, still less to impose an internationally standardized concept of the philosophy,\r\n    aims or content of education, or to reflect its cultural aspects. Indeed, for any given\r\n    country the interplay of cultural traditions, local customs, socio-economic conditions, at\r\n    the very least, will have resulted in a concept of education in many ways unique to that\r\n    country, and any attempt to impose a common definition would not be productive. However,\r\n    for the purposes of ISCED, it is necessary to prescribe the scope and coverage of the\r\n    educational activities to be covered by the classification. \n 7. Within the framework of ISCED, the term education is thus taken to\r\n    comprise all deliberate and systematic activities designed to meet learning needs. This\r\n    includes what in some countries is referred to as cultural activities or training.\r\n    Whatever the name given to it, education is understood to involve organized and sustained\r\n    communication designed to bring about learning. The key words in this formulation are to\r\n    be understood as follows: \n 8. COMMUNICATION: a relationship between two or more persons involving\r\n    the transfer of information (messages, ideas, knowledge, strategies, etc.). Communication\r\n    may be verbal or non-verbal, direct/face-to-face or indirect/remote, and may involve a\r\n    wide variety of channels and media. \n 9. LEARNING: any improvement in behaviour, information, knowledge,\r\n    understanding, attitude, values or skills. \n   \n 10. ORGANIZED: planned in a pattern or sequence with explicit or\r\n    implicit aims. It involves a providing agency (person or persons or body) which sets up\r\n    the learning environment and a method of teaching through which the communication is\r\n    organized. The method is typically someone who is engaged in communicating or releasing\r\n    knowledge and skills with a view to bringing about learning, but it can also be\r\n    indirect/inanimate e.g. a piece of computer software, a film, or tape, etc. \n 11. SUSTAINED: intended to mean that the learning experience has the\r\n    elements of duration and continuity. No minimum duration is stipulated, but appropriate\r\n    minima will be stated in the operational manual. \n 12. ISCED embraces both initial education at the early stages of a\r\n    person\u0092s life prior to entry into the world of work, as well as continuing education\r\n    throughout a person\u0092s life. It follows that education for the purpose of ISCED\r\n    includes a variety of programmes and types of education which are designated in the\r\n    national context, such as regular education, adult education, formal education, non-formal\r\n    education, initial education, continuing education, distance education, open-education,\r\n    life-long education, part-time education, dual systems, apprenticeships,\r\n    technical-vocational education, training, special needs education. A provisional glossary\r\n    of definitions is annexed to this document. \n 13. It follows that education, for the purposes of ISCED, excludes\r\n    communication that is not designed to bring about learning. It also excludes various forms\r\n    of learning that are not organized. Thus, while all education involves learning, many\r\n    forms of learning are not regarded as education. For example, incidental or random\r\n    learning which occurs as a by-product of another event, such as something that\r\n    crystallizes during the course of a meeting, is excluded because it is not organized i.e.\r\n    does not result from a planned intervention designed to bring about learning. \n HOW ISCED WORKS \n 14. ISCED provides an integrated and consistent statistical framework\r\nfor the collection and reporting of internationally comparable education statistics. It\r\ncontains two components: \n   \n a  statistical framework  for the comprehensive statistical description of national\r\n    education and learning systems along a set of variables that are of key interest to policy\r\n    makers in international educational comparisons; and \n   \n a  methodology  that translates national educational programmes into an\r\n    internationally comparable set of categories for (i) the levels of education; and\r\n    (ii) the fields of education. \n   \n   \n   \n 15. The application of ISCED facilitates the transformation of detailed\r\n    national education statistics on participants, providers and sponsors of education,\r\n    compiled on the basis of national concepts and definitions, into aggregate categories that\r\n    are internationally comparable and that can be meaningfully interpreted. \n 16. ISCED rests on three components: (i) internationally agreed\r\n    concepts and definitions, (ii) the classification systems, and (iii) an operational\r\n    instructional manual and a well-defined implementation process. Comprehensive, and\r\n    detailed operational specifications are an integral part of ISCED \u0096 that is,\r\n    inseparable from the basic taxonomy. The same applies to the implementation process. The\r\n    operational manual will give specific and operational instructions. Without them, no\r\n    individual country, no matter how strong its intention to facilitate international\r\n    comparisons, is in a position to determine whether its method of assigning programmes to\r\n    international categories is compatible with the methods of other countries. \n THE CONCEPT OF THE \u0091EDUCATIONAL PROGRAMME\u0092 IN ISCED \n 17. The basic unit of classification in ISCED remains the\r\n    educational programme. Educational programmes are defined on the basis of their\r\n    educational content as an array or sequence of educational activities which are organized\r\n    to accomplish a pre-determined objective or a specified set of educational tasks.\r\n    Objectives can, for example, be preparation for more advanced study, qualification for an\r\n    occupation or range of occupations, or simply an increase of knowledge and understanding.  \n 18. Accomplishment of a pre-determined objective often means the\r\n    presence of a set of structured learning experiences that lead to a completion point which\r\n    sometimes is formally certified through an award or other form of recognition. Usually\r\n    educational programmes, while containing courses and other learning experiences, are not\r\n    merely the sum of their components because they are supposed to be organized (see\r\n    para. 17). In many cases \u0096 though not always \u0096 it is required that an\r\n    institution or other provider recognizes the existence of such a programme and certifies\r\n    completion of it. \n   \n   \n 19. The term \u0091educational activity\u0092 implies a broader meaning\r\n    than the term \u0091course or combination of courses\u0092 which is important because\r\n    education at a given level comprises not only courses organized into programmes but also\r\n    free-standing courses and a variety of non-course activities as well. Programmes sometimes\r\n    include major components not normally characterized as courses \u0096 for example,\r\n    interludes of work experience in enterprises, research projects, and preparation of\r\n    dissertations.  \n 20. It should be noted that not all courses are parts of programmes of\r\n    regular education. For instance, many participants in adult and continuing education and\r\n    training in enterprises take individual courses to acquire specific kinds of skills (see\r\n    paragraph 26 to determine the level for these courses). \n 21. It must be recognized, though, that ISCED has natural limitations\r\n    for the direct classification and assessment of competences and qualifications of the\r\n    participants in educational activities. This is because there is no close and universal\r\n    relationship between the programmes a participant is enrolled in and actual educational\r\n    achievement. The educational programmes an individual has participated in or even\r\n    successfully completed are, at best, a first approximation to the skills and competences\r\n    he or she has actually obtained. Furthermore, for a programme-based taxonomy it is very\r\n    difficult to capture educational activities that are not organized in the form of\r\n    educational programmes of regular education.  \n 22. There is another serious limitation with a programme-based taxonomy\r\n    of the levels of education. Although it is reasonable to assume that educational\r\n    activities will result in an increase of skills and competences for an individual so that\r\n    the pathway of an individual through the education system can be understood as an ordered\r\n    increase in the educational attainment, the underlying educational programmes can often be\r\n    ordered only to a limited extent: individuals can arrange their educational pathways in\r\n    many ways. To respond to this, education systems provide multiple branching paths,\r\n    alternative programme sequences, and \u0091second chance\u0092 provisions. There is also\r\n    an increase in \u0091horizontal\u0092 movements through education systems in which a\r\n    participant can broaden his or her education with only a partial increase in the\r\n    \u0091level\u0092 of education. It thus becomes increasingly difficult to attribute the\r\n    programme itself to a particular level of education. A taxonomy which is programme-based\r\n    necessarily loses partly the information on the pathway of the participants through the\r\n    education system. A hierarchy of educational programmes can thus reflect the reality of\r\n    education systems only to a limited extent. \n   \n APPLICATION OF ISCED TO PROGRAMMES OUTSIDE REGULAR EDUCATION \n 23. Some educational activities cannot be easily described in terms\r\n    of an educational programme in the above sense even though they clearly involve  organized \r\n    and  sustained communication  designed to bring about  learning  so that they\r\n    fall, in principle, under the scope of ISCED. Family-centred early childhood education can\r\n    serve as an example.  \n 24. Within the framework of ISCED, the universe of education includes,\r\n    as mentioned in paragraphs 1 and 12, in addition to regular education, adult education and\r\n    special needs education. The content of the educational programmes designed for the latter\r\n    two sub-groups are often adjusted to cover their particular needs.  \n 25. For other types of educational activities the provision of\r\n    education can be defined in terms of an educational programme in the above sense but it is\r\n    very difficult to identify the participants in the programme. An educational broadcasting\r\n    programme might serve as an example for such cases. In yet other cases educational\r\n    programmes may have special characteristics that do not meet the usual criteria that are\r\n    chosen in ISCED for the classification of programmes but still fall under the coverage of\r\n    ISCED. For example, an educational course provided through the Internet may be similar in\r\n    content and objectives to a programme provided in regular education. \n 26. All such educational activities should be classified based on their\r\n    equivalence with the educational content of regular programmes. In other words, they\r\n    should be classified together with those regular educational programmes to which they are\r\n    most similar with respect to the criteria provided. For example, where family-centred\r\n    early childhood education satisfies the content-based criteria of ISCED level 0, it should\r\n    be classified as an ISCED level 0 pre-primary programme. Sometimes the qualifications or\r\n    certifications awarded upon successful completion of a programme can help to classify an\r\n    educational activity. For example, the level of educational content of a distance\r\n    education programme might be classified based on the type of qualifications that are\r\n    awarded upon its successful completion. \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \n CROSS-CLASSIFICATION VARIABLES \n   \n   \n   \n   \n   \n   \n   \n   \n   \n   \n 27. Educational programmes are cross-classified by levels and\r\n    fields of education, each variable being independent. Thus, every educational programme\r\n    can be classified into one and only one cell in the level-field matrix. Obviously, not\r\n    every combination of level and field exists, or can exist. \n   \n I.  LEVELS OF EDUCATION \n 28. The notion of \u0091levels\u0092 of education is taken\r\n    to be broadly related to gradations of learning experiences and the competences which the\r\n    contents of an educational programme require of participants if they are to have a\r\n    reasonable expectation of acquiring the knowledge, skills and capabilities that the\r\n    programme is designed to impart. Broadly speaking, the level is related to the degree of\r\n    complexity of the content of the programme. This does not imply that levels of education\r\n    constitute a ladder where the access of prospective participants to each level necessarily\r\n    depends on having successfully completed the previous level. It also does not preclude the\r\n    possibility that some participants in educational programmes at a given level may have\r\n    previously successfully completed programmes at a higher level. \n 29. The notion of \u0091levels\u0092 of education, therefore, is\r\n    essentially a construct based on the assumption that educational programmes can be\r\n    grouped, both nationally and cross-nationally, into an ordered series of categories\r\n    broadly corresponding to the overall knowledge, skills and capabilities required of\r\n    participants if they are to have a reasonable expectation of successfully completing the\r\n    programmes in these categories. These categories represent broad steps of educational\r\n    progression from very elementary to more complex experiences with the more complex the\r\n    programme, the higher the level of education. \n 30. The classification of the levels of education is undertaken within\r\n    an overall taxonomic framework that considers the educational system as a whole, and\r\n    specifically for parameters that are of key interest to policy-makers in international\r\n    educational comparisons or that are closely related to the definition of the levels of\r\n    education. Such parameters can be the general orientation of the programme, the field of\r\n    education, the service provider and the educational setting or location, the mode of\r\n    service provision, the type of participant or the mode of participation. Some of these\r\n    parameters do not necessarily provide direct attributes of the educational programmes but\r\n    are rather attributes of the institutions that provide the programmes or general\r\n    attributes of the modes of provision. However, these attributes serve an important\r\n    function in distinguishing the nature of the programmes in many countries. They further\r\n    play a crucial role when defining the scope of data collections. Thus, while ISCED is a\r\n    classification system of educational programmes, these other \u0096 often\r\n    closely interrelated \u0096 parameters will help to establish an overall\r\n    reference framework. \n   \n   \n HOW TO ASSESS THE LEVEL OF CONTENT OF A PROGRAMME \n 31. While the classification of educational programmes by level\r\n    should be based on educational content, it is clearly not possible to directly assess and\r\n    compare the content of the educational programmes in an internationally consistent way.\r\n    Curricula are far too diverse, multi-faceted and complex to permit unambiguous\r\n    determinations that one curriculum for students of a given age or grade belongs to a\r\n    higher level of education than another. International curricula standards that are needed\r\n    to support such judgements do not as yet exist. \n 32. Empirically, ISCED assumes that there exists several criteria which\r\n    can help point to the level of education into which any given educational programme should\r\n    be classified. Depending on the level and type of education concerned, there is a need to\r\n    establish a hierarchical ranking system between criteria: main criteria, and subsidiary\r\n    criteria (typical entrance qualification, minimum entrance requirement, minimum age, staff\r\n    qualification, etc., see Table 1). It is very important to apply these criteria in a\r\n    manner that they do not exclude but rather complement each other. After applying the\r\n    criteria, the level of the programme is determined. \n 33. To help users classify educational activities and programmes\r\n    appropriately, and to provide reliable tools to collect data and to calculate pertinent\r\n    and comparative indicators, there is a need to subdivide certain levels. For example,\r\n    Level 5 is disaggregated using three independent variables (called complementary\r\n    dimensions) - cumulative duration, national degree and qualification structure, and type\r\n    of programmes. This type of disaggregation facilitates many kinds of cross-classifications\r\n    and the derivation of pertinent comparative indicators. \n   \n HOW TO APPLY THE PROXIES IN PRACTICE \n 34. When using the criteria for the classification of a programme,\r\n    it should be borne in mind that the primary classification criterion is the educational\r\n    content. It is of fundamental importance that institutional characteristics of national\r\n    programmes are not used as substitutes for educational content. Sole reliance on\r\n    institutional criteria could sacrifice the objective of international comparability for a\r\n    wide range of comparisons since institutional structures are not usually internationally\r\n    comparable.  \n 35. Flexibility is, however, required when applying the criteria to\r\n    determine the level of education of an educational programme. While it is a principal\r\n    objective of ISCED to promote the collection of comparable data on education for the\r\n    various programme groupings, it is recognized that nationally disparate conditions may\r\n    exist which preclude strict adherence to the level definitions. Two examples to highlight\r\n    this are the starting age and the duration. \n First, it is stated that the starting age for pre-primary education is\r\n    three years but this does not preclude younger children from participating. \n A second example, the duration of ISCED 1 as stated is six years of\r\n    full-time equivalent schooling. This, however, does not automatically imply that countries\r\n    with seven years of primary education are requested to divide statistics on, for example,\r\n    the financial and teaching resources in primary education in two parts. Instead ISCED\r\n    recognizes that the statistical reporting will be done in the context of the national\r\n    education system and the constraints of statistical reporting systems.  \n What is important is that as far as institutional transition points are\r\n    used as criteria for allocating a programme to an ISCED level, the choice of national\r\n    transition points for matching the international classification categories is determined\r\n    by the content of the underlying educational programmes. Each duration given in ISCED is\r\n    intended to serve as a guide, and variations could be envisaged. These examples are also\r\n    valid for levels 2 and 3. \n 36. Short terms are used to describe some complementary dimensions. The\r\n    complete definitions are the following: \n the type of subsequent education or destination: the type of subsequent education or\r\n      destination for which completers are eligible or type of labour market positions for which\r\n      they prepare graduates; \n the programme orientation: the programme orientation, understood here as the degree to\r\n      which the programme is specifically oriented towards a specific class of occupations or\r\n      trades \n . \n   \n   \n Table 1: LEVELS OF EDUCATION AT A GLANCE \n   \n   \n How to determine\r\n    the level of a programme \n   \n   \n   \n Proxy criteria for\r\n    contents \n Name of the level \n Code \n Complementary \n Main criteria \n Subsidiary\r\n    criteria \n   \n   \n dimensions \n Educational properties  School\r\n    or centre-based  \n Minimum age \n Upper age limit \n Staff qualification \n Pre-primary education \n 0 \n None \n Beginning of systematic\r\n    apprenticeship of reading, writing and mathematics \n Entry into the\r\n    nationally designated primary institutions or programmes Start of compulsory education \n Primary education First\r\n    stage of basic education  \n 1 \n None \n Subject presentation Full\r\n    implementation of basic skills and foundation for lifelong learning \n Entry after some 6\r\n    years of primary education End of the cycle after 9 years since the beginning of primary\r\n    education \n End of compulsory education \n Several teachers conduct classes in their field of specialization \n Lower secondary\r\n    education  Second stage of basic education \n 2 \n Type of subsequent education or\r\n    destination Programme orientation \n Typical entrance qualification Minimum\r\n    entrance requirement \n   \n (Upper) secondary\r\n    education \n 3 \n Type of subsequent education or\r\n    destination Programme orientation \n Cumulative duration since the beginning of ISCED level 3 \n Entrance requirement, Content, \n Age, \n Duration \n   \n Post-secondary non\r\n    tertiary education \n 4 \n Type of subsequent education or\r\n    destination Cumulative duration since the beginning of ISCED level 3 \n Programme orientation  \n Minimum entrance requirement, Type\r\n    of certification obtained, \n Duration \n   \n First stage of\r\n    tertiary education (not leading directly to an advanced research qualification) \n 5 \n Type of programmes Cumulative\r\n    theoretical duration at tertiary \n National degree and qualification structure \n Research oriented content,  Submission\r\n    of thesis or dissertation \n Prepare graduates for\r\n    faculty and research posts \n Second stage of\r\n    tertiary education (leading to an advanced research qualification) \n 6 \n None \n   \n   \n LEVEL 0 - PRE-PRIMARY EDUCATION \n   \n Principal characteristics \n 37. Programmes at level 0, (pre-primary) defined as the initial\r\n    stage of organized instruction are designed primarily to introduce very young children to\r\n    a school-type environment, i.e. to provide a bridge between the home and a school-based\r\n    atmosphere. Upon completion of these programmes, children continue their education at\r\n    level 1 (primary education).  \n Classification criteria \n 38. For the definition of the beginning and the end of pre-primary\r\n    education, i.e. the boundary between pre-primary education and childcare or between\r\n    pre-primary and primary education, the following criteria are relevant: \n Main criteria \n the educational properties of the programme; \n school or centre based; \n the minimum age of the children catered for; and \n the upper age limit of the children. \n Subsidiary criterion \n the staff qualifications. \n 39. For a programme to be considered as pre-primary education, it has\r\n    to be school-based or centre-based. These terms are used to distinguish activities in\r\n    settings such as primary school, pre-schools and kindergartens from services provided in\r\n    households or family settings. \n 40. Such programmes are designed for children aged at least 3 years.\r\n    This age has been chosen since programmes destined for younger children do not normally\r\n    satisfy the educational criteria in ISCED. \n 41. The upper age limit depends in each case on the typical age for\r\n    entry into primary education. \n   \n 42. Where appropriate, the requirement of pedagogical\r\n    qualifications for the teaching staff can be a good proxy criterion for an educational\r\n    programme in all those countries, in which such a requirement exists. It serves to\r\n    distinguish pre-primary education from child-care for which para-medical or no\r\n    qualifications are required.  \n Includes also: \n 43. This level includes organized instruction for children with\r\n    special needs education. This education may be also provided in hospitals or in special\r\n    schools or training centres. In this case no upper age limit can be specified. \n Excludes: \n 44. Adult education. \n   \n   \n LEVEL 1 - PRIMARY EDUCATION  \n OR FIRST STAGE OF BASIC EDUCATION \n   \n Principal characteristics \n 45. Programmes at level 1 are normally designed on a unit or\r\n    project basis to give students a sound basic education in reading, writing and mathematics\r\n    along with an elementary understanding of other subjects such as history, geography,\r\n    natural science, social science, art and music. In some cases religious instruction is\r\n    featured. \n 46. The core at this level consists of education provided for children,\r\n    the customary or legal age of entrance being not younger than five years or older than\r\n    seven years. This level covers in principle six years of full-time schooling. \n 47. Throughout this level the programmes are organized in units or\r\n    projects rather than by subjects. This is a principal characteristic differentiating\r\n    programmes at this level in most countries from those at level 2. \n Classification criteria \n 48. For the definition of the boundary between education levels 0\r\n    and 1 (pre-primary and primary education) the following criteria are relevant:  \n Main criterion \n the beginning of systematic studies characteristic of primary\r\n    education, e.g. reading, writing and mathematics. \n Subsidiary criteria \n entry into the nationally designated primary institutions or\r\n    programmes; and \n the start of compulsory education where it exists. \n   \n Includes also:  \n 49. In countries where primary education is part of \u0091basic\r\n    education\u0092, only the first stage should be included in level 1. If \u0091basic\r\n    education\u0092 is not officially divided into stages, only the first six years should be\r\n    classified as level 1. \n 50. This level category also includes programmes suited to children\r\n    with special needs education. \n 51. Literacy programmes within or outside the school system which are\r\n    similar in content to programmes in primary education for those considered too old to\r\n    enter elementary schools are also included at this level because they require no previous\r\n    formal education. \n   \n   \n LEVEL 2 - LOWER SECONDARY OR SECOND STAGE  \n OF BASIC EDUCATION \n   \n Principal characteristics \n 52. The contents of education at this stage are typically designed\r\n    to complete the provision of basic education which began at ISCED level 1. In many, if not\r\n    most countries, the educational aim is to lay the foundation for lifelong learning and\r\n    human development on which countries may expand, systematically, further educational\r\n    opportunities. The programmes at this level are usually on a more subject-oriented pattern\r\n    using more specialized teachers and more often several teachers conducting classes in\r\n    their field of specialization. The full implementation of basic skills occurs at this\r\n    level. The end of this level often coincides with the end of compulsory education where it\r\n    exists.  \n Classification criteria \n 53. For the definition of this level, the following criteria are\r\n    relevant: \n Main criteria \n the beginning of subject presentation using more qualified\r\n      teachers than for level 1; and \n the full implementation of basic skills and foundation for lifelong\r\n      learning. \n Subsidiary criteria \n entry is after some 6 years of primary education (see paragraph\r\n    35); \n the end of this level is after some 9 years of schooling since the\r\n    beginning of primary education (see paragraph 35); \n the end of this level often coincides with the end of compulsory\r\n    education in countries where this exists; and \n often, at the beginning of this level, several teachers start to\r\n    conduct classes in their field of specialization. \n   \n Complementary dimensions \n 54. Two complementary dimensions are needed to describe this level: \n the type of subsequent education or destination (see paragraph 36); and \n the programme orientation (see paragraph 36). \n   \n Type of subsequent education or destination \n 55. ISCED level 2 programmes can be subclassified according to\r\n    the destination for which the programmes have been designated, resulting in the following\r\n    distinction (see paragraph 66): \n ISCED 2A: programmes designed for direct access to level 3 in a sequence which would\r\n      ultimately lead to tertiary education, i.e. entrance to ISCED 3A or 3B; \n ISCED 2B: programmes designed for direct access to level 3C; \n ISCED 2C: programmes primarily designed for direct access to the labour market at the\r\n      end of this level (sometimes referred to as \u0091terminal\u0092 programmes). \n   \n Programme orientation \n 56. This second complementary dimension subdivides the\r\n    programmes into three categories: \n General education \n 57. Education which is mainly designed to lead participants to a\r\n    deeper understanding of a subject or group of subjects, especially, but not necessarily,\r\n    with a view to preparing participants for further (additional) education at the same or a\r\n    higher level. Successful completion of these programmes may or may not provide the\r\n    participants with a labour-market relevant qualification at this level. These programmes\r\n    are typically school-based. Programmes with a general orientation and not focusing on a\r\n    particular specialization should be classified in this category. \n   \n   \n Pre-vocational or pre-technical education \n 58. Education which is mainly designed to introduce participants to\r\n    the world of work and to prepare them for entry into vocational or technical education\r\n    programmes. Successful completion of such programmes does not yet lead to a labour-market\r\n    relevant vocational or technical qualification. For a programme to be considered as\r\n    pre-vocational or pre-technical education, at least 25 per cent of its content has to be\r\n    vocational or technical. This minimum is necessary to ensure that the vocational subject\r\n    or the technical subject is not only one among many others. \n Vocational or technical education \n 59. Education which is mainly designed to lead participants to\r\n    acquire the practical skills, know-how and understanding necessary for employment in a\r\n    particular occupation or trade or class of occupations or trades. Successful completion of\r\n    such programmes lead to a labour-market relevant vocational qualification recognized by\r\n    the competent authorities in the country in which it is obtained (e.g. Ministry of\r\n    Education, employers\u0092 associations, etc.).  \n   \n Programmes in this category may be subdivided into two types: \n those which are primary theoretically oriented; and \n those which are primarily practically oriented. \n   \n These three categories are also used for levels 3 and 4. \n   \n   How the two complementary dimensions work at level 2 \n Type of \n ISCED\r\n    level 2 programmes \n subseq. educ. \n Programmes giving access to ISCED level 3 \n Programmes\r\n    not giving \n or destination \n ISCED 2A progr. \n ISCED 2B progr. \n access to\r\n    level 3: \n giving access to \n giving access to \n ISCED 2C\r\n    programmes \n Programme \n 3A or 3B \n 3C programmes \n preparing\r\n    only for direct \n orientation \n programmes \n entry\r\n    into the labour market \n General \n Pre-vocat. or \n pre-technical \n Vocational or \n technical \n   \n   \n   \n   \n Includes also:  \n 60. In countries where primary education is part of \u0091basic\r\n    education\u0092, the second stage of \u0091basic education\u0092 should be included in\r\n    level 2. If \u0091basic education\u0092 is not officially divided into stages, the years\r\n    after the sixth should be classified as level 2. \n 61. This level includes special needs education programmes and all\r\n    adult education which are similar in content to the education given at this level, e.g.\r\n    the education which gives to adults the basic skills necessary for further learning. \n   \n   \n LEVEL 3 \n (UPPER) SECONDARY EDUCATION \n Principal characteristics \n 62. This level of education typically begins at the end of full-time compulsory\r\n    education for those countries that have a system of compulsory education. More\r\n    specialization may be observed at this level than at ISCED level 2 and often teachers need\r\n    to be more qualified or specialized than for ISCED level 2. The entrance age to this level\r\n    is typically 15 or 16 years. \n 63. The educational programmes included at this level typically require\r\n    the completion of some 9 years of full-time education (since the beginning of\r\n    level 1) for admission or a combination of education and vocational or technical\r\n    experience and with as minimum entrance requirements the completion of level 2 or\r\n    demonstrable ability to handle programmes at this level. \n Classification criteria \n 64. For the definition of this level, the following criteria are\r\n    relevant: \n Main criteria \n the typical entrance qualifications (some nine years of\r\n    full-time education since the beginning of level 1; see paragraph 35); and  \n the minimum entrance requirements (usually the completion of level 2). \n   \n Complementary dimensions \n 65. Three dimensions are needed to subclassify this level:  \n type of subsequent education or destination (see paragraph 36); \n programme orientation (see paragraph 36); and \n cumulative theoretical duration in full time equivalent since the beginning of level 3. \n   \n Type of subsequent education or destination \n 66. The first of these dimensions results in three distinct\r\n    groupings (see paragraph 84): \n ISCED 3A: programmes at level 3, designed to provide direct access to ISCED 5A; \n ISCED 3B: programmes at level 3 designed to provide direct access to ISCED 5B; \n ISCED 3C: programmes at level 3 not designed to lead directly to ISCED 5A or 5B.  \n Therefore, these programmes lead directly to labour market, ISCED 4\r\n    programmes or other ISCED 3 programmes. \n Programme orientation \n 67. This second complementary dimension has the same categories\r\n    as for level 2 (see paragraphs 56 to 59): \n general education; \n pre-vocational or pre-technical education; and \n vocational or technical education. \n Cumulative theoretical duration \n 68. This third dimension, the cumulative theoretical duration\r\n    of the programme, in full-time equivalent, is calculated from the beginning of level 3.\r\n    This dimension is particularly useful for level 3C programmes. \n   \n  \r\n   How the three complementary dimensions work at level 3 \n Type of \n ISCED level 3 programmes \n subseq. educ. or\r\n    destination \n Programmes giving access to ISCED level 5 \n Programmes\r\n    not giving access to level 5 programmes \n ISCED 3A progr. \n ISCED 3B progr. \n ISCED 3C programmes giving \n Programme \n giving access to 5A\r\n    programmes \n giving access to 5B\r\n    programmes \n access to labour market, level 4 programmes or other level 3 programmes \n orientation \n <= 6 months \n 6 mo < <=1 y \n 1y < <=2y \n > 2 yrs \n General \n Pre-vocat. or \n pre-technical \n Vocational or \n technical \n   \n   \n Includes also:  \n 69. This level includes also special needs education programmes and adult\r\n    education. \n Excludes:  \n 70. Remedial programmes that are designed for participants who have\r\n    pursued a programme at ISCED level 2 but who have not attained the objectives of ISCED\r\n    level 2 programmes (and which can therefore not be regarded as equivalent in content to\r\n    any of the ISCED 3 programmes described below) should not be classified at ISCED level 3\r\n    but at ISCED level 1 or 2 depending on the content of the programmes. \n   \n LEVEL 4 - POST-SECONDARY NON-TERTIARY EDUCATION \n   \n Principal characteristics \n 71. ISCED 4 captures programmes that straddle the boundary between\r\n    upper-secondary and post-secondary education from an international point of view, even\r\n    though they might clearly be considered as upper-secondary or post-secondary programmes in\r\n    a national context. \n 72. ISCED 4 programmes can, considering their content, not be\r\n    regarded as tertiary programmes. They are often not significantly more advanced than\r\n    programmes at ISCED 3 but they serve to broaden the knowledge of participants who\r\n    have already completed a programme at level 3. \n 73. Typical examples are programmes designed to prepare students for\r\n    studies at level 5 who, although having completed ISCED level 3, did not follow a\r\n    curriculum which would allow entry to level 5, i.e. pre-degree foundation courses or\r\n    short vocational programmes. Second cycle programmes can be included as well. \n Classification criteria \n 74. It requires as a rule the successful completion of\r\n    level 3, i.e. successful completion of any programme at level 3A or 3B, or, for\r\n    3C programmes, a cumulative theoretical duration of typically 3 years at least.\r\n    However, the criterion of successful completion of ISCED 3 should be interpreted in\r\n    the context of the duration of the programme. For example, a programme that builds on a\r\n    2-year programme at ISCED 3 and has a duration of 4 years, would normally be\r\n    classified at ISCED 4 even though the preceding 2-year programme at ISCED 3 does\r\n    not qualify for the completion of ISCED 3. \n The programme content can be expected to be more specialized or\r\n    detailed and the applications to be more complex in some cases than those offered at the\r\n    upper-secondary level, and this irrespective of the institutional setting of the\r\n    programme. \n The students are typically older than those in upper secondary programmes.  \n It has a typical full-time equivalent duration of between 6 months and\r\n    2 years. \n   \n   \n   \n Complementary dimensions \n 75. Three dimensions are needed to subclassify this level:  \n type of subsequent education or destination (see paragraph 36); \n the cumulative theoretical duration in full-time equivalence since the beginning of\r\n      level 3; and \n the programme orientation (see paragraph 36). \n   \n Type of subsequent education or destination\r\n     76. According to this first dimension, level 4 can be\r\n    subdivided into:  \n 4A programmes that prepare for entry to ISCED 5; and \n 4B programmes not giving access to level 5 (primarily designed for\r\n        direct labour market entry). \n Cumulative theoretical duration \n 77. This duration is to be considered from the beginning of\r\n    ISCED 3. \n Programme orientation \n 78. The three categories are defined above in paragraphs 56 to\r\n    59: \n general education; \n pre-vocational or pre-technical education; and \n vocational or technical education. \n  \r\n How\r\n    the three complementary dimensions work at level 4 \n Type of \n ISCED level 4 programmes \n subseq. educ. or\r\n    destination \n Programmes\r\n    giving access to level 5 programmes \n Programmes\r\n    not giving access to level 5 programmes \n ISCED 4A programmes  \n ISCED 4B programmes  \n Programme \n orientation \n <= 2 years \n 2y < <=3 y \n 3y < <=4y \n > 4 years \n <= 2 years \n 2y <\r\n    <=3 y \n 3y < <=4y \n > 4\r\n    years \n General \n Pre-vocat. or \n pre-technical \n Vocational or \n technical \n   \n Cumulative duration is to be considered from the beginning of\r\n    ISCED 3 \n   \n   \n   \n Includes also:  \n This level includes adult education. For example, technical courses given during an\r\n    individual\u0092s professional life on specific subjects as computer software could be\r\n    included in this level. \n   \n   \n LEVEL 5 - FIRST STAGE OF TERTIARY EDUCATION \n (NOT LEADING DIRECTLY TO AN ADVANCED RESEARCH \n QUALIFICATION) \n   \n Principal characteristics \n 80. This level consists of tertiary programmes having an\r\n    educational content more advanced than those offered at levels 3 and 4. Entry to these\r\n    programmes normally requires the successful completion of ISCED level 3A or 3B or a\r\n    similar qualification at ISCED level 4A. \n 81. All degrees and qualifications are cross-classified by type of\r\n    programmes, position in national degree or qualification structures (see below) and\r\n    cumulative duration at tertiary. \n Classification criteria \n 82. For the definition of this level, the following criteria are\r\n    relevant: \n normally the minimum entrance requirement to this level is the successful completion of\r\n    ISCED level 3A or 3B or ISCED level 4A; \n level 5 programmes do not lead directly to the award of an advanced research\r\n    qualification (level 6); and \n these programmes must have a cumulative theoretical duration of at least 2 years from\r\n    the beginning of level 5. \n   \n Complementary dimensions \n 83. Three complementary dimensions are needed to subdivide this\r\n    level: \n the type of programmes dividing programmes into theoretically based/research\r\n      preparatory/giving access to professions with high skills requirements programmes on the\r\n      one hand, practical/technical/occupationally specific programmes on the other hand;  \n the cumulative theoretical duration in full time equivalence; and \n the position in the national degree or qualification structure (first, second or further\r\n      degree, research). \n Combining these three independent dimensions is the only way to capture\r\n    the broad variety in the provision of tertiary education. The choice of the combination\r\n    depends on the problems to analyse. \n Type of programmes \n 84. The first dimension to be considered is the distinction\r\n    between the programmes which are theoretically based/research preparatory (history,\r\n    philosophy, mathematics, etc.) or giving access to professions with high skills\r\n    requirements (e.g. medicine, dentistry, architecture, etc.), and those programmes which\r\n    are practical/technical/occupationally specific. To facilitate the presentation, the first\r\n    type will be called 5A, the second, 5B. \n 85. With the increasing demand for tertiary education in many\r\n    countries, the distinction between long streams and short streams is very important. The\r\n    long stream programmes are more theoretical and can lead to advanced research programmes\r\n    or a profession with high skills requirements. The short streams are more practically\r\n    oriented. \n 86. As the organizational structure of tertiary education programmes\r\n    varies greatly across countries, no single criterion can be used to define boundaries\r\n    between ISCED 5A and ISCED 5B. The following criteria are the minimum requirements for\r\n    classifying a programme as ISCED 5A, although programmes not satisfying a single criterion\r\n    should not be automatically excluded. If a programme is similar in content to other\r\n    programmes meeting each of these criteria, it should be classified at level 5A. \n 87. ISCED level 5A programmes are tertiary programmes that are largely\r\n    theoretically based and are intended to provide sufficient qualifications for gaining\r\n    entry into advanced research programmes and profession with high skills requirements. They\r\n    must satisfy a sufficient number of the following criteria: \n   \n they have a minimum cumulative theoretical duration (at tertiary) of three years\u0092\r\n      full-time equivalent, although typically they are of 4 or more years. If a degree has 3\r\n      years\u0092 full-time equivalent duration, it is usually preceded by at least\r\n      13 years of previous schooling (see paragraph 35). For systems in which degrees are\r\n      awarded by credit accumulation, a comparable amount of time and intensity would be\r\n      required; \n they typically require that the faculty have advanced research credentials; \n they may involve completion of a research project or thesis; \n they provide the level of education required for entry into a profession with high\r\n      skills requirements (see paragraph 84) or an advanced research programme. \n 88. Qualifications in category 5B are typically shorter than those in\r\n    5A and focus on occupationally specific skills geared for entry into the labour market,\r\n    although some theoretical foundations may be covered in the respective programme. \n   \n 89. The content of ISCED level 5B programmes is practically\r\n    oriented/occupationally specific and is mainly designed for participants to acquire the\r\n    practical skills, and know-how needed for employment in a particular occupation or trade\r\n    or class of occupations or trades - the successful completion of which usually provides\r\n    the participants with a labour-market relevant qualification. \n 90. A programme should be considered as belonging to level 5B if it\r\n    meets the following criteria: \n it is more practically oriented and occupationally specific than programmes at\r\n      ISCED 5A, and does not provide direct access to advanced research programmes; \n it has a minimum of two years\u0092 full-time equivalent duration but generally is of 2\r\n      or 3 years. For systems in which qualifications are awarded by credit accumulation, a\r\n      comparable amount of time and intensity would be required; \n the entry requirement may require the mastery of specific subject areas at ISCED 3B or\r\n      4A; and \n it provides access to an occupation. \n   \n Cumulative theoretical duration \n 91. For initial programmes at tertiary, the cumulative\r\n    theoretical duration is simply the theoretical full-time equivalent duration of those\r\n    programmes from the beginning of level 5. \n 92. For programmes that require completion of other tertiary programmes\r\n    prior to admission (see national degree and qualification structure below), cumulative\r\n    duration is calculated by adding the minimum entrance requirements of the programme (i.e.\r\n    full-time equivalent years of tertiary education prerequisites) to the full-time\r\n    equivalent duration of the programme. For degrees or qualifications where the full-time\r\n    equivalent years of schooling is unknown (i.e. courses of study designed explicitly for\r\n    flexible or part-time study), cumulative duration is calculated based on the duration of\r\n    more traditional degree or qualification programmes with a similar level of educational\r\n    content. \n   \n 93. The categories to be considered would be: \n and less than 3 years (particularly for ISCED level 5B); \n and less than 4 years; \n and less than 5 years; \n and less than 6 years; \n years and more. \n   \n National degree and qualification structure \n 94. This dimension cross-classifies both ISCED 5A and 5B\r\n    qualifications by their position in the national qualification structure for tertiary\r\n    education within an individual country. \n 95. The main reason the national degree and qualification structure is\r\n    included as a separate dimension is that the timing of these awards mark important\r\n    educational and labour market transition points within countries. For example, in country\r\n    A a student who completes a three year Bachelor\u0092s degree programme will have access\r\n    to a wide range of occupations and opportunities for further education, whereas the same\r\n    student studying in country B (which does not distinguish between a first and second\r\n    university degree) will only obtain a labour market relevant qualification after the\r\n    completion of a full four or five year degree programme, even though the content may be\r\n    similar to that of a second (Master\u0092s) degree programme in country A. \n 96. The \u0091position\u0092 of a degree or qualification structure is\r\n    assigned (first, second or further, research) based on the internal hierarchy of awards\r\n    within national education systems. For example, a first theoretically based degree or\r\n    qualification (cross-classifying \u0091theoretically based\u0092 type of programme 5A with\r\n    \u0091first\u0092 in the national degree and qualifications structure) would necessarily\r\n    meet all of the criteria listed above for a theoretically based programme and lead to the\r\n    first important educational or labour market qualification within this type of programme .\r\n    The research degree is intended for the countries which have a non-doctoral research\r\n    degree such as the Master of Philosophy in some countries and want to have it clearly\r\n    distinguished in international statistics. \n 97. When \u0091theoretically based\u0092 programmes are organized and\r\n    provide sequential qualifications, usually only the last qualification gives direct access\r\n    to level 6, but all these programmes are allocated to level 5A. \n   \n 98. Bachelor\u0092s degrees in many English-speaking countries, the\r\n    \u0091Diplom\u0092 in many German-speaking countries, and the Licence in many\r\n    French-speaking countries meet the content criteria for the first theoretically based\r\n    programmes. Second and higher theoretically based programmes (e.g. Master\u0092s degree in\r\n    English-speaking countries and Maîtrise in French-speaking countries) would be classified\r\n    separately from advanced research qualifications, which would have their own position in\r\n    ISCED 6 (see below). \n 99. Degrees or qualifications with a different numerical ranking in two\r\n    countries may be equivalent in educational content. For instance, programmes leading to a\r\n    \u0091graduate\u0092 or second degree in many English-speaking countries have to be\r\n    classified at level 5 as is the case for long first degrees in many German-speaking\r\n    countries. It is only by combining national degree structure with other tertiary\r\n    dimensions, such as cumulative theoretical duration and programme orientation, that enough\r\n    information is available to group degrees and qualifications of similar education content. \n How the three complementary dimensions work at\r\n    level 5  \n Theoretical \n LEVEL\r\n    5 \n cumulative \n 5A\r\n    Programmes \n 5B\r\n    Programmes \n duration at \n tertiary level \n First degree \n Sec. and further\r\n    degree \n Research \n First qualificat. \n Second qualification \n 2 and < 3 years \n 3 and < 4 years \n 4 and < 5 years \n 5 and < 6 years \n 6 years and + \n   \n Includes also:  \n 100. This level includes all the research programmes which are not\r\n    part of a doctorate, such as any type of Master\u0092s degree. \n 101. In some countries, students beginning tertiary education enrol\r\n    directly for an advanced research qualification. In this case, the part of the programme\r\n    concentrating on advanced research should be classified as level 6 and the initial years\r\n    as level 5. \n 102. Adult education programmes equivalent in content with some ISCED 5\r\n    programmes could be included at this level. \n   \n LEVEL 6 - SECOND STAGE OF TERTIARY EDUCATION \n (LEADING TO AN ADVANCED RESEARCH QUALIFICATION) \n   \n Principal characteristics \n 103. This level is reserved for tertiary programmes which lead to\r\n    the award of an advanced research qualification. The programmes are therefore devoted to\r\n    advanced study and original research and are not based on course-work only. \n Classification criteria \n 104. For the definition of this level, the following criteria are\r\n    relevant: \n Main criterion \n It typically requires the submission of a thesis or\r\n    dissertation of publishable quality which is the product of original research and\r\n    represents a significant contribution to knowledge. \n Subsidiary criterion \n It prepares graduates for faculty posts in institutions\r\n    offering ISCED 5A programmes, as well as research posts in government, industry, etc. \n Complementary dimensions \n 105. As the scope of this level is very restricted, no\r\n    complementary dimension is needed. \n Includes also: \n 106. The part concentrating on advanced research in those countries\r\n    where students beginning tertiary education enrol directly for an advanced research\r\n    programme (see paragraph 101). \n   \n   \n   \n II.  BROAD GROUPS AND FIELDS OF EDUCATION \n   \n 107. The fields of education in the original ISCED have been modified\r\n    to eliminate overlapping, and increased to include new fields. Thus, there are now 25\r\n    fields of education as compared to 21 in the original version. Another innovation is the\r\n    establishment of broad groups composed of fields of education having similarities. One\r\n    such example is the broad group Health and Welfare comprising educational programmes in\r\n    medicine, medical services, nursing, dental services and social services. \n 108. Further, it should also be stated that UNESCO intends to insert\r\n    new fields as and when the need arises. Member States would be accordingly advised when\r\n    this occurs. It is also recommended that inter- or multi-disciplinary programmes should be\r\n    classified according to a majority rule, i.e. in the field of education in which the\r\n    students spend most of their time. \n 109. A code list describing exactly how educational programmes/subject\r\n    groups are allocated to the different fields of education will be given in the operational\r\n    manual.  \n General Programmes \n 01 Basic programmes \n Basic general programmes pre-primary, elementary, primary, secondary,\r\n      etc. \n 08 Literacy and numeracy   \n Simple and functional literacy, numeracy. \n 09 Personal development \n Enhancing personal skills, e.g. behavioural capacities, mental skills,\r\n      personal organizational capacities, life orientation programmes. \n   \n   \n   \n Education \n 14 Teacher training and education science \n Teacher training for pre-school, kindergarten, elementary school,\r\n      vocational, practical, non-vocational subject, adult education, teacher trainers and for\r\n      handicapped children. General and specialized teacher training programmes.  \n Education science: curriculum development in non-vocational and\r\n      vocational subjects. Educational assessment, testing and measurement, educational\r\n      research, other education science. \n Humanities and Arts \n 21 Arts \n Fine arts: drawing, painting, sculpture; \n Performing arts: music, drama, dance, circus; \n Graphic and audio-visual arts: photography, cinematography, music\r\n      production, radio and TV production, printing and publishing;  \n Design; Craft skills. \n 22 Humanities \n Religion and theology; Foreign languages and cultures: living or\r\n      \u0091dead\u0092 languages and their literature, area studies;  \n Native languages: current or vernacular language and its literature;  \n Other humanities: interpretation and translation, linguistics,\r\n      comparative literature, history, archaeology, philosophy, ethics. \n Social sciences, business and law \n 31 Social and behavioural science \n Economics, economic history, political science, sociology, demography,\r\n      anthropology (except physical anthropology), ethnology, futurology, psychology, geography\r\n      (except physical geography), peace and conflict studies, human rights. \n 32 Journalism and information \n Journalism; library technician and science; technicians in museums and\r\n      similar repositories; \n Documentation techniques; \n Archival sciences. \n   \n   \n   \n 34 Business and administration \n Retailing, marketing, sales, public relations, real estate; \n Finance, banking, insurance, investment analysis; \n Accounting, auditing, bookkeeping; \n Management, public administration, institutional administration,\r\n      personnel administration; \n Secretarial and office work. \n 38 Law \n Local magistrates, \u0091notaires\u0092, law (general, international,\r\n      labour, maritime, etc.), jurisprudence, history of law. \n Science \n 42 Life sciences \n Biology, botany, bacteriology, toxicology, microbiology, zoology,\r\n      entomology, ornithology, genetics, biochemistry, biophysics, other allied sciences,\r\n      excluding clinical and veterinary sciences. \n 44 Physical sciences \n Astronomy and space sciences, physics, other allied subjects,\r\n      chemistry, other allied subjects, geology, geophysics, mineralogy, physical anthropology,\r\n      physical geography and other geosciences, meteorology and other atmospheric sciences\r\n      including climatic research, marine science, vulcanology, palaeoecology. \n 46 Mathematics and statistics \n Mathematics, operations research, numerical analysis, actuarial\r\n      science, statistics and other allied fields. \n 48 Computing \n Computer sciences: system design, computer programming, data\r\n      processing, networks, operating systems - software development only (hardware development\r\n      should be classified with the engineering fields). \n Engineering, manufacturing and construction \n 52 Engineering and engineering trades \n Engineering drawing, mechanics, metal work, electricity, electronics,\r\n      telecommunications, energy and chemical engineering, vehicle maintenance, surveying. \n   \n   \n   \n 54 Manufacturing and processing \n Food and drink processing, textiles, clothes, footwear, leather,\r\n      materials (wood, paper, plastic, glass, etc.), mining and extraction. \n 58 Architecture and building \n Architecture and town planning: structural architecture, landscape\r\n      architecture, community planning, cartography;  \n Building, construction; \n Civil engineering. \n Agriculture \n 62 Agriculture, forestry and fishery \n Agriculture, crop and livestock production, agronomy, animal husbandry,\r\n      horticulture and gardening, forestry and forest product techniques, natural parks,\r\n      wildlife, fisheries, fishery science and technology. \n 64 Veterinary \n Veterinary medicine, veterinary assisting. \n Health and welfare \n 72 Health  \n Medicine: anatomy, epidemiology, cytology, physiology, immunology and\r\n      immunoaematology, pathology, anaesthesiology, paediatrics, obstetrics and gynaecology,\r\n      internal medicine, surgery, neurology, psychiatry, radiology, ophthalmology;  \n Medical services: public health services, hygiene, pharmacy,\r\n      pharmacology, therapeutics, rehabilitation, prosthetics, optometry, nutrition; \n Nursing: basic nursing, midwifery;  \n Dental services: dental assisting, dental hygienist, dental laboratory\r\n      technician, odontology. \n 76 Social services \n Social care: care of the disabled, child care, youth services,\r\n      gerontological services; \n Social work: counselling, welfare n.e.c. \n   \n   \n   \n Services \n 81 Personal services \n Hotel and catering, travel and tourism, sports and leisure,\r\n      hairdressing, beauty treatment and other personal services: cleaning, laundry,\r\n      dry-cleaning, cosmetic services, domestic science. \n 84 Transport services \n Seamanship, ship's officer, nautical science, air crew, air traffic\r\n      control, railway operations, road motor vehicle operations, postal service. \n   \n 85 Environmental protection \n Environmental conservation, control and protection, air and water\r\n      pollution control, labour protection and security. \n 86 Security services \n Protection of property and persons: police work and related law\r\n      enforcement, criminology, fire-protection and fire fighting, civil security; \n Military. \n Not known or unspecified \n (This category is not part of the classification itself but in data\r\n      collection \u009199\u0092 is needed for \u0091fields of education not known or\r\n      unspecified\u0092.) \n   \n   \n   \n   \n   \n   \n   \n   \n Glossary \n   \n   \n Course \n A course for this purpose is taken to be a planned series of\r\n    learning experiences in a particular range of subject-matters or skills offered by a\r\n    sponsoring agency and undertaken by one or more students. \n Formal education (or initial education or regular school and\r\n    university education) \n Education provided in the system of schools, colleges, universities and\r\n    other formal educational institutions that normally constitutes a continuous\r\n    \u0091ladder\u0092 of full-time education for children and young people, generally\r\n    beginning at age five to seven and continuing up to 20 or 25 years old. In some countries,\r\n    the upper parts of this \u0091ladder\u0092 are constituted by organized programmes of\r\n    joint part-time employment and part-time participation in the regular school and\r\n    university system: such programmes have come to be known as the \u0091dual system\u0092 or\r\n    equivalent terms in these countries. \n Non-formal education \n Any organized and sustained educational activities that do not\r\n    correspond exactly to the above definition of formal education. Non-formal education may\r\n    therefore take place both within and outside educational institutions, and cater to\r\n    persons of all ages. Depending on country contexts, it may cover educational programmes to\r\n    impart adult literacy, basic education for out-of-school children, life-skills,\r\n    work-skills, and general culture. Non-formal education programmes do not necessarily\r\n    follow the \u0091ladder\u0092 system, and may have differing duration. \n Special needs education \n Educational intervention and support designed to address  special\r\n    education needs . The term \u0091special needs education\u0092 has come into use as a\r\n    replacement for the term \u0091special education\u0092. The older term was mainly\r\n    understood to refer to the education of children with disabilities that takes place in\r\n    special schools or institutions distinct from, and outside of, the institutions of the\r\n    regular school and university system. In many countries today a large proportion of\r\n    disabled children are in fact educated in  \n institutions of the regular system. Moreover, the concept of\r\n    \u0091children with special educational needs\u0092 extends beyond those who may be\r\n    included in handicapped categories to cover those who are failing in school for a wide\r\n    variety of other reasons that are known to be likely to impede a child\u0092s optimal\r\n    progress. Whether or not this more broadly defined group of children are in need of\r\n    additional support depends on the extent to which schools need to adapt their curriculum,\r\n    teaching and organization and/or to provide additional human or material resources so as\r\n    to stimulate efficient and effective learning for these pupils. \n Adult education (or continuing or recurrent education)   \n The entire body of organized educational processes, whatever the\r\n    content, level and method, whether formal or otherwise, whether they prolong or replace\r\n    initial education in schools, colleges and universities as well as in apprenticeship,\r\n    whereby persons regarded as adults by the society to which they belong, improve their\r\n    technical or professional qualifications, further develop their abilities, enrich their\r\n    knowledge with the purpose: \n to complete a level of formal education; \n to acquire knowledge and skills in a new field; \n to refresh or update their knowledge in a particular field."}