{"url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/navigation-mechanisms-mult-loc.html", "content": "Understanding Success Criterion 2.4.5  | Understanding WCAG 2.0\n    \t\t\t\t Understanding WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  SC  2.4.4 [Link Purpose (In Context)] Next:  SC  2.4.6 [Headings and Labels] On this page: Intent Examples Related Resources Techniques & Failures Key terms   -   Multiple Ways : Understanding  SC  2.4.5 \n 2.4.5  Multiple Ways:  More than one way is available to locate a  Web page \n                 within a  set of Web pages \n                except where the Web Page is the result of, or a step in, a  process .\n\t\t\t\t\t(Level AA)\n\t\t\t\tIntent of this Success Criterion\n\t\t\t The intent of this Success Criterion is to make it possible for users to locate content in a manner that best meets their needs. Users may find one technique easier or more comprehensible to use than another. Even small sites should provide users some means of orientation. For a three or four page site, with all pages linked from the home page, it may be sufficient simply to provide links from and to the home page where the links on the home page can also serve as a site map. \n\t\t\t\tSpecific Benefits of Success Criterion 2.4.5:\n\t\t\t Providing an opportunity to navigate sites in more than one manner can help people find information faster. Users with visual impairments may find it easier to navigate to the correct part of the site by using a search, rather than scrolling through a large navigation bar using a screen magnifier or screen reader. A person with cognitive disabilities may prefer a table of contents or site map that provides an overview of the site rather than reading and traversing through several Web pages. Some users may prefer to explore the site in a sequential manner, moving from Web page to Web page in order to best understand the concepts and layout. Individuals with cognitive limitations may find it easier to use search features than to use a hierarchical navigation scheme that be difficult to understand. \n\t\t\t\tExamples of Success Criterion 2.4.5 \n A search mechanism. \n A large food processing company provides a site containing recipes created using its products. The site provides a search mechanism to search for recipes using a particular ingredient. In addition, it provides a list box that lists several categories of foods. A user may type \"soup\" in to the search engine or may select \"soup\" from the list box to go to a page with a list of recipes made from the company's soup products \n Links between Web pages. \n A local hair salon has created a Web site to promote its services. The site contains only five Web pages. There are links on each Web page to sequentially move forward or backward through the Web pages. In addition, each Web page contains a list of links to reach each of the other Web pages. \n Where content is a result of a process or task - Funds transfer confirmation. \n An on-line banking site allows fund transfer between accounts via the Web. There is no other way to locate the confirmation of fund transfer until the account owner completes the transfer. \n Where content is a result of a process or task - Search engine results. \n A search engine provides the search results based on user input. There is no other way to locate the search results except to perform the search process itself. \n\t\t\t\tRelated Resources\n\t\t\t Resources are for information purposes only, no endorsement implied. (none currently documented) \n\t\t\t\tTechniques and Failures for Success Criterion 2.4.5 - Multiple Ways Each numbered item in this section represents a technique or combination of techniques that the  WCAG  Working Group deems sufficient for meeting this Success Criterion. However, it is not necessary to use these particular techniques. For information on using other techniques, see  Understanding Techniques for WCAG Success Criteria , particularly the \"Other Techniques\" section. \n\t\t\t\tSufficient Techniques  \n\t\t\t Using two or more of the following techniques: \n G125: Providing links to navigate to related Web pages \n G64: Providing a Table of Contents \n PDF2: Creating bookmarks in PDF documents  (PDF)\n G63: Providing a site map \n G161: Providing a search function to help users find content \n G126: Providing a list of links to all other Web pages \n G185: Linking to all of the pages on the site from the home page \n\t\t\t\t Additional Techniques (Advisory) for 2.4.5 Although not required for conformance, the following additional techniques should be considered in order to make content more accessible. Not all techniques can be used or would be effective in all situations. \n H59: Using the link element and navigation tools   (HTML)\n        Including information about presentation modes in tables of contents and concept maps (future link)\n\t\t\t\t Common Failures for  SC  2.4.5 The following are common mistakes that are considered failures of Success Criterion 2.4.5 by the  WCAG  Working Group. (No failures currently documented) Key Terms   Web page \n              a non-embedded resource \n                obtained from a single URI using HTTP plus any other resources that are used in the rendering or intended to be rendered together with it by a  user agent \n Note 1:\n\t\t\t\t\t Although any \"other resources\" would be rendered together with the primary resource, they would not necessarily be rendered simultaneously with each other. Note 2:\n\t\t\t\t\t For the purposes of conformance with these guidelines, a resource must be \"non-embedded\" within the scope of conformance to be considered a Web page. Example 1:\n\t\t\t\t\t A Web resource including all embedded images and media. Example 2:\n\t\t\t\t\t A Web mail program built using Asynchronous JavaScript and XML (AJAX). The program lives entirely at http://example.com/mail, but includes an inbox, a contacts area and a calendar. Links or buttons are provided that cause the inbox, contacts, or calendar to display, but do not change the URI of the page as a whole. Example 3:\n\t\t\t\t\t A customizable portal site, where users can choose content to display from a set of different content modules. Example 4:\n\t\t\t\t\t When you enter \"http://shopping.example.com/\" in your browser, you enter a movie-like interactive shopping environment where you visually move around in a store dragging products off of the shelves around you and into a visual shopping cart in front of you. Clicking on a product causes it to be demonstrated with a specification sheet floating alongside. This might be a single-page Web site or just one page within a Web site.   process series of user actions where each action is required in order to complete an activity Example 1:\n\t\t\t\t\t Successful use of a series of Web pages on a shopping site requires users to view alternative products, prices and offers, select products, submit an order, provide shipping information and provide payment information. Example 2:\n\t\t\t\t\t An account registration page requires successful completion of a Turing test before the registration form can be accessed.   set of Web pages collection of  Web pages  that share a common purpose and that are created by the same\n               author, group or organization \n             Note:  Different language versions would be considered different sets of Web pages.  Top Contents Intro Previous:  SC  2.4.4 [Link Purpose (In Context)] Next:  SC  2.4.6 [Headings and Labels] This Web page is part of  Understanding WCAG 2.0: A guide to understanding and implementing WCAG 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}