{"url": "http://www.rtl-longueuil.qc.ca/en-CA/rtl/legal-notice/", "content": "Legal Notice - RTL \n Skip to main content \n Home  |  \n RTL  |  \n Press room  |  \n Careers  |  \n Contact us  |  \n Mobile Site  |  \n A \n A \n A \r\n        |\r\n Français \n Customer Center \n Connexion \n  /  \n Inscription \n Services Schedules and Maps RTL Mobile Express service Shared Taxi Students Zone Chrono List of Holidays Carpooling Multi-Modal Transfer Universal accessibility Helpful Tips Network Map FAQ Fares Fare schedule RTL fares and special offers Access to student rates 65 years old + OPUS  Solo Flex card Membership Offers Transfer  Points of Sale Tax Credit Paratransit Service Services and Territory Application and file updates Online service Trips Fares Helpful tips Safety mesures Contact us Customer Service Information Twitter feeds Road work Comment Complaint Lost and Found Bus Rental Lost item form \n Line number \n 1 Victoria / Churchill \n 2 Tiffin / St-Georges \n 3 Montgomery \n 4 Taschereau / Payer \n 5 mtée St-Hubert / Maisonneuve \n 6 Victoria \n 8 ch. de Chambly / Promenades St-Bruno \n 9 Secteurs L-M / St-Hubert \n 10 Roland-Therrien / Belcourt \n 13 Riverside \n 14 Rome / DIX30 \n 15 Churchill \n 16 Nobert / King-George / Adoncour \n 17 Roland-Therrien / Roberval \n 19 Davis \n 20 Jean-Paul-Vincent / Beauharnois \n 21 Grande Allée \n 23 Ste-Hélène / Jacques-Cartier \n 25 Parcs industriels \n 28 ch. de Chambly / Aéroport \n 29 Collectivité nouvelle \n 30 Secteurs P-V \n 31 Secteurs R-S-T / boul. St-Laurent \n 32 Secteur B / Mountainview \n 33 Secteurs M-N-O \n 34 Secteur A / Bellevue \n 35 Secteur L / DIX30 / TCV \n 37 Simard / du Béarn \n 38 boul. Chevrier / Secteur B \n 39 Panama / Quartier DIX30 \n 41 de Rome / Milan \n 42 Gaétan Boucher / Parc de la Cité \n 43 Milan / de Rome \n 44 Secteurs M-N-O \n 45 Express Panama / TCV \n 46 Secteurs R-S-T \n 47 Secteurs R-S-T \n 49 Secteurs R-S \n 50 Prince-Charles \n 54 Taschereau \n 55 Victoria / Wellington \n 59 Gareau \n 60 Milan / Gaétan-Boucher / Promenades St-Bruno \n 61 Boucherville / Terminus Radisson \n 71 Curé-Poirier \n 73 Joliette / de Lyon \n 74 St-Laurent / Bellerive \n 75 Quinn / Brébeuf \n 76 Roberval / Beliveau / R.-Therrien \n 77 Taschereau / Matte \n 78 Adoncour / du Colisée \n 80 De Montarville / Carrefour de la Rive-Sud \n 81 du Fort-St-Louis / Marie-Victorin \n 82 Marie-Victorin / du Fort-St-Louis \n 83 De Montarville / Samuel-De Champlain \n 84 Samuel-De Champlain / De Montarville \n 85 de Gascogne \n 86 Samuel-De Champlain / De Montarville / Montréal \n 87 Marie-Victorin / du Fort St-Louis / Montréal \n 88 ch. de Chambly / Mountainview \n 90 Express Chevrier / TCV \n 91 Gare St-Bruno \n 92 Yvonne-Duckett / Montarville / Gare St-Bruno \n 98 Promenades St-Bruno / Parc industriel \n 99 Saint-Bruno \n 106 Secteur B / Victoria \n 115 Churchill \n 120 Lalande \n 123 Jacques-Cartier / Parcs industriels \n 125 Pratt & Whitney \n 128 Zone aéroportuaire \n 132 Parc de la Cité / Westley \n 135 Secteur L / DIX30 / TCV \n 142 Gaétan Boucher / Pacific \n 144 des Prairies / Océanie / Naples / Malo \n 150 Orchard \n 170 Ste-Hélène / Jacques-Cartier \n 177 Taschereau / Ste-Foy \n 180 Boucherville - des Sureaux \n 185 Ampère / Gay-Lussac \n 192 Yvonne-Duckett / Montarville \n 199 Seigneurial / Grand Boulevard \n 410 Express Roland-Therrien / Belcourt \n 417 Express Roland-Therrien / Roberval \n 500 École Saint-Lambert International High School \n 501 Écoles privées \n 503 École Centennial \n 504 École Centennial \n 505 École Centennial \n 506 Écoles privées \n 521 École Centennial \n 524 École Centennial \n 525 École Centennial \n 526 École Centennial \n 530 École Centennial \n 532 École Centennial \n 533 École Centennial \n 534 École Centennial \n 535 École Centennial \n 536 École Centennial \n 538 École Heritage Regional High School \n 539 École Heritage Regional High School \n 540 École Heritage Regional High School \n 542 École Heritage Regional High School \n 544 École Centennial \n 546 École Centennial \n 547 École Centennial \n 549 École Centennial \n 550 École Centennial \n 551 École Centennial \n 560 École Saint-Lambert International High School \n 565 École Saint-Lambert International High School \n 570 École Saint-Lambert International High School \n 572 École Saint-Lambert International High School \n 575 École Saint-Lambert International High School \n 580 École Saint-Lambert International High School \n 600 Écoles privées \n 601 École Participative Agora \n 602 École Participative Agora \n 603 École Mgr-A.-M.Parent \n 604 École Participative Agora \n 605 École Participative Agora \n 606 Écoles privées \n 608 École André-Laurendeau et CEGEP Édouard-Montpetit \n 613 Écoles privées \n 614 Écoles privées \n 616 École Gérard-Filion \n 618 Écoles privées \n 620 Collège Français \n 621 École Mgr-A.-M.Parent \n 622 École Jacques-Rousseau et CEGEP Édouard-Montpetit \n 624 École St-Jean-Baptiste \n 626 Collège Français \n 628 École Jacques-Rousseau \n 640 École Antoine-Brossard \n 644 École Antoine-Brossard \n 650 École Antoine-Brossard \n 653 École Antoine-Brossard \n 656 École Antoine-Brossard \n 660 École Antoine-Brossard \n 664 École Antoine-Brossard \n 665 École Antoine-Brossard \n 670 École Antoine-Brossard \n 674 École Antoine-Brossard \n 677 Jacques-Rousseau et CEGEP Édouard-Montpetit \n 681 CEGEP Édouard-Montpetit \n 682 CEGEP Édouard-Montpetit \n 683 CEGEP Édouard-Montpetit \n 684 École Antoine-Brossard \n 690 École Antoine-Brossard \n 691 École Lucille-Teasdale \n 692 École Lucille-Teasdale \n 693 École Lucille-Teasdale \n 694 École Lucille-Tesdale \n 695 École Lucille-Tesdale \n 696 École Lucille-Tesdale \n T18 Taxi - Aéroport \n T19 Taxi - Jacques-Cartier \n T20 Taxi - ch. de Chambly - Pacific \n T21 Taxi - Parc industriel :  J.-A.-Bombardier \n T22 Taxi - Parc industriel :  Leclerc \n T23 Taxi - Vauquelin \n T48 Taxi - Terminus Panama - Marie-Victorin \n T77 Taxi - Matte \n T89 Taxi - Parc industriel : Eiffel \n T90 Taxi - des Ateliers \n T92 Taxi - Parc industriel : Gay-Lussac \n T93 Taxi - de Mortagne - du Boisé - ch. de Touraine \n T94 Taxi - St-Bruno - St-Basile \n T97 Taxi - Gare de St-Basile-le-Grand \n Date \n Schedule \n Map \n Itinerary \n Bus Stop \n Home Page \n RTL 1   Legal Notice \n Mission and values Board of directors Members of the Board Schedule of public meetings Public question period Streaming of public meetings Executive team Equipment Vehicles Bus Shelter Maintenance Activities Infrastructures Terminal Park and Ride Train Station Reserved Bus Lanes Sustainable Development Contracts and Tenders Standards & Regulations Service Standards Rules on board Regulations Properties Fare regulations Advertising on Buses Other carriers  History \n Legal Notice \n Conditions of use \n Acceptance and changes to the conditions of use \n Using the Réseau de transport de Longueuil (RTL) website (hereunder referred to as « site ») means accepting the conditions of use outlined in this document (hereunder referred to as “conditions of use”). These can be modified at any time. It is therefore recommended that you refer to it on a regular basis. \n Personal use \n This site is available to net surfers exclusively for personal but non-commercial use. \n Description of service \n The site offers information to net surfers who need information on the RTL and its services. It also provides a lot of information concerning public transit. \r\nFurthermore, the site offers tools and forms.  The user of this site who browses using or downloading documents, forms or tools accepts the conditions of use described below.  Please read carefully the following, as any user of this site is supposed to have read and accepted the conditions outlined in the present document, agreeing to their validity, and commits to respect and be bound by said conditions.  The RTL can, at any time and without notice, modify these conditions.  The date of the most recent modification of these conditions appears at the bottom of this page.  When the conditions are modified, the user is bound by these changes. \r\nThese conditions constitute the entirety of the rights and obligations binding the RTL and any user of this site, and replace any prior conditions or provisions with respect to the use of this site. No verbal or written statement from an employee or a manager of the RTL or from any other person may lead to the modification of or be a substitution to said conditions. \r\nThe content and the use of this site are governed by the laws in effect in Québec and in Canada.  These conditions as well as any disputes or misunderstandings arising from their application must be construed in accordance with these laws.  Should any part of these conditions be contrary to the law, invalid and unenforceable, this part shall be deemed separable from these conditions and does not compromise its validity or its enforceability, which will therefore be interpreted without reference to the removed part. Any recourse, action, request or suit, based on the content or the use of this site against the RTL or involving the RTL, must be brought before a Québec court of law or a federal court of law, in spite of any potential application of the conflict of law principles. \n Privacy policy \n Please refer to the site’s  Policy on privacy  section. \n Protection of intellectual property rights policy \n The RTL owns the totality of the content of this site, whether written, visual, binary, audible or other.  This content is protected by the Canadian and international copyrights laws (and in particular the Copyright Act, R.S.C. 1985, c. C-42).  The RTL owns copyrights, including on the selection, coordination, arrangement and improvement of its content.  It is illegal to reproduce, modify, download, publish, copy, display, expose, share, index in a database or otherwise distribute all or part of this content, as well as exploiting it, including being involved in its sale or its transfer or in creating artworks from it.  The RTL allows, however, any user of this site to make copy of its content, forbidding however the use of official trademarks or any other marks, without the specific authorization or fees, provided that: \n the copy results from a single downloading from a single computer; \n the copy is strictly for personal use and not for commercial or for profit purposes; \n the RTL be clearly identified as the source of the copied documents; \n the reproduction is not represented as an official version of the copied document, nor as a copy made in collaboration with the RTL, under its supervision or with its consent; \n after such reproduction, the content of the copied document is not modified with a view or for the purpose of undermining RTL’s moral rights. \n The RTL grants no licence other than the one mentioned below and moreover reserves all its intellectual property rights on the content of this site. \r\nThe user of this site agrees that the RTL uses and exploits freely any ideas, concepts, know-how or techniques it received by electronic means, regardless of the end and assigns to the RTL its possible rights to this effect, without the RTL having to pay whatever royalties or fees, provided the RTL commits to protect the user’s personal information. \n Official mark and trademarks \n The expression « RTL » and the RTL’s logotype are official marks of a public authority as defined in subparagraph 9(1)(n)(iii) of the Trade-marks Act (L.R.C., 1985, c. T-13) and are duly registered as such. \n Certain graphics, logotypes, icons, drawings, expressions, words or slogans found on this site constitute or may constitute official marks, trademarks, service marks, brand names or certification marks by virtue of the Canadian laws or of any other countries.  These marks may be filed and registered as such. The fact that such marks may appear on this site does not mean the granting or the assignment of any such licence. \n The RTL reserves all rights to all official, commercial, service, brand or certifications marks it holds or uses.  It is illegal to download, copy, display, share or otherwise distribute such a mark.  The RTL will exercise all necessary judicial recourses against any person using a mark held and used by the RTL. \n Links to other websites \n This site has links to other websites.  Since the RTL cannot control these sites, it cannot guarantee the accuracy and completeness of their content, advertisements, products, services and other available material on or via these sites.  Furthermore, the RTL makes no declaration nor makes any endorsement and cannot be held responsible for any damage or loss, confirmed or alleged, or from the use of or for having trusted the content, goods or available services on these websites.  Some of these websites can place permanent or temporary cookies on users’ computers hard drives.  Finally, it should be noted that the information found on websites operated by third parties may not be available in French and/or in English. \n Integrity and accuracy of the information \n The RTL strives to ensure that the information available on its website is complete, accurate and updated. This information is derived from sources the RTL deems reliable and it is regularly updated.  It can however contain inaccuracies, omissions, typographical errors or other mistakes. \n Consequently, this site and the integrity of its content are available to the public “as is”, without any guarantee whatsoever, explicit or implicit, including, amongst others, the implied warranties of merchantability, the non-infringement or suitability to particular needs or uses. \n When you use this site, including the tools, forms and the available information, you agree to do so at your own risks.  The RTL makes no declaration and offers no guarantee whatsoever regarding this site, including the tools, the forms and the information found therein. \n Without limiting the generality of the foregoing, the RTL offers no guarantee regarding the availability and stability of the site’s content, whether it be the possibility to access it, or with respect to its precision, its reliability or the accuracy of the available information, mainly information pertaining to schedules, to RTL’s partners, to legislation or to regulations, to the availability of transit services described therein or to public tenders.  The user should note that the site is regularly subject to technical maintenance operations which can limit or prevent its access.  The RTL can, at its discretion, suspend, cease or limit the use of any portion of this site, at all times, without notice or liability \r\nThe RTL cannot be held liable for any damages whatsoever, direct or indirect, suffered due to the use of this site, including specific damages, punitive, exemplary, incidental, moral or consequential damages, loss of profit, loss of earnings or loss of information, operating losses damages, loss or deleted programs or data from an information system, and all other expenses or damages resulting from the use or the non-availability of the site, its algorithms, the incompatibility of any downloaded or copied software from this site, from interruptions, defect, delay in processing or in transmission time, or because of a computer virus, worm or Trojan horse, or any other harmful components, or a power or system failure, regardless of whether the RTL is informed or not of the possibility of damages, losses or expenses. \n Any user of this site does it at its own risks and agrees to indemnify and hold the RTL as well as its managers, administrators, employees, suppliers, contractors or agents harmless of any liability, whether civil, criminal or quasi-criminal in connection with the use of the site, regardless of their negligence. \r\n  \r\nUnless otherwise indicated, all sums of money shown in this site are in the legal currency of Canada. \n Illegal modifications and content \n The RTL does not authorize users of this site to modify, rewrite, adapt, change, adjust, rearrange, show, define or decrypt its content, except for the customized information features specifically made available to users by the RTL. \r\nFurthermore, it is strictly forbidden to post on or to transfer through this site illegal material, threats as well as defamatory, obscene, fraudulent, scandalous, seditious, pornographic or blasphemous texts, sounds or images, or any other material considered to be a criminal or a penal offence or promoting or encouraging the commission of such offences, or even leading to civil liability or violating in any other way current laws. \n Management of the site and technical difficulties \n This site has been entirely designed and is managed by the RTL. We ask users to report to the Webmaster any technical difficulties or errors encountered while browsing this site by filling the  electronic form  found in this section. \r\nThe present conditions of use were updated on July 1st, 2013. \r\n  \n  Services \n  Schedules and Maps \n  RTL Mobile \n  Express service \n  Shared Taxi \n  Students Zone \n  Universal accessibility \n  Network Map \n  FAQ \n  Fares \n  Fare schedule \n  Access to student rates \n  OPUS  Solo Flex card \n  Membership Offers \n  Transfer  \n  Points of Sale \n  Customer Service \n  Information \n  Road work \n  Comment \n  Complaint \n  Lost and Found \n  Bus Rental \n  RTL \n  Board of directors \n  Equipment \n  Sustainable Development \n  Standards & Regulations \n  Advertising on Buses \n  Press room \n  Press Releases \n  Public Notice \n  Documents and practical information \n  Public consultations \n  Media resources \n RTL © 2017 \n About Website  |  \n Legal Notice  |  \n Web Accessibility  |  \n Confidentiality  |  \n Site map  |  \n GTFS  |  \n Français"}