{"url": "https://en.wikipedia.org/wiki/Low-cost_airlines", "content": "Low-cost carrier - Wikipedia \n Low-cost carrier   \n From Wikipedia, the free encyclopedia     (Redirected from  Low-cost airlines ) \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article has multiple issues.  Please help  improve it  or discuss these issues on the  talk page .  ( Learn how and when to remove these template messages ) \n This article  possibly contains  original research .  Please  improve it  by  verifying  the claims made and adding  inline citations . Statements consisting only of original research should be removed.   (July 2010)   ( Learn how and when to remove this template message ) \n This article includes a  list of references , but  its sources remain unclear  because it has  insufficient  inline citations .  Please help to  improve  this article by  introducing  more precise citations.   (December 2012)   ( Learn how and when to remove this template message ) \n ( Learn how and when to remove this template message ) \n A  low-cost carrier  or  low-cost airline  (also known as  no-frills ,  discount  or  budget  carrier or airline, or  LCC ) is an  airline  without most of the traditional services provided in the fare, resulting in lower fares and fewer comforts. To make up for revenue lost in decreased ticket prices, the airline may charge for extras such as food, priority boarding, seat allocating, and baggage. As of July 2014, the world's largest low-cost carrier is  Southwest Airlines , which operates in the United States and some surrounding areas. \n Airbus A319  of  Germanwings  and an  Airbus A320  of  Air Berlin  at  Zurich Airport . Both carriers were among the largest budget airlines in Germany at the time the picture was taken. \n The term originated within the airline industry referring to airlines with a lower operating cost structure than their competitors. While the term is often applied to any carrier with low ticket prices and limited services, regardless of their operating models, low-cost carriers should not be confused with regional airlines that operate short flights without service, or with full-service airlines offering some reduced fares. \n Some airlines actively  advertise  themselves as  low-cost ,  budget , or  discount airlines  while maintaining  products  usually associated with traditional  mainline carrier's  services—which can increase operational complexity. These products include preferred or  assigned seating , catering other items rather than basic  beverages , differentiated  premium cabins , satellite or ground-based  Wi-Fi   internet , and  in-flight audio and video entertainment . More recently, the term \"ultra low-cost carrier\" differentiates some low-cost carriers, particularly in North America where traditional airlines increasingly offer a similar service model to low-cost carriers. \n Contents \n 1   Business model \n 1.1   Common practices \n 1.1.1   Aircraft \n 1.1.2   Bases \n 1.1.3   Simplicity \n 1.1.4   Non-flight revenue \n 1.1.5   Limit personnel costs \n 1.1.6   Principles of operation \n 1.1.7   Innovative practices \n 1.2   Differentiation \n 1.3   Ultra Low-Cost Carrier \n 1.4   Pricing policy \n 2   Criticism \n 3   History \n 3.1   No-frills long-haul flights \n 3.2   No-frills shortest-haul flight \n 3.3   Low-cost business-only carriers \n 4   See also \n 5   Notes \n 6   References \n 7   External links \n Business model [ edit ] \n Wizz Air   Airbus A320  at  Katowice International Airport \n SunExpress   Boeing 737-800  at  Zurich Airport \n Low-cost carrier  business model  practices vary widely. Some practices are more common in certain regions, while others are generally universal. The common theme among all low-cost carriers is the reduction of cost and reduced overall fares compared to legacy carriers. \n Traditional airlines have also reduced their cost using several of these practices. \n Common practices [ edit ] \n Aircraft [ edit ] \n Most low-cost carriers operate aircraft configured with a single passenger class, and most operate just a single aircraft type, so cabin and ground crew will only have to be trained to work on only one type of aircraft. These airlines tend to operate short-haul flights that suit the range of  narrow-body  (single aisle) planes. Long-range  wide-body aircraft  are typically too expensive for low cost carriers. However,  Monarch Airlines  operated two  Airbus A330  wide-body aircraft before 2015. [ citation needed ] \n In the past, low-cost carriers tended to operate older aircraft purchased second-hand, such as the  McDonnell Douglas DC-9  and older models of the  Boeing 737 . Since 2000, fleets generally consist of the newest aircraft, commonly the  Airbus A320 family  and  Boeing 737 . Although buying new aircraft is usually more expensive than second-hand, new planes are cheaper to operate in the long run since they are extremely efficient in terms of fuel, training, maintenance, and crew costs per passenger. [ citation needed ] \n In 2013,  ch-aviation  published a study about the fleet strategy of low-cost carriers. They summarized that major LCCs that order aircraft in large numbers get huge discounts, and due to this they sell their aircraft just a few years after delivery at a very high price. That saves a lot in operative costs. [1] \n Aircraft often operate with a minimum set of optional equipment, further reducing costs of acquisition and maintenance, as well as keeping the weight of the aircraft lower and thus saving fuel.  Ryanair  seats do not recline and do not have rear pockets, to reduce cleaning and maintenance costs. Others have no window shades. Pilot conveniences, such as  ACARS , may be excluded. Often, no  in-flight entertainment  systems are made available, though many US low-cost carriers do offer satellite television or radio in-flight. It is also becoming a popular approach to install LCD monitors onto the aircraft and broadcast advertisements on them, coupled with the traditional route–altitude–speed information. Most do not offer reserved seating, hoping to encourage passengers to board early and quickly, thus decreasing turnaround times. Some allow priority boarding for an extra fee instead of reserved seating, and some allow reserving a seat in an emergency exit row (for longer leg room) at an extra cost. \n Bases [ edit ] \n Norwegian Air Shuttle   Boeing 737-800  at  Trondheim Airport \n Like the major carriers, many low-cost carriers develop one or more bases to maximize destination coverage and defend their market. [2]  Many do not operate traditional  hubs , but rather  focus cities . \n Simplicity [ edit ] \nPassengers boarding a  Spring Airlines  aircraft via passenger boarding stairs at  Shanghai Pudong International Airport \n Airlines often offer a simpler fare scheme, such as charging one-way tickets half that of round-trips. Typically fares increase as the plane fills up, which rewards early reservations. In Europe (and early in Southwest's history) luggage is not transferred from one flight to another, even if both flights are with the same airline. This saves costs and is thought to encourage passengers to take direct flights. Tickets are not sold with transfers, so the airline can avoid responsibility for passengers' connections in the event of a delay. Low-cost carriers often have a sparse schedule with one flight per day and route, so it would be hard to find an alternative for a missed connection. Modern US-based low-cost carriers generally transfer baggage for continuing flights, as well as transferring baggage to other airlines. Many airlines opt to have passengers board via stairs, since  jetways  generally cost more to lease. \n Often, the low-cost carriers fly to smaller, less congested secondary airports and/or fly to airports in off-peak hours to avoid air traffic delays and take advantage of lower  landing fees . This is why Ryanair flies to  Gatwick Airport ,  Luton Airport , and  Stansted Airport  in the London area and how easyJet is able to fly to  Paris-Charles de Gaulle , and  Amsterdam . In London's case however, low-cost carriers wouldn't be able to use Heathrow anyway as the airport is running at near capacity, so there is no room to build a base. The airlines tend to offload, service and re-load the aircraft (turnaround) in shorter time periods and don't wait for late passengers, allowing maximum utilization of aircraft. \n Non-flight revenue [ edit ] \n Low-cost carriers generate  ancillary revenue  from a variety of activities, such as à la carte features and commission-based products. Some airlines may charge a fee for a pillow or blanket or for carry-on baggage. [3]  In Europe, it is common for each and every convenience and service to have an additional charge. AirAsia, for example, generates revenue by courier services and hotels as well as flights. \n Allegiant Air  is a large United States low-cost airline. \n Limit personnel costs [ edit ] \n Ryanair  and  easyJet  airplanes at  John Lennon Airport ,  Liverpool , two competing low-cost carriers in the European market \n Airbus A320-200  of  AirAsia  and an  Boeing 737-900ER  of  Lion Air  at  Ngurah Rai Airport . Both carriers are among the largest budget airlines in Southeast Asia. \n Low-cost carriers intend to be low-cost, so in many cases employees work multiple roles. At some airlines flight attendants also work as gate agents or assume other roles (limiting personnel costs).  Southwest Airlines  is well known for using fuel  hedging  programs to reduce its overall fuel costs. Check-in at the gate of luggage requires fees, as it requires addition to the weight calculation and last-minute baggage handling. \n Online check-in is becoming common, again in the interest of avoiding personnel costs. \n Where permissible, some airlines have a disinclination to handle Special Service passengers, for instance by placing a higher age limit on  unaccompanied minors [4]  than full-service carriers. Often these airlines don't offer connecting tickets, since the airline will have to pay for ground crew to transfer luggage. A customer may create a connection manually by purchasing two separate tickets, but these are considered separate contracts, and the passenger bears the risk if a delayed inbound flight causes a missed connection. [5] \n When most countries had national monopolies, crews could negotiate pay raises and good pension benefits (something that costs money for the airlines only in the long term). Most passengers were business travelers who paid high fares that covered these costs. After deregulation led to lower fares, many airlines remained bound to these salary agreements and pensions, whereas new low-cost carriers employed new staff with lower salaries, especially for cabin crew, keeping personnel costs low and allowing for competitive fares. In some cases airlines have gone bankrupt (e.g.,  Alitalia ,  Sabena , and  Swissair ), and new airlines replaced them. \n Traditional carriers followed the low-cost carriers by enabling web check-in and encouraging machine check-in at the airport, and generally reducing ground personnel cost. Many airlines are limited to whatever their hub airports decides. Ryanair is special by more or less having its own airports, when it can demand large cost reductions and good deals with the airport owners. \n The number of  crew members  follow international conventions that require one flight attendant per 50 passenger seats and two pilots. No carrier can save money by reducing flight crew, but they can reduce ground crew. \n Carriers like Ryanair hire pilots through third-party agencies, without benefits for sick pay, pensions or health insurance. [6] \n Principles of operation [ edit ] \n Gol Transportes Aéreos   Boeing 737-800  at  Afonso Pena International Airport \n At  IATA , a LCC operation is defined as including the following characteristics, at least to some degree, [7] \n Primarily point-to-point operations \n Short-haul routes, often between regional or secondary airports \n Strong focus on price-sensitive traffic, mostly leisure passengers \n Typically a single service class, with no (or limited) customer loyalty programmes \n Limited passenger services, with additional charges for some services (e.g., on-board catering) \n Low average fares, with a strong focus on price competition \n Different fares offered, related to aircraft load factors and length of time before departure \n A very high proportion of bookings made through the Internet \n High aircraft utilisation rates, with short turnaround between operations \n A fleet of just one or two aircraft types \n Private-sector companies \n A simple management and overhead structure with a lean strategic decision-making process \n While low-cost airlines differ in service offerings, by definition they feature most of the following: \n Standardized fleet (lower training, maintenance costs; purchasing aircraft in bulk) \n Absent non-essential features (reclining seats,  frequent flyer  schemes) \n Use of secondary airports for lower  landing fees  and marketing support \n Avoidance of airports with high costs \n Rapid turnaround (less time on the ground, more flights per day) \n Online ticket sales to avoid the cost of  call centres  or agents \n Online check-in (fewer check-in desks), charge for desk check-in \n Baggage charges for checked bags to offset baggage handling and loading costs \n Passenger loading via stairs rather than  jetways  ( Stansted , the main Ryanair hub, has jetways, and they are needed for large airports) \n Use staff for multiple jobs (cabin crew also check tickets at the gate, clean aircraft) \n Hedge fuel costs (buying fuel in advance when cheaper) \n Charge for all services (including on-board services, reserved seating, and extra baggage) \n Do not use reserved seating (which slows down boarding), or charge extra for reserved seating or early boarding. \n Fly point-to-point (passenger transfers to other flights are not accommodated, no compensation for missed connections) \n Carry little extra fuel (reducing aircraft weight ) \n Outfit plane with cost-cutting modifications, such as  winglets [8] [9] [10] \n Route planning  before aircraft arrives at airport (saving time on the ground) \n Market destination services such as hotels and rental cars for commissions \n Innovative practices [ edit ] \n Nok Air   Boeing 737-800  taking off at  Phuket International Airport \n Some airlines resort to very innovative practices. Many airlines these days work with aircraft manufacturers, but airlines such as AirAsia goes a step further, working with airports to develop specially designed  low-cost terminals  that require far less overhead. Lower costs are passed on to the airline, and in turn to the customer. Other practices that reduce expenses are the use of  UAVs  for aircraft checkups, tablet PCs instead of logs on paper (reduces airplane weight), and smartglasses for the pilot. [11] \n Differentiation [ edit ] \n Ryanair  and  WizzAir  airplanes at  Glasgow Prestwick Airport , two competing low-cost carriers in the European market \n Not every low-cost carrier implements all of the above points. For example, some try to differentiate themselves with allocated seating, while others operate more than one aircraft type, still others have relatively high operating costs but lower fares.  JetBlue  for instance has in-flight entertainment in every passenger seat. Other airlines are limited on what points they can implement based on local laws. For example,  Ryanair  cannot remove window blinds from its aircraft, as they are required by the Irish Aviation Authority. As supply increases, this sort of differentiation by brand is an important criteria for the future success of low-cost carriers, since many experts believe price competition alone is not enough, given the number of carriers. [12] \n As the number of low-cost carriers has grown, these airlines have begun to compete with one another in addition to the traditional carriers. In the US, airlines have responded by introducing variations to the model.  JetBlue Airways  advertises satellite television. Advertiser-supported  Skybus Airlines  launched from Columbus in 2007, but ceased operations in April 2008. In Europe, the emphasis has remained on reducing costs and no-frills service. In 2004, Ryanair announced proposals to eliminate reclining seats, window blinds, seat headrest covers, and seat pockets from its aircraft. [13] \n India's  Air India Express  offers a complimentary meal with beverages on most of its flights. [14] \n Ultra Low-Cost Carrier [ edit ] \n A secondary term \"ultra low-cost carrier\" (ULCC) has been used to differentiate some low-cost airlines whose model deviates further from that of a standard low-cost carrier, with ultra low-cost carriers having minimal inclusions in the fare and a greater number of add-on fees. [15]   Spirit Airlines  and  Allegiant Air  have been most commonly referred to as Ultra Low-Cost, [16]  with  Frontier Airlines  in 2015 announcing a new strategy to reposition themselves as ultra low-cost. [17]   Canada Jetlines  specifically refers to itself as seeking to apply \"Ultra-Low Cost Carrier operating principles\". [18] \n Pricing policy [ edit ] \n Further information:  Yield_management § Airlines \n The pricing policy of the low-cost carriers is usually very dynamic, with discounts and tickets in promotion. Like other carriers, even if the advertised price may be very low, it often does not include charges and taxes. With some airlines, some flights are advertised as free (plus applicable taxes, fees and charges). Depending on the airline, perhaps as many (or as few) as ten percent of the seats on any flight are offered at the lowest price, and are the first to sell. The prices steadily rise thereafter to a point where they can be comparable or more expensive than a flight on a full-service carrier. \n Most airlines charge additional taxes and fees on their tickets. Some low-cost airlines have been known to charge fees for the seemingly ridiculous, such as levying a credit card charge where credit card is the only payment method accepted. Many consumers and governments consider this fraudulent, but some still allow this and similar practices. \n Traditional perceptions of the \"low-cost carrier\" as a stripped-down, no-frills airline have been changing as new entrants to the market offer passengers more options, as well as premium amenities.  JetBlue  offers all passengers generous legroom, complementary snacks, and live in-flight television. JetBlue also offers a first class cabin with lie-flat seats on some flights.  Southwest  allows passengers to check two bags for free. Other amenities found on low-cost airlines include premium cabins, in-flight  Wifi , and rewards programs. \n Criticism [ edit ] \n Some elements of the low-cost model have been subject to criticism by governments and regulators, and in the UK in particular the issue of \"unbundling\" of ancillary charges by both low-cost carriers and other airlines (showing airport fees, taxes as separate charges rather than as part of the advertised fare) to make the \"headline fare\" appear lower has resulted in enforcement action. [19]  Believing that this amounts to a misleading approach to pricing, the United Kingdom's  Office of Fair Trading  (OFT) in February 2007 gave all carriers and travel companies three months to include all fixed non-optional costs in their basic advertised prices. Although the full-service carriers had complied within the specified timescales, the low-cost carriers have been less successful in this respect, leading to the prospect of legal action by the OFT. [20] \n Some destination cities lie relatively far from the airports that low cost airlines use to save costs. Examples of this are  Hahn ,  Weeze  and  Girona  airports—which low cost airlines advertise as the destinations for  Frankfurt ,  Düsseldorf , and  Barcelona , respectively—even though these airports are 50 to 90 kilometers away. This has drawn criticism, mostly from competing airlines that fly closer to the destinations. [21] \n IAG  CEO  Willie Walsh  found established airlines arrogant facing the LCC model:  Aer Lingus  turned down the opportunity to buy  Ryanair  for 29 million  Irish pounds  (€36.8 million), and would not have developed it but would have shut it down. [22] \n History [ edit ] \n While tour and package operators have offered lower-priced, lower-frilled traveling for a large part of modern airline history, not until during the post– Vietnam War  era did this business model escalate. Through various ticket consolidators,  charter airlines , and innovators in lower-frills flying, such as  Channel Airways  and  Court Line , the traveling public had been conditioned to want to travel to new and increasingly further away and exotic locations on vacation, rather than short-haul trips to nearby beach resorts. [ citation needed ] \n The world’s first low-cost airline was  Pacific Southwest Airlines , which started intrastate flights connecting Southern and Northern California on 6 May 1949. PSA's light-hearted atmosphere and efficient operations were a runaway success early on, and inspired a number of low-cost start-ups across the United States, beginning in the mid-60s. Herb Kelleher studied the success of PSA, and copied their culture closely when he established Southwest Airlines. \n The first airline to offer cheaper transatlantic fares was Icelandic airline  Loftleiðir  in 1964, often referred to as \"the Hippie Airline\". Many young Americans travelled to Europe after graduation, to experience the \"old-world culture\", and they were more concerned with getting there cheaply than comfortably or even exactly on time. Loftleiðir were not famous for speed or punctuality, but flying with the company became a sort of rite of passage for those young \"hippies\", one of whom was  Bill Clinton , later US President. [23] \nAdvert for Loftleiðir Icelandic Airlines on Fifth Avenue, New York in 1973 \n The first airline offering no-frills transatlantic service was  Freddie Laker 's  Laker Airways , which operated its famous \"Skytrain\" service between London and New York City during the late 1970s. The service was suspended after Laker's competitors,  British Airways  and  Pan Am , were able to price Skytrain out of the market. [ citation needed ] \n In the United States, airline carriers such as  Midway Airlines  and  America West Airlines , which commenced operations after 1978, soon realized a  cost of available seat mile  (CASM) advantage in relation to the traditional and established,  legacy airlines  such as  Trans World Airlines  and  American Airlines . Often this CASM advantage has been attributed solely to the lower labor costs of the newly hired and lower pay grade workers of new start-up carriers, such as  ValuJet ,  Midway Airlines , and their like. However, these lower costs can also be attributed to the less complex aircraft fleets and route networks with which these new carriers began operations, in addition to their reduced labor costs. \n To combat the new round of low-cost and start-up entrants into the very competitive and deregulated United States airline industry, the  mainline   major carriers  and  network legacy carriers  strategically developed no-frills divisions within the main airlines brand and corporate structures. Among these were  Continental Lite ,  Delta Express ,  MetroJet ,  Shuttle by United ,  Song , and  Ted . However, most of these \"airlines within an airline\" were short-lived and quickly disposed off when economic rationalization or competitive pressures subsided. [ citation needed ] \n Taking a page from the mainline, major, or legacy carriers desire to reduce costs in all ways possible in regards regional route networks by outsourcing regional operations to the lowest expense airline bidder capable of operating regional aircraft; a new generation of low cost airlines (in name only) soon evolved in the US with varying levels of success. Among these variety of low cost and discount operators were noteworthy starts-ups that managed to get off the ground by using the larger aircraft services of established charter airlines. Among this group were the  virtual airlines ;  Direct Air ,  PeoplExpress ,  Western , and those that never began service such as  JetAmerica . Though harkened as something new, this business model of hiring other mainline airlines and marketing it as a whole other airline business was actually pioneered by the ubiquitous  Pan Am  with its  Pan Am Express  operations operated by  Air Atlanta  and  Emerald Air  among others during the early years following Airline Deregulation, as established airlines fought to survive. \n In Japan, low-cost airlines made a major inroads to the market in 2012 when  Peach ,  Jetstar Japan  and  AirAsia Japan  began operations, each with financial sponsorship by a domestic legacy airline and one or more foreign investors. By mid-2013, these new LCCs were operating at a unit cost of around 8 yen per seat-kilometer, compared to 10–11 yen per seat-kilometer for domestic legacy airlines. However, their unit cost was still much higher than the 3 yen per seat-kilometer for  AirAsia  in  Malaysia , due to the higher cost of landing fees and personnel in Japan. [24] \n By 2017, low-cost carriers had achieved market share of 57.2% in the South Asia and 52.6% in Southeast Asia. Market share remained somewhat lower in Europe at 37.9% and North America at 32.7%. [25] \n No-frills long-haul flights [ edit ] \n It has been suggested that the  Airbus A380 , able to hold up to 853 passengers in an all-economy layout, [26]  would enable true low-cost long-haul service. While the per-seat costs of such an aircraft would be lower than the competition, there are fewer cost savings possible in a long-haul operation, and therefore a long-haul low-cost operator would find it harder to differentiate itself from a conventional airline. In particular, low-cost carriers typically fly their aircraft for more hours and flights each day, scheduling the first departure early in the morning and the last arrival late at night. However, long-haul aircraft scheduling is more determined by timezone constraints (e.g., leaving the US East Coast in the evening and arriving in Europe the following morning), and the longer flight times mean there is less scope to increase aircraft utilization by adding one or two more short flights each day. The business model comes with considerable fiscal risk, as seen in the many companies that have become bankrupt, such as  Laker Airways  and more recent airlines. \n In 2004 the Irish company  Aer Lingus  lowered its prices to compete with companies such as  Ryanair  on shorthaul, however it maintains a full service on  transatlantic flights . [27]  Late in 2004 the Canadian airline  Zoom Airlines  also started selling transatlantic flights between the  UK  and Canada for £89; and  Oasis Hong Kong Airlines  – for £199 from  London  to  Hong Kong . In August 2006, Zoom announced that it was to establish a  UK  subsidiary, to offer low-cost long-haul flights to the United States and India, but the company suspended all its operations from 28 August 2008 due to financial problems related to high fuel prices. \n Australia's  Jetstar Airways  has operated international flights since 2005, when it began services to  Christchurch , New Zealand. In late 2006, more international services began. Departing from  Sydney ,  Melbourne  and  Brisbane , it flies to popular tourist destinations within 10 hours of Australia such as  Honolulu , Japan,  Vietnam ,  Thailand  and  Malaysia . With the delivery of new aircraft, it hopes to fly to the continental  US  and  Europe . \n In April 2006, the industry magazine  Airline Business  analysed the potential for low-cost long-haul service [28]  and concluded that a number of Asian carriers, including  AirAsia , were closest to making such a model work. On 2 November 2007,  AirAsia X , a subsidiary of  AirAsia  and  Virgin Group  flew its inaugural flight from  Kuala Lumpur ,  Malaysia , to  Gold Coast , Australia.  AirAsia X  claims that it is the first true low-cost long-haul carrier since the end of  Skytrain . [29] \n On 26 October 2006,  Oasis Hong Kong Airlines  started flying from  Hong Kong  to  London-Gatwick . The lowest prices for flights between  Hong Kong  to  London  could be as low at £75 (approximately US$150) per leg (not including taxes and other charges) for economy class and £470 (approximately US$940) per leg for business class for the same route. From 28 June 2007, a second long-haul route to Vancouver,  British Columbia  was started. The company ceased operations on 9 April 2008, after over a billion  Hong Kong dollars  in losses. \n In late 2007,  Cebu Pacific , the  Philippines ' largest low-cost carrier, announced intentions to launch non-stop Pacific flights from the  Philippines  to the United States West Coast and other US cities by around mid-2009. [30]  The airline also intends to launch low-cost service to Middle East, where around a million Filipinos are based, and in Europe. As of October 2017, it operates flights to Dubai daily and Guam three times a week [31] . \n On 11 March 2009,  AirAsia X  started its first low-cost long-haul service into  Europe  – to  London Stansted ,  England . The daily flights to  Stansted  are operated by two leased  Airbus A340-300  aircraft. A one-way economy-class ticket often costs £150, and the premium-class one-way often costs £350. On 12 January 2012, AirAsia announced that it would be suspending services to  London  on 1 April 2012. \n The third largest European low-cost airline,  Norwegian Air Shuttle , started long-haul low-cost operations in May 2013. Norwegian initially operated flights to Bangkok and New York from Scandinavia using leased Airbus A340 aircraft, switching to new  Boeing 787s  in the second half of 2013 after Boeing resolved problems with the aircraft and resumed deliveries following extensive delays. [32]  It currently has direct routes from the United States ( Los Angeles ,  Fort Lauderdale ,  New York City ,  Oakland-San Francisco ,  Boston  and  Orlando ) into  Scandinavia  ( Oslo ,  Stockholm ,  Copenhagen ). \n In March 2017,  International Airlines Group  established  Level , a long-haul low-cost  virtual airline  based in  Barcelona Airport  and serving destinations in North and South America. [33] \n Long-Haul low-cost carriers are emerging on the  transatlantic flights  market with 545,000 seats offered over 60 city pairs in September 2017 (a 66% growth over one year), compared to 652,000 seats over 96 pairs for  Leisure airlines  and 8,798,000 seats over 357 pairs for  mainline carriers . [34] \n No-frills shortest-haul flight [ edit ] \n On 9 September 2011,  EasySky  started operations in Honduras, using the low-cost model, serving the mainland City of  La Ceiba  and the island of  Roatán  in the Western Caribbean using a  Boeing 737-200 . Flight time is 8 minutes over a distance of 40  nautical miles . [ citation needed ] \n Low-cost business-only carriers [ edit ] \n A trend from the mid-2000s was the formation of new low-cost carriers exclusively targeting the long-haul business market. Aircraft are generally configured for a single class of service, initially on transatlantic routings. \n Similarly, Midwest Express (later  Midwest Airlines ) which operated from 1984 until it was absorbed into  Frontier Airlines  in 2010 and  Legend Airlines  which ceased operations in late 2000 were also founded on this operating model. \n Probably best described as \"fewer frills\" rather than \"no frills\", the initial entrants in this market utilized second-hand, mid-sized, twin jets, such as  Boeing 757  and  Boeing 767 , in an attempt to service the lucrative London-US Eastern Seaboard market: \n Eos Airlines , which ceased operating on 27 April 2008 [35] \n MAXjet , which has ceased its scheduled business flights, but is planning to restart as a luxury charter carrier [36] \n Silverjet , which ceased [37]  operations on 30 May 2008. \n La Compagnie \n See also [ edit ] \n Low cost carrier terminal \n List of low-cost airlines \n Notes [ edit ] \n ^   ch-aviation: Low-cost carriers eliminate rivals with unique fleet strategy , July 20, 2013 \n ^   Bamber, G.J., Gittell, J.H., Kochan, T.A. & von Nordenflytch, A. (2009).  \"Chapter 5: Up in the Air: How Airlines Can Improve Performance by Engaging their Employees\" . Cornell University Press, Ithaca.   CS1 maint: Multiple names: authors list ( link ) \n ^   \"8 things to consider before booking a low-cost flight\" .  Oony UK . Retrieved  24 May  2016 .   \n ^   \"Definition of unaccompanied minors\" . Uk-air.net. 2012-01-27 . Retrieved  2012-04-09 .   \n ^   See e.g. connecting flight policy of  easyJet  and  Wizz Air \n ^   Humphries, Conor; Bryan, Victoria (22 Sep 2017).  \"Ryanair crisis exposes low-cost scramble for senior pilots\" . Reuters . Retrieved  22 September  2017 .   \n ^   Chapter 3, Airline Cost Performance \n ^   \"American low cost carrier ordering winglets\" . Flightglobal.com. 2012-09-19 . Retrieved  2013-09-06 .   \n ^   \"Chinese low cost carrier ordering winglets\" . Prnewswire.com . Retrieved  2013-09-06 .   \n ^   \"Reasons for installing winglets\" . Worldwide-aviation.net . Retrieved  2013-09-06 .   \n ^   \"easyJet to use drones for aircraft checks\" . Retrieved  24 May  2016 .   \n ^   Strauss, Michael (2010)  Value Creation in Travel Distribution \n ^   \"Ryanair cuts reclining seats; suitcases next to go - BusinessNews\" . www.smh.com.au. 17 February 2004 . Retrieved  2009-03-10 .   \n ^   [1]   Archived  September 24, 2011, at the  Wayback Machine . \n ^   \"Ultra-low-cost Carriers Set Their Sights On Expansion\" .  AviationPros.com . Retrieved  24 May  2016 .   \n ^   \"New Ultra-Low Cost Airline Begins Service in February - Press Room\" . Retrieved  24 May  2016 .   \n ^   \"Frontier unveils ultra-low-cost fare strategy, carry-on pricing\" .  The Denver Post . Retrieved  24 May  2016 .   \n ^   \"Jetlines\" . Retrieved  24 May  2016 .   \n ^   \"A Brief History of the Low-Cost Airline\" .  Scott's Cheap Flights . Retrieved  July 27,  2017 .   \n ^   \"UK | Action threatened over air fares\" . BBC News. 2007-06-16 . Retrieved  2009-03-10 .   \n ^   Barrett, S. (2004). \"The sustainability of the Ryanair model\".  Journal of Transport Management  (2): 89–98.   \n ^   Victoria Moores (Nov 10, 2017).  \"Can the air transport industry be 'Uber-ized'?\" .  Aviation Week Network .   \n ^   \"Our History\" .  Loftleidir Icelandic . Retrieved  March 22,  2015 .   \n ^   \"明暗分けた「日本流サービス」　ピーチ、満足度「大手並み」\" .  日本経済新聞 . 24 July 2013 . Retrieved  24 July  2013 .   \n ^   Wall Street Journal article dated August 23, 2017; \"How Budget Carriers Transformed the Airline Industry-in 14 Charts;\"  https://www.wsj.com/articles/how-budget-carriers-transformed-the-airline-industryin-14-charts-1503501624 \n ^   \"Low-cost set for the long-haul\" . Flightglobal.com. 2005-04-01 . Retrieved  2012-04-09 .   \n ^   Aer Lingus: Travel Information - Long-haul   Archived  December 6, 2010, at the  Wayback Machine . \n ^   \"Dream or reality?\" . Flightglobal.com. 2006-04-26 . Retrieved  2012-04-09 .   \n ^   \"Norwegian airline NAS targets budget long-haul market\" . BBC. 2013-06-12 . Retrieved  2013-09-10 .   \n ^   \" Directory: CebuPac's next meal: Regional, US routes \" . Manilastandardtoday.com . Retrieved  2009-03-10 .   \n ^   \"International Flight Schedule updated as of 19 July 2017\"   (PDF) . Cebupacificair.com . Retrieved  2017-10-23 .   \n ^   \"UPDATE 2-Norwegian Air may seek compensation for Dreamliner problems\" .  Reuters . 2013-09-09.   \n ^   \"Details Of LEVEL, IAG's New Transatlantic Low Cost Airline\" .  One Mile at a Time . 2017-03-17 . Retrieved  2017-04-18 .   \n ^   \"LCCs - in it for the long-haul?\" .  Flightglobal . 5 Oct 2017.   \n ^   \"Eos Airlines Ceases Operations\" . Btnmag.com. 2008-04-26 . Retrieved  2009-03-10 .   \n ^   Frary, Mark (2008-05-09).  \"Scheduled airline failure insurance anyone?\" . London: Travel.timesonline.co.uk . Retrieved  2009-03-10 .   \n ^   \"We are very sad to announce that from 30 May 2008 we will cease operations\" . Silverjet . Retrieved  2008-05-31 .   \n References [ edit ] \n Gross, S./Schroeder, A. (Eds.): Handbook of Low Cost Airlines - Strategies, Business Processes and Market Environment, Berlin 2007 \n \"Low-cost airlines making their way to Japan\" .  Japan News Review . 2007-12-18 . Retrieved  2007-12-18 .   \n External links [ edit ] \n Oleksandr Laneckij Trends of the European Aviation Market: Seven Themes from the CONNECT 2016 Conference \n Wikivoyage has a travel guide for  Air travel on a budget . \n Authority control \n GND :  7545448-8 \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Low-cost_carrier&oldid=811578248 \"\t\t\t\t\t \n Categories :  Low-cost carriers Airline types Business models Hidden categories:  CS1 maint: Multiple names: authors list Webarchive template wayback links Articles that may contain original research from July 2010 All articles that may contain original research Articles lacking in-text citations from December 2012 All articles lacking in-text citations All articles with unsourced statements Articles with unsourced statements from May 2017 Articles with unsourced statements from August 2013 Articles with unsourced statements from July 2013 Wikipedia articles with GND identifiers   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikivoyage   \n Languages \n Afrikaans العربية Български Bosanski Català Čeština Dansk Deutsch Eesti Español فارسی Français Galego 한국어 Hrvatski Bahasa Indonesia Íslenska Italiano עברית Lietuvių Magyar Bahasa Melayu Nederlands 日本語 Norsk Polski Português Română Русский Simple English Slovenčina Српски / srpski Srpskohrvatski / српскохрватски Suomi Svenska ไทย Українська Tiếng Việt 中文   \n Edit links   \n  This page was last edited on 22 November 2017, at 15:06. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}