{"url": "https://www.wikihow.com/Discussion:Find-Hidden-Files-and-Folders-in-Windows", "content": "Discussion:Find Hidden Files and Folders in Windows - wikiHow \n MESSAGES \n You have no  notifications  at this time.   \n LOG IN \n Log in \n Facebook \n Google \n Civic \n wikiHow Account \n\t\tNo account yet?\t\t Create an account \n EXPLORE \n Community Dashboard Random Article About Us Categories Recent Changes   \n HELP US \n Write an Article Request a New Article Answer a Request More Ideas...   \n Article Edit Discuss \n Discussion:Find Hidden Files and Folders in Windows \n This discussion page has been archived. \nFeel free to start a new discussion or revive an old one here. \n Discussion Archives:    1 \n At 21:36, Feb 09, 2010 \n 122.161.42.73  said: \n i tried..but whenever i do this...i cant see the hidden files...from \"show hidden files\"..it automatically returns to \"dont show hidden files\"...please help me \n Reply to 122.161.42.73 \n At 09:40, Mar 21, 2010 \n 120.61.9.209  said: \n how will i know about the hidden folder,cause after i activated the show hidden files command,i did know where to look for hidden files!! \n Reply to 120.61.9.209 \n At 09:42, Mar 21, 2010 \n 120.61.9.209  said: \n i mean i did not know ,sorry! \n Reply to 120.61.9.209 \n At 14:27, Jul 11, 2010 \n Kwilkin  said: \n i have the same problem, whenever I hit the 'show hidden files' button and then apply the changes, it doesn't show the hidden files and reverts straight back to 'don't show hidden files'. i would love to know how to access them as I didn't mean to hide them, i just wanted to lock them \n Reply to Kwilkin \n At 01:10, Apr 09, 2011 \n 67.163.87.4  said: \n I just want to say THANK YOU!!!!! Damn virus hid all my files... thought they may have been deleted. \n Reply to 67.163.87.4 \n At 13:46, May 30, 2011 \n 217.208.86.32  said: \n I'm interested to learn how to open up a hidden file or better unhide a hidden file. Somehow I have got pictures and music files hidden and can't use them together with programs such as photoshop etc and windows media player. What to do? \n Reply to 217.208.86.32 \n At 07:33, Jun 17, 2012 \n 117.220.97.74  said: \n i know the name of the hinden file and folder but i cant find dat??? so please help me as soon as possibe \n Reply to 117.220.97.74 \n At 08:44, May 17, 2013 \n 82.69.86.127  said: \n This doesn't find all folders, it just allows you to see them. \n Very misleading title, explaining something that most 12 year olds already know how to do. \n Reply to 82.69.86.127 \n At 21:06, Nov 24, 2013 \n Gmrwebteam123  said: \n Well after reading this I feel I can get back a lot of stuffs that i have list by hiding it , really useful and great application my friend love the way you explained every thing by the use of great picture , keep updating. \n Reply to Gmrwebteam123 \n At 04:40, Feb 12, 2014 \n Patteri007  said: \n open RUN command (windows key+R) type CMD, then which drive u want, type drive letter F: , after type , f: attrib -h -r -s /d /s then enter...wait and enjoy solve ur problem. \n Reply to Patteri007 \n Can you improve this article? If so, you can edit it directly!  Click here  to go into edit mode and fix it up. \n\t\t\t\tYou are not logged in. Your IP address will be displayed in your posting.\n Enter the word that appears above. \n Security \n Cookies make wikiHow better. By continuing to use our site, you agree to our  cookie policy . \n Random Article \n Write An Article \n Featured Articles \n How to  Buy Nike Stock How to  Deal With Tons of Homework How to  Use a Milk Frother How to  Tame a Fully Grown Quail   \n Follow Us On... \n Home \n About wikiHow \n Jobs \n Terms of Use \n RSS \n Site map \n Log In \n    All text shared under a  Creative Commons License .\n Powered by Mediawiki. \n 50"}