{"url": "http://www.osc.gov.on.ca/en/NewsEvents_nr_20160928_new-results-women-on-boards.htm", "content": "CSA News Release: Regulators Release New Results on Women on Boards and in Executive Officer Positions  \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   News & Events   /   News Releases   /   2016   /   CSA News Release: Regulators Release New Results on Women on Boards and in Executive Officer Positions  \n            News & Events\n Hide Section Menu   × \n News Releases \n OSC News Releases \n Organizational News Releases \n Regulatory News Releases \n Enforcement News Releases \n OSC Investor Alerts \n CSA News Releases \n Speeches & Events \n Media Room \n Social Media \n OSC in the Community \n Reports and Publications \n OSC Annual Report \n Statement of Priorities \n OSC Investor News \n OSC Dialogue 2017 \n   Section Menu \n For Immediate Release \nSeptember 28, 2016 \n Regulators Release New Results on Women on Boards and in Executive Officer Positions  \n Toronto –  The securities regulatory authorities in  Manitoba, New Brunswick, Newfoundland and Labrador, Northwest Territories, Nova  Scotia, Nunavut, Ontario, Québec, Saskatchewan and Yukon (the participating  jurisdictions) today published  CSA Multilateral Staff Notice 58-308  Staff  Review of Women on Boards and in Executive Officer Positions – Compliance with  NI 58-101 Disclosure of Corporate Governance Practices .  \nThe notice summarizes a review of the corporate governance disclosure of 677  non-venture issuers with year ends between December 31, 2015 and March 31, 2016  as it relates to women in leadership roles.  This is the second review  following the implementation of rules under National Instrument 58-101  Disclosure  of Corporate Governance Practices,  which require non-venture issuers to  disclose certain information regarding women on boards and in executive officer  positions.  \nThe review revealed an increase in the number of women on boards in all size  categories of issuers, with large issuers still leading the way.  \n “These disclosure requirements were adopted to increase  transparency and to provide meaningful additional information that investors  can consider when making investment and voting decisions. This year’s results  show that the requirements have generally led to improved disclosure by issuers  and are having a positive impact on the representation of women on boards,”  said Louis Morisset, CSA Chair and President and CEO of the Autorité des  marchés financiers. “This topic continues to be a CSA priority and we will  continue to evaluate and report thereon to ensure meaningful disclosure is  provided.”   \nOur review found that in the case of the 215 issuers with a market  capitalization over $1 billion, 18 per cent of board seats are now held by  women, compared with 16 per cent last year, and in the case of the 42 largest  issuers with a market capitalization over $10 billion, these numbers are 23 per  cent and 21 per cent, respectively. Among the issuer sample, 55 per cent have  at least one woman on their boards (an increase of six per cent over last  year), and 66 issuers (or 10 per cent) have three or more women on their  boards, compared to 56 issuers (or eight per cent) last year. The percentage of  issuers that have at least one woman in an executive officer position remained  relatively stable, and the total percentage of board seats occupied by women  has increased from 11 per cent to 12 per cent.  \nThe review also found that issuers that have a policy relating to the  representation of women on their boards have average female board  representation of 18 per cent compared to issuers with no policy, which have  average female board representation of 10 per cent. Similarly, issuers with  board targets have an average of 25 per cent female board representation compared  to issuers without targets that average 10 per cent female representation. \nLater this fall, the participating jurisdictions will publish the underlying  data for this review on their websites.  \nOnce all issuers have made corporate governance disclosure regarding women on  boards and in executive officer positions for two consecutive years, the  participating jurisdictions intend to publish a comparison of the complete  two-year results. \nThe Staff notice can be found on the websites of the participating jurisdictions. \nThe CSA, the council of the securities regulators of Canada’s provinces and  territories, co-ordinates and harmonizes regulation for the Canadian capital  markets. \n - 30 - \n For more information: \n            Sylvain Théberge \n            Autorité des marchés financiers \n            514-940-2176\n Kristen\n            Rose \n            Ontario Securities Commission \n            416-593-2336 \n Jason (Jay) Booth \n            Manitoba Securities Commission \n            204-945-1660 \n Andrew\n            Nicholson \n            Financial and Consumer Services \n            Commission, New Brunswick \n            506-658-3021\n Jane H. Anderson \n            Nova Scotia Securities Commission \n            902-424-0179   \n Shannon McMillan \n            Financial and  Consumer Affairs  \n            Authority of  Saskatchewan \n            306-798-4160 \n            John O’Brien \n            Office of the Superintendent of\n            Securities \n            Newfoundland and Labrador \n            709-729-4909\n            Rhonda Horte \n            Office of the Yukon Superintendent \n            of Securities \n            867-667-5466\n            Jeff Mason \n            Nunavut Securities Office \n            867-975-6591 \n Tom\n            Hall \n            Northwest Territories Securities Office \n            867-767-9305\n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}