{"url": "https://insights.ubuntu.com/category/news/feed/", "content": "News – Ubuntu Insights \n https://insights.ubuntu.com\n Fri, 24 Nov 2017 10:55:09 +0000 \n en-US \n hourly \n 1 \n https://wordpress.org/?v=4.9 \n PT Biznet Gio Nusantara Launches NEO Cloud with Canonical BootStack \n https://insights.ubuntu.com/2017/11/02/pt-biznet-gio-nusantara-launches-neo-cloud-with-canonical-bootstack/\n\t\t https://insights.ubuntu.com/2017/11/02/pt-biznet-gio-nusantara-launches-neo-cloud-with-canonical-bootstack/#respond \n Thu, 02 Nov 2017 09:56:53 +0000 \n https://insights.ubuntu.com/?p=81594 \n PT Biznet Gio Nusantara Launches NEO Cloud –  a Leading Cloud Computing Platform for App Developers – running on Ubuntu OpenStack on Canonical’s BootStack managed cloud.  \n NEO Cloud is built on OpenStack technology, the first cloud computing service in Indonesia providing Multiple Availability Zones and Multiple Regions. NEO Cloud will be a more reliable and secure cloud computing service for Indonesian app developers across various level of businesses, from SME, Startups, to Corporations. \n Adi Kusma, President Director of Biznet said, ”Biznet keeps innovating to develop the latest technology further as well as expanding its coverage area to reach more cities in Indonesia. NEO Cloud’s computing service, which is equipped with various new features, is supported by Biznet’s over-the- edge network technology infrastructure. We believe that NEO Cloud will become the right solution to support customers’ needs to have a reliable and high-quality cloud computing service.” \n “We want to bring the new nuances for cloud computing industry in Indonesia,” said Dondy Bappedyanto, CEO PT Biznet Gio Nusantara. “From time to time, local cloud service providers are still out of favor compared to their global peers due to lack of features. NEO Cloud presents several features such as Multiple Regions and Availability Zones which should have been provided by other local cloud service providers, but yet are still not available,” he added. \n Biznet Gio uses Canonical’s managed cloud service  BootStack  with its Ubuntu OpenStack distribution to deploy and manage its OpenStack servers and software. “The main idea of engaging Canonical and their BootStack program is to have transfer of knowledge and best practices from the experienced OpenStack teams to Biznet Gio’s team,” Dondy explained. \n Mark Shuttleworth, CEO of Canonical, Founder of Ubuntu said, “Being able to operate cloud infrastructure efficiently at a low cost is the key to success. Biznet Gio determined Canonical’s BootStack to be the best model for them and their customers. We work closely with Biznet Gio to operate their cloud. It is a successful partnership for us both.” \n For further information about this new service please click  here \n About Biznet \n Biznet is a company that focuses on telecommunication and multimedia business, with a commitment to build modern infrastructure to reduce Indonesia’s digital gap with other developed countries. Biznet owns and operates the most advance fiber optic network and data center in Indonesia. For more information about the company and services, please  visit  the website. \n About Biznet Gio \n PT Biznet Gio Nusantara is an Indonesian company providing cloud computing service. The company was established in Jakarta on 22 September 2014 as a joint venture company between Biznet and  Internet Initiative Japan  (IIJ is the pioneer and number one cloud computing service provider in Japan ). The main focus of PT Biznet Gio Nusantara is to provide the leading instant and affordable infrastructure service for customers supported by reliable network infrastructure and data center owned by Biznet and also IIJ technology.  \n]]> \n https://insights.ubuntu.com/2017/11/02/pt-biznet-gio-nusantara-launches-neo-cloud-with-canonical-bootstack/feed/ \n 0 \n Ubuntu 17.10 releases with GNOME, Kubernetes 1.8 & minimal base images \n https://insights.ubuntu.com/2017/10/19/ubuntu-17-10-releases-with-gnome-kubernetes-1-8-minimal-base-images/\n\t\t https://insights.ubuntu.com/2017/10/19/ubuntu-17-10-releases-with-gnome-kubernetes-1-8-minimal-base-images/#respond \n Thu, 19 Oct 2017 15:19:58 +0000 \n https://insights.ubuntu.com/?p=81031 \n 19th October, London, UK:  Canonical today announced the release of  Ubuntu 17.10   featuring a new GNOME desktop on Wayland, and new versions of KDE, MATE and Budgie to suit a wide range of tastes. On the cloud, 17.10 brings Kubernetes 1.8 for hyper-elastic container operations, and minimal base images for containers. This is the 27th release of Ubuntu, the world’s most widely used Linux, and forms the baseline for features in the upcoming Long Term Support enterprise-class release in April 2018. \n “Ubuntu 17.10 is a milestone in our mission to enable developers across the cloud and the Internet of Things” said Mark Shuttleworth, CEO and Founder of Canonical. “With the latest capabilities in Linux, it provides a preview of the next major LTS and a new generation of operations for AI, container-based applications and edge computing.” \n Enhanced security and productivity for developers \n The Atom editor and Microsoft Visual Studio Code are emerging as the new wave of popular development tools, and both are available across all supported releases of Ubuntu including 16.04 LTS and 17.10. \n The new default desktop features the latest version of GNOME with extensions developed in collaboration with the GNOME Shell team to provide a familiar experience to long-standing Ubuntu users. 17.10 will run Wayland as the default display server on compatible hardware, with the option of Xorg where required. \n Connecting to WiFi in public areas is simplified with support for captive portals. Firefox 56 and Thunderbird 52 both come as standard together with the latest LibreOffice 5.4.1 suite. Ubuntu 17.10 supports driverless printing with IPP Everywhere, Apple AirPrint, Mopria, and WiFi Direct. This release enables simple switching between built-in audio devices and Bluetooth. \n Secure app distribution with snaps \n In the 6 months since April 2017, the number of snaps has doubled with over 2000 now available for Ubuntu, Debian, Solus and other Linux distributions. Snaps are a single delivery and update mechanism for an application across multiple Linux releases, and improve security by confining the app to its own set of data.  Hiri ,  Wavebox , and the  Heroku  CLI are notable snaps published during this cycle . \n Ubuntu 17.10 features platform snaps for GNOME and KDE which enable developers to build and distribute smaller snaps with shared common libraries. Delta updates already ensure that snap updates are generally faster, use less bandwidth, and are more reliable than updates to traditional deb packages in Ubuntu. \n The catkin Snapcraft plugin enables Robot Operating System (ROS) snaps for secure, easily updated robots and drones. There are many new mediated secure interfaces available to snap developers, including the ability to use Amazon Greengrass and Password Manager. \n The latest hardware support and container capabilities \n Ubuntu 17.10 ships with the 4.13 based Linux kernel, enabling the latest hardware and peripherals from ARM, IBM, Dell, Intel, and others. The 17.10 kernel adds support for OPAL disk drives and numerous improvements to disk I/O. Namespaced file capabilities and Linux Security Module stacking reinforce Ubuntu’s leadership in container capabilities for cloud and bare-metal Kubernetes, Docker and LXD operations. \n Canonical’s  Distribution of Kubernetes , CDK, supports the latest 1.8 series of Kubernetes. In addition to supporting the new features of Kubernetes 1.8, CDK also enables native cloud integration with AWS, native deployment and operations on VMWare, Canal as an additional networking choice, and support for the IBM Z and LinuxONE. \n Netplan by default \n Network configuration has over the years become fragmented between NetworkManager, ifupdown and other tools. 17.10 introduces  netplan   as the standard declarative YAML syntax for configuring interfaces in Ubuntu. Netplan is backwards compatible, enabling interfaces to continue to be managed by tools like NetworkManager, while providing a simple overview of the entire system in a single place. New installations of Ubuntu 17.10 will use Netplan to drive systemd-networkd and NetworkManager. Desktop users will see their system fully managed by NetworkManager as in previous releases. On Ubuntu server and in the cloud, users now have their network devices assigned to systemd-networkd in netplan. Ifupdown remains supported; upgrades will continue to use ifupdown and it can be installed for new machines as needed. \n -Ends- \n About Canonical \nCanonical is the company behind Ubuntu, the leading OS for cloud operations. Most public cloud workloads use Ubuntu, as do most new smart gateways, switches, self-driving cars and advanced robots. Canonical provides enterprise support and services for commercial users of Ubuntu. Established in 2004, Canonical is a privately held company. \n For further information please click  here . \n]]> \n https://insights.ubuntu.com/2017/10/19/ubuntu-17-10-releases-with-gnome-kubernetes-1-8-minimal-base-images/feed/ \n 0 \n Ubuntu Desktop Weekly Update: September 15, 2017 \n https://insights.ubuntu.com/2017/09/15/ubuntu-desktop-weekly-update-september-15-2017/\n\t\t https://insights.ubuntu.com/2017/09/15/ubuntu-desktop-weekly-update-september-15-2017/#respond \n Fri, 15 Sep 2017 18:47:48 +0000 \n https://insights.ubuntu.com/?p=80374 \n A fairly short update this week as we’re in bug fixing mode ahead of final beta in a couple of weeks. \n GNOME \n This week saw the release of GNOME 3.26, and we’re ready to ship it in 17.10. This will bring new versions of the core applications and new features as described in the  GNOME release notes. \n If you’ve been running 17.10 for a while you will have already been using 3.25, the development branch of 3.26, and so you will have already be familiar with 3.26 \n We’ve also been working on adding support for progress bars and urgent notifications to the Dash to Dock extension and we ported Dash to Dock settings to the new Control Center layout for 3.26 \n We’ve been working with the GNOME community on documentation to help people transitioning from Unity to GNOME and we tracked down and fixed a GDM but which was selecting the wrong session at login. Patches are upstream. \n Snaps \n Our patches to add PolicyKit support have been cherry picked for snapd 2.28. This will allow you to install Snaps without having to login to Ubuntu One. \n We have built new Snaps for gnome-characters and gnome-logs. \n Updates \n Chromium 61.0.3163.79 got promoted to stable channel and will be tested published soon. \n Chromium dev channel is updated to 62.0.3202.9. \n   \n]]> \n https://insights.ubuntu.com/2017/09/15/ubuntu-desktop-weekly-update-september-15-2017/feed/ \n 0 \n NEC partners with Canonical on Ubuntu Core based signage platform \n https://insights.ubuntu.com/2017/09/13/nec-partners-with-canonical-on-ubuntu-core-based-signage-platform/\n\t\t https://insights.ubuntu.com/2017/09/13/nec-partners-with-canonical-on-ubuntu-core-based-signage-platform/#respond \n Wed, 13 Sep 2017 13:00:24 +0000 \n https://insights.ubuntu.com/?p=80303 \n CMS digital signage solution leverages NEC large format displays and the Raspberry Pi Compute Module 3 \n Munich, 13   September   2017  –  NEC Display Solutions Europe  today announced a collaboration with Canonical, the company behind  Ubuntu Core  and  Screenly , the leading digital signage software solution for Raspberry Pi. This is one of several partnerships NEC has made with digital signage software companies leveraging Raspberry Pi as part of their digital signage solution. The joint collaboration facilitates an innovative digital signage solution which uses NEC’s P and V Series 40–55 inch large format displays and modular  Raspberry Pi  Compute Module 3 (CM3) to deliver high impact visual content in an integrated package for professional AV applications. \n When it comes to deploying signage in professional environments, not only the playback performance is paramount, but also the user experience and the overall platform security, reliability and manageability are vital. This collaboration is a strategic move by NEC to highlight these capabilities within our versatile range of display solutions, and is in line with NEC’s Open Modular intelligent computing strategy. \n Screenly’s powerful digital signage platform makes it easy to manage both small and large deployments, with targeted sectors such as retail, food and beverage, education, transport, and corporate offices, who will be able to communicate eye-catching content with their customers on this platform. The player enables smooth playback of full HD videos, images and web pages, complete with health checks and remote status monitoring. Moreover, the combination of Screenly’s simple, yet powerful, CMS and the flexible API, means Screenly can be used as a stand-alone solution or integrated with IoT solutions as well as into larger, more complex systems. Sensor triggers can be incorporated to make the signage more context-aware and relevant to the viewer, enhancing the overall experience. \n Jatin Bhatt, Strategic Alliance Manager at NEC Display Solutions Europe said: “Companies are looking for highly reliable technologies to continue improving their adoption and use of digital signage. The cooperation with Canonical and Screenly enables seamless integration of digital signage functionality and content management features into a single smart device, leveraging the power of the Raspberry Pi CM3 right inside our  P and V Series  displays. Together, this creates a simple but very secure, self-contained and effective solution for digital signage applications, supporting the NEC Open Modular computing strategy.” \n Ubuntu Core is a minimal version of Ubuntu targeted at IoT and embedded devices offering over-the-air updates, security built-in from the ground up and the opportunity for additional functionality and monetisation through snaps – the universal Linux packaging application format. Automatic updates simplify the update process for businesses that have digital signage installed in numerous and remote locations, while the secure platform ensures resistance to screen takeover and other potential attacks. Ubuntu Core is fully supported on the Raspberry Pi CM3 to deliver a cost effective, secure and extensible platform. \n Mike Bell, EVP of IoT and Devices at Canonical commented: “Digital signage platforms are now an increasing must-have feature for businesses all around the world. By partnering with the brightest minds in the industry, we can continue to develop enterprise and embedded IoT uses for Ubuntu Core. NEC’s large format displays with their support for Raspberry Pi Compute Module 3 running Ubuntu Core, offers a compelling and fully-integrated solution.” \n Viktor Petersson, CEO of Screenly added: “NEC’s open modular platform approach and IoT focus with Raspberry Pi CM3 allows us to push our software right into the heart of the digital signage hardware platform, providing a vibrant yet secure digital visual proposition that takes full advantage of the opportunities the IoT offers to advertisers and other organisations to personalise content and be more interactive. We look forward to working with NEC and Canonical to deliver the future of CMS digital signage.” \n For more information about the Screenly signage software and to download a fully featured 30 days trial license, please click  here . \n – ENDS – \n   \n About Canonical \nCanonical is the company behind Ubuntu, the leading OS for cloud operations. Most public cloud workloads use Ubuntu, as do most new smart gateways, switches, self-driving cars and advanced robots. Canonical provides enterprise support and services for commercial users of Ubuntu. Established in 2004, Canonical is a privately held company. \nFor further information please click  here . \n About Screenly \nScreenly is the world’s most popular digital signage platform for the Raspberry Pi. Since its launch in 2012, Screenly has become a dominant digital signage platform for the Raspberry Pi and powers over ten thousand of screen around the world. Screenly’s wide range of customers include advertising firms, hotels, restaurants, retail chains, offices and universities. For more information on Screenly please visit  https://www.screenly.io \n About NEC Display Solutions Europe \nNEC Display Solutions Europe GmbH has its European headquarters in Munich, Germany and is responsible for all business activities in EMEA. NEC Display Solutions Europe benefits from the technological know-how and technologies of the NEC Corporation and, with its own Research and Development, is one of the world’s leading manufacturers offering the widest product range of display solutions in the market. The display product portfolio ranges from entry-level to professional and speciality desktop LCDs, via large-size Public Displays for Digital and Retail Signage. The Projector range offers products for all needs, from portable devices via business projectors to products for permanent operation (such as PoS applications) and digital cinema projectors. Bernd Eberhardt is President and CEO of NEC Display Solutions Europe. \n Further information can be found online at:  www.nec-display-solutions.com \n Follow us on our social media channels: Facebook, YouTube, Twitter, LinkedIn and Google+. \n About NEC Corporation \nNEC Corporation is a leader in the integration of IT and network technologies that benefit businesses and people around the world. By providing a combination of products and solutions that cross utilize the company’s experience and global resources, NEC’s advanced technologies meet the complex and ever-changing needs of its customers. NEC brings more than 100 years of expertise in technological innovation to empower people, businesses and society. For more information, visit NEC at  http://www.nec.com. \n Based on its Mid-term Management Plan 2015, the NEC Group globally provides “Solutions for Society” that promote the safety, security, efficiency and equality of society. Under the company’s corporate message of “Orchestrating a brighter world,” NEC aims to help solve a wide range of challenging issues and to create new social value for the changing world of tomorrow. For more information, please visit  http://www.nec.com/en/global/about/solutionsforsociety/message.html. \n]]> \n https://insights.ubuntu.com/2017/09/13/nec-partners-with-canonical-on-ubuntu-core-based-signage-platform/feed/ \n 0 \n OpenStack Pike and all new updates to the Cloud Archive \n https://insights.ubuntu.com/2017/09/01/openstack-pike-and-all-new-updates-to-the-cloud-archive/\n\t\t https://insights.ubuntu.com/2017/09/01/openstack-pike-and-all-new-updates-to-the-cloud-archive/#respond \n Fri, 01 Sep 2017 13:27:17 +0000 \n https://insights.ubuntu.com/?p=80039 \nOn Wednesday 30th August, the upstream OpenStack community  officially announced the release of OpenStack Pike . Pike represents the 2nd release of OpenStack this year after Ocata was released back in February and it shows that the innovation and progress in OpenStack shows no signs of slowing just yet. With recent big announcements from Google, Amazon and VMware it is important that OpenStack continues to develop and offer a real, open alternative to public cloud platforms for organisations wanting to operate application infrastructure in house.\n New features: \n Pike updates have focused on manageability, flexibility and scale. Ubuntu OpenStack users  also benefit from updates to a number of key complementary technologies such as Ceph storage and OpenvSwitch. \n Manageability \n Thanks to updates of Cinder the block storage service of OpenStack, users get greater management of their data volumes, able to revert to a snapshot to recover from data loss or corruption. Volumes can also now be extended without rebooting a VM. \n Ironic, a bare metal service for OpenStack also now joins Cinder, Nova, Neutron and Swift in being able to support rolling upgrades. Whilst we have seen that for many uses cases, machines launched in OpenStack with LXD as a container hypervisor will deliver bare metal performance with greater security control and simplicity. For those who for one reason or another require Ironic, the ability to support rolling upgrades improves uptime during maintenance periods. \n Flexibility \n Users of Swift can now use a remote region to recover and even in the event of cross region network failure, individual regions can still function. \n Scalability \n Cells are an architectural implementation that breaks availability zones into units each with its own database and messaging server used to track state of the cloud. By splitting AZs in this way, centralised database and messaging services are no longer a bottleneck enabling larger pools of compute to be made available. In Pike more cells are supported and it is a great step to full CellsV2 support due in the next release of OpenStack known as Queens. \n Ubuntu OpenStack specific updates \n Now that we are over halfway through an LTS cycle OpenStack Pike gives us an opportunity to refresh many of the underlying operating system dependencies that OpenStack makes use of: \n QEMU – now refreshed to version 2.10 with improved NVMe support and handling of NUMA process scheduling. \n Libvirt 3.6.0 – many new features relating to use of libvirt with IBM pSeries servers and improvements in how hot plug events are handled with relation to vlans and OpenvSwitch \n Open vSwitch 2.8.0 – improvements to OVN including native active/passive HA support for ovn-northd, improvements to  network flow handling and improved support for DPDK (17.05.1) \n Ceph 12.2.0 – with Luminous also released this week it made sense to combine it with the release of Pike. Luminous has a new simple, built-in web-based dashboard for monitoring cluster status immediately improving usability. Luminous also uses Bluestore by default for ceph-osd meaning that a filesystem is no longer required. \n Access Pike now \n sudo add-apt-repository cloud-archive:pike \n New Charms for Pike will be released early next week giving users a clear way to upgrade from Ocata.  We’ll post more details on that soon. \n]]> \n https://insights.ubuntu.com/2017/09/01/openstack-pike-and-all-new-updates-to-the-cloud-archive/feed/ \n 0 \n Canonical expands enterprise Kubernetes \n https://insights.ubuntu.com/2017/08/23/canonical-expands-enterprise-kubernetes/\n\t\t https://insights.ubuntu.com/2017/08/23/canonical-expands-enterprise-kubernetes/#respond \n Wed, 23 Aug 2017 15:00:12 +0000 \n https://insights.ubuntu.com/?p=79155 \n Canonical supports enterprise Kubernetes on cloud and on-premises \n Two turnkey consulting packages for rapid deployment \n Support for Galactic Fog serverless, Rancher container management and Weave Cloud \n Reference architectures for Kubernetes operations on cloud or bare-metal \n LONDON, U.K, Aug 23rd, 2017 ,  Canonical  today announced two consulting packages for  enterprise Kubernetes  deployments, and expanded enterprise support to include serverless infrastructure from  Galactic Fog , container management workflows from  Rancher , and  Weave Cloud  from  Weaveworks . \n “Organisations looking for best-practice Kubernetes now have a reference architecture and specialist consulting to operate K8s on any cloud, bare metal, or virtualisation,” said Marco Ceppi, product manager for Kubernetes at Canonical. “ Canonical Kubernetes  is transforming how our customers host scale out, cloud native workloads, with an emphasis on portability across public clouds and private infrastructure.” \n ‘Kubernetes Explorer’ covers Kubernetes on a public cloud, private cloud or VMware. It delivers the reference architecture at $15,000 including training and deployment, with optional consulting for workload analysis or to assist in the creation of CI/CD pipelines in support of everyday operations with containers. \n ‘Kubernetes Discoverer’ broadens the offering to include bare metal operations. At $35,000 it includes specialist consulting to optimise the architecture for particular workloads, together with hands-on training delivered on site. The Discoverer package provides the opportunity for deep integration and customisation of storage and networking options. \n Canonical Ubuntu is the leading OS for cloud operations – public and private – and Canonical works with AWS, Azure, Google and Oracle to optimise Ubuntu guests for containers on those clouds. Canonical also works with Google GKE to enable hybrid operations between enterprise deployments of Kubernetes and the Google SAAS offering. \n “The enterprise challenge is to enable containers across hybrid cloud environments,” said Dustin Kirkland, VP Product at Canonical. “Canonical’s cloud partnerships provide choice of cloud infrastructure with a consistently secure and efficient Kubernetes across multiple clouds.” \n Canonical’s Kubernetes implementation serves as a shared platform for a wide range of partner offerings, including serverless infrastructure from Galactic Fog, container management platform from Rancher Labs and Weave Cloud from Weaveworks. \n “Innovation is shifting up the stack, so we are delighted to partner with Canonical to enable enterprise serverless infrastructure on every cloud,” said Anthony Skipper, Founder and CEO at Galactic Fog. “Galactic Fog on Canonical’s Kubernetes provides a multi-cloud solution for serverless computing that is operable at scale and easy to integrate.” \n “Canonical’s Kubernetes provides a modern, stable, efficient base for the best-in-class Rancher container management,” said Nick Stinemates, VP of Business Development at Rancher Labs. “Our customers appreciate the business value of running container-optimized workloads in production, and seek to get there with as little friction as possible.” \n “Enterprises can cut through the complexity to discover the power of Kubernetes with Ubuntu’s reference architecture and services,” said Steve George, COO at Weaveworks. “Combining Canonical Kubernetes with Weave Cloud’s comprehensive management and monitoring delivers a powerful and efficient platform for DevOps practitioners to deploy and operate sophisticated apps at scale, on any infrastructure.” \n -Ends- \n About Canonical \n Canonical  is the company behind Ubuntu, the leading OS for container, cloud, scale-out and hyperscale computing. 65% of large-scale OpenStack deployments are on Ubuntu, using both KVM and the pure-container LXD hypervisor for the world’s fastest private clouds. Canonical provides enterprise support and services for commercial users of Ubuntu. \n About Galactic Fog \n Galactic Fog  was founded in 2015 with the goal of enabling companies to easily build or migrate existing applications to cloud-native architectures. Galactic Fog’s platform is built on open source and foundational components have been released as open source. Galactic Fog is backed by Osage Venture Partners and Newark Venture Partners. \n About Rancher Labs \n Rancher Labs  builds innovative, open source software for enterprises leveraging containers to accelerate software development and improve IT operations. The flagship Rancher container management platform makes it easy to adopt, run and manage Docker containers across multiple Kubernetes clusters. It includes everything you need to run containers in production, on any infrastructure. For additional information, please visit  www.rancher.com . \n About Weaveworks \n Weaveworks  is the maker of Weave Net, Weave Scope, Weave Cortex, Weave Flux and Weave Cloud, which enable customers to connect, monitor and manage microservices and containers. Weave is open source software and contributions and pull requests are more than welcome via Github. \n]]> \n https://insights.ubuntu.com/2017/08/23/canonical-expands-enterprise-kubernetes/feed/ \n 0 \n SnapRoute and Canonical create new switch stack for network operators \n https://insights.ubuntu.com/2017/08/22/snaproute-and-canonical-create-new-switch-stack-for-network-operators/\n\t\t https://insights.ubuntu.com/2017/08/22/snaproute-and-canonical-create-new-switch-stack-for-network-operators/#respond \n Tue, 22 Aug 2017 12:59:41 +0000 \n https://insights.ubuntu.com/?p=79121 \n Redefining the economics of data center networking through disaggregation of hardware, operating system, and software components. \n SnapRoute and Canonical announced today an integrated network stack, creating a rock solid software foundation for white-box and brite-box switch deployments in large environments. FlexSwitch from SnapRoute is a modern, micro-services architecture switch control plane, and Canonical’s Ubuntu is the most widely trusted OS in enterprise cloud computing. \n The FlexSwitch+Ubuntu stack is certified on multiple white-box switches including the Facebook Wedge 100. It dramatically simplifies deployment and operations for out-of-band management, top-of-rack, leaf, and spine networks since the switch control software can be deployed as a normal Ubuntu application in the datacenter. The move to Ubuntu brings a new degree of freedom to the white-box switch market thanks to its huge cloud software ecosystem. \n FlexSwitch deployment is fully automated with Canonical’s MAAS (‘Metal as a Service’), enabling top-to-bottom data center provisioning. \n Udi Nachmany, Vice President of Cloud Alliances, Canonical  \n“Network Operators demand visibility and control of all aspects of their infrastructure. The combination of the familiar and widely trusted Ubuntu OS, and SnapRoute’s pioneering FlexSwitch, raises the bar on security, operational control and network stack innovation.” \n Jason Forrester, Founder and CEO, SnapRoute \n“We strongly believe that open networks are synonymous to good networks. Combining Ubuntu and FlexSwitch on a white-box platform of choice delivers network architects a reliable and simple alternative to closed, traditional switch platforms while providing choice and flexibility to leverage the vast universe of Linux-based software and tools right on the switch. This is the future of networking.” \n For further information please visit  www.ubuntu.com  and  www.snaproute.com \n About SnapRoute \nFounded by engineers who created and reliably operated some of the largest data center networks on the planet by adopting open networking principles, SnapRoute is dedicated to bringing simplicity, reliability, and white-box economics to data center networks everywhere. SnapRoute’s FlexSwitch software runs on industry standard white-box switches, providing all management and networking functionality through an innovative architecture that simplifies the networking stack and dramatically reduces the code bloat typical of incumbent products. SnapRoute makes it easy to automate network provisioning while giving unprecedented visibility into how the network is running. SnapRoute is backed by Norwest Venture Partners, Lightspeed Venture Partners, AT&T, and Microsoft. For more information visit  www.snaproute.com . Follow us on Twitter:  @snaproute \n]]> \n https://insights.ubuntu.com/2017/08/22/snaproute-and-canonical-create-new-switch-stack-for-network-operators/feed/ \n 0 \n Ubuntu Desktop Weekly Update: August 11, 2017 \n https://insights.ubuntu.com/2017/08/11/ubuntu-desktop-weekly-update-august-11-2017/\n\t\t https://insights.ubuntu.com/2017/08/11/ubuntu-desktop-weekly-update-august-11-2017/#respond \n Fri, 11 Aug 2017 17:15:02 +0000 \n https://insights.ubuntu.com/?p=78978 \n GUADEC \n The GNOME conference happened last week with good representation from Ubuntu. The spirit was good and the discussions constructive. Decisions were made, details can be read on  https://didrocks.fr/2017/08/03/ubuntu–guadec-2017-and-plans-for-gnome-shell-migration/ \n GNOME Shell \n We’re preparing to make the changes described above in the coming weeks, that means that the GNOME Shell Ubuntu session is going to transition to this design in the next few days. Didier will be posting a series of blog posts next week on how this all works as they are landing. The vanilla upstream GNOME session will also emerge from this work. And we’ll link to the posts in next week’s newsletter, but keep an eye on social media for up-to-date information. \n We’ve resurrected the “power off” option when the power button is pressed.  This will appear in GNOME Control Center 3.25.90. \n Video, Audio, Bluetooth, Networking \n You might have seen this screenshot earlier in the week: \n We’re testing some patches to Chromium 60 in Artful to enable video acceleration and we’re seeing roughly a 50% saving in CPU overhead when using VA API.  In the screenshot above playing the video without acceleration is on the left and playing with acceleration is on the right.  The CPU is  Haswell .  There are still more bugs to fix, but we’re making progress. \n In Pulse Audio we’ve dropped some more patches for Android support (from Ubuntu Touch) bringing us more inline with upstream.  This will make maintenance easier and should reduce the chance of bugs cropping up from our patches. \n Our patches to add enabling and disabling of the Network Connectivity Checker are in review  upstream .  This will eventually add a toggle switch in the privacy settings of Control Center to allow you to turn on/off the connectivity checker.  We should be able to distro-patch these into Ubuntu soon before they appear upstream, and then drop the patches once they are available upstream. \n We’re including the Rhythmbox “Alternate Toolbar” by default in 17.10, this brings a tidier user interface \n Updates \n Updated Chromium stable to 60.0.3112.78, pending validation.  The next Chromium stable update is 60.0.3112.90, already lined up in a PPA.  Updated Chromium beta to 61.0.3163.31, Chromium dev to 62.0.3175.4. \n Updating LibreOffice Snap to 5.4.0. \n Merged upstream Ghostscript version 9.21 from Debian into Ubuntu. \n Synced newest versions from Debian for hplip, cups-bjnp, ippusbxd.  System-config-printer updated to a new snapshot from upstream GIT. \n GNOME got a stack of updates to 3.25.90 (evolution, games, font viewer, online accounts, tweak tool, map, log, disk, calculator, cheese, todo) \n   \n In The News \n We’re planning a Fit And Finish hackfest in London at the end of August to find and fix all the niggly little bugs and theming issues. If you’ve got skills to offer and would like to get involved please see  Popey’s blog post . \n Softpedia also covers  this topic here . \n Linux Action News  discuss  the changes to the default session in 17.10. \n 16.04.3 was released last week.  OMG  covers the release here . \n OMG also have articles  on the dock  and the  Rhythmbox plugin \n Softpedia  discuss  Didier’s blog post about the changes coming to the default session \n]]> \n https://insights.ubuntu.com/2017/08/11/ubuntu-desktop-weekly-update-august-11-2017/feed/ \n 0 \n 68% of businesses are struggling to hire talent for IoT \n https://insights.ubuntu.com/2017/08/09/68-of-businesses-are-struggling-to-hire-talent-for-iot/\n\t\t https://insights.ubuntu.com/2017/08/09/68-of-businesses-are-struggling-to-hire-talent-for-iot/#respond \n Wed, 09 Aug 2017 13:00:07 +0000 \n https://insights.ubuntu.com/?p=78740 \n Research from Canonical shows businesses are battling with drought in the “Internet of Talent” pool \n London, 9th August 2017  – Businesses are struggling to recruit employees with the skills needed to make the internet of things a success according to a new  IoT Business Models  report from Canonical – the makers of the IoT operating system,  Ubuntu Core . \n The report, which includes research from over 360 IoT professionals, developers and vendors found that 68% are struggling to find and recruit employees with relevant IoT expertise. \n According to Canonical’s research, the most difficult to hire IoT employees are those with knowledge of big data and analytics, with 35% of IoT professionals saying they struggle to recruit this skillset. Knowledge of big data and analytics was also identified as the most important skillset for IoT professionals, with 75% deeming it a necessity for anyone claiming to be an IoT expert. The next most hard to find skillsets for IoT professionals are knowledge of embedded software development (33%), embedded electronics (32%), expertise in IT security (31%) and an understanding of AI (30%).   \n Commenting on these findings, Mike Bell, EVP of IoT and Devices at Canonical said, “When it comes to the internet of things, the business community is still overcoming a significant skills gap. Many businesses are concerned by their own lack of knowledge and skills within the IoT market and many business leaders are finding themselves running head first into a set of technology and business challenges that they do not yet fully understand. \n “Businesses need to realise that working in IoT should not require such an extensive variety of skills. What is needed, instead, is a simplification of the technologies behind IoT. Within the next five years we expect to see IoT technologies built into all aspects of the business environment. As edge computing brings connected intelligence directly to the shop floor, cloud computing will continue to drive back-end processes across the entire supply chain, for example. With all business processes growing increasingly connected, their supporting IoT technologies must be easy enough for anyone to manage, monitor and use – regardless of their background knowledge or personal skillset. \n “Above all, businesses must be agile when it comes to deciding on the ‘right’ people, skills and team to take them forward. What is decided upon today, is unlikely to remain the same in even one or two years, so constantly evaluating what change is needed and being able to execute this quickly is a must.” To find out more about the IoT skills gap, download Canonical’s  Defining IoT Business Models  report. \n ENDS \n Methodology \n The  Defining IoT Business Models  report incorporates original research, commissioned by Canonical and conducted by independent industry publication IoTNow. The research surveyed 361 people from IoT Now’s database of registered IoT professionals. \n About Canonical \n Canonical is the company behind Ubuntu, the leading OS for cloud operations. Most public cloud workloads use Ubuntu, as do most new smart gateways, switches, self-driving cars and advanced robots. Canonical provides enterprise support and services for commercial users of Ubuntu. \n Established in 2004, Canonical is a privately held company. For further information please click  here . \n]]> \n https://insights.ubuntu.com/2017/08/09/68-of-businesses-are-struggling-to-hire-talent-for-iot/feed/ \n 0 \n Achieving ROI trumps security as the IoT industry’s biggest challenge \n https://insights.ubuntu.com/2017/07/19/achieving-roi-trumps-security-as-the-iot-industrys-biggest-challenge/\n\t\t https://insights.ubuntu.com/2017/07/19/achieving-roi-trumps-security-as-the-iot-industrys-biggest-challenge/#respond \n Wed, 19 Jul 2017 12:59:51 +0000 \n https://insights.ubuntu.com/?p=77332 \n While security concerns continue to grab headlines, business benefits and ROI are the top-ranked challenges for IoT professionals today \n London, 19 July 2017  – Despite over 23,000 articles* being written about IoT security in the last 12 months, it’s ensuring a return on investment that represents the biggest challenge for IoT professionals in 2017. That’s according to a new  ‘Defining IoT Business Models’  research whitepaper from Canonical – the company behind  Ubuntu Core , the IoT operating system. \n The report, which surveyed over 360 IoT professionals including developers, vendors, and enterprise users, highlights that – despite a widespread focus on IoT security – 53% believe “quantifying ROI and providing a clear use case” is their most immediate IoT challenge. As an industry concern, this places defining the return on investment above both the lack of available infrastructure (40%) and the need for improved device security (45%). \n Despite the IoT industry now being valued at more than $900 billion1, it’s clear that many businesses still don’t understand how to turn a profit or gain genuine business benefits from the internet of things. According to Canonical’s research, 34% of IoT professionals also believe that “quantifying the business benefits” of the internet of things should be their number one priority to encourage greater IoT adoption. \n Biggest immediate challenges faced by IoT professionals \n Quantifying ROI – 53% \n Device security and privacy – 45% \n Lack of IoT infrastructure – 40% \n Lack of budget/investment in IoT – 34% \n Ensuring integration with the wider ecosystem – 29% \n Device management / long-term support – 26% \n Resistance from within the organisation – 25% \n Ensuring regular updates are installed – 12% \n Commenting on these findings, Mike Bell, EVP of IoT and Devices at Canonical said, “The early internet of things was something of a gold rush, with vendors and developers jumping in to secure their share of an exciting and rapidly growing new market. Unfortunately, many of these businesses simply didn’t understand or evaluate how the IoT was going to deliver value – and apparently – the majority still don’t. \n “As we move towards 2018, businesses are looking for new ways to ensure that their investments in the IoT are driving financial growth and that their business models will remain sustainable in the years to come. At the forefront of this is a change in the way that businesses monetise the internet of things. Where once, people planned to monetise the IoT through device sales, we are now increasingly moving towards a software defined business model for IoT. With IoT specific operating systems, such as Ubuntu Core, allowing users to install new functionality onto their products, a growing number of businesses are now relying on IoT app stores to generate new revenues and increase their ROI. Through this new model, IoT users – whether corporate, industrial or consumer – can receive the latest features without having to buy a whole new device. This not only provides greater security and functionality for consumers, but also provides a long-term revenue source. With this in mind, businesses shouldn’t need to see ROI as their biggest challenge for the IoT, if anything, it should be their biggest opportunity.” \n To download Canonical’s  Defining IoT Business Models  research whitepaper click  here . \n ENDS \n NOTES TO EDITORS \n McKinsey & Company, 2016 \n Methodology \n The Defining IoT Business Models report incorporates original research, commissioned by Canonical and conducted by independent industry publication IoTNow. The research surveyed 361 people from IoTNow’s database of registered IoT professionals. *As part of this research, Canonical also ran a media analysis using the Meltwater news monitoring tool. This found that 23,000 English language articles and news stories have been published on the topic of IoT security between June 2016 and June 2017. \n About Canonical \n Canonical is the company behind Ubuntu, the leading OS for cloud operations. Most public cloud workloads use Ubuntu, as do most new smart gateways, switches, self-driving cars and advanced robots. Canonical provides enterprise support and services for commercial users of Ubuntu. \n Established in 2004, Canonical is a privately held company. \n For further information please visit  https://www.ubuntu.com/internet-of-things  \n]]> \n https://insights.ubuntu.com/2017/07/19/achieving-roi-trumps-security-as-the-iot-industrys-biggest-challenge/feed/ \n 0"}