{"url": "https://it.wikipedia.org/wiki/Wikipedia:Avvertenze_generali", "content": "Wikipedia:Avvertenze generali - Wikipedia \n Wikipedia:Avvertenze generali   \n Da Wikipedia, l'enciclopedia libera.   \n\t\t\t\t\tVai a:\t\t\t\t\t navigazione , \t\t\t\t\t ricerca \n WIKIPEDIA NON DÀ GARANZIE SULLA VALIDITÀ DEI CONTENUTI \n Avvertenze e note alla consultazione \n Avvertenze generali (general disclaimer) \n Usa Wikipedia a tuo rischio! \n Wikipedia non dà consigli legali \n Wikipedia non dà consigli medici né psicologici \n Wikipedia può contenere materiale discutibile, illegale o vietato \n Attendibilità di Wikipedia \n Privacy e tutela dei dati su Wikipedia \n Applicazione della legge civile italiana \n Applicazione della legge penale italiana \n Rappresentante legale \n Abbreviazioni \n WP:DISCLAIMER \n Wikipedia  è un'enciclopedia online a contenuto aperto, frutto del lavoro di un insieme di volontari, con lo scopo di sviluppare una fonte di conoscenza comune e libera. Sebbene esistano  regole  e un sistema non ufficiale di gestione anonimo e volontario, la struttura dell'enciclopedia permette a chiunque di modificare il contenuto delle sue pagine. \n È pertanto necessario tenere presente che: \n «di nessuna delle informazioni presenti nelle pagine di questo sito è possibile garantire verifica o controllo da parte di soggetti legalmente abilitati o con le necessarie competenze per esprimersi nei campi trattati; un siffatto controllo sarebbe necessario per fornire un'informazione completa, corretta e certa». \n Wikipedia NON PUÒ garantire, in alcun modo, la validità delle informazioni pubblicate . Ciò, naturalmente, non implica la mancanza di informazioni interessanti o accurate, ma è importante sapere che su Wikipedia ogni contenuto può essere modificato, alterato o  vandalizzato  da chiunque. Ciò significa che ogni dato o informazione presente nelle voci di Wikipedia potrebbe non rappresentare adeguatamente l'effettivo stato della conoscenza condivisa o la verità dei fatti. Alcune edizioni linguistiche di Wikipedia hanno adottato  sistemi per selezionare e approvare le versioni più accreditate , ma sempre in forma volontaria e senza garanzia. La cosa più vicina a questo sistema di selezione è l'attuale sezione « vetrina »; tuttavia anche le voci in essa presenti potrebbero essere state successivamente modificate senza il controllo necessario. \n «Nessuno degli autori, contributori, sponsor, amministratori, sistemisti, o qualsiasi altra parte sia in qualsiasi modo connessa a Wikipedia può essere ritenuto responsabile per la presenza di qualsiasi informazione inaccurata, diffamatoria o lesiva, né per l'utilizzo di tali informazioni, né per qualsiasi tipo di danno cagionato dall'utilizzo di tali informazioni». \n Le informazioni riportate sono fornite in maniera libera e gratuita. Nessun tipo di accordo o contratto sussiste — sia pure in forma implicita — tra l'utente e i proprietari del sito, gli utenti, i proprietari dei server, gli amministratori del progetto, gli amministratori di sistema o qualsiasi altra parte  in qualsiasi modo collegata  a Wikipedia o ai progetti collaterali. \n Qualsiasi  marchio registrato , marchio di fabbrica, marchio collettivo, diritto di design, diritto d'immagine, di tutela dei propri dati personali o altri diritti simili, menzionati o utilizzati nelle voci di Wikipedia, è di proprietà dei legittimi detentori. Tutto il materiale che si trova su Wikipedia è pubblicato dagli utenti (dei quali è conservato l'indirizzo IP a scopo cautelativo) secondo quanto previsto dalle  licenze Creative Commons  (CC BY-SA) e  GNU Free Documentation License  (GFDL). Wikipedia non può garantire che gli utenti abbiano effettivamente ottemperato a quanto richiesto da dette licenze e non abbiano, quindi, leso alcun diritto: la responsabilità della pubblicazione rimane perciò esclusivamente in capo agli utenti. Laddove non diversamente dichiarato i siti di Wikipedia e Wikimedia non sono né associati a, né approvati da alcuno dei detentori di tali diritti.  L'eventuale pubblicazione o uso di qualsiasi materiale protetto da diritto d'autore è a unico rischio dell'utente che lo pubblica e/o lo usa  ed è espressamente vietato. \n È garantita una licenza limitata di copia dei contenuti (secondo le condizioni previste dalle licenze CC BY-SA e GFDL), ma ciò non crea né implica alcuna responsabilità contrattuale o extra-contrattuale da parte di Wikipedia o di uno qualsiasi dei suoi agenti, membri, organizzatori o altre parti. \n «Wikipedia non è uniformemente revisionata; benché gli utenti possono correggere errori o rimuovere dati errati, non hanno tuttavia alcun obbligo, onere o dovere di farlo e quindi tutte le informazioni presenti sono fornite senza alcuna garanzia di idoneità per qualsiasi scopo o utilizzo». \n Le informazioni presenti potrebbero violare delle leggi del luogo di loro fruizione. Wikipedia non incoraggia le violazioni di legge ma, siccome le informazioni sono conservate su server posti in  Florida , negli  Stati Uniti d'America , si assumono a riferimento le disposizioni generali stabilite dal  Primo emendamento  della  costituzione degli Stati Uniti d'America  e dalla  Dichiarazione universale dei diritti umani  delle  Nazioni Unite . Alcune legislazioni nazionali potrebbero non accordare una talmente ampia protezione della libertà di parola: Wikipedia non è responsabile per eventuali utilizzi dei propri contenuti considerati illeciti in tali Paesi. \n «Per consigli specifici (per esempio medici, legali, gestione dei rischi) ci si rivolga a un professionista che abbia titolo legale a fornire consulenza in materia». \n Leggere anche le avvertenze  sul rischio   medico  e  legale  per le liberatorie o per clausole specifiche di esclusione di responsabilità (disclaimer). \n Nessun danno consequenziale può essere contestato, imputato o opposto a Wikipedia o ai volontari che, anche solo occasionalmente, la curano  in quanto essa è un'associazione volontaria di individui solo parzialmente strutturata e sviluppata liberamente per creare risorse educative, culturali e informative, online e aperte.  Queste informazioni vengono fornite in maniera gratuita  e  non esiste alcun accordo o intendimento fra l'utente e Wikipedia  circa il loro utilizzo o modifica, a parte il rispetto delle licenze CC BY-SA e GFDL; parimenti nessuno in Wikipedia è responsabile per il fatto che chicchessia cambi, modifichi o rimuova qualsiasi informazione che chiunque altro o egli medesimo possa aver inserito su Wikipedia o su uno qualsiasi dei suoi progetti associati. \n Il contenuto di questa pagina si applica a  ogni pagina  presente in Wikipedia. \n Grazie per il tempo speso per la lettura di queste avvertenze generali, e auguri per una navigazione utile e piacevole su Wikipedia. \n\t\t\t\t\t\tEstratto da \" https://it.wikipedia.org/w/index.php?title=Wikipedia:Avvertenze_generali&oldid=91647033 \"\t\t\t\t\t \n Categoria :  Disclaimer sui contenuti Categoria nascosta:  Pagine di servizio protette parzialmente   \n Menu di navigazione \n Strumenti personali \n Accesso non effettuato discussioni contributi registrati entra   \n Namespace \n Pagina di servizio Discussione   \n Varianti \n Visite \n Leggi Visualizza wikitesto Cronologia   \n Altro \n Ricerca \n Navigazione \n Pagina principale Ultime modifiche Una voce a caso Vetrina Aiuto Sportello informazioni   \n Comunità \n Portale Comunità Bar Il Wikipediano Fai una donazione Contatti   \n Strumenti \n Puntano qui Modifiche correlate Pagine speciali Link permanente Informazioni pagina Elemento Wikidata   \n Stampa/esporta \n Crea un libro Scarica come PDF Versione stampabile   \n In altri progetti \n Wikimedia Commons MediaWiki Wikispecies Wikibooks Wikidata Wikinotizie Wikiquote Wikiversità Wikivoyage   \n In altre lingue \n Afrikaans Alemannisch Aragonés العربية ܐܪܡܝܐ অসমীয়া Asturianu Azərbaycanca Башҡортса Boarisch Беларуская Беларуская (тарашкевіца)‎ Български Bamanankan বাংলা བོད་ཡིག Bosanski Буряад Català Mìng-dĕ̤ng-ngṳ̄ Cebuano کوردی Čeština Cymraeg Dansk Deutsch Zazaki Eʋegbe Ελληνικά Emiliàn e rumagnòl English Esperanto Español Eesti Euskara فارسی Suomi Võro Føroyskt Français Nordfriisk Furlan Gaeilge 贛語 Gàidhlig Galego Avañe'ẽ ગુજરાતી Hawaiʻi עברית हिन्दी Hrvatski Kreyòl ayisyen Magyar Հայերեն Interlingua Bahasa Indonesia Igbo Ilokano Íslenska 日本語 Basa Jawa ქართული ភាសាខ្មែរ ಕನ್ನಡ 한국어 Kurdî Kernowek Lëtzebuergesch Limburgs Ligure Lingála ລາວ Lietuvių Latviešu Malagasy Македонски മലയാളം Монгол मराठी Bahasa Melayu Malti Mirandés မြန်မာဘာသာ مازِرونی Nāhuatl Plattdüütsch Nedersaksies नेपाली Nederlands Norsk nynorsk Norsk Diné bizaad Occitan ଓଡ଼ିଆ Ирон ਪੰਜਾਬੀ Pälzisch Polski پښتو Português Runa Simi Română Armãneashti Русский संस्कृतम् Sardu Scots سنڌي Srpskohrvatski / српскохрватски සිංහල Simple English Slovenčina Slovenščina Gagana Samoa ChiShona Soomaaliga Shqip Српски / srpski Basa Sunda Svenska Kiswahili தமிழ் తెలుగు Тоҷикӣ ไทย Türkmençe Tagalog Türkçe Татарча/tatarça Удмурт ئۇيغۇرچە / Uyghurche Українська اردو Oʻzbekcha/ўзбекча Tiếng Việt West-Vlams Volapük Winaray IsiXhosa ייִדיש 中文 Bân-lâm-gú 粵語 IsiZulu   \n Modifica collegamenti   \n  Questa pagina è stata modificata per l'ultima volta il 30 set 2017 alle 17:39. \n Il testo è disponibile secondo la  licenza Creative Commons Attribuzione-Condividi allo stesso modo ; possono applicarsi condizioni ulteriori. Vedi le  condizioni d'uso  per i dettagli. \n Informativa sulla privacy \n Informazioni su Wikipedia \n Avvertenze \n Sviluppatori \n Dichiarazione sui cookie \n Versione mobile"}