{"url": "http://parcolympique.qc.ca/en/", "content": "Parc olympique de Montréal \n Our organization \n How to get here \n FAQ \n Français \n Menu The Park The Montréal Tower The Esplanade Financière Sun Life The Stadium The Sports Centre Other attractions  Close News Activities Events Self-circuits Plan an event \n Events calendar \n   \n                    November 2017                     \n   \n   L \n M \n M \n J \n V \n S \n D \n     \n   \n 01 \n 02 \n 03 \n 04 \n 05 \n   06 \n 07 \n 08 \n 09 \n 10 \n 11 \n 12 \n   13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n   20 \n 21 \n 22 \n 23 \n 24 \n 25 \n 26 \n   27 \n 28 \n 29 \n 30 \n   \n   \n   \n Next events \n See all events \n Latest news \n New Way to Access the Olympic Stadium for the Blue Jays Game on Friday, March 31st, and Saturday, April 1st. \n Montréal’s Olympic Park will implement their new entry process at the Olympic Stadium, by moving the search points outside for the two Blue Jays game on Friday, march 31st, and Saturday, April 1st, 2017, as well as for all upcoming spectator[...]  Learn more » \n New Way to Access the Olympic Stadium for the Impact Game on Saturday, March 11 \n Montréal’s Olympic Park is implementing a new entry process at the Olympic Stadium, by moving the search points outside for the Impact game on Saturday, March 11, 2017, as well as for all upcoming spectator events. People arriving via the Pie-IX metro station[...]  Learn more » \n The Olympic Park presents: Souvenirs from 1976, an exhibit at 3 sites recounting the highlights of the Olympic Games \n Montreal, March 21, 2016 – Starting this summer, the Olympic Park will present Memories of 1976, a key exhibit about the Montreal Olympic Games, which will be presented at 3 critical sites in the Mercier – Hochelaga – Maisonneuve neighbourhood:[...]  Learn more » \n Info-Accès \n The Stadium \n The Montréal Tower \n The Esplanade \n The Sports Centre \n Other attractions \n How to get here \n About \n Partners \n Bon voisinage \n Employment \n Contact us \n\t\t\t\t\t4141, avenue Pierre-De Coubertin \r\n\t\t\t\t\tMontreal, Quebec \r\n\t\t\t\t\tH1V 3N7\r\n\t\t\t\t\tPhone : 514 252-4141 or 1 877 997-0919 \r\n\t\t\t\t\tFax : 514 252-0372 \r\n\t\t\t\t\tEmail :  rio@rio.gouv.qc.ca"}