{"url": "https://www.getsmarteraboutmoney.ca/accessibility-policy/", "content": "Accessibility policy | GetSmarterAboutMoney.ca \n Skip to content \n   Visit our Facebook page \n   Visit our Twitter page \n A \n Set font size to normal \n A \n Set font size to large \n  Contrast\t\t\t \n Français \n     Menu \n A \n Set font size to normal \n A \n Set font size to large \n  Contrast\t\t\t \n Français \n Search for: \n Search \n Invest \n Investing basics \n Getting started \n Multilingual introduction \n Understanding risk \n Getting advice \n Making a plan \n Tracking your progress \n Investment products \n Annuities \n Bonds \n Complex investments \n ETFs \n Exempt securities \n GICs \n Mutual funds & segregated funds \n Real estate \n Savings bonds \n Stocks \n Pension & savings plans \n Savings plans \n RESPs \n RRSPs \n RRIFs \n RDSPs \n TFSAs \n Plan & manage \n Planning basics \n Bank accounts \n Budgeting \n Financial planning \n Personal insurance \n Understanding tax \n Managing debt \n Saving money \n Wills & estate planning \n The Universal Truths \n Retirement planning \n Planning for retirement \n Living your retirement \n RRSPs \n RRIFs \n Annuities \n Pension & savings plans \n Getting advice \n Working with an advisor \n Finding an advisor \n Checking registration \n Making a complaint \n InvestmentReporting.ca \n Life events \n Buying a home \n Death & dying \n Getting an education \n Getting divorced \n Getting married \n Growing older \n Having a baby \n Inheriting money \n Living your retirement \n New to Canada \n Planning for retirement \n Planning your future \n Raising a family \n Protect your money \n Investor alerts & warnings \n Fraud \n Protecting against fraud \n Reporting fraud \n Investor protection \n Regulation in Canada \n Checking registration \n Making a complaint \n CrowdfundOntario.ca \n InvestmentReporting.ca \n OSC in the Community \n Calculators & tools \n Calculators \n Compound Interest \n Investment Recovery \n Mutual Fund Fee \n Net Worth \n Pay Down Debt or Invest \n Pay Off Credit Cards & Debt \n Portfolio Benchmark \n RESP Savings \n RRSP Savings \n TFSA \n Tools \n Cranial Cash Clash \n Fund Facts : Interactive Sample \n Love And Money \n Risk Profile Quiz \n The Canadian Money State of Mind Risk Survey 2014 \n Investment Policy Statement \n Interactive Investing Chart \n Worksheets \n Resources \n Publications \n Investor News \n Research & reports \n Glossary \n Fact Cards \n Videos \n Infographics \n Brochures \n OSC in the Community \n CrowdfundOntario.ca \n InvestingIntroduction.ca \n InvestmentReporting.ca \n Re: Investing \n Home  >  Accessibility policy \n Accessibility policy \n Accessibility at the Ontario Securities Commission \n The  Ontario Securities Commission Ontario Securities Commission  An independent Crown corporation that is responsible for regulating the capital markets in Ontario. Its mandate is to provide protection to investors from unfair, improper or fraudulent practices and to foster confidence in fair and efficient capital markets. + read full definition  ( OSC OSC  See Ontario Securities Commission. + read full definition ) is committed to providing services that are accessible and inclusive of individuals with disabilities to fulfill our obligations under the Accessibility for Ontarians with Disabilities Act, 2005 (AODA) and our policies with respect to the specific accessibility standards that have been developed. The OSC is also committed to providing you with contact information to make inquiries, or provide feedback, with respect to accessibility at the OSC. \n Accessibility for all Ontarians \n The AODA became law on June 13, 2005 (Legislation). Under this Legislation, the Government of Ontario developed mandatory accessibility standards to identify, break down, and prevent barriers, and increase accessibility, for individuals with disabilities. The mandatory accessibility standards cover customer service, information and communications, employment, transportation and the design of public spaces. \n These accessibility standards were phased in across the public and private sectors according to a specific timetable. For the OSC, among other designated public service organizations, the customer service standard came into force on January 1, 2010 and set out specific requirements for the provision of goods and services to individuals with disabilities (Customer Service Standard). Mandatory standards for information and communications (Information and Communications Standard), employment (Employment Standard) and transportation (Transportation Standard) were combined into an integrated accessibility standard and implemented, on a phased-in basis, on July 1, 2011 (Integrated Accessibility Standard). Finally, the Integrated Accessibility Standard was amended on December 12, 2012 to include standards for the design of public spaces (Design of Public Spaces Standard), which, for the OSC and other designated public sector organizations, became effective on January 1, 2016, where additional standards for accessibility in the built environment will be addressed at a later date under the Building Code Act, 1992 (Building Code). \n Our Commitment \n At all times, the OSC strives to provide access to services, information, employment opportunities, and our premises in a manner that respects the dignity and independence of individuals with disabilities. \n What we are doing to make the OSC accessible \n Policies and Planning \nThe OSC has developed a Customer Service Policy that sets out our obligations in providing services to individuals with disabilities in an accessible manner. The OSC is currently developing policies to address the Information and Communications, Employment, and the Design of Public Spaces Standards, in accordance with the Integrated Accessibility Standard. The OSC will monitor and update all of its accessibility policies on an ongoing basis to promote compliance with our AODA obligations. \n Employment Practices \nAll staff members are employees of the OSC. As an employer of choice, the OSC strives to meet and exceed the requirements of the AODA by ensuring an inclusive, barrier-free, accessible workplace that enables each employee to contribute and perform to their full potential on a day to day basis. The OSC develops its employment policies and practices through an accessibility lens with an objective of achieving a maximum level of engagement and contribution from each OSC employee. Further, the OSC is committed to ensuring an inclusive, barrier-free, accessible recruitment process so that all individuals with disabilities who are interested in pursuing, and who apply for, employment with the OSC are made aware of the accommodation measures available to them throughout the recruitment and hiring process, as well as during employment. \n Training \nThe OSC continues to ensure its staff members are trained on their obligations under the Customer Service Standard, generally, and the Integrated Accessibility Standard in respect of information and communications, employment, transportation and the built environment. \n Communications \nThe OSC will communicate on an ongoing basis, both internally and externally, our commitment to inclusivity and accessibility. We will communicate with individuals with disabilities in a manner that takes into account their disability, including through the use of accessible formats and communication supports, as necessary. \nWe will solicit and respond to feedback with respect to the OSC’s accessibility policies, practices, and procedures. The OSC will report, as required, on its compliance with AODA and with the Customer Service Standard. For more details with respect to our specific commitments, please see the following documents:\n Customer Service Policy \n Employment Policies of the OSC \n Information and Communications Policy (including Web Accessibility Policy) \n Built Environment \nThe OSC’s office, which is not open to the public, is within the leased premises of the OSC. Through recent renovations, the OSC has endeavoured to remove barriers to accessibility within its location (20 Queen Street West, 20th Floor reception, Toronto) and has encouraged its landlord to address building common areas. The following work has been completed in the building common areas:\n Automatic door openers have been installed at both the street and the mall entrances to our building. \n The lobby has wheelchair elevators/lifts at both the street and the mall entrances to the building. Assistance in using these devices is immediately available by pressing the contact button located at the lifts. \n Elevator surrounds have raised lettering and Braille signage to indicate floor numbers. \n Elevator interiors have raised numeric pads for floor selections. \n Audio notification is provided at each elevator lobby to indicate elevator direction (one ring tone for up, two ring tones for down). \n The OSC will comply with the requirements of the Design of Public Spaces Standard and will incorporate any changes to the built environment required under the Building Code. \n Questions and Feedback \n Contact us  if you have a question or want to provide feedback concerning accessibility at the OSC. We are committed to providing accessibility and welcome your feedback. \n Last updated  June 9, 2017   \n Connect With Us \n   Visit our Facebook page \n   Visit our Twitter page \n About us \n Contact us \n Investor News \n Media \n Multilingual \n Glossary \n OSC in the Community \n OSC Website \n Terms of use \n Privacy Policy \n Accessibility policy \n Connect With Us \n   Visit our Facebook page \n   Visit our Twitter page \n Sign Up For Investor News \n Stay informed about the latest investor initiatives, educational resources and investor warnings and alerts. \n Sign Up \n View past issues \n © Ontario Securities Commission 2017 \n Share on Facebook \n Share on Twitter \n Share by Email \n Print Article \n Share on social \n Ask us an investing question \n Social Sharing \n Close Investing Link \n Share on Facebook \n Share on Twitter \n Share by Email"}