{"url": "https://en.wikipedia.org/wiki/Ryanair", "content": "Ryanair - Wikipedia \n Ryanair   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Not to be confused with  Ryan Air Services  or  Rayani Air . For other similarly named air carriers, see  Ryan Airlines . \n Ryanair \n IATA \n ICAO \n Callsign \n FR \n RYR \n RYANAIR \n Founded \n 28 November 1984 [1] \n Commenced operations \n 8 July 1985 \n Operating bases \n List of bases \n Alghero \n Alicante \n Athens \n Barcelona \n Bari \n Belfast \n Bergamo \n Berlin-Schönefeld \n Birmingham \n Bologna \n Bournemouth \n Bratislava \n Bremen \n Brindisi \n Bristol \n Brussels \n Bucharest \n Budapest \n Burgas  (from March 2018) \n Cagliari \n Catania \n Chania \n Charleroi \n Cologne Bonn \n Corfu \n Cork \n Dublin   (Headquarters) \n East Midlands \n Edinburgh \n Eindhoven \n Faro \n Fes \n Frankfurt \n Gdańsk \n Girona \n Glasgow \n Gothenburg-Landvetter \n Gran Canaria \n Hahn \n Ibiza \n Karlsruhe/Baden-Baden \n Kaunas \n Kraków \n Lamezia Terme \n Lanzarote \n Leeds/Bradford \n Lisbon \n Liverpool \n London-Luton \n London-Stansted   (Largest base) \n Madrid \n Málaga \n Malta \n Manchester \n Marrakesh \n Memmingen \n Milan–Malpensa \n Naples \n Nuremberg \n Palermo \n Palma de Mallorca \n Paphos \n Pisa \n Ponta Delgada \n Poznań \n Porto \n Prague \n Prestwick \n Rome-Ciampino \n Rome-Fiumicino \n Seville \n Santiago de Compostela \n Shannon \n Sofia \n Stockholm-Skavsta \n Thessaloniki \n Tenerife-South \n Timișoara \n Trapani \n Valencia \n Vilnius \n Warsaw Modlin \n Weeze \n Wrocław \n Zadar \n Fleet size \n 420 \n Destinations \n 205 \n Company slogan \n Low Fares Made Simple \n 30 Years of Low Fares \n Always Getting Better \n Headquarters \n Dublin Airport ,  Ireland \n Key people \n David Bonderman   (Non-Executive Chairman) \n Michael O'Leary   (CEO) \n Revenue \n  €6.536 billion  (2016) \n Operating income \n  €1.663 billion  (2016) \n Net income \n  €1.559 billion  (2016) \n Total assets \n  €12.218 billion  (2016) \n Total equity \n  €4.035 billion  (2015) \n Employees \n 11,458  (2016) [2] \n Website \n www .ryanair .com \nCounter of Ryanair in Glasgow \n Ryanair Ltd.  (/raɪə'ner/) [3]  is an  Irish   low-cost airline  founded in 1984, headquartered in  Swords ,  Dublin , Ireland, with its primary operational bases at  Dublin  and  London Stansted  airports. In 2016, Ryanair was the largest European airline by scheduled passengers flown, and carried more international passengers than any other airline. [4]  ( ISEQ :  RY4C ,  LSE :  RYA ,  NASDAQ :  RYAAY ) \n Ryanair operates 403  Boeing 737-800  aircraft, with a single 737-700 used primarily as a charter aircraft, but also as a backup plane and for pilot training. [5]  The airline has been characterised by its rapid expansion, a result of the  deregulation  of the  aviation industry  in Europe in 1997 and the success of its low-cost business model. Ryanair's route network serves 34 countries in Europe, Africa (Morocco), and the Middle East (Israel). [6] \n Contents \n 1   History \n 1.1   Early years \n 1.2   1992–2009 \n 1.3   2010s \n 2   Corporate affairs \n 2.1   Business trends \n 3   Criticism \n 3.1   Employment relations \n 3.2   Ancillary revenue and in-flight service \n 3.3   No-frills \n 3.4   Customer service \n 3.4.1   Improved customer service and attracting families \n 3.4.2   Flight cancellations September and October 2017 \n 3.5   Publicity \n 3.5.1   Controversial advertising \n 3.5.2   Misleading advertising \n 3.6   Criticism of surcharges \n 3.7   Fuel incidents \n 4   Competitors \n 5   Destinations \n 5.1   Choosing destinations \n 5.2   Outside Europe \n 6   Fleet \n 6.1   Current fleet \n 6.2   Former fleet \n 6.3   Fleet development \n 7   Accidents and incidents \n 8   See also \n 9   Notes \n 10   References \n 11   Further reading \n 12   External links \n History [ edit ] \n ATR-42  in 1991 \n Since its establishment in 1984, [1]  Ryanair has grown from a small airline flying the short journey from  Waterford  to London into Europe's largest carrier. Ryanair now has over 11,000 people working for the company, most of whom are employed and contracted by multiple agencies to fly on Ryanair aircraft, or, as is the case for pilots, the vast majority are either agency employed or self-employed and their services are contracted to Ryanair. After the rapidly growing airline went public in 1997, the money raised was used to expand the airline into a pan-European carrier.  Revenues  have risen from €231 million in 1998, to €1,843 million in 2003 and €3,013 million in 2010. Similarly net profits have increased from €48 million to €339 million over the same period. [7] \n Early years [ edit ] \n Ryanair was founded in 1984 as \"Danren Enterprises\" [1]  by Christopher Ryan, Liam Lonergan (owner of Irish travel agent Club Travel) and Irish businessman  Tony Ryan  (after whom the company is named), founder of  Guinness Peat Aviation . [8]  The airline was shortly thereafter renamed \"Ryanair\" [1]  and began operations in 1985 with a 15-seat  Embraer Bandeirante   turboprop  aircraft, flying between  Waterford  and  Gatwick Airport [9]  with the aim of breaking the  duopoly  on London-Ireland flights at that time, held by  British Airways  and  Aer Lingus . [10] \n Embraer EMB 110 Bandeirante  in 1988 \n In 1986, the company added a second route – flying  Dublin – Luton  in direct competition with the  Aer Lingus  /  British Airways  duopoly for the first time. Under partial EU deregulation, airlines could begin new international intra-EU services, as long as at least one of the two governments gave approval (the so-called \"double-disapproval\" regime). The Irish government at the time refused its approval, to protect Aer Lingus, but Britain, under  Margaret Thatcher 's deregulating  Conservative  government, approved the service. With two routes and two planes, the fledgling airline carried 82,000 passengers in one year. [ citation needed ] \n In 1986 the directors of Ryanair took an 85% stake in  London European Airways , from 1987 this provided a connection with the Luton Ryanair service onward to Amsterdam and Brussels. [11]  In 1987, Ryan hired  Michael O'Leary  as his personal financial and tax advisor. In 1988 London European operated as Ryanair Europe and later began to operate charter services. [12] [13]  Ryanair passenger numbers continued to increase, but the airline generally ran at a loss and, by 1991, was in need of restructuring including the closure of Ryanair Europe/London European. O´Leary was charged with the task of making the airline profitable. O'Leary quickly decided that the key to profitability was low fares, quick turn-around times for aircraft, \" no frills \" and no business class, as well as operating a single model of aircraft. [14]  In 1989, a  Short Sandringham  was operated with Ryanair sponsorship titles but never flew revenue-generating services for the airline. [15] \n O'Leary returned from a visit to  Southwest Airlines  convinced that Ryanair could make huge inroads into the European air market, at that time dominated by national carriers, which were subsidised to various degrees by their parent countries. He competed with the major airlines by providing a \"no-frills\", low-cost service. Flights were scheduled into regional airports, which offered lower landing and handling charges than larger established international airports. O'Leary as Chief Executive took part in a  publicity stunt , where he helped out with baggage handling on Ryanair flights at Dublin Airport. By 1995, after the consistent pursuit of its low-cost business model, Ryanair celebrated its 10th birthday by carrying 2.25 million passengers. [16] \n 1992–2009 [ edit ] \nRyanair operated  BAC 1-11  series 500 aircraft between 1988 and 1993 \n In 1992, the  European Union 's deregulation of the air industry in Europe gave carriers from one EU country the right to operate scheduled services between other EU states and represented a major opportunity for Ryanair. [17]  After a successful flotation on the  Dublin Stock Exchange  and the  NASDAQ Stock exchanges , the airline launched services to  Stockholm ,  Sandefjord Airport, Torp  (110 km south of Oslo),  Beauvais–Tillé  and  Charleroi  near  Brussels . [18]  In 1998, flush with new capital, the airline placed a massive US$2  billion  order for 45 new  Boeing 737-800  series aircraft. [19] \n Boeing 737 -200 landing at  Bristol Airport , the type operated by the company through the 1990s and until 2005 \n Boeing 737 -800 in the old livery \n The airline launched its website in 2000, with online booking initially said to be a small and unimportant part of the software supporting the site. Increasingly the online booking contributed to the aim of cutting flight prices by selling directly to passengers and excluding the costs imposed by travel agents. Within a year, the website was handling three-quarters of all bookings. \n Ryanair launched a new base of operation in  Charleroi Airport  in 2001. Later that year, the airline ordered 155 new  737-800  aircraft from  Boeing  at what was believed to be a substantial discount, to be delivered over eight years from 2002 to 2010. [20]  Approximately 100 of these aircraft had been delivered by the end of 2005, although there were slight delays in late 2005 caused by production disruptions arising from a Boeing machinists' strike. [21] \nRyanair cabin with advertising on overhead lockers and safety cards on seatbacks \n In April 2003, Ryanair acquired its ailing competitor  Buzz  from  KLM . [22] \n During 2004, Michael O'Leary warned of a \"bloodbath\" during the winter from which only two or three low-cost airlines would emerge, the expectation being that these would be Ryanair and  EasyJet . [23]  A loss of €3.3 million in the second quarter of 2004 was the airline's first recorded loss for 15 years but the airline became profitable soon after. The  enlargement of the European Union  on 1 May 2004 opened the way to more new routes for Ryanair. [24] \n The rapid addition of new routes and new bases has enabled growth in passenger numbers and made Ryanair among the largest carriers on European routes. In August 2005, the airline claimed to have carried 20% more passengers within Europe than British Airways. [25] \n For the six months ending 30 September 2006 passenger traffic grew by more than a fifth to 22.1 million passengers and revenues rose by a third to €1.256 billion. [26] \n On 13 February 2006, Britain's  Channel 4  broadcast a documentary as part of its  Dispatches  series, \"Ryanair caught napping\". The documentary criticised Ryanair's training policies, security procedures and aircraft hygiene, and highlighted poor staff morale. Ryanair denied the allegations [27]  and claimed that promotional materials, in particular a photograph of a stewardess sleeping, had been faked by  Dispatches . [28] \n On 5 October 2006, Ryanair launched a €1.48 billion (£1 billion; $1.9 billion) bid to buy fellow Irish carrier  Aer Lingus . Ryanair CEO Michael O'Leary said the move was a \"unique opportunity\" to form an Irish airline. The new airline would carry over 50 million passengers a year. [29]  On 2 October 2006, Aer Lingus rejected Ryanair's takeover bid, saying it was contradictory. [30] \n In August 2006, the company started charging passengers to check in at the airport, therefore reversing its policy of paying for online check-in. It says that by cutting airport check-in, it reduces overhead costs. [31] \n Ryanair's CEO, Michael O'Leary, stated in April 2007 that Ryanair planned to launch a new  long-haul  airline around 2009. [32]  The new airline would be separate from Ryanair and operate under a different branding. It would offer both low cost with fares starting at €10.00 and a business class service which would be much more expensive, intended to rival airlines like  Virgin Atlantic . The new airline would operate from Ryanair's existing bases in Europe, to approximately six new bases in the United States. The new American bases will not be main bases such as New York's  JFK airport , but smaller airports located outside major cities. Since the Boeing 787 was sold out of production until at least 2012, and the Airbus A350 XWB will not enter service until 2014, this has contributed a delay to the airline's launch. It is said that the name of the new airline will be RyanAtlantic and it will sell tickets through the Ryanair website under an alliance agreement. [33]  In February 2010, O'Leary said the launch would be delayed until 2014, at the earliest, because of the shortage of suitable, cheap aircraft. [34] [35] \n In October 2008, Ryanair withdrew operations from a base in Europe for the first time when it closed its base in Valencia, Spain. [36]  Ryanair estimated the closure cost 750 jobs. [37] \n On 1 December 2008, Ryanair launched a second takeover bid of Aer Lingus, offering an all-cash offer of €748 million ( £ 619 mil; US$950 million). The offer was a 28% premium on the value of Aer Lingus stock, during the preceding 30 days. Ryanair said, \"Aer Lingus, as a small, stand alone, regional airline, has been marginalised and bypassed, as most other EU flag carriers consolidate.\" The two airlines would operate separately. Ryanair stated they would double the Aer Lingus short-haul fleet from 33 to 66 and create 1,000 new jobs. [38] [39] [40]  The Aer Lingus board rejected the offer and advised its  shareholders  to take no action. [41]  On 22 January 2009, Ryanair walked away from the Aer Lingus takeover bid after it was rejected by the Irish government on the grounds it undervalued the airline and would harm competition. [42]  However, Ryanair retained a stake in Aer Lingus; in October 2010, competition regulators in the UK opened an enquiry, due to concerns that Ryanair's stake may lead to a reduction in competition. [43] \n In 2009, Ryanair announced that it was in talks with Boeing and  Airbus  about an order that could include up to 200 aircraft. Even though Ryanair had dealt with Boeing aircraft up to that point, Michael O'Leary said he would buy Airbus aircraft if they offered a better deal. However, Airbus Chief Commercial Officer  John Leahy  denied in February 2009 that any negotiations were taking place. [44] \n On 21 February 2009, Ryanair confirmed they were planning to close all  check-in desks  by the start of 2010. Michael O'Leary, Ryanair's chief executive, said passengers will be able to leave their luggage at a bag drop, but everything else will be done on line. This became reality in October 2009. [45] \n In June 2009, Ryanair reported their first annual loss, with a loss posted of €169 million for the financial year ending 31 March. [46] \n In November 2009, Ryanair announced that negotiations with Boeing had proceeded poorly and that Ryanair was thinking of stopping the negotiations, then put at 200 aircraft for delivery between 2013 and 2016, and simply returning cash to shareholders. [47]  Boeing's competitor Airbus was mentioned again as an alternative vendor for Ryanair, but both Michael O'Leary and Airbus CCO John Leahy dismissed this. [48]  In December 2009, Ryanair confirmed that negotiations with Boeing had indeed failed. Plans were to take all 112 aircraft already on order at that point, with the last deliveries occurring in 2012, for a total fleet of over 300. Ryanair confirmed that an agreement had been met on price, but it had failed to agree on conditions, as Ryanair had wanted to carry forward certain conditions from its previous contract. [49] \n 2010s [ edit ] \nRyanair aircraft landing, 2016 \nA  Boeing 737-800  at  Moss Airport, Rygge \n As of February 2010 [update] , Ryanair had an average fare of €32. Ryanair stood by the fact that its average fare was less than half than that of competitor EasyJet's of €66. \n In April 2010, after  a week of flight disruption  in Europe caused by the  2010 eruptions of Eyjafjallajökull  in Iceland, Ryanair decided to end refusals to comply with EU regulations which stated they were obliged to reimburse stranded passengers. [50]  In a company statement released on 22 April 2010, Ryanair described the regulations as 'unfair'. On 29 April 2010, Ryanair cancelled of all of its routes from  Budapest Liszt Ferenc Airport  after talks about decreasing taxes with the airport's management failed. The airport is the only one serving  Budapest , so the airline is not able to operate from an alternative lower-cost airport in the surroundings. \n In June 2010, Ryanair called for a scrapping of the Irish government's tourist tax, implying it was destroying Irish tourism. [51] \n In August 2010, Ryanair held a press conference in  Plovdiv  and announced its first ever Bulgarian destination connecting Plovdiv with London Stansted. The service was planned to start in November 2010 with two flights weekly. [52] \n In late 2010, Ryanair began withdrawing all their routes from their smallest base, Belfast City, and Shannon due to rises in airport fees. [53] \n In the last three months of 2010, Ryanair made a loss of €10.3 million, compared with a loss of €10.9 million in the same period the previous year. In this time, more than 3,000 flights were cancelled. Ryanair blamed the losses on strikes and flight cancellations due to severe weather. [54] \n In March 2011, Ryanair opened a new maintenance hangar at Glasgow Prestwick International Airport, making it Ryanair's biggest fleet maintenance base. \n In June 2011, Ryanair and  COMAC  signed an agreement to co-operate on the development of the  C-919 , a  Boeing 737  competitor. [55] \n Ryanair cut capacity by grounding 80 aircraft between November 2011 and April 2012 due to the high cost of fuel and continuing weak economic conditions. [56] \n On 19 June 2012, Ryanair Chief Executive Michael O'Leary announced his intentions to make an all-cash offer to buy Aer Lingus. However, the bid is likely to face a stiff challenge from the European Commission, which blocked an earlier 2007 bid. The combined companies would control 80% of the 370,000 journeys between the UK and Ireland every month. The Irish government said it was looking to sell its 25% stake in Aer Lingus; however, it was made clear that they would not sell their share to Ryanair due to competition concerns. Michael O'Leary pledged that he would keep the two airlines separate and competitive to one another. In 2015, IAG purchased Ryanair's shareholding in Aer Lingus, ending Ryanair's attempts to buy its oldest competitor. \n On 25 October 2013, Ryanair unveiled what it called a series of \"customer service improvements\" over the next six months. These included lower fees for reprinting boarding passes, free changes of minor errors on bookings within 24 hours, and a second small carry on bag. Ryanair said it was making these changes due to customer feedback. [57] \n On 27 January 2014, Ryanair moved into their new €20m, 100,000 sq ft Dublin Head Office in Airside Business Park, having outgrown their previous office based within Dublin Airport. [58]  The building was officially opened on Thursday 3 April 2014 by Taoiseach  Enda Kenny , Minister for Finance  Michael Noonan  and the  Lord Mayor of Dublin   Oisin Quinn . \n On 8 September 2014, Ryanair agreed to purchase up to 200  Boeing 737 MAX 8s  (100 confirmed and 100 options) for over $22 billion. [59] \n The airline confirmed plans to open an operating base at  Milan Malpensa Airport  from December 2015, initially with one aircraft. [60] \n On 9 March 2016, Ryanair launched a corporate jet charter service, offering a Boeing 737-700 for corporate or group hire. [61] [62] \n In November 2016, Ryanair launched new package holiday service named Ryanair Holidays. The new service will offer flights, accommodation and transfer package deals. The service has been launched in  Ireland ,  United Kingdom  and  Germany , with other markets to follow next year. [63]  Ryanair has partnered with Spain-based tour operator, Logitravel, and accommodation provider, World2Meet, to create Ryanair Holidays. [64]  In early February 2017, Ryanair suspended their Ryanair Holidays service, stating that one of their software providers breached contract conditions. It is thought Ryanair are currently looking for a new software provider to resume selling package holidays.  [65] \n In April 2017, Ryanair started issuing tickets with connected flights, meaning in case of missed connection the customer will be rebooked without extra cost and compensated according to the  EU Flight Compensation Regulation . To begin with, such tickets were issued only with connection at Rome-Fiumicino airport, but will be extended to more airports. [66]   [67] \n Plans are underway to add 50 new aircraft to Ryanair's fleet every year for the next five years in a strategy to reach 160 million passengers by the early 2020s, up from 120 million passengers today.  [68] \n Corporate affairs [ edit ] \n As of 2014 [update]  the head office of Ryanair has been in the Airside Business Park in  Swords ,  County Dublin ,  Ireland . [69]  David Daly, a developer, built the facility prior to Ryanair's 2012 purchase. [70]  The building has 100,000 square feet (9,300 m 2 ) of space, [71]  and the airline paid €11 million euros to occupy the building. John Mulligan of the  Irish Independent  wrote that \"It is thought that\" Ryanair would refurbish the building for another €9 million. [70]  At the end of 2013 the airline had scheduled to move to the new building. [71]  The airline planned to occupy half of the building space and to sublease the other half. [72] \n As of 2004, the head office had been on the property of  Dublin Airport , in proximity to the  Aer Lingus  head office. [73]  Darley Investments built the facility in 1992. Ryanair later purchased Darley and had a 30-year lease of the head office facility from the  Department of Transport of Ireland . For twelve years, the company paid no rent even though it was supposed to pay €244,000 per year. After twelve years and prior to 2008, it paid less than half of the €244,000. [70] \n Business trends [ edit ] \n As of 2016, the key trends for Ryanair since 2010 are shown below (as at year ending 31 March): [74] [75] \n 2010 \n 2011 \n 2012 \n 2013 \n 2014 \n 2015 \n 2016 \n Total operating revenue ( €m ) \n 2,988.1 \n 3,629.5 \n 4,390.2 \n 4,884.0 \n 5,036.7 \n 5,654.0 \n 6,536 \n Operating income (€m) \n 402.1 \n 488.2 \n 683.2 \n 718.2 \n 658.6 \n 1,042.9 \n Profit before taxation (€m) \n 341.0 \n 420.9 \n 633.0 \n 650.9 \n 591.4 \n 982.4 \n Profit after taxation (€m) \n 305.3 \n 374.6 \n 560.4 \n 569.3 \n 522.8 \n 866.7 \n 1,242 \n Number of employees (average) \n 7,032 [76] \n 8,063 [76] \n 8,438 \n 9,059 \n 9,501 \n TBA \n Revenue passengers booked (m) \n 66.5 \n 72.1 \n 75.8 \n 79.3 \n 81.7 \n 90.6 \n 106.4 \n Booked passenger load factor (%) \n 82 \n 83 \n 82 \n 82 \n 83 \n 88 \n Year end aircraft fleet \n 272 [76] \n 294 [76] \n 305 \n 297 \n 308 \n Criticism [ edit ] \nFormer Ryanair Headquarters in Dublin Airport \nBoeing 737-200 in 2003 \n Employment relations [ edit ] \n In the early years, when Ryanair had a total of 450 employees who each had shares in the company, there was an agreement that staff would not join a union on the basis that they would have influence on how the company was run. [77]  The treatment of employees has changed considerably since then and new employees no longer get shares in the company. However, Ryanair still refuses to recognise or negotiate with any union, be it for pilots or for cabin crew. In 2011, a former Ryanair captain was awarded financial compensation by an employment tribunal in London after being fired for handing out a union form to a cabin crew member while on duty. [78]  In 2012 the Ryanair Pilot Group (RPG) was formed, but to date has not been successful in its aim to represent the pilots flying for Ryanair as a collective bargaining unit. [ citation needed ] \n Ryanair faced criticism for allegedly forcing pilots to pay tens of thousands of euro for training, then establish  limited companies  in Ireland and work for Ryanair through an agency, [79]  as well as forcing ground staff in Spain to open bank accounts in  Gibraltar  in which to receive their wages. [80] \n In May 2014, Ryanair's office in Marseille was raided by French police investigating complaints that the company was failing to follow French employment law. Ryanair protested about the raid. [81] \n In May 2015, the Mayor of Copenhagen announced a boycott of Ryanair. This came in the wake of protests from Danish unions regarding employment conditions. [82]  After a court trial confirmed the unions' right to  strike , Ryanair moved its bases out of Denmark. [83] \n Ancillary revenue and in-flight service [ edit ] \n Twenty percent of Ryanair's revenue is generated from  ancillary revenue ; that is, income from sources other than ticket fares. In 2009, ancillary revenue was at €598 million, compared to a total revenue of €2,942 million. [84] \n Ryanair has been described by the consumer magazine  Holiday Which?  as being the worst offender for charging for optional extras. [85]  As part of the low-cost business model, the airline charges fees, which can be related to alternative services such as using airport check-in facilities instead of the online service fee and paying by credit card. It also charges for extra services like checked-in luggage and it offers food and drinks for purchase as part of a  buy on board  programme. [86] \n In 2009, Ryanair abolished airport check-in and replaced it with a fast bag drop for those passengers checking in bags. [87]  The option of checking in at the airport for €10 has been discontinued, and all passengers are required to check in online and print their own boarding pass. Passengers arriving at the airport without a pre-printed online check-in will have to pay €45/£45 for their boarding pass to be re-issued, whilst customers unable to check in luggage online are asked to pay a fee which varies depending on where they are traveling to at the airport (as of June 2012). Ryanair faced criticism over the ambiguous nature of these changes. [88] [89] \n No-frills [ edit ] \n New Ryanair aircraft have been delivered with non-reclining seats, no seat-back pockets, safety cards stuck on the back of the seats, and life jackets stowed overhead rather than under the seat. This allows the airline to save on aircraft costs and enables faster cleaning and security checks during the short turnaround times. [90]  It was reported in various media that Ryanair wanted to order their aircraft without window shades, [90]  but the new aircraft do have them, as it is required by the regulations of the  Irish Aviation Authority . [ citation needed ] \n Other proposed measures to reduce frills further have included eliminating two toilets to add six more seats, [91]  redesigning the aircraft to allow  standing passengers  travelling in \" vertical seats \", charging passengers for using the toilet, [92]  charging extra for overweight passengers, [93]  and asking passengers to carry their checked-in luggage to the plane. [94] \n Customer service [ edit ] \n Ryanair has been criticised for many aspects of its customer service.  The Economist  wrote that Ryanair's \"cavalier treatment of passengers\" had given Ryanair \"a deserved reputation for nastiness\" and that the airline \"has become a byword for appalling customer service ... and jeering rudeness towards anyone or anything that gets in its way\". [95] \nRyanair's old logo, used from 2001 to 2013 \nRyanair's previous logo used from November 2013 to July 2015, where a new logo with a white background was introduced. This logo was first revealed in January 2010. \n In 2002, the High Court in Dublin awarded Jane O'Keefe €67,500 damages and her costs after Ryanair reneged on a free travel prize she was awarded for being the airline's 1 millionth passenger. [96] [97] \n The airline has come under heavy criticism for its poor treatment of disabled passengers. In 2002, it refused to provide  wheelchairs  for disabled passengers at London Stansted Airport, greatly angering disabled rights groups. [98]  The airline argued that this provision was the responsibility of the airport authority, stating that wheelchairs were provided by 80 of the 84 Ryanair destination airports, [99]  at that time. A court ruling in 2004 judged that the responsibility should be shared by the airline and the airport owners; [100]  Ryanair responded by adding a surcharge of £0.50 to all its flight prices. In July 2012, a 69-year-old woman, Frances Duff, who has a  colostomy , was refused permission to bring her medical kit on board, despite having a letter from her doctor explaining the need for her to carry this with her, and was asked by Ryanair boarding staff to lift up her shirt in front of fellow passengers, to prove that she had a colostomy bag. Duff had previously attempted to contact Ryanair on three occasions to inquire about their policy on travellers colostomy bags, but each time no one had answered the phone after half an hour. [101]  On 4 April 2011, Ryanair began adding a surcharge of €2 to its flights to cover the costs arising from compliance with EC  Regulation 261/2004 , which requires it to pay for meals and accommodation for passengers on delayed and cancelled flights. [102] \n Ryanair did not offer customers the possibility of contacting them by email or  webform , only through a premium rate phone line, by fax or by post; however it does now have a webform contact option. An  early day motion  in the British Parliament put forward in 2006 criticised Ryanair for this reason and called on the company to provide customers with a means to contact the company by email. [103]  Ryanair offers a basic rate telephone number for post-booking enquiries in the United Kingdom, which chose to omit the exemption for passenger transport services when enacting Article 21 of  Directive 2011/83/EU on Consumer Rights  under  Regulation 41 of the Consumer Contracts (Information, Cancellation and Additional Payments) Regulations 2013 . [104] \n Improved customer service and attracting families [ edit ] \n On 17 June 2014, Ryanair announced a new campaign to re-invent itself as a more  family-friendly  airline. Speaking at the company's 2014 AGM, chief executive Michael O'Leary said that the airline needed to \"stop unnecessarily pissing people off\". Ryanair says up to 20% of its 81 million customers are travelling as families and it wants to raise that figure. Kenny Jacobs, Ryanair's chief marketing officer, said: \"Families are a big deal for us. It's a group of customers that we want to get closer to\". [105]  As another step, the company launched  LiveChat  on their website to improve the quality of service and experience provided by the company. [106]  The change in the approach almost immediately had positive effect on the finances of the company. [107] \n Flight cancellations September and October 2017 [ edit ] \n Ryanair was subject to widespread criticism [108] [109] [110] [111] [112]  after it announced that it would be cancelling between 40 and 50 flights per day (about 2% of total daily flights) during September and October of 2017. Flights were cancelled with very little notice, sometimes only hours before departure. People who had already taken outbound flights were left with no flight home. Ryanair said that the cancellations aimed \"to improve its system-wide punctuality\" [113]  which had dropped significantly in the first two weeks of September, which the airline attributed to \"ATC capacity delays and strikes, weather disruptions and the impact of increased holiday allocations to pilots and cabin crew\". [113]  In subsequent statements, Ryanair acknowledged that it had \"messed up\" holiday schedules for pilots, including a change to the calendar year for how vacations were calculated. [114] \n Publicity [ edit ] \n Controversial advertising [ edit ] \n Ryanair's advertising and the antics of Michael O'Leary, such as causing deliberate court controversy to generate free publicity for the airline, [115]  have led to a number of complaints to the  Advertising Standards Authority  (ASA) and occasionally court action being taken against the airline. [116] [117] [118] [119] \n An example of this was the live BBC News interview on 27 February 2009 when Michael O'Leary, observing that it was \"a quiet news day\", commented that Ryanair was considering charging passengers £1 to use the toilet on their flights. The story subsequently made headlines in the media for several days and drew attention to Ryanair's announcement that it was removing check-in desks from airports and replacing them with online check-in. Eight days later O'Leary eventually admitted that it was a publicity stunt saying \"It is not likely to happen, but it makes for interesting and very cheap PR\". [120]  The concept of Ryanair charging for even this most essential of customer services was foreseen by the spoof news website \"The Mardale Times\" some five months previously, in their article \"Ryanair announce new 'Pay-Per-Poo' service\". [121] \n'bye bye Latehansa' (referring to  Lufthansa ) is one of Ryanair's Boeing 737-800s, taken at  Girona-Costa Brava Airport , Spain. (2008) \n Ryanair often use their advertising to make direct comparisons and attack their competitors. One of their advertisements used a picture of the  Manneken Pis , a famous Belgian statue of a urinating child, with the words: \"Pissed off with  Sabena 's high fares? Low fares have arrived in Belgium.\" Sabena sued and the court ruled that the advertisements were misleading and offensive. Ryanair was ordered to discontinue the advertisements immediately or face fines. Ryanair was also obliged to publish an apology and publish the court decision on their website. Ryanair used the apologies for further advertising, primarily for further price comparisons. [116] \n Another provocative ad campaign headlined \"Expensive Bastards!\" compared Ryanair with  British Airways . As with Sabena, British Airways disagreed with the accompanying price comparisons and brought legal action against Ryanair. However, in this case the High Court sided with Ryanair and threw BA's case out ordering BA to make a payment towards Ryanair's court costs. The judge ruled \"The complaint amounts to this: that Ryanair exaggerated in suggesting BA is five times more expensive because BA is only three times more expensive.\" [122] \n In 2007, Ryanair used an advertisement for its new  Belfast  route which showed  Sinn Féin 's  Martin McGuinness  ( Northern Ireland deputy First Minister  and a former senior commander of the  IRA ) standing alongside party president  Gerry Adams  with a speech bubble which said \"Ryanair fares are so low even the British Army flew home\". [123] [124] [125]  Ulster Unionists reacted angrily to the advertisement, while the Advertising Standards Authority said it did not believe the ad would cause widespread offence. [126] \n An advertisement depicting a model dressed as a schoolgirl was accompanied by the words \"Hottest back to school fares\". Ryanair ran the advertisement in two Scottish and one UK-wide newspaper. After receiving 13 complaints, the advertisement was widely reported by national newspapers. The Advertising Standards Authority (ASA) instructed them to withdraw the advert in the United Kingdom, saying that it \"appeared to link teenage girls with sexually provocative behaviour and was irresponsible and likely to cause serious or widespread offence\". Ryanair said that they would \"not be withdrawing this ad\" and would \"not provide the ASA with any of the undertakings they seek\", on the basis that they found it absurd that \"a picture of a fully clothed model is now claimed to cause 'serious or widespread offence', when many of the UK's leading daily newspapers regularly run pictures of topless or partially dressed females without causing any serious or widespread offence\". [127] \n The airline has proposed the introduction of pay-per-view  pornography  on its flights, CEO Michael O'Leary revealed to British newspaper The Sun. O'Leary likened the service to those commonly provided in hotels, saying \"hotels around the world have it, so why wouldn't we?\" [128] \n Misleading advertising [ edit ] \n Although it usually does not serve the primary airport of major European cities, Ryanair has been criticised for placing the names of famous cities on distant secondary airports that were not built for tourist traffic and lacked transit links to the main city. Examples include \" Paris Beauvais \" (which is not in the same region as Paris), \" Brussels South \" (which is actually in the city of  Charleroi ), \" Milan Bergamo \" and \" Barcelona Reus \" (which is over 90 minutes by car from Barcelona).  Frommers  has dubbed Ryanair the \"ultimate bait-and-switch airline\" for this deceptive practice. [129] \n Ryanair was ordered by the ASA to stop claiming that its flights from London to Brussels are faster than the rail connection  Eurostar , on the grounds that the claim was misleading, due to required travel times to the airports mentioned. Ryanair stood by its claims, noting that their flight is shorter than the train trip and that travel time is also required to reach Eurostar's stations. [130] [131] \n In April 2008, Ryanair faced a probe by the UK  Office of Fair Trading , after a string of complaints about its adverts. It was found to have breached advertising rules seven times in two years. ASA's director general Christopher Graham commented that formal referrals to the OFT were rare, the last occurring in 2005. He added that the ASA \"would prefer to work with advertisers within the self-regulatory system rather than call in a statutory body, but Ryanair's approach has left us with no option\". Ryanair countered with the claim that the ASA had \"demonstrated a repeated lack of independence, impartiality and fairness\". [132] \n In July 2009, Ryanair took a number of steps to \"increase the clarity and transparency of its website and other advertising\" after reaching an agreement with the OFT. The airline's website now includes a statement that \"fares don't include optional fees/charges\" and they now include a table of fees to make fare comparisons easier. [133] \n In July 2010, Ryanair once again found itself in controversy regarding alleged misleading advertising. Ryanair circulated advertisements in two newspapers offering £10 one-way fares to European destinations. Following a complaint from rival carrier EasyJet, the ASA ruled the offer was \"likely to mislead\". [134]  Ryanair made no comment on the claim but did hit back at EasyJet, claiming they cared about details in this regard but did not themselves print their on-time statistics. EasyJet denied this. [ citation needed ] \n In April 2011, Ryanair advertised 'a place in the sun destinations' but the advert was banned when it was found that some of the destinations experienced sunshine for as little as three hours per day and temperatures between 0 and 14 °C (32 and 57 °F). [135] \n In 2016, Ryanair stated that websites like  Opodo ,  CheapOair  etc. and their partners engage in  screenscraping  and false advertising, and attempted to prevent them from showing Ryanair data. [136] \n Criticism of surcharges [ edit ] \n In February 2011, a Ryanair passenger, Miro Garcia, brought a claim against Ryanair for unfair surcharges, claiming that the €40 (£30) surcharge on passengers who failed to print out a boarding card prior to arrival at the airport was unfair. Judge Barbara Cordoba, sitting in the Commercial Court in Barcelona, held that, under international air travel conventions, Ryanair can neither demand passengers turn up at the airport with their boarding pass, nor charge them €40 (£30) if they do not, and that the fines were abusive because aviation law obliges airlines to issue boarding passes. Judge Cordoba stated that: \"I declare abusive and, therefore, null, the clause in the contract by which Ryanair obliges the passenger to take a boarding pass to the airport... the customary practice over the years has been that the obligation to provide the boarding pass has always fallen on the airline\". The judge ordered a refund for Mr Garcia and said the fact the company was a low-cost carrier did \"not allow it to alter its basic contractual obligations\". [137]  Ryanair appealed the decision and the Appeals Court in Spain overturned the ruling in November 2011, holding that the surcharge is in compliance with international law. [138] \n In December 2011, Ryanair announced that they would fight against the UK Treasury's plan to ban what  Which?  magazine calls \"rip-off\" charges made when customers pay by credit card. [139]  EU legislation has already been drafted against surcharges for methods of payment. [140] \n Fuel incidents [ edit ] \n On 26 July 2012 three Ryanair aircraft inbound to  Madrid–Barajas Airport  diverted to  Valencia Airport  due to severe thunderstorms in the Madrid area. All three aircraft declared an emergency ( Mayday ) when the calculated usable fuel on landing at Valencia Airport was less than final reserve (30 minutes of flight) after having been held in the air for 50 to 69 minutes. [141]  The  Irish Aviation Authority  investigated the incidents and came to a number of conclusions, including: \n \"The aircraft in all three cases departed for Madrid with fuel in excess of Flight Plan requirements\" ; \n \"The Crew diverted to Valencia with fuel in excess of the minimum diversion fuel depicted on the Flight Plan\" ; \n \"Diverting with fuel close to minimum diversion fuel in the circumstances presented on the evening in question was likely to present challenges for the crew. Initial holding was to the Southwest of Madrid which increased the diversion time to the alternate\" ; \n \"The Crew declared an Emergency in accordance with EU-OPS when the calculated usable fuel for landing at Valencia was less than final reserve\" ; \n \"The Met conditions in Madrid were more significant than anticipated by the Crew when reviewing the Met Forecast. Consequently the additional fuel carried was influenced by the forecast\" ; \n \"Operations into a busy airport such as Madrid in Thunderstorm conditions with the associated traffic levels can add significant delays to all traffic\" ; \n \"Air Traffic Control in Valencia was under significant pressure with the number of diversions arriving in their airspace.\" [142] \n The  Irish Aviation Authority  made a number of recommendations, including that Ryanair should  \"review their fuel policy and consider issuing guidance to Crew with respect to fuel when operating into busy airports with mixed aircraft operators and types particularly in poor weather conditions when diversions are likely.\" [142]  The IAA also recommended that the  Spanish Aviation Safety and Security Agency   \"review delays into Madrid to consider if additional fuel should be recommended or required to be carried in normal operations particularly where the southerly Runways are in operation.\" [142] \n Among the causes of the incident, the  Civil Aviation Accident and Incident Investigation Commission  concludes that  \"the company's fuel savings policy, though it complies with the minimum legal requirements, tends to minimise the amount of fuel with which its aircraft operate and leaves none for contingencies below the legal minimums. This contributed to the amount of fuel used being improperly planned and to the amount of fuel onboard dropping below the required final fuel reserve.\" [143] \n In an interview with the Dutch investigative journalism programme  KRO Reporter , four anonymous Ryanair pilots claimed they are being pressured to carry as little fuel as possible on board to cut costs. [144] [145]  Ryanair and its CEO Michael O'Leary denied the allegations and sued KRO. [146] [147]  On 16 April 2014, the Dutch Court decided that  KRO  had provided sufficient evidence in two television episodes of  Mayday, Mayday  broadcast in 2012 and 2013 to back their claims in respect of Ryanair's fuel policy and \"fear culture\". It also found that Ryanair had been given a right of reply in response to the claims. The broadcast of the programmes was found to be in the public interest. Ryanair were ordered to pay the legal costs of the case. [148] \n Competitors [ edit ] \n Ryanair has several  low-cost   competitors . In 2004, approximately 60 new low-cost airlines were formed. Although traditionally a full-service airline, Aer Lingus moved to a low-fares strategy from 2002, leading to a much more intense competition with Ryanair on Irish routes. [149]  Ryanair is a member of  Airlines for Europe , having formerly been a member of the defunct  European Low Fares Airline Association . [150] [151] \n Airlines which attempt to compete directly with Ryanair are treated competitively, with Ryanair being accused by some of reducing fares to significantly undercut their competitors. In response to MyTravelLite, who started to compete with Ryanair on the Birmingham to Dublin route in 2003, Ryanair set up competing flights on some of MyTravelLite's routes until they pulled out.  Go  was another airline which attempted to offer services from Ryanair's base at Dublin to Glasgow and Edinburgh in Scotland. A fierce battle ensued, which ended with Go withdrawing its service from Dublin. [152] \n In September 2004, Ryanair's biggest competitor,  EasyJet , announced routes to the Republic of Ireland for the first time, beginning with the Cork to London Gatwick route. Until then, EasyJet had never competed directly with Ryanair on its home ground. EasyJet later withdrew its Gatwick-Cork, Gatwick-Shannon, Gatwick-Knock and Luton-Shannon routes. [153] \n In 2012, Ryanair also responded to the decision of another low-cost carrier,  Wizz Air  that planned to move its flight operations from  Warsaw Chopin Airport  in Poland to the new low-cost  Warsaw Modlin Airport  in  Nowy Dwór Mazowiecki . [154]  Ryanair had previously operated the route to Dublin from Warsaw but they withdrew claiming that the fees at Warsaw's main airport were too high. When Wizz Air began operations from Modlin Airport, Ryanair began several new routes from the same airport, most of which were identical to routes offered by Wizz Air. \n In 2008, Ryanair asked the Irish high court to investigate why it had been refused permission to fly from  Knock  to Dublin. This route was won by CityJet, which was unable to operate the service. The runner up,  Aer Arann , was then allowed to start flights, a move Ryanair criticises on the basis that not initiating an additional tender process was unlawful. [155] \n DFDS Seaways  cited competition from low-cost air services, especially Ryanair, which now flies to  Glasgow Prestwick Airport  and London Stansted Airport from  Gothenburg City Airport , as the reason for scrapping the  Newcastle – Gothenburg  ferry service in October 2006. [156]  It was the only dedicated passenger ferry service between Sweden and the United Kingdom, and had been running under various operators since the 19th century. According to research in October 2013 Ryanair was the cheapest low-cost airline in Europe in basic price without fees but was the fourth cheapest when fees were included. [157] [158] \n Destinations [ edit ] \nA Ryanair  BAC 1-11  and an  Aer Lingus  Boeing 737 at Dublin Airport, Ireland in 1993. The two airlines are the largest operators out of Dublin Airport. \n Main article:  Ryanair destinations \n Ryanair's largest base is at  London-Stansted  in the United Kingdom with 43 aircraft followed by its home base at  Dublin . [159]  Ryanair operates from 84 bases connecting 33 countries across Europe and North Africa, some of which only base a single aircraft. [160]  Several non-base airports serve more flights and/or destinations than certain base airports. \n Ryanair traditionally prefers to fly to smaller or secondary airports usually outside major cities to help the company benefit from lower landing fees and quick turn-around times to reduce costs. For example, Ryanair does not fly to the main  Düsseldorf  airport. Instead, it flies to  Weeze , 70 km from Düsseldorf. Ryanair has even referred to  Bratislava Airport  in Slovakia as \"Bratislava Vienna\", despite Vienna being 80 km (50 mi) away, across a national border. In some cases, secondary airports are not distant from the city they serve, and can in fact can be closer than the city's major airport; this is the case at  Rome-Ciampino . \n Ryanair does still serve a number of major airports, including  Amsterdam ,  Athens ,  Barcelona El Prat ,  Brussels Zaventem ,  Budapest ,  Copenhagen ,  Dublin ,  Edinburgh ,  Lisbon ,  London-Gatwick ,  Madrid Barajas ,  Manchester ,  Marseille ,  Oslo-Gardermoen  and  Rome-Fiumicino . Some of these cities do not have a viable secondary airport that Ryanair could use as an alternative. [129]  In more recent months/years, Ryanair has grown more at primary airports as it looks to attract more business passengers. For Summer 2014, the airline opened bases in Athens, Lisbon and the primary airports of Brussels and Rome for the first time. \n Ryanair flies in a  point to point model  rather than the more traditional airline  hub and spoke  model where the passengers have to change aircraft in transit at a major airport, usually being able to reach more destinations this way. [161] [162]  In April 2017 however, Ryanair announced to add more indirect flights to its portfolio, starting with a new transfer hub in  Rome -Fiumicino airport (FCO). [163]  Ryanair has 50 European bases. Despite it being an Irish airline, and having a significant presence there, it also has a significant presence in France, Germany, Italy, Poland, Spain, the United Kingdom as well as many other European countries (although the airline has no bases in France). Currently, its biggest country market is Italy, containing fourteen bases, as well as a total of nine other non-base airports. \n Ryanair's largest competitor is EasyJet which has a far greater focus on larger or primary airports such as  Amsterdam  and  Paris-Charles de Gaulle , heavily targeting business passengers. Ryanair also serves sun and beach destinations with bases in the  Canary Islands ,  Cyprus , the  Greek Islands  and  Malta  amongst others. In August 2014, the airline unveiled ambitious plans to establish a major hub in Israel to service a broad range of European routes. [164]  In December 2014 Ryanair announced plans to open its 72nd base in 2015 in the  Azores . [165] \n Top airports by destinations 2007-17 [166] \n City \n IATA \n destinations \n retention [a] \n London Stansted \n STN \n 184 \n 73% \n Dublin \n DUB \n 131 \n 69% \n Bergamo \n BGY \n 124 \n 65% \n Charleroi \n CRL \n 116 \n 70% \n Girona \n GRO \n 112 \n 35% \n Hahn \n HHN \n 103 \n 44% \n Weeze \n NRN \n 97 \n 45% \n Alicante \n ALC \n 89 \n 61% \n Madrid \n MAD \n 86 \n 57% \n Pisa \n PSA \n 86 \n 53% \n Choosing destinations [ edit ] \n When Ryanair negotiates with its airports, it demands very low landing and handling fees, as well as financial assistance with marketing and promotional campaigns. [167]  In subsequent contract renewal negotiations, the airline has been reported to play airports against each other, threatening to withdraw services and deploy the aircraft elsewhere, if the airport does not make further concessions. According to Michael O'Leary's biography \"A Life in Full Flight\", Ryanair's growing popularity and also growing bargaining power, with both airports and aircraft manufacturers, has resulted in the airline being less concerned about a market research/demographics approach to route selection to one based more on experimentation. This means they are more likely to fly their low cost planes between the lowest cost airports in anticipation that their presence alone on that route will be sufficient to create a demand which previously may not have existed, either in whole or in part. [168] \nCork Airport \n In April 2006, a failure to reach agreement on a new commercial contract resulted in Ryanair announcing that it would withdraw service on the Dublin–Cardiff route at short notice. [169]  The airport management rebutted Ryanair's assertion that airport charges were unreasonably high, claiming that the Cardiff charges were already below Ryanair's average and claimed that Ryanair had recently adopted the same negotiating approach with  Cork Airport  and London Stansted Airport. [170]  In 2009, Ryanair was reported to have adopted 'harsh' negotiating with  Shannon Airport , threatening to close 75% of its operations there from April 2010. [171]  Ryanair was forced to give up its  Rome Ciampino – Alghero  route, after the route was allocated to  Air One , as a  public service obligation  (PSO) route. The  European Commission  is investigating the actions of the Italian Government in assigning PSO routes and thus restricting competition. \n Outside Europe [ edit ] \n Ryanair has also helped with the launch of low-cost airlines:  VivaAerobús  (Mexico) and  VivaColombia  (Colombia). [172]  In 2016, it will help to develop a new low-cost airline in Costa Rica, named  VivaCan . [173] [174] [175] \n Fleet [ edit ] \n Current fleet [ edit ] \nRyanair  Boeing 737-800  departs  Bristol Airport  (2014) \n As of 30 September 2017, Ryanair's fleet consists of the following aircraft: [5] \n Ryanair Fleet \n Aircraft \n In Service \n Orders \n Passengers \n Notes \n C \n Y \n Total \n Boeing 737-700 \n 1 \n — \n 60 \n — \n 60 [176] \n In an all-business configuration as a corporate charter service, mainly for sports clubs during the winter. \nUpconverted to 149 seats in summer as a training/backup aircraft on UK-Ireland Routes. [177] \n Boeing 737-800 \n 419 \n 69 [178] \n — \n 189 \n 189 [179] \n Deliveries 2014–2018 \n Boeing 737 MAX 200 \n — \n 110 [178] [180] \n — \n 197 \n 197 [181] \n First deliveries start early 2019 [182] \n Total \n 420 \n 179 \n Former fleet [ edit ] \n Ryanair has operated the following types of aircraft in the past: [ citation needed ] \n Ryanair Past Fleet \n Aircraft \n Introduced \n Retired \n Embraer EMB 110 Bandeirante \n 1985 \n 1989 \n Hawker Siddeley HS 748 \n 1986 \n 1989 \n BAC One-Eleven \n 1987 \n 1994 \n ATR 42-300 \n 1989 \n 1991 \n Boeing 737-200 \n 1994 \n 2005 \n Boeing 737-300 \n 2003 \n 2004 \n Fleet development [ edit ] \n Ryanair claims to operate the newest, greenest, and quietest fleet of aircraft in Europe. [183] [184]  As of March 2014, the average age of the Ryanair fleet was around 5.5 years. [74]  When Boeing builds an aircraft for Ryanair, it is allocated the  customer code  AS, which appears in their aircraft designation as a suffix, such as 737-8AS. \n Ryanair's fleet reached 200 aircraft for the first time on 5 September 2009. [183] [185]  All aircraft in the Ryanair fleet have been  retrofitted  with performance enhancing  winglets  and the more recent deliveries have them fitted as standard. [186] \n The company also owns three  Learjet 45 , based at  London Stansted Airport  and  Bergamo Airport  but registered in the  Isle of Man  as M-ABEU, M-ABGV and M-ABJA, which are mainly used for the quick transportation of maintenance personnel and small aircraft parts around the network. [187] \n On 13 March 2013, Ryanair signed an order for 175 new  Boeing 737-800s  at the  Waldorf Hotel  in New York. In the same press conference,  Michael O'Leary  said Ryanair were still evaluating the possibility of the  Boeing 737 MAX , and stated their huge order in March was for the  Boeing 737 Next Generation  rather than the 737 MAX as they needed aircraft before the 737 MAX would enter service. \n On 30 April 2014, Ryanair confirmed that they have ordered 5 more aircraft to add to their fleet, 4 of them to be delivered in 2015 and the last one to be delivered in February 2016, to bring the number of aircraft on order to 180. [188] \n Ryanair also showed interest in other aircraft, including the  Comac C919 , when they signed a design agreement with Comac in 2011 to help produce a rival jet to Boeing's offerings. At the  Paris Airshow  in 2013, Michael O'Leary stated that Comac could build a larger version of the C919 aircraft that would hold up to 200 passengers. [189] \n On 8 September 2014, Ryanair made a commitment to order 100 new  Boeing 737 MAX 200s  (plus options for an additional 100) for delivery from 2019. [59] \n On 1 December 2014, the airline finalised their order for up to 200 Boeing 737 MAX 200s. The order includes 100 firm, and 100 purchase rights. This makes Ryanair the launch customer of the Boeing 737 MAX 200. [190] \n As of August 2016 around 91% of the Ryanair fleet (316 of 354 aircraft) were owned by the company, with the balance being leased. [74] \n Accidents and incidents [ edit ] \n On 10 November 2008,  Ryanair Flight 4102 , from  Frankfurt–Hahn Airport , suffered undercarriage damage in an emergency landing at  Rome–Ciampino Airport , after experiencing  bird strikes , which damaged both engines on approach. The registration number of the aircraft involved was EI-DYG. There were 6 crew members and 166 passengers on board. [191]  Two crew members and eight passengers were taken to hospital with minor injuries. [192]  The port undercarriage of the  Boeing 737-800  collapsed, [193]  leaving the aircraft stranded on the runway and closing the airport for over 35 hours. [192]  As well as damage to the engines and undercarriage, the rear fuselage was also damaged by contact with the runway. [194]  The aircraft involved was damaged beyond repair and was scrapped. [ citation needed ] \n See also [ edit ] \n Ireland portal \n Companies portal \n Aviation portal \n List of airlines \n List of companies of Ireland \n List of low-cost airlines \n Notes [ edit ] \n ^   share of routes operated in 2007-2017 still operating in 2017 \n References [ edit ] \n ^  a   b   c   d   Aldous, Richard (2013).  Tony Ryan: Ireland’s Aviator . Gill & Macmillan Ltd. p. 80.  ISBN   0717157814 .   \n ^   \"Ryanair-Annual-Report-FY16.pdf\"   (PDF) .  investor.ryanair.com .   \n ^   https://www.oxfordlearnersdictionaries.com/pronunciation/english/ryanair \n ^   O'Halloran, Barry (25 August 2016).  \"Ryanair carries more international passengers than any other airline\" .  Irish Times . Retrieved  2 April  2017 .   \n ^  a   b   \"Latest Register and Monthly Changes\" .  www.iaa.ie . Irish Aviation Authority. 30 September 2017 . Retrieved  3 October  2017 .   \n ^   \"About us\" . Ryanair.com . Retrieved  16 March  2017 .   \n ^   \"history of ryanair – Google zoeken\" . Google. 1 October 2009 . Retrieved  25 December  2011 .   \n ^   Fottrell, Quentin (6 June 2004).  \"The rise and rise of Ryanair\" . THE POST.IE. Archived from  the original  on 26 January 2005 . Retrieved  18 December  2006 .   \n ^   \"Tony Ryan Obituary\" . airlineworld.wordpress.com. 4 October 2007.   \n ^   \"RyanAir: The ' Southwest' of European Airlines | Business Strategy Case Studies|Business, Management Strategies Cases|Case Study\" . Icmrindia.org . Retrieved  25 December  2011 .   \n ^   \"LEA is back from the dead\" .  Flight International : 7. 9 May 1987 . Retrieved  4 May  2014 .   \n ^   \"World Airline Directory\" .  Flight International : 108. 26 March 1988 . Retrieved  4 May  2014 .   \n ^   \"World Airline Directory\" .  Flight International : 116. 26 March 1988 . Retrieved  4 May  2014 .   \n ^   \"RYANAIR HOLDINGS PLC (Form: 20-F, Received: 20 September 2007 11:21:19)\" . Google.brand.edgar-online.com. Archived from  the original  on 19 January 2012 . Retrieved  25 December  2011 .   \n ^   Simper, Robert (1998).  River Medway and the Swale . Lavenham: Creekside Publishing. p. 23.  ISBN   0951992775 .   \n ^   \"COMMENT: STATE AID, THE GROWTH OF LOW-COST CARRIERS IN THE EUROPEAN UNION, AND THE IMPACT OF THE 2005 GUIDELINES ON FINANCING OF AIRPORTS AND START-UP AID TO AIRLINES DEPARTIN\" . Litigation-essentials.lexisnexis.com . Retrieved  25 December  2011 .   \n ^   \"Ryanair Holdings plc – Company History\" . Fundinguniverse.com . Retrieved  25 December  2011 .   \n ^   \"Ryanair Holding plc: Consolidated Financial Statements For The Year Ended 31 March 1999\"   (PDF) . Ryanair.com . Retrieved  30 September  2012 .   \n ^   \"About Us\" . Ryanair.com . Retrieved  15 February  2013 .   \n ^   \"Ryanair in Boeing spending spree\" . BBC News. 24 January 2002 . Retrieved  23 July  2012 .   \n ^   McCaffrey, Una (9 September 2005).  \"Ryanair's new routes could face delays due to strike\" .  The Irish Times . Retrieved  2 September  2010 .   \n ^   Coyle, Dominic (29 April 2003).  \"Buzz gets go-ahead to resume flights\" .  The Irish Times . Retrieved  1 September  2010 .   \n ^   Creaton, Siobhan (6 June 2004).  \"Ryanair warns of 'bloodbath' in airline industry\" .  The Irish Times . Retrieved  1 September  2010 .   \n ^   O'Sullivan, Jane (22 June 2005).  \"Ryanair sticks to 10% growth forecast\" .  The Irish Times . Retrieved  2 September  2010 .   \n ^   \"About Us\" . Ryanair.com . Retrieved  25 December  2011 .   \n ^   Airliner World , January 2007 \n ^   \"Ryanair Statement for Channel 4 Dispatches Programme\"   (PDF) . Ryanair. 9 February 2006. Archived from  the original   (PDF)  on 27 March 2009.   \n ^   \"Dispatches misleading advertisement in media\"   (PDF) . Ryanair. 13 February 2006. Archived from  the original   (PDF)  on 21 March 2006.   \n ^   \"EU ban on Ryanair's Aer Lingus takeover 'valid ' \" .  Daily Mail . London. 6 July 2010.   \n ^   \"Aer Lingus says no as Ryanair ups stake\" . Raidió Teilifís Éireann. 5 October 2006 . Retrieved  18 December  2006 .   \n ^   \"Ryanair to charge for airport check-in\" .  Flight International . 24 August 2007.   \n ^   Boston Globe , 12 April 2007 \n ^   Black, Fergus (13 April 2007).  \"O'Leary plans new all-frills airline for flights to US\" .  Irish Independent . Retrieved  30 July  2008 .   \n ^   Riegel, Ralph (3 February 2010).  \"Ryanair wages price war on Aer Lingus in holiday market\" .  Irish Independent . Retrieved  3 February  2010 .   \n ^   Young, Kathryn M. (2 July 2012).  \"Long-haul, low-cost FlyA slated for 2013 launch | News content from\" . ATWOnline . Retrieved  27 September  2013 .   \n ^   Ryanair closes Valencia base  By Kevin Done, Aerospace Correspondent in the  Financial Times  24 October 2008 19:26 \n ^   Valencia Loses 750,000 Passengers and 750 Jobs   Archived  30 September 2009 at the  Wayback Machine ., Ryanair press release 24 October 2008 \n ^   \"Aer Lingus rejects Ryanair offer\" . BBC News. 1 December 2008.   \n ^   Michaels, Daniel; Fottrell, Quentin; Niththyananthan, Kaveri (1 December 2008).  \"Ryanair's Renewed Offer for Aer Lingus Is Rejected\" .  The Wall Street Journal .   \n ^   Aer Lingus rejects Ryanair's offer – RTÉ News . Raidió Teilifís Éireann. (1 December 2008). Retrieved 9 December 2010. \n ^   Aer Lingus rejects Ryanair takeover bid – RTÉ News . Raidió Teilifís Éireann. (1 December 2008). Retrieved 9 December 2010. \n ^   Gergely, Andras (22 January 2009).  \"UPDATE 4-Ryanair concedes defeat in Aer Lingus bid\" . Reuters.   \n ^   \"UK regulator surprises Ryanair with Aer Lingus merger probe\" . Flightglobal . Retrieved  30 September  2012 .   \n ^   Green, Ryan (5 February 2009).  \"Airbus: No Deal with Ryanair\" .  Seattle Post-Intelligencer .   \n ^   \"Ryanair to abolish check-in desks\" . BBC. 21 February 2009 . Retrieved  4 January  2010 .   \n ^   \"Ryanair reports first annual loss\" . BBC News. 2 June 2009 . Retrieved  21 January  2012 .   \n ^   \"Ryanair Threatens to End Relationship with Boeing Over Prices – Travel News\" . Asap.co.uk. 3 November 2009. Archived from  the original  on 4 February 2012 . Retrieved  25 December  2011 .   \n ^   Harrison, Pete (8 December 2009).  \"UPDATE 2-Ryanair says likely to shelve 200-plane Boeing deal\" . Reuters.   \n ^   \"News : Ryanair Confirms Boeing Negotiations Have Terminated..\"  Ryanair.com. 18 December 2009 . Retrieved  16 May  2010 .   \n ^   \"Italy fines Ryanair over volcano ash 'failings ' \" . BBC News. 15 May 2010 . Retrieved  16 May  2010 .   \n ^   Ryanair calls for end to tourist tax . InsideIreland.ie (16 June 2010). Retrieved 9 December 2010. \n ^   \"Райън еър обявяват официално стъпването си в Пловдив тази сряда\"  (in Bulgarian). plovdiv24.bg. 2 August 2010 . Retrieved  4 August  2010 .   \n ^   \"O'Leary claims Shannon 'dying on its feet' as Ryanair cuts flights by 21%\" . The Irish Examiner . Retrieved  9 October  2010 .   \n ^   \"Ryanair blames snow and strikes for third-quarter loss\" .  The Guardian . London. 31 January 2011 . Retrieved  21 January  2012 .   \n ^   \"Ryanair and Comac (Commercial Aircraft Corp. of China) Sign C 919..\"  Ryanair.com. 6 November 2006 . Retrieved  30 September  2012 .   \n ^   Odell, Mark (23 May 2011).  \"Ryanair to cut capacity for first time\" .  Financial Times . Retrieved  25 December  2011 .   \n ^   \"Ryanair Announces Customer Service Improvements Over Next 6 Months\" . Ryanair. 25 October 2013 . Retrieved  25 October  2013 .   \n ^   Ryanair Official website News Article [ permanent dead link ] \n ^  a   b   \"Boeing Launches 737 MAX 8 with Ryanair\"  (Press release). The Boeing Company. 8 September 2014 . Retrieved  10 November  2014 .   [ permanent dead link ] \n ^   \"Ryanair\".  Airliner World : 7. November 2015.   \n ^   \"Corporate Jet Hire\" .  Ryanair.com . Archived from  the original  on 14 March 2016 . Retrieved  2016-03-10 .   \n ^   \"Ryanair Corporate Jet Hire\" .  Ryanair Corporate . Retrieved  2017-02-08 .   \n ^   Emma Munbodh (1 December 2016).  \"Ryanair launch new package holiday service offering \"lowest prices\" in the industry - as airline takes on likes of Thomas Cook\" . Mirror UK . Retrieved  2 December  2016 .   \n ^   \"RYANAIR LAUNCHES \"RYANAIR HOLIDAYS\" SERVICE\" . 1 December 2016 . Retrieved  2 December  2016 .   \n ^   \"Ryanair Holidays suspended just two months after launch\" .  The Telegraph . Retrieved  2017-02-18 .   \n ^   Ryanair to Embrace Connecting Flights in Move Toward Hub Model  (published 6 April 2017 by Bloomberg) \n ^   Connecting Flights  (read 31 May 2017, published by Ryanair) \n ^   \" \" Ryanair's remarkable growth story has only just begun \" \" . The Business Report. January 2017 . Retrieved  14 July  2017 .   \n ^   \" Contact Us \" ( Archive ). Ryanair. Retrieved on 31 October 2014. Under \"Registered Address and VAT No.\" = \"Ryanair Ltd. Corporate Head Office Airside Business Park Swords Co. Dublin Ireland\" \n ^  a   b   c   Mulligan, John. \" Ryanair staff moving to new €20m HQ \" ( Archive ).  Irish Independent . 15 February 2013. Retrieved on 31 October 2014. \n ^  a   b   Post Reporter. \" Ryanair to move main Dublin office to Swords .\"  Business Post . 14 February 2013. Retrieved on 31 October 2014. \n ^   \" Ryanair spends up to €12m on HQ \" ( Archive ).  Irish Examiner . Friday 15 February 2013. Retrieved on 31 October 2014. \n ^   Lavery, Brian. \" SPOTLIGHT: Aer Lingus chief's survival guide .\"  The New York Times . Saturday 2 October 2004. Retrieved 29 February 2010. \n ^  a   b   c   \"Annual Report 2014\" .  www.ryanair.com . Ryanair. 25 July 2014. Archived from  the original  on 10 November 2014 . Retrieved  10 November  2014 .   \n ^   \"Full Year Results 2015\" .  www.ryanair.com . Ryanair. 26 May 2015 . Retrieved  26 May  2015 .   \n ^  a   b   c   d   \"Annual Report 2012\" .  www.ryanair.com . Ryanair. 27 July 2012. Archived from  the original  on 10 November 2014 . Retrieved  10 November  2014 .   \n ^   Bamber, G.J.; Gittell, J.H.; Kochan, T.A. & von Nordenflytch, A. (2009).  \"Up in the Air: How Airlines Can Improve Performance by Engaging their Employees, chapter 5\" . Cornell University Press, Ithaca.   \n ^   Mirror.co.uk  Ryanair pilot sacked for handing out union form wins compensation   Archived  23 September 2012 at the  Wayback Machine ., article. Retrieved 18 September 2012. \n ^   Mirror.co.uk  Guess which airline cuts costs by hiring freelance pilots?   Archived  23 September 2012 at the  Wayback Machine . article. Retrieved 18 September 2012. \n ^   Typically Spanish  Spanair workers reject offer of employment from Ryanair , article. Retrieved 18 September 2012. \n ^   Oltermann, Philip; Willsher, Kim (23 May 2014).  \"Ryanair lodges formal complaint after French police raid Marseilles offices\" .  The Guardian . Retrieved  23 May  2014 .   \n ^   \"Frank Jensen: Ansatte i København benytter ikke Ryanair\" .  DR . 16 May 2015 . Retrieved  17 June  2015 .   \n ^   Hall, Ole. \" Bittersweet victory to unions \"  Berlingske , 14 July 2015. \n ^   \"Ryanair's ancillary revenues grow to €598m\" . m-travel. 3 June 2009. Archived from  the original  on 14 June 2009 . Retrieved  9 June  2009 .   \n ^   Have Your Say.  \"Ryanair the 'worst offender' for extra charges on fares\" .  The Belfast Telegraph . Archived from  the original  on 9 April 2008 . Retrieved  31 October  2008 .   \n ^   \" FAQS: What snacks and drinks are available onboard?   Archived  14 November 2008 at the  Wayback Machine .\".  Ryanair . Retrieved 11 October 2008. \n ^   \"Checked Baggage Allowance\" . Ryanair.com. 6 November 2006 . Retrieved  25 December  2011 .   \n ^   News : Ryanair Moves to Web Check-In Only   Archived  5 June 2009 at the  Wayback Machine .. Ryanair. (6 November 2006). Retrieved 9 December 2010. \n ^   Smith, Oliver (6 July 2009).  \"Ryanair to improve clarity over 'hidden charges ' \" .  The Daily Telegraph . London.   \n ^  a   b   \"Ryanair 'to cut frills further ' \" . BBC News. 15 February 2004 . Retrieved  9 June  2009 .   \n ^   Osborne, Alistair (2 June 2009).  \"Ryanair's 'lose loos' strategy typifies its win, win focus on low fares\" .  The Daily Telegraph . London.   \n ^   Leach, Ben (6 July 2009).  \"Ryanair to make passengers stand\" .  The Daily Telegraph . London.   \n ^   Ryanair considers 'fat tax' for obese air passengers ,  The Daily Telegraph , 22 April 2009 \n ^   Millward, David (3 June 2009).  \"Passengers may have to load their own bags onto Ryanair flights\" .  The Daily Telegraph . London.   \n ^   \"Snarling all the way to the bank\" .  The Economist . 23 August 2007.  ISSN   0013-0613 . Retrieved  13 April  2008 .     (subscription required) \n ^   \"RTÉ News: Damages awarded to Ryanair passenger\" .  Raidió Teilifís Éireann . 19 June 2002. Archived from  the original  on 8 January 2009 . Retrieved  13 December  2008 .   \n ^   Ryanair ordered to pay damages for reneging on 'free flights' offer to millionth customer ,  The Independent , 20 June 2002 \n ^   Disability Rights Commission (21 December 2004).  \"Appeal Court rules airport and airline jointly responsible for disabled passengers\" . Archive.org. Archived from  the original  on 24 December 2004 . Retrieved  18 December  2006 .   \n ^   \"BBC.co.uk\" . BBC . Retrieved  25 December  2011 .   \n ^   Adams-Spink, Geoff (21 December 2004).  \"Wheelchair users' rights upheld\" .  BBC . Retrieved  18 December  2006 .   \n ^   69-year-old woman \"humiliated\" by Ryanair over colostomy bag ordeal   TheJournal.ie , 20 July 2012. Retrieved 13 June 2013 \n ^   \"Ryanair introducing €2 passenger levy – RTÉ News\" . Raidió Teilifís Éireann. 30 March 2011. Archived from  the original  on 23 December 2011 . Retrieved  25 December  2011 .   \n ^   \"Early Day Motions By Details\" . UK Parliament. Archived from  the original  on 26 November 2010.   \n ^   \"Where are you calling from?\" .  Ryanair . Ryanair.   \n ^   \"Ryanair Woos Families\" .  The Irish Times . Retrieved  17 June  2014 .   \n ^   \"Ryanair live chat service?\" . Ryanair . Retrieved  Aug 26,  2016 .   \n ^   Sean Farrell (Nov 2, 2015).  \"Ryanair credits 'being pleasant to customers' for profits rise\" . The Guardian . Retrieved  Aug 26,  2016 .   \n ^   \"Ryanair to cancel 40-50 flights per day for six weeks\" .  BBC News . 2017-09-16 . Retrieved  2017-09-17 .   \n ^   Katz, Bemjamin (2017-09-16).  \"Ryanair Cancels 82 Flights After It 'Messed Up' Crew's Time Off\" .  Bloomberh . Retrieved  2017-09-17 .   \n ^   \"Ryanair to cancel 40-50 flights per day for six weeks to improve punctuality and give staff leave\" .  ABC Australia . 2017-09-17 . Retrieved  2017-09-17 .   \n ^   \"Ryanair reveals Sunday's cancelled flights - including eight to and from Dublin\" .  independent.ie . 2017-09-16 . Retrieved  2017-09-17 .   \n ^   Calder, Simon (2017-09-16).  \"Around 30,000 Ryanair passengers have had their weekend travel plans wrecked by short-notice flight cancellations\" .  The Independent . Retrieved  2017-09-17 .   \n ^  a   b   \"RYANAIR TO CANCEL LESS THAN 2% OF FLIGHTS OVER NEXT 6 WEEKS TO IMPROVE PUNCTUALITY\" . 2017-09-17 . Retrieved  2017-09-17 .   \n ^   \"Ryanair cancels flights after 'messing up' pilot holidays\" . BBC News. 17 Sep 2017 . Retrieved  17 September  2017 .   \n ^   / Columnists / Lunch with the FT – Lunch with the FT: Michael O’Leary .  Financial Times . (18 December 2009). Retrieved 9 December 2010. \n ^  a   b   \"brandchannel.com | Irish Airlines| brands | branding news\" . Brandchannel.com. Archived from  the original  on 7 January 2009 . Retrieved  31 October  2008 .   \n ^   \"Ryanair advert dubbed 'offensive ' \" . BBC News. 4 February 2004 . Retrieved  18 December  2006 .   \n ^   \"New Ryanair Army advert 'crass ' \" . BBC News. 14 August 2007 . Retrieved  31 October  2008 .   \n ^   Millward, David (6 February 2008).  \"Carla Bruni awarded damages from Ryanair\" .  The Daily Telegraph . London . Retrieved  10 April  2010 .   \n ^   Sat, 7 March 2009 – Charging for toilets PR stunt, says Ryanair boss . The Irish Times (3 March 2009). Retrieved 9 December 2010. \n ^   [1]   Archived  29 March 2009 at the  Wayback Machine . \n ^   Bowers, Simon (6 December 2000).  \"Ryanair on a victory roll as judge swears advert attacking BA is honest and fair\" .  The Guardian . London.   \n ^   Ryanair fares are so low even the British army flew home . flickr.com (31 August 2007). Retrieved 3 December 2014. \n ^   \"First reaction to 'crass and offensive' Ryanair ad coming in\" . larryni.me.uk. 2007-08-14. Archived from  the original  on 2008-03-13.   \n ^   Irish Examiner – 2007/12/31: Budget advertising: How Ryanair does it on the fly . irishexaminer.com (31 December 2007). Retrieved 3 December 2014. \n ^   Ryanair escapes censure over Sinn Féin Army gag – Brand Republic News .  Brand Republic . (7 November 2007). Retrieved 9 December 2010. \n ^   \"Ryanair schoolgirl ad criticised\" . BBC News. 30 January 2008.   \n ^   Hawkes, Steve (8 November 2011).  \"Mister blue sky Ryanair's boss plans to screen porn on flights\" .  The Sun . London.   \n ^  a   b   \" \" Paris\" Beauvais Airport, France – The 10 Worst Airport Terminals Slideshow at Frommer's\" . Frommers.com . Retrieved  15 September  2012 .   \n ^   \"Channel 4 – News – Not so fast, Ryanair\" . Channel 4 . Retrieved  31 October  2008 .   \n ^   \"Ryanair's Eurostar claim banned\" . BBC News. 21 August 2007 . Retrieved  31 October  2008 .   \n ^   \"Ryanair faces probe over adverts\" . BBC News. 9 April 2008.   \n ^   Taylor, Ian (7 July 2009).  \"Travelweekly.co.uk\" . Travelweekly.co.uk . Retrieved  25 December  2011 .   \n ^   \"Ryanair reprimanded for 'misleading' advertisements\" . BBC News. 14 July 2010 . Retrieved  30 August  2010 .   \n ^   \"Ryanair's bikini advert banned by ASA\" . BBC. 27 April 2011 . Retrieved  25 December  2011 .   \n ^   \"Ryanair and Momondo fall out over links to fare screenscapers\" .  Tnooz . 23 November 2016 . Retrieved  25 November  2016 .   \n ^   Giles Tremlett (14 January 2011).  \"Judge tells Ryanair that forcing passengers to print boarding passes is illegal\" .  The Guardian . London . Retrieved  30 September  2012 .   \n ^   \"Spanish Appeal Court Rules Ryanair's Boarding Card Reissue Fee..\"  Ryanair.com. 11 October 2011 . Retrieved  30 September  2012 .   \n ^   \"Ryanair ready for the fight to keep 'excessive' card charges – More stories\" .  The Scotsman . 24 December 2011 . Retrieved  25 December  2011 .   \n ^   \"Consumer Rights: Parliament approves new EU-wide rules for on-line shopping\" . European Parliament . Retrieved  13 August  2012 .   \n ^   \"Madrid Diversions To Valencia 26 July\" . Ryanair.com. 6 November 2006 . Retrieved  15 February  2013 .   \n ^  a   b   c   \"IAA Report Weather Diversions Madrid\"   (PDF) . Irish Aviation Authority. 21 September 2012. Archived from  the original   (PDF)  on 13 April 2013.   \n ^   Report of CIAIAC IN-010/2010 \n ^   \"Mayday Mayday – International version\" . Reporter. 28 December 2012 . Retrieved  15 February  2013 .   \n ^   Kerry Mcdermott (31 December 2012).  \"Ryanair flies into new cost-cutting storm as pilots claim it 'saves money on jet fuel ' \" .  Daily Mail . London . Retrieved  15 February  2013 .   \n ^   \"Hardtalk – Ryanair's Michael O'Leary: Fuel risk claims are lies\" . BBC News. 11 October 2012 . Retrieved  15 February  2013 .   \n ^   \"Ryanair dismisses false claims from KRO REPORTER\" . Ryanair.com. 6 November 2006 . Retrieved  15 February  2013 .   \n ^   \" \" Mayday Mayday\" wins over Ryanair defamation allegations\" . Eurocockpit . Retrieved  17 April  2014 .   \n ^   \"Aer Lingus facing increasing direct competition from Ryanair in Dublin; UK and US routes account for over 40% of capacity\" . anna.aero. 3 October 2008 . Retrieved  25 December  2011 .   \n ^   \"The European Low Fares Airline Association\" . ELFAA . Retrieved  27 September  2013 .   \n ^   \"TA4E members\" . ELFAA . Retrieved  8 July  2017 .   \n ^   Quinn, Eamonn. \"No competitors for Ryanair in Dublin, says Cassani\", 30 November 2003, at  Tcm.ie   Archived  5 May 2009 at the  Wayback Machine .. Retrieved 18 December 2006. \n ^   \"EasyJet vs. Ryanair – continuous competition | AirlineProfiler\" . Airlineprofiler.eu. 13 December 2010. Archived from  the original  on 23 March 2012 . Retrieved  25 December  2011 .   \n ^   \"Low cost Wizz Air and Ryanair moving to Modlin\" . PolishGuide2012.pl. 8 February 2012. Archived from  the original  on 26 April 2012 . Retrieved  31 March  2012 .   \n ^   Mulligan, John. \"Ryanair wins judicial review of decision over Knock route\", 10 September 2008 at  Independent.ie \n ^   Savage, James. \"DFDS scraps Newcastle-Gothenburg line\", 6 September 2006, at  Thelocal.se   Archived  28 August 2007 at the  Wayback Machine .. Retrieved 18 December 2006. \n ^   \"Ryanair: not the cheapest airline?\" .  Telegraph.co.uk .   \n ^   \"Battle of the low-cost airlines: is Ryanair the cheapest?\" .  WhichAirline.com .   \n ^   \"One\"   (PDF) . Archived from  the original   (PDF)  on 27 September 2011 . Retrieved  16 May  2010 .   \n ^   https://www.ryanair.com/gb/en/ \n ^   [2] [ dead link ] \n ^   \"Ryanair says Air France stifling regional airports – EU Business News\" . EUbusiness.com. 24 March 2010 . Retrieved  16 May  2010 .   \n ^   \"Ryanair will Umsteigeflüge anbieten\" . Retrieved  11 April  2017 .   \n ^   \"Israeli market beckons Ryanair\" .  Irish Sun.com . 25 August 2014 . Retrieved  25 August  2014 .   \n ^   \"Archived copy\" . Archived from  the original  on 13 December 2014 . Retrieved  2014-12-11 .   \n ^   \"The \"best, most and worst\" Ryanair airports 2007-17\" .  airline network news and analysis . 1 Feb 2017.   \n ^   Playle, Steve (16 July 2009).  \"Time to take flight from these Ryanair add-ons\" .  The Guardian . London.   \n ^   Michael O'Leary A Life in Full Flight, Alan Ruddock. Page 325 \n ^   \"Cardiff to Dublin flight is ended\" . BBC News. 25 April 2006 . Retrieved  18 December  2006 .   \n ^   \"Cardiff International Airport :: News\" . Info.cwlfly.com. Archived from  the original  on 30 April 2008 . Retrieved  31 October  2008 .   \n ^   150 jobs to go as Ryanair cuts Shannon flights . RTÉ News (30 October 2009). Retrieved 9 December 2010. \n ^   \"The Ryanair of Mexico Is About to Take Off in Latin America\" .  Condé Nast Traveler .   \n ^   \"Low-cost airline to operate Central America flights from Costa Rica\" .  Tico Times - Costa Rica Information - Travel - Real Estate - Hotel .   \n ^   \"Ryans let fly in Central America with VivaCan\" .  The Irish Times . 17 July 2015.   \n ^   \"Aerolínea Viva CAN in Central America - CentralAmericaData :: The Regional Business Portal\" .  centralamericadata.com .   \n ^   \"Corporate jet specifications\" . Ryanair . Retrieved  21 March  2017 .   \n ^   \"New Ryanair corporate jet costs €5,000 per hour of flying\" . Retrieved  13 April  2016 .   \n ^  a   b   \"Boeing 737 Orders & Deliveries\" . The Boeing Company. 31 July 2017 . Retrieved  5 September  2017 .   \n ^   \"About Us - Our Fleet\" .  www.ryanair.com . Ryanair . Retrieved  10 November  2014 .   \n ^   \"Ryanair buys an additional 10 Boeing 737 Max 200 'Gamechanger' aircraft to add to fleet\" .  The New York Times . 2014-09-08.  ISSN   0362-4331 . Retrieved  2017-04-15 .   \n ^   Clark, Nicola (2014-09-08).  \"Would Ryanair Deal Make Economy Class Even More Crowded?\" .  The New York Times . Retrieved  20 June  2017 .   \n ^   http://www.independent.ie/business/irish/ryanair-buys-an-additional-10-boeing-737-max-200-gamechanger-aircraft-to-add-to-fleet-35846191.html \n ^  a   b   [3]   Archived  19 April 2009 at the  Wayback Machine . \n ^   About Us – Ryanair & the environment   Archived  15 April 2009 at the  Wayback Machine .. Ryanair. (6 November 2006). Retrieved 9 December 2010. \n ^   News : Ryanair's Fleet Grows to 200 Aircraft [ permanent dead link ] . Ryanair. (6 November 2006). Retrieved 9 December 2010. \n ^   \"Company History/Timeline\" . Aviation Partners Boeing.    See 2005. \n ^   Airframes.org Aircraft Registration Database Lookup . Retrieved 5 October 2012. \n ^   http://www.irishtimes.com/business/sectors/transport-and-tourism/ryanair-buys-five-more-737-800-planes-from-boeing-1.1778712 \n ^   \"AIRSHOW-Ryanair CEO sees larger Chinese jet in early 2020s\" . Reuters. 19 June 2013 . Retrieved  27 September  2013 .   \n ^   \"Boeing, Ryanair Finalize Order for 100 737 MAX 800\" . Boeing via Mediaroom.com. 1 December 2014.   [ permanent dead link ] \n ^   \"Accident description\" . Aviation Safety Network . Retrieved  11 November  2008 .   \n ^  a   b   \"Accident: Ryanair B738 at Rome on Nov 10th 2008, engine and landing gear trouble, temporarily departed runway\" .  The Aviation Herald . Retrieved  11 November  2008 .   \n ^   \"Bird-hit jet in emergency landing\" . BBC News. 10 November 2008 . Retrieved  11 November  2008 .   \n ^   \"Pictures: Bird-struck Ryanair 737 extensively damaged\" .  Flight International . Retrieved  13 November  2008 .   \n Further reading [ edit ] \n \"All we need is low. Ryanair is cheaper as two one-ways than as a return ticket\" .  alfb.net . Archived from  the original  on 5 July 2008 . Retrieved  12 October  2007 .   \n Calder, Simon (2002).  No Frills: The Truth Behind the Low Cost Revolution in the Skies . London: Virgin Books.  ISBN   1-85227-932-X .   \n Clark, Andrew (8 May 2006).  \"Ryanair ... the low-fare airline with the sky-high insurance levy\" .  The Guardian . London . Retrieved  29 May  2006 .   \n Creaton, Siobhán (2004).  Ryanair: How a Small Irish Airline Conquered Europe . London: Aurum Press.  ISBN   1-85410-992-8 .   \n — (2007).  Ryanair: The full story of the controversial low-cost airline . London: Aurum.  ISBN   1-84513-293-9 .   \n \"Disabled groups attack 33p Ryanair levy\" .  Telegraph . London. 13 May 2006 . Retrieved  29 May  2006 .   \n Ruddock, Alan (2007).  Michael O'Leary – A Life in Full Flight . Dublin: Penguin Ireland.  ISBN   978-1-84488-055-3 .   \n External links [ edit ] \n Find more about Ryanair at Wikipedia's  sister projects \n Definitions  from Wiktionary \n Media  from Commons \n News  from Wikinews \n Quotations  from Wikiquote \n Texts  from Wikisource \n Textbooks  from Wikibooks \n Learning resources  from Wikiversity \n Official website \n Profit. Auf Kosten aller? - Der gnadenlose Preiskampf der Billigairlines , 14 June 2017,  ARD Mediathek  45 Min documentary (German) \n Links to related articles \n v \n t \n e \n Airlines of the  Republic of Ireland \n Current \n Aer Arann Islands \n Aer Lingus \n ASL Airlines Ireland \n CityJet \n Norwegian Air International \n Norwegian Long Haul \n Ryanair \n Stobart Air \n Defunct \n Aer Arann \n Aer Turas \n Avair \n Aviajet \n Eirjet \n EUjet \n Euroceltic Airways \n Futura Gael \n Iona National Airways \n JetGreen Airways \n JetMagic \n Nex Aviation \n Skynet Airlines \n TransAer International Airlines \n v \n t \n e \n Members of the  European Low Fares Airline Association (ELFAA) \n Current \n British Airways \n EasyJet \n Flybe \n Jet2 \n Iberia \n Iberia Express \n Norwegian Air Shuttle \n Ryanair \n Transavia \n Volotea \n Vueling \n Wizz Air \n Former \n Air Berlin \n Air Polonia \n Basiqair \n Blue Air \n Bmibaby \n Clickair \n Flying Finn \n Hapag-Lloyd Express  (later  TUIfly ) \n My Way Airlines  (later  MyAir.com ) \n SkyEurope \n Sverigeflyg \n Sterling \n Volareweb.com \n v \n t \n e \n   ISEQ 20  companies of  Ireland \n Aryzta \n Bank of Ireland \n CRH \n C&C Group \n Dalata Hotel Group \n Datalex \n FBD Holdings \n Glanbia \n Green REIT \n Hibernia REIT \n Irish Continental Group \n Irish Residential Properties REIT \n Kerry Group \n Kingspan Group \n Origin Enterprises \n Paddy Power Betfair \n Permanent TSB \n Ryanair \n Smurfit Kappa \n Total Produce \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Ryanair&oldid=812045696 \"\t\t\t\t\t \n Categories :  Ryanair Airlines of the Republic of Ireland Low-cost carriers Airlines established in 1985 European Low Fares Airline Association Former IATA members 1985 establishments in Ireland Companies listed on NASDAQ Companies based in Swords Irish brands Hidden categories:  Webarchive template wayback links CS1 Bulgarian-language sources (bg) All articles with dead external links Articles with dead external links from June 2017 Articles with permanently dead external links Pages containing links to subscription-only content Articles with dead external links from May 2010 EngvarB from August 2014 Use dmy dates from August 2014 All articles with unsourced statements Articles with unsourced statements from June 2017 Articles containing potentially dated statements from February 2010 All articles containing potentially dated statements Articles containing potentially dated statements from 2014 Articles with unsourced statements from July 2017 Articles with unsourced statements from April 2017 Articles with unsourced statements from January 2017 Official website different in Wikidata and Wikipedia   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons Wikinews   \n Languages \n Afrikaans العربية Aragonés Azərbaycanca Български Bosanski Català Čeština Cymraeg Dansk Deutsch Eesti Ελληνικά Español Esperanto Euskara فارسی Français Frysk Gaeilge Gàidhlig Galego 한국어 Հայերեն Hrvatski Bahasa Indonesia Íslenska Italiano עברית Latviešu Lietuvių Magyar مصرى Nederlands 日本語 Norsk Polski Português Română Русский Sardu Scots Simple English Slovenčina Slovenščina Српски / srpski Suomi Svenska Türkçe Українська اردو Tiếng Việt 粵語 Žemaitėška 中文   \n Edit links   \n  This page was last edited on 25 November 2017, at 17:22. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}