{"url": "https://blogs.opera.com/desktop/2017/02/opera-44-developer-with-reborn/", "content": "Meet the very first Reborn build - Opera Desktop \n Regional blogs \n                          Global                         \n                          India                         \n                          Indonesia                         \n                          Russia & CIS                         \n Product blogs \n                          Desktop team                         \n                          Mobile team                         \n                          Security team                         \n                          Dev.Opera                         \n Download Opera \n Follow us \n Facebook \n Google+ \n Twitter \n Youtube \n LinkedIn \n Instagram \n Search for: \n Opera blogs \n Desktop team / English \n Beginning of dialog window. This dialog displays large versions of the images from the page. Use the left and right arrow keys to see next or previous image. Use the escape key to close the dialog. \n Image viewer dialog window \n Loading image, please wait... \n Previous image \n Next image \n Close image viewer modal dialog \n        Meet the very first Reborn build       \n      Grzegorz Miazga\n Feb 16, 2017 \n 549  comments \n Hi, \n It’s time for a very exciting update to the Opera developer stream! \n Today, we’re bringing you a brand new refresh of our user interface in the developer stream. This work is part of a bigger project, codenamed Reborn, which we will tell you more about soon. However, starting from today, you can preview its fresh look and the new set of features. \n Brand new look and feel \n Opera’s entire design has been updated with a new, high-quality graphical design that is less platform-specific. The tabs are simplified, lighter and more elegant, making it easier to locate open tabs. The new sidebar is more subtle and refined, with a touch of animation. Speed Dial has also been given a fresh look with smooth animations. \n Two colors \n Opera is now available in two theme colors: light and dark. We’ve also designed three new backgrounds that perfectly complement Opera’s new look and feel. Both the background wallpaper and the browser color can be managed under  Themes . \n Browser sidebar \n Opera’s sidebar has been moved from Speed Dial to the main browser window, similar to how it is in Opera Neon. This first version of the new sidebar gives you one-click access to important tools such as bookmarks, history, personal news and extensions. You can customize the tools that appear in the sidebar according to what you find useful. \n The new sidebar will be visible by default for new users; current users will have the option to turn it on by flipping the switch in Speed Dial.  \n Sidebar for Facebook Messenger \n Communication is truly important on the web. But today, switching between tabs when responding to a message is cumbersome and inefficient. In this version, we have added the ability to keep Messenger.com – Facebook Messenger’s standalone website – as a side tab. More social services are planned in the future. \n To use Facebook Messenger in Opera, click the icon on the top of the sidebar. After you log in to the site, there are two ways of using Facebook Messenger in the sidebar: you can open it in overlay or pin it and use it side-by-side with your current tab. The second option allows you to combine online chat with a full browsing experience. \n Zero-click network installer \n We’ve been working on providing you with an even quicker, simpler installation process. If you install Opera Developer for Windows from the link below, the installer will start the installation process right after it’s launched, requiring no further clicks. The same solution will soon be available for everyone who downloads Opera at opera.com. \n Of course, you can still go through the full installation process by choosing the “Download the offline package” option on our download page, or by using a USB installer. \n Other information: \n Changelog with detailed list of  changes . \n Chromium is updated to version  57.0.2987.19 \n Installation links: \n Opera developer for Windows  (Using Opera developer for Windows installer means  Opera for Computers EULA  is accepted) \n Opera developer for Windows (Portable version) \n Opera developer for macOS \n Opera developer for Linux – deb packages \n Opera developer for Linux – RPM packages \n Share \n Twitter \n Facebook \n LinkedIn \n Google+ \n Grzegorz Miazga Desktop QA Team Lead. Working in Opera since 2010. View all posts by Grzegorz Miazga Back to top   \n Post navigation \n Previous article : Opera 43 squeezes page loading time to its limits Next article : Opera Stable 43.0.2442.991 update   \n _artem_ \n pfff.. until this build.. i had possibility to delete fugly internet explorer left right reload icons by disabling windows 10 skin.. but now they are displayed even with that flag disabled; \ndark style is totaly fugly. sorry.. but have to tell you truth \n iYuzver \n “Sidebar for Facebook Messenger” \n For Vkontakte?! \n Ralf Brinkmann \n … as long as I can turn off all these new toys … 🙂 \n _artem_ \n the fugly windows 10 skin no….. now it’s enabled even if the corresponding flag is disabled 😀 welcome new opera.. it becomes more and more crap.. after china bought it 🙁 \n Jamie \n Yeah, I don’t get the sidebar thing! Isn’t that what the sidebar extensions were for? So you could use them only if you wanted to? \n Ralf Brinkmann \n I don’t know anything about sidebar extensions. I don’t use it. I want all the space on my 32″ monitor for me, not for any sidebars or extensions. \n Jamie \n I’m the same with my 27″ monitor. And even more so, with my 13.3″ laptop where space is at a premium. \n x a \n You should investigate the V7 sidebar extensions by  vux777 , then… \n Ralf Brinkmann \n What about TLS 1.3? Is Opera going to implement it soon? Chrome 56 and Firefox developer already have it. \n tarquinwj \n TLS 1.3 support will be added via the Chromium engine. Note that it is not enabled by default in Chromium yet, which is why it is not enabled in Opera. (Chrome hides it behind a flag for now, which is disabled.) \n plovec \n When the browser opens a pop-up (like the “in new window” link in gmail) the title bar is too height \n x a \n How does EULA 6.i go along with your former proud claims, that Opera’s extensions are all reviewed and therefore save-ish?  😉 You claimed this especially each time news broke about some Chrome-Extension in Google Play being discovered playing rogue. \n Opera may offer a portfolio of third-party browser extensions and themes (“Add-Ons”) at  https://addons.opera.com/extensions . Opera exercises no editorial control over the Add-Ons that you access through this Service. \n Grzegorz Miazga \n As I understand ‘reviewed’ does not equal ‘editorial control’. Former means that we check extensions if that contain no malware or are otherwise harmful. Later means we do not edit them, so they could pass review but still could be of poor quality or have low/zero value for users. \n If you’d like I could try to forward your question to some legal department for clarification. \n Jamie \n Love the light and dark themes, but please please please allow users to disable the left sidebar. I prefer no UI cluttering the sides of the browser. That is why I disabled the sidebar in the first place. Please don’t needlessly clutter the side of the browser! \n I almost never use any of the shortcuts that are in the new sidebar (and can get to the speedial with one click from the shortcut on the address bar). And I definitely don’t want Facebook messenger always showing. I can download the app to my desktop if I want that or use an extension. \n If I can’t disable this sidebar clutter, it would definitely be a deal-breaker. So at least make it optional. = \n Sidney Guioy \n well, it can be hidden, and you can disable facebook too, so no worries 🙂 \n Alex Wazovskiy \n It was hidden for me by defailt, after update) \n Sidney Guioy \n yeah for me too 🙂 \n _artem_ \n just make OPERA menu, left, right, reload AND plus icons the way they look like on previous build WITH disabled windows 10 skin (#windows-10-skin) and enabled alternative theme (#submodule-native-theme-alt) flag and don’t toucht this things ever again – it’s so easy dev team. so easy \n Leo Lozes \n It would be nice to have a sidebar extension for Whatsapp Web. \nAlso, I have to agree that the dark theme is not great visually compared to the light one. \nOther than that,  definitely seems to be an improvement over the current design. \n Will you please fix some day the speed dial synchronization so it makes sense? I don’t get why my bookmarks are imported without any problem between machines or opera stable / beta / developer versions, but I have to reconfigure the speed dial every time. \n Alex Wazovskiy \n What about DNAWIZ-5170 (Opera’s native adblock works wrong with RuAdList from Adblock Plus extension)? I sent this report over 6 months ago, but still no fix, even in this build. \n Arjan van Leeuwen \n Your bug has been marked as invalid. There were 2 issues described. First was a blocked element that isn’t hidden – this is a feature of ABP that Opera is missing, and although we plan on implementing it we haven’t seen many sites where this would be useful. Second was a video not playing, but the same problem occurred with ABP and uBlock: it was caused by the list, not by Opera. \n FYI: RuAdList is included with Opera by default, there’s no need to load a custom list for it. \n If you have other specific issues be sure to mention them, it’s just that these were 2 that we couldn’t act on.  \n When filing a bug, don’t say ‘It doesn’t work in many places’, provide specific example of something that doesn’t work correctly. \n Alex Wazovskiy \n 1. Glad to know that mentioned feature you’re planning to implementing – I hope it will be. \n2. About the problem with videos not playing – for me it works with ABP and uBlock, I tested before writing this reply. \n3. About RuAdList – I didn’t know that RuAdList was included with Opera by default, maybe when I sent this bug report, RuAdList had not been included in Opera, I don’t know. Hovewer, now I deleted RuAdList from custom filter list, and the second issue has gone. Thanks for really important information and quick reply. \n Sidney Guioy \n I’m using Franz for my messaging services, Single windows with all of them, separated, i don’t know if Opera implementation could be better.. \n You guys would want to have a look to make something good ! 🙂 \n Gryzor \n Woot! Here’s hopping for more chat apps – like Viber, Hangouts or Telegram… \n Abdolahi \n Telegram ! wow thats interesting \ni love that idea ! \n Mike Robinson \n Flash is still broken on Linux (I’m using Debian Stretch 64 bit). \n /usr/lib/x86_64-linux-gnu/opera-developer/resources/pepper_flash_config.json  lists: \n{ \n  \"PepperFlashPaths\" : [ \n    \"/usr/lib/adobe-flashplugin/libpepflashplayer.so\", \n    \"/usr/lib/pepperflashplugin-nonfree/libpepflashplayer.so\", \n    \"/usr/lib/PepperFlash/libpepflashplayer.so\", \n    \"/usr/lib64/PepperFlash/libpepflashplayer.so\", \n    \"/usr/lib/chromium-browser/PepperFlash/libpepflashplayer.so\", \n    \"/usr/lib/chromium/PepperFlash/libpepflashplayer.so\", \n    \"/usr/lib64/chromium-browser/PepperFlash/libpepflashplayer.so\", \n    \"/usr/lib64/chromium/PepperFlash/libpepflashplayer.so\", \n    \"/opt/google/chrome-beta/PepperFlash/libpepflashplayer.so\", \n    \"/opt/google/chrome-unstable/PepperFlash/libpepflashplayer.so\", \n    \"/opt/google/chrome/PepperFlash/libpepflashplayer.so\" \n  ] \n} \n I have it installed to the following: \n$ ls -l /usr/lib/adobe-flashplugin/libpepflashplayer.so \n-rw-r--r-- 1 root root 18806048 Feb 14 06:11 /usr/lib/adobe-flashplugin/libpepflashplayer.so \n$ ls -l /opt/google/chrome/PepperFlash/libpepflashplayer.so \n-rw-r--r-- 1 root root 18785568 Oct 18 09:00 /opt/google/chrome/PepperFlash/libpepflashplayer.so \n However it is not available if I go to  http://www.adobe.com/software/flash/about/ . I have had this problem since version 43. \n Also, as of this version  opera://plugins  does not work: \n This site can’t be reached \n The webpage at opera://plugins/ might be temporarily down or it may have moved permanently to a new web address.\n Radek Rzepecki \n Hi, \nyou should be able to download the latest Flash package for Debian on adobe website and it will work. \nopera:plugins was removed, you can see your installed plugins on opera://components now. However, you can control Flash plugin now on our Preferences page. \n Mike Robinson \n That’s exactly what I did. Doesn’t work. Flash is not recognized. \n Radek Rzepecki \n what version have you installed? Make sure you have PPAPI. Works fine with 24.0.0.221. \n Mike Robinson \n 24.0.0.221 PPAPI 64 bit is installed. Just verified comparing its md5sum against a freshly downloaded copy: \n $ md5sum /usr/lib/adobe-flashplugin/libpepflashplayer.so \nf79abcb704902fac00f596c297e781d0  /usr/lib/adobe-flashplugin/libpepflashplayer.so \n /opt/google/chrome/PepperFlash/libpepflashplayer.so  had a different md5sum so I deleted it. It still doesn’t work though. Opera’s still not recognizing flash. \n My OS is 64 bit Debian Stretch: \n $ uname -a \nLinux mike-debian 3.16.0-4-amd64 #1 SMP Debian 3.16.36-1+deb8u1 (2016-09-03) x86_64 GNU/Linux \n$ lsb_release -a \nNo LSB modules are available. \nDistributor ID: Debian \nDescription:    Debian GNU/Linux 9.0 (stretch) \nRelease:        9.0 \nCodename:       stretch \n Mike Robinson \n I figured out the problem. I had the libpepflashplayer.so  file, but not the manifest.json file. \n Юлия \n You integrate the worst privacy offender (Facebook) into your browser? No. Make it a downloadable extension, don’t bake it into your browser. Right now I can’t find a way to get rid of it: \n https://i.imgur.com/xtr6xNe.png \nPlace a link on your new sidebar, call it “Download sidebar extensions” and point it to your extensions page, maybe create a new category for such things. \n Sebastian Kamieniarz \n There is no difference between logging into Facebook in regular browser’s tab and using sidebar Messenger shortcut. It is not integrated into browser – it’s just another way of displaying Messenger’s website. \n Mike Robinson \n You can also just right click on the sidebar and uncheck facebook to hide it. If you don’t want to use facebook in the sidebar, just don’t log in. \n Юлия \n I don’t use facebook and I definitely don’t need their nasty tracking. \n Nekomajin43 \n That icon is only a bookmark on the sidebar. \n icetom \n Opera owns an advertising network, they dont really want privacy for us. Just look what is all built into their android apps, lots of tracking for advertisement. you can check for yourself with app malware analyzing tools. Same sure goes for the Opera browser in Desktop, just nobody can analyze it. \n _artem_ \n я влюбился \n _artem_ \n джаст райтклик ит энд анчек \n http://prntscr.com/e9lnyo \n _artem_ \n ор юз зе джирс айкон он зе райт \n http://prntscr.com/e9ln5i \n tankfeeder \n windows 10 (latest patches). Same shit on memory leaks issue, you open 30 tabs, size 2GB, close all, size 300MB, after hour – no memory, can even open about:opera, but size ~300MB \n Alex Wazovskiy \n BTW, why opera://plugins/ page is unavaible in this build? \n Robert Tomaszewski \n Hi, you can use opera://components \n Alex Wazovskiy \n But there is no Flash Player plugin. It needs for me to disabling it sometimes. \n Leonardo Gomes \n You can disable/enable Flash on settings.  \n Alex Wazovskiy \n Thanks! \n Mike Robinson \n This should be in the menu. Especially when you are changing the URI. “Developer” is no longer in the menu. \n Also, why not redirect opera://plugins to opera://components? \n Mike Robinson \n I finally got my flash player working and it doesn’t show up in opera://components. It looks like this is something completely different from opera://about. The same is true with the Chromium browser. chrome://plugins/ and chrome://components/ show completely different things. One is not a substitute for the other. \n Юлия \n No, Google decided to remove the chrome://flags page. Since Opera uses Google’s engine they have no choice but to follow their bad practices.. \n Horgeon \n While the new interface is a nice refresh, I have one issue with it: it uses Windows 10-style controls, even on Windows 7/8, instead of native ones, so the browser is no longer well integrated with the environment and other applications. \n https://imgur.com/a/J8OZH \n It would be nice to see native controls in the new interface, much like what Firefox is doing when using a theme (Windows 10-style menus, window buttons and icons are out of place in Windows 7/8). \n Stanislav Stratil \n I do like new sidebar and icons, but you shouldnt force Windows 10 skin to Windows 7 users. \nKeep it in aero and it will be fine. \n Herr Pietrus \n New ions are pathetic – same like in Windows 10. \n Nekomajin43 \n This one is extremely important! \n Maryla R \n What’s the point in having two sidebars…  They should be combined in to one in my opinion. \nIs it that hard to implement a sidebar splitter to show/hide it? \nThe new themes are rather week, gradients really? First opera mobile now this… \n Alex Wazovskiy \n OMG, there is two sidebars! O_o \n http://i.piccy.info/i9/7de067971bc929a2a6eaa0506918d09f/1487260866/14183/1119645/2017_02_16_17_58_02.png \n Matheus Bombonato \n Or maybe a sidebar’s sidebar… who knows… O_o \nThey should learn from Vivaldi’s webpanels. They are awesome. \n Maryla R \n Hope they’ll combine them. And add a sidebar splitter(edge) to toggle the sidebar on and off. \n Barbara Rogos-Turek \n Maryla R, could you specify what do you mean by “sidebar splitter”? \n Maryla R \n Old Opera example  http://imgur.com/8Nsy98f  – click to show/hide the sidebar. \nFor those who browse the web with maximized browser(80% of us?) it’s a very handy thing. It increases drastically the accessibility to the sidebar. \n bwat47 \n Yo dawg, I heard u like sidebars \n http://i.imgur.com/T12rgnC.png \n L33t4opera \n Hi Grzegorz, thanks for the update and fixes 😉 \n Two new flags: \n– opera:flags#show-overdraw-feedback \n Visualize overdraw by color-coding elements based on if they have other elements drawn underneath. \n – opera:flags#ui-disable-partial-swap \n Sets partial swap behavior. \n Trevor Gough \n looks nice … I see no way to log into Messenger with the new sidebar, though.  I just get a big splash page telling me about its features. \n Regnas \n Neon was better… 🙂 \n Leonardo Gomes \n You can’t simply turn Opera into Neon from night to day, some transition is needed. 🙂  \n Maryla R \n So the new owners want to make a maxthon clone with the new opera \n inDigazzZ \n You’re God damn right 🙁 \n Leonardo Gomes \n Why do you say that?  \n Der Herr Nick \n Nice to have the sidebar back during surfing! Yay! \n Der Herr Nick \n But with an increased zoom level on a hi-DPI monitor the extension icons look rather shitty: \n http://imgur.com/V90SQOE \n Clasan Ibanez \n The dark theme is not cool here in my Debian 8.7. \n https://s6.postimg.org/yi9dd9zyp/2017_02_16_142515_1024x768_escrotum.png \n x a \n Same with Mint, if them switched dark (didn’t try restarting Opera). \n Clasan Ibanez \n Restarting Opera or changing GTK theme system (to a dark theme, for exemple) didn’t solve here… \n Angry Penguin \n Ubuntu 16.10×64 with Unity and same issue here… \n Rokan U. \n It’s good to see Opera is trying something new. \n Here are my thoughts so far. \nAs mentioned earlier, the dark theme is not as appealing as it should be. \nThe “Menu” front’s color should turn white when dark them is selected. The menu items should turn dark too under dark theme. \nCurrent build:  http://imgur.com/PXLuK5Q \nThis is how it looks with Opera Developer 44.0.2494.0 with dark system color. \n http://imgur.com/f1eCxtx \n The animation for show/hide sidebar is too aggressive. The flicker on the UI makes is seem that there was a system error. Also, I think the sidebar should have same width consistently whether it is in speed-dial or regular window. Thus, it can reduce the flicker too. \n Additionally, the “Show system color on top bar” setting doesn’t seem to be  working on this build. \nThe Google Chrome extensions are not working. It just shows a placeholder for extension. \n http://imgur.com/xWj6EQx \n Alex Wazovskiy \n Plus, I think there is should be an option to automatically apply dark theme when the dark system theme in Windows 10 and macOS is applied. \n Michael Pürmayr \n I love it! Looking forward to having it in a stable version! \n DavidMay \n Agreed, trying to refresh the design is a nice idea. I see that you try to make Opera consistent between all platforms. That’s a good idea. However, I think it goes a step too far away from the consistency to the respective underlying platform (i.e., having a somewhat native look and feel).  \n Two specific problems I see with it: \n1. Light theme / Windows 10: I am not a fan of the grey gradient (dark to light grey) in the non-active tabs, because I perceive it as a dated design (think: 90ies). I personally very much like the  more native look on Windows 10 of the existing design. \n2. The extension bar should be integrated with the new side bar to avoid having two bars. \n BK \n thanks for your feedback, much appreciated. We will look into it. \n DavidMay \n One follow to the gradient (point 1): The gradient looks better (and is less noticeable) when viewed directly on my monitor. When I wrote my post above, I saw the gradient via TeamViewer + Max. Quality Settings. Still not sure, if the gradient is the optimal solution, although my issues with it are less severe now. \n Maxim \n Sweet! I can’t wait until you let us have tabs on the side like in Opera Neon. Great work guys! \n Regnas \n Ok, the new additions are great… \n But there’s a minor issue with the new sidebar… If you use the extensions sidebar like I do, you will end up with two sidebars, see:  http://i.imgur.com/iwDX0yd.png  which is not great, it’s a waste of space. \nWould not be better to merge this two sidebars into one? The facebook messenger already looks like a sidebar extension, so it would be nice. \n Other thing, the extensions sidebar color should match the new one, imo.. Besides, when you switch to the dark theme, the extension sidebar remains the same light color… needs fix.. \n And yes, add Telegram to the sidebar, please asap… 🙂 \n Thx… \n Cjcr \n BIG YES to all you said, telegram included. \n BK \n Yes, so this is initial release, not a final solution. More work on sidebar is incoming too. \n Regnas \n Ok, great… \nThank you.. \n Herr Pietrus \n Are you planning to add media panel from Neon? \n ManOnTheBorder \n Looks pretty good, thanks for the new build! \n Regnas \n Crashing when moving tabs out of the window and putting back. See:  http://i.imgur.com/zknVAVa.gif \n Thx. \n Rodrigo Wander \n Confirmed bug here \n Robert Tomaszewski \n Hi Regnas, Hi Rodrigo, Thanks for catching this. We logged it and will be fixing soon. \n Abhishek Mandloi \n I can’t help thinking how confusing the new interface will be for people who use webapps with similar left sidebar (Jira, Outlook Web Access, Tweedeck, VWO, Zendesk) \n patkoscsaba \n Very good first step. I can’t wait to hear and see more about the Reborn project. \n BK \n Thanks ! You stay tuned to dev edition, you will see more very soon in O45. \n Herr Pietrus \n So there will be no Opera 44 stable? \nYou can’t release it in such shape! \n First impression is simply dramatic. Now I can see that you can have some plan, but… \n Leonardo Gomes \n I don’t think that O44 stable will have the Reborn thing. I would say it’s something more for O45. \n BK \n We will proceed with development and await more feedback from you. Clearly there are still many obvious bugs/issues to address, so decision about stable release it yet to be taken. \n Herr Pietrus \n I think that it’s to early for Opera in Neon Design… \nOK, to be honest I’m afraid that Neon will be not much better than Modern… So Opera Neon should be optional… Don’t forget that W10 still has ONLY 4x % market-share \n Regnas \n What “Show system color on top bar” does? See:  http://i.imgur.com/8qzR6hS.png \n I enabled it but didn’t see any difference. \nThx… \n Herr Pietrus \n I don’t even have such option available on Windows 7. So I’m supposed to use that with default non-aero gray? \n Regnas \n Hmm, I’m on Win 10…. probably there’s something wrong with this feature… \n Herr Pietrus \n Is this a fucking joke?! \nOptions in the installer only in offline version HIDDEN on your FTP?! (I mean offline 64-bit package) \n “The new sidebar is more subtle” \nSUBTLE?! It’s ugly, it’s a disaster! \n “high-quality graphical design that is less platform-specific” \nLess platform-specific?! With graphic style and icons from Windows 10? Do you think that we are idiots?! \nBTW – NO AERO GLASS ON WINDOWS 7 and that gargantuan bar with gargantuan icons?! \nOh, that’s your example of subtlety! \n In short words: no good browser on the market soon?! \n BK \n Hi, regarding installer, no worries, there will be regular offline installer available. We are testing. \n Олег \n Thank you for this interesting updates. Can we expect native bookmarks support in new sidebar? \n http://imgur.com/Rx2kQlo \n Nekomajin43 \n OK, first of all: Change the jumping effect on the speed dial. I hate when items jumping on hover. \n Second, I’d like to have an option for a native look. At least the window frame. There will be years while Win10 will be the number one on the market. This is very important. I don’t care how much easier is to maintain one GUI. You have all the chinese money now, solve it. \n Third, please merge the two sidebars, because this is ridiculous. \n Raszlo \n +1 for the jumping effect. Childish. \n Nekomajin43 \n And very annoying. \n BK \n Hi 🙂 thanks a lot for this feedback. \n Nekomajin43 \n To be constructive too, I think any effect is unnecessary, because we have the mouse cursor changed, and also the menu icon appears in the corner of the tile. It is enough feedback. But if you want effects, just stick to some opacity change. \n BK \n OK, thanks, we will review. \n Regnas \n The effect is very subtle, so I think it’s ok… \n Herr Pietrus \n The want to make second Maxthon mixed with Vivaldi. Opera is going to be ugly – because MS “invented” their “Modern UI”. \n So,perhaps once again we must prepare for the Opera’s funeral. This time can be the last one. \nI hope not. \n Nekomajin43 \n Personally, I don’t have a problem with the modern UI. I think it is a great concept, although not the best practical solution. But I really hate when an application is out of the environment. \n Herr Pietrus \n so it’s not great it should be practical in the first place – especially if it supposed to be better than current UI. \nNow it’s unpractical and ugly. It’s not logical too – do you think, that suddenly all developers will design simple one-color icons for their apps? UI designer should think about that. \n Modern it’s the worst UI that can be created. Rough, ugly, unpractical, wasting space, chaotic. \n It may look nice on one or two screenshots but create a file explorer (FOR PC), a web browser in neon… impossible. It’s not a phone. \nAnd yes – MD from Google is much, much more better prepared and thought-out. \n Nekomajin43 \n But it should be used for Win10, to make it native. \n Herr Pietrus \n Of course – but only for Windows 10. \n Nekomajin43 \n I agree. \n Raszlo \n Have you heard about MS Project Neon? (Same name as Opera’s experiment, coincidence? ;)) It’s basically a new design language for MS Windows and it could be released this year. Opera has to be ready and I think this is the beginning. \n https://cdn-mspoweruser.netdna-ssl.com/wp-content/uploads/2017/01/neon-.png \n Herr Pietrus \n I’ve heard. It’ doesn’t seem to be much more ergonomic that this modern crap. It seems to have a little smaller fonts and margins, but it’s still very rough. \n BK \n Hi! As always we appreciate your feedback. You are quite some time here with us, right? \n Herr Pietrus \n Right, that’s why I’m so irritated when I see that you’re going to spoil something that, after a very long time, has been finally polished and is really great (I mean Opera UI after all these changes with “bottom toolbar” etc.) \n But – one thing you can copy from Vivaldi are their sidebar web-panels. I hope that FB is only an announcement of such new functionality. It would be grat to have a chance to open any mobile web-page in such window. (Wikipedia, some vocabulary or even web e-mail interface) – I’ve wrote about that in comments under the Opera Neon. (Opera Neon, Project Neon – are we in Las Vegas?) \n And I think that the native title bar is even more important – for example your version is much more bigger that the one I have configured in my system… not mentioning the icons. \n Oh – I think that last.current pages icon on th title bar is a really bad idea. \nIt concerns TABS so it should be on the tabs bar. \n …but if you prepare Opera for Project Neon I can easily understand that sidebar. \nBut you have to keep the Win & UI for Win 7 users – I mean old-style icons and native title bar. \n x a \n The “jumping effect” on the speed dial makes me sea sick.  😉 \n Rodrigo Wander \n Woa woa … \n Calm down People… it’s a “DEVELOPER BUILD”…. \n Nekomajin43 \n Yeah, it always starts like that, then we have to use the scrappy solutions for months. \n BK \n Indeed. This is just initial release, not a final solution that you will stick for months 🙂 \n SiMcarD \n Why the left tab “bounces” back when I close the last tab? \n Nekomajin43 \n OK, to say something positive, I love the animated icons on the nav/sidebar. \n BK \n now we are talking. Anything else? 🙂 \n Nekomajin43 \n Not yet. The whole thing just looks like a mess now. I know it’s only a snapshot, but still hard to say anything else positive. \n BK \n OK. Thanks for highlight the annoying parts 🙂 keep doing that, so that we can improve as much as possible. This is just initial release, and we plan to further modify UI. Your input is very appreciated. \n Nekomajin43 \n I hope you will implement fallback options to a more conservative GUI. This is your chance to do it right. \n I loved the Neon GUI (excluding the jumpy effects), but I can not see how I can use that for work. It is fancy and scifi-ish, and very handy for entertainment. But don’t forget that using a browser is not only about YouTube and Facebook. The traditional tabbed interface is still the best compromise for different use cases. \n Herr Pietrus \n Exactly 🙂 \n BK \n yes, this was a “concept car” type of project. \n RafaellaG \n I like the older Opera developer 44.0.2494.0 better. Restored it. \n But I also never used the sidebar. \n BK \n Hi. Can you share some more feedback about new version please? \n RafaellaG \n As I use(d) only the navigation items on the left side of the speed dial, \nthe new side bar is not interesting for me. \nAlso the nav item now got a half-transparent bar (if I remember right). Ugly. \n Then there’s no plugins page anymore (bug? or feature?). \n The dark/light theme colors is not an interesting feature as \nthe “show system colour on top bar” feature seems now useless (not functioning) \n(I liked that feature). \n The speed dial items seems to have a lot bigger round edges. \nI liked the old smaller better (& more consistent with windows 10). \n All in all only little things – but I personally don’t like the new look. \n Maybe I’ll try again a later build. \n BK \n Thanks. Personally I agree on the half transparent bar 😉 But it’s always, a matter of personal preference and opinion.  \n Looking to hear more from you. \n Herr Pietrus \n If I can add something – I’ve never used “true” sidebar in the new opera too. Not only because there are no good extensions for it, but also because I’ve used to open downloads page with the button on the main bar/icon on the speed dial sidebar and for the bookmarks I use “Neater Bookmarks” Chrome extension (bookmarks menu is the bet way to open bookmarks… perhaps even better than the side panel that I really loved in the old Opera) \nEven with the proper bookmarks and download panels I don’t think I will prefer sidebar over the speed dial sidebar nowadays. \n ….but if you really prepare for project neon and it’s side menus…. then it’s obvious that the sidebar must come back…  \n I’m not against it but please – do something to not destroy Win 7 interface with it and add some neon “glass” 😛 \nI’m also afraid that Opera Neon icon fits better to it. \n BK \n Hm.. Aren’t you upgrading to Win 10 any time soon? 🙂 \n Nekomajin43 \n Not anytime soon. Not until Win7 perfectly fits my needs. And I am alone, seeing the market share… \n Herr Pietrus \n No, I’m not. I don’t need it. My PC works fine, all games works fine, still there are no exclusive titles except Forza Horizon 3 and GoW that I’m not interested in. I don’t have a money for the SSD and only on SSD’s W10 works “fine”.  I don’t want forced obligatory updates. I hate it’s ugly UI, I like nice things and W10 is an antithesis of ergonomics and good design. I don’t need extremely slow UWP “applications”, I don’t have a money for the new monitor,  and without bigger one I wont be able to use W10 in comfort way because I can’t set in W10 custom DPI – only 100, 125, 150 and 200 are available. \n Herr Pietrus \n Oh, and all applications works fine too, I have drives for all devices… Even Office 2016 is still compatible… No, I don’t want that funny Frankenstein called Windows 10. \n BK \n Win 10 is indeed bizarre. You can find there all sort of designs ideas, dating back to Win95 🙂 \n SlickRic \n I also like the show system color on top. If I only have dark and light to choose from, I will be finding a new browser. Believe that!! \n anonym \n apart from several crashes when closing the sidebar (with messenger activated), closing the “this tab is now fullscreen” closes the browserwindow and restoring it restores it without chrome (no url-bar or whatsoever). \n – the opera-button on linux looks very weird, not fitting the design at all. \n– if i have the sidebar open including the download-symbol it should not be shown next to url bar to save space. \n– there should be an option to kill all space between + and tabmenu-dropdown. \n– why hype 2 themes, and not make all colors stylable by ourselfes? just put a list of rgb(a) colors somewhere and everybody can get his hue as he wants. \n Ivo Naiman \n I like new sidebar, I no longer need V7 addons. For more conservative users exist possibility to hide this feature, so its perfect from my point of view. \n Ivo Naiman \n Dark theme is nice, but text in address bar is harder to read due to font color.(white on light gray background) \n Regnas \n Bug. Funny movement when closing tabs from the right, see:  http://i.imgur.com/r0f2Dfm.gif \n Cheers.. \n Robert Tomaszewski \n Hi Regnas, \nWe found that issue too. It is logged and we will handle it. \n nu4a \n Very nice job with the dark theme. I am glad to see that feature coming. Can’t wait to see it stable! \n By the way it can be a bit darker and it will be better to expand the range of the dark theme. For example Opera menu, internal pages (settings, downloads, etc), popup blocker window, context menus, extension windows and so on. \n Nice job so far, keep doing Opera better and better! \n BK \n Indeed, more changes incoming soon 🙂  stay tuned. \n nu4a \n Hype! 😉 \n daniellz \n I think, that we need more contrast here  http://take.ms/QYeil , especially blue links. \nAnd I’m waiting dark themed internal pages (preferences, bookmarks etc…) and pop-outs like last downloads list, tabs histiry list, main menu etc… \nAnd main menu button have black color font, poorly visible  http://take.ms/duVxD \n Generally, more darker theme (with more contrast elements) should solve problem. \nBut I think, that customisable colors would be very good feature, it’s just 4-5 inputs  for main colors, something like in Windows theme settings \n Robert Tomaszewski \n Tanks nu4a hearing these nice words about new features. We will be fixing remaining issues of the dark skin on other not covered yet elements. \n Izaak Hagy \n Seems like an attempt at catching up to Vivaldi \n BK \n Nope, we are not catching up to Opera 12.x  🙂 \n anonym \n took you just some years to realize that this is neccessary… \n Leonardo Gomes \n Sorry, but it will never be. One or other feature may be interesting to bring back – and it has been happening already – but wanting to turn any current modern browser into what O12 was just show, in my opinion, a inability to look forward, to see what is the future. \n People want simple things, simple software. They don’t want a bunch of features that they may never use, they just want the necessary ones. \n People using more and more mobile devices with their apps and using less desktops show that they want to keep things simple. \n Herr Pietrus \n “People want simple things, simple software. They don’t want a bunch of features that they may never use,” \n And that’s why Facebook Messenger looks like… it looks already 😀 \n anonym \n “People want simple things, simple software. They don’t want a bunch of features that they may never use, they just want the necessary ones.” \ni want simple to use software. and not just “simple software”. apart from that, i find stuff like the (somehow overly hyped by opera) currency converter simply stupid and one of the many features, i’ll never use. \n opera nowadays has loads of features, but none thought through to the end or apart from introducing them there seems to be no energy to make things what the could be. \n Leonardo Gomes \n Currency converter may be very helpful if you shop online often.  \n However, as you ended pointing out, it’s not easy to please everyone  and one new feature will always make some people like and others to do not like it that much.  \n And the creators of the product may need to choose a side, aiming on balancing people’s needs and company needs.  \n nanana1 \n Kudos for moving forward rather than retarding back 😉 \n proxxy \n it’s good that opera evolves to a modern and clean interface. \nHowever, i would like to see a progress bar like vivaldi or safari, back/forward/reload buttons seems to be too small (macos) and possibility to hide start page button and share button will be great. \n Corthloy \n How do I change this to normal (it’s too confusing) \n http://i.imgur.com/C9GSDwG.png \n I just want to change between tabs like I do with Chrome. \n Leonardo Gomes \n What do you call ‘normal’? And why you can’t change between tabs using the tab menu? \n Corthloy \n When I press ctrl+tab I just want it to jump to the next tab instead of jump to ¿recent or something like that? Also, I don’t want it to show the tooltip with the title of the tabs that are open, just jump to the next tab like Chrome, Edge, Firefox \n Leonardo Gomes \n Have you tried unchecking ‘Cycle tabs in most recently used order’ ? \n Corthloy \n That worked thank you, now the only problem is the tooltip and the lightbox when trying to jump between tabs? Check  http://i.imgur.com/rIiBfy1.png \n Any idea how to disable that? \n Leonardo Gomes \n I don’t think you can. \n L33t4opera \n Hi, please have a look  here . \n Cary Fries \n Hi there… \nGood and clean.  However, the windows 10 skin switch no longer gives transparent title bar when disabled.  Any chance of getting back, or not? \n sunqj \n Opera for windows is very nice! @leocgomes:disqus I mean flattening is probably the meaning of this 🙂 \n devilpenakut \n Please add sidebar for Telegram and Whatsapp \n beBoss \n Dashlane stopped to work \n ziken \n make darker \n Regnas \n And with no white text…. \nThe white text is what is making the dark theme a little weird on the eyes… \n shadow118 \n Black text on dark gray backgroung, like it is on Opera menu button, looks way worse \n Regnas \n Of course, I wasn’t even thinking about it…. Something around greyish/light grey is what I had in mind… \n Cobalt \n “DNA-58690 Not working preview of the tab in the “Tab menu” when you re-mouseover on that tab in the list” \n It’s still not working =( \n Rodrigo Wander \n Opera <3 Opera <3 Opera <3 Opera <3 Opera <3 Opera <3 Opera <3 Opera <3 Opera <3 Opera <3 Opera <3 Opera <3 Opera  \n Look at this SEXY Sidebar and this THEME \n<<<<<, LOOK Ohhhh Man.. i love opera….   \n OhhhhHhhhHhHHHHhHHhhhhhHhH \n i really love this browser…  \n <3 Opera <3 Opera  \n no… HEY LOOK THIS THEME .. Look those icons… Really sexy …  ohh my…. \n Rodrigo Wander \n i gonna cry … \n cristianer \n Thanks. Downloading… \n Frylock86 \n I hate this new theme. It is VERY HARD ON MY EYES. Especially figuring out the active tab when I have LOTS Of tabs open. I do not want EXTREME LIGHT or EXTREME DARK colors. You FORCE it without any option to revert to earlier theme? Goodbye Opera and hello Google Chrome. Give us an option to revert to old theme. Don’t your designers know anything about usability or how to introduce user interface changes? Light grey on grey? What kind of bullshit is this? No color in title bar? Are you insane? GIVE US AN OPTION TO REVERT TO OLD THEME!! It’s so typical and brainless trend in the industry. Sacrificing usability for style and fashion. Who defined “lighter” as elegant you morons? Lighter=harder to see. You have used grey everywhere and removed all the clean dark lines that defined various sections and borders of the UI! \n Barbara Rogos-Turek \n Thanks for all your feedback. We are going to investigate all problems you’ve mentioned. Please notice, that Developer stream is one of our ways to test and introduce changes to our most experienced users. \nStay tuned, adjustments are coming soon! \n Frylock86 \n For now I have uninstalled Opera Developer’s latest build and reverted to 44.0.2494 and blocked all updates using my Windows Firewall. That is the last usable version for me without this extremely hard-on-eyes theme. Please consider making it optional. \n Barbara Rogos-Turek \n Thanks for the information. We are currently working on visual usability of both themes and private mode \n Robert Tomaszewski \n Hi Frylock86, \nSorry if you experienced inconveniences with this release. You can disable dark theme in opera:settings in Browser section. \n Frylock86 \n I am talking about the light theme, not the dark theme. The default one which is now so horrid and full of pale grey next to white that all the contrast from the entire UI is lost making it extremely difficult to operate for me. Yes I am visually impaired. \n wolkenspalter \n I mostly agree. The light theme is missing contrast, everything is dark grey on light grey. Except for the baby blue folders in the bookmark bar. A no go colour, specially in combination the green font in the adress bar. \nI dont use dark themes and do not care about them. But if you give us the choice why not with a slider to adjust brightnessdarkness? \n Umut Körpe \n Opera best of. \n akülü tekerlekli sandalye.  https://www.fulmaks.com/tr/ \n Ariane Lu \n UI text and icon become blur on Hi-DPI screen with 125% scale. \n Screenshot: \n http://imgur.com/a/PKOdN \n Bug report: \nDNAWIZ-12065 \n DB3 \n So how can we remove the shitty facebook messenger? And not just deselecting it but totally removing it. \n daniellz \n Why you don’t satisfied by just removing icon from bar? \n DB3 \n Because it are extra extensions/modules that I don’t need or use and are completely unnecessary to make the browser work. \n Nekomajin43 \n Preselected lists are always the worst solution. \n Mikolaj Boc \n The Messenger actually is removed by deselecting it from the sidebar menu, there is nothing kept in the browser besides the actual URL and some logic to make it work. No FB’s extensions / modules whatsoever were built-in. \n Ariane Lu \n Please check this comment: \n http://disq.us/p/1g97hys \n DB3 \n Ok thanks for the info. \n Zefjam \n I deselected the messenger from the sidebar menu, yet i still get notifications whenever someone messages me on FB. \n How do i disable this? \n Leonardo Gomes \n Settings > Websites > Notifications. Check ‘exceptions manager’. \n Zefjam \n Oh, sorry about the confusion, but i didn’t mean that kind of notifications, i meant the sound notification messenger.com plays whenever a new message arrives.  \n To me that means Opera is still somehow communicating with messenger.com even though i disabled the icon from the sidebar. \n And no, i don’t have a messenger tab open when that happens. 😉 \n Leonardo Gomes \n And are you logged off from Messenger? \n Frederik \n Looks and feels very good. Keep up the good work. \n Barbara Rogos-Turek \n Thanks! We are going to! 🙂 \n dacomboman \n Like it ’cause it matches my choice on Android and it was a relatively quick response to a post requesting this not long ago. Very nice indeed! 🙂 \n dacomboman \n Dark theme on Windows is not consistent (as nice) on Linux. \nThere’s a light blue on toolbar that remains and contrasts enormously with dark open tab (on Linux). \n cr2004 \n Maybe better make it like this: \n http://i.imgur.com/CXQNT6F.gif \n Jamie \n That does look a lot better! \n cr2004 \n …and to change messenger’s icon: \n http://i.imgur.com/R37ttZm.png  (sorry for the quality of the screen, but it is made in order to show my idea 🙂   ) \n Nekomajin43 \n Much better. \n Barbara Rogos-Turek \n Thanks for your input. Unfortunately we cannot modify Messenger icon. \n Herr Pietrus \n And that’s the problem with MS minimalistic application icons. it’s impossible to force everybody to use them. 🙂 \n alexSuper \n They just split.  http://i.imgur.com/jDHQItK.png \nHow to reproduce: 1. click on one folder 2. mouse over another folder \n Nekomajin43 \n Will you make it possible to pin any site to the sidebar and open in a panel, or we have to use a few preselected ones? Which is a very bad solution, btw. \n MrX1980 \n Hi, I had to disable the hardware acceleration on my Lenovo Yoga 710-14IKB (HD 620 / v.4550 [Lenovo] or v.4590 [Intel]), else the Opera menü will not open/visible and also the context menü at speed dial -> tiles. The Opera builds before was working with no problems. Windows 10 Insider 15031 x64 \n oic \n It be nice if the bookmark located on the side bar actually open up  side panel instead of creating its own tab \n Nekomajin43 \n The same with History and Dowloads. \n Barbara Rogos-Turek \n Indeed 🙂 thanks for the feedback. More changes incoming soon \n Vlad T \n Hi, the new Opera runs very fast 🙂 But I still have problems with some sites fonts.. I see this problem only with my notebook (Win10, 1366×768). \n http://i.imgur.com/VHegZWC.png \n Томица \n Web video (H.264) still not working on Linux. Shame. \n Radek Rzepecki \n For h264 to work on linux you need to have ffmpeg codecs installed. However, you have to wait until compatible ffmpeg version is released, or download and install a custom package. \n Томица \n Radek, sorry I can’t agree with you. I now have installed Opera Dev \t44.0.2463.0 in which H.264 works just fine. It also works without a problem in all my other browsers. Also, in the changelog for Opera Dev 44.0.2475.0 it is clearly stated that a known issue is broken support for H.264, so even the developers are aware of this bug. I do not expect to have to install anything on my end, because I don’t. I already have everything I need for H.264 to work. All that’s left is for the Opera devs to finally fix the known issue, not for users to mess with their systems on an individual basis. \n Radek Rzepecki \n unfortunately, we cannot do anything about it. We depend on chromiums ffmpeg to play h264 videos on Linux. So you can either install a custom package or wait until the compatible version is released for your distro. \n Томица \n I see. Well thanks for clarifying that, it means a lot. I should check what’s the deal with this issue with Chromium community. \n L33t4opera \n Hi, please have a look  here , except that you need to download the opera-developer-ffmpeg-codecs package, instead of the opera-ffmpeg-codecs 😉 \n Oskar \n Great update! Really like the new feel and look! I don’t like the new animation when closing a tab though, feels like a bug. Should be the same as on Opera stable. \nAlso, please fix synching of passwords between desktop and mobile! \n Tratsing \n ,,Show system colour on top bar” is broken. It is not functioning. Only white color stays active. Even then, when there is a change in the system colour. \nI hope that ,,Switch to dark theme” option could work with ,,Show system colour on top bar”. \n Shtorov \n Can we add extensions for sidebar in this new version of sidebar(maybe in future)? \nSorry for my terrible English. \n Marko Koivuniemi \n I must say I love it. Nice job. Not tested yet with Windows 10 only in OS X. \n FB George \n Complaints \n1) The menu icon has a top margin, whose role I don’t see. \nIt just makes clicking it harder in full screen, I usually move the mouse in the corner and click, \ntop-right the close button, bottom-right show desktop, bottom-left start menu, top-left the opera menu. \n 2.1) The facebook messenger, why only facebook messenger? Why not let us define a site like Vivaldi? \nIt might be on your list, but I don’t understand why you wouldn’t ship a more complete feature. \n 2.2) The unpinned window is resizing very smoothly, but once it’s pinned resizing stutters a lot. \n“More social services are planned in the future.”  Please NO , let us add the sites we need/want. \n 3) Going from settings to any other page from sidebar opens a new tab and there’s a flicker too. \nEnabling the “Settings component” in opera://flags/ fixes this. \n 4) The dark theme is very unpolished. \n 5) The tool tips for the sidebar items are annoying once you know what each item does. \n Suggestion \nAllow for grouping of sidebar items, dragging an item on top of another groups them together. \nOpen a group either by click or hover. \n Robert Tomaszewski \n Hello FB George, \nThank you for your feedback! Please notice that this is the Developer version so we are in progress of polishing things. Thanks! \n Krzysztof Pogłódek \n Hi Robert, \nIs there any option to add Google Hangout support for sidebar a you did for Facebook Messenger? \n Robert Tomaszewski \n Hi Krzysztof, \nAs of now there is no feature to add or customize the communicator there. Although we consider adding additional communicators soon. \n Krzysztof Pogłódek \n I would love to see Hangouts. Really! If you (as a team) will implement such feature I will go to Wroclaw and say thanky you personally. Bears on me! \n:-p \n Nekomajin43 \n The only acceptable solution is to allow adding any site to the sidebar. No preselected lists, no built-in stuff. \n pauloaguia \n Actually I can see that being the result of pinning a tab -> moving it over to the sidebar, where it could be accessed briefly without really leaving browsing. \n Nekomajin43 \n I think pinned tabs and sidebar web panels should be distinct features. The latter dfinitely has advantage, but I like to use full size tabs even for chat. \n Foldex \n Hello, I have one question. \nAre you planning in the future to extend the functionality of built-in adblocker? \nI mean for example, that I want to add some ads that are natively on the page. \nuBlock has that option. \n Good job! \nDobra robota 😉 \n BK \n Yes, we do plan to enchance adblock functionality \n Foldex \n Thanks for your reply 😉 \n kapsi \n Looks good, but it doesn’t integrate with the extensions sidebar. \n Вадік Дудар \n Please, do Opera Turbo traffic counter like on opera mini. I`d like to know how many MB i saved on my laptop. \n Krzysztof Pogłódek \n Please add Google Hangout support in sidebar. \n Dmitriy \n Please make big Extension icons as it was before! When you change the DPI to 125% \n http://i89.fastpic.ru/big/2017/0208/84/85795e3545ececef93778b1ab72d4384.jpg \n DataZByteS \n Happy to see a dark theme in opera!  \n After using it for a bit couple of things: \nWill internal pages such as bookmarks and config get a makeover? Can be quite jarring switching to them. \n Same as above for ui elements, opera menu, rightclick menu. \n At the moment theme appears gray, would be nice to tone it just a little bit darker. \n Foxy Informática \n I’m impressed with the quality of Opera. Congratulations to the team. I’m loving it and making it known to friends. It’s fast, clean and looks flawless. \n Marko Koivuniemi \n I think this is new issue in this build. Very weird behaviour when using FB-sharer in this site: \n http://arialsio.vapaavuoro.uusisuomi.fi/kulttuuri/191223-minut-kaapattiin-ufoon \nSharer windows flickers constantlly (at least in OS X) but works still. Can anyone confirm? \n Devocalypse \n Good work on the new build and on making it PGO again. \n The good stuff >> \n – Fast and responsive. \n– The dark theme is nice, albeit could be a bit more black and less gray. \n The bad stuff >> \n – In Dark mode – address field suggestion text color is a bit heavy on the eyes. Dark blue on grey is never a good idea. Need more contrast. White on grey like the address itself would be alright. White on black even. \n– All internal views (settings, bookmarks, history, etc) have to inherit the selected color scheme otherwise there’s not much point to have a dark tab bar only. When going completely dark – we’d want to style the webpages as well. That would require something along the lines of:  https://lnikki.la/articles/night-mode-css-filter/ \n Kev \n LOL is more Speed, Nice. \n Stanislav Stratil \n Unrelated to this build, but is there any future possibility for adding  https://www.youtube.com/feed/subscriptions  and  https://twitter.com  to my news feed? \n Leonardo Gomes \n Wouldn’t it depend on the pages themselves?  \n Stanislav Stratil \n I dont know… would it? \n Leonardo Gomes \n As far as I know, the page needs to provide a feed source. \n Vikruntasas \n Will it have WIndows 7 Aero integration? \n swagnoodle \n It doesn’t blend in with Aero? Wow, that’s pretty awful. I can’t imagine how bad this would look next to the rest of Windows 7 \n NazmusLabs \n Well, Windows 7 will be killed off in less than three years. When Windows 7 came out, Android Gingerbread didn’t even exist. Yeah, that’s how old that piece of OS is. \n led9ru \n Aero – It can be added in Windows 8 and 10 by third-party program. Do you understand – lot of people like Aero!  \n What does old age or an android, when we talk about Aero? Do you see any connection? Transparency is pleasant to people, it is clear to you? \n shadow118 \n Transparnencity will be back with Windows Neon and Redstone 3 \n Herr Pietrus \n But only for the side-panels. There will be even no title bars. Oh, I mean they will be in the old Win32 applications, but MS thinks that nobody will use them any more.  \n My1 \n exactly, I saw the reborn theme just yesterday when it hit beta and to be honest it’s ugly, I does everything NOT to follow the system theme, whether it be titlebarts, context menus or anything for that matter. is it so hard to follow the system theme? \n Nekomajin43 \n Just take a look at the OS market share… \n My1 \n market share aside wouldnt it in general make more sense to follow the OS theme instead of building some stuff yourself? \n Watermurf \n Not sure I like the new interface…I think it’s lost some of its clean lines with the new side bar.  With the sidebar collapsed, the Opera menu icon is distracting.  Any way to move it to the right side…a la Firefox and/or Chrome?  Also, I love the look of the current “private” Opera title bar (the darker gray), and wish that look could make it into the standard version of future releases of Opera.  Love the contrast of the darker title bar. \n Sebastián Lalaurette \n > Any way to move it to the right side…a la Firefox and/or Chrome?  \n Please don’t do this. \n tarkus \n Opera has the looks, that’s for sure – nobody is going to choose another browser depending solely on the UI ! But … the dev team is customizing the browser by themselves not letting the user do it, that’s the problem – there are other issues that cannot be resolved by the looks and, believe me, you will see them coming your way again and again! Anyway, Opera is stunning and continues to evolve in that path! \n LamiaLove \n Depends what you mean when saying “depending solely on the UI”. \n Robert \n You cannot add black to look better? \n http://s009.radikal.ru/i309/1702/82/5e7523d90188.jpg \n Julian Lugod \n I think I’m loving the new update. I know that this theme like are for Win 10, but, I’m using Win7 with a custom taskbar and looking good. What improvements that I would like to suggest is, in Dark Mode, make it darker, I hope in Settings panel will also be in Dark Mode too. Fix when clicking Hide and Show Sidebar animation. As for the sidebar section, i hope in the future we can add what kind of apps that we want. ^_^ I rate it 9/10. \n https://my.mixtape.moe/uiaudq.png \n BK \n Thx for this feedback. \n Jeff0101 \n Is there a reason why the GPU process taking up 1GB+ ? \n http://i.imgur.com/KbjnmAN.png \nWin10 64Bit \n Ralf Brinkmann \n When doing what? \n Jeff0101 \n everytime i watch a stream on twitch \n Ralf Brinkmann \n Not here. \nW10x64 \n of \n I have weird extensions icons behavior. They are aligned to the bottom of the address bar.  http://imgur.com/E90BrHw \nMy DPI is 150%. Win10 x64 \n Rodrigo Wander \n It’s not opening “opera://plugins/” ? \n anonym \n http://techdows.com/2017/01/chrome-plugins-page-removed.html \n Łukasz Grzesik \n It’s just ugly at this moment, running on Ubuntu 17.04:  http://imgur.com/58RCwlp \nWell, even better:  http://imgur.com/WVTlPNv \n duhduhduh0 \n Great idea but it just looks weird \n Mateus Simoes \n make to windows 10 mobile, would be the \n best \n Matheus Bitencourt \n I don’t know why, but I think that this sidebar doesn’t match very well with the address bar. Maybe it’s the color scheme or something like that. \nI think that the Dark theme is good, but should be DARKER. Just like the M$ Edge. A dark color also would match with the sidebar. \n swagnoodle \n Yeah, this redesign’s pretty terrible. The new sidebar’s an eyesore and somehow blends in worse than the current one does. Can it just be like the one in 12.x? That looked fine. \n Darnok \n Ugh I fall in love with opera neon design and it would be great to see this design in yours browser in the future  \n Veles \n make the black color darker \n shadow118 \n This. I like the dark theme, but it’s just not dark enough 😀 \n Herr Pietrus \n Yeah, I won;t use dark theme but now it’s not dark, it’s not nice, it’s wash out gray. \n Atoqir \n A gradient window toolbar? You have got to be kidding. Vivaldi does this also in the last builds. I don’t want to go back to the vista days on my Windows 10 PC. \nBlue fluo mac folders, bright white right click menus from Chrome. \n Compared to the current UI; this is horrible. \n I used Opera because I can look it very Windows 10 native but with my accent color in the titlebar. Now the UI looks like some frankenstein breed between MacOS, ChromeOS and Windows Vista \n swagnoodle \n I half agree. I think gradients look way better than the flat shit Windows 10 pulls, but at least make an effort to blend in with the OS it’s running on \n Herr Pietrus \n I these case everything depend on the system you have. Gradients doesn’t fit Win10, Win10 ugly icons and solid background of the title bar doesn’t fit Windows 7. \nI don’t understand why they don’t want to use native Windows elements. Perhaps they are preparing only one “Windows Neon” version that won’t use any of the native elements… \n swagnoodle \n Ugh, this looks awful on Mac. Squared tabs? What are you trying here? The verison 30 builds looked really sleek and nice, this is just garbage. Not everything needs to be flat you know. Also just a suggestion: push out this terrible redesign if you want, but if you really must, at least make Facebook Messenger uninstallable. I know you can hide it, but it’s not gone. It’s still there. I don’t want anything Facebook baked into my browser \n dmatrance \n Had the same concern but apparently it’s just pointing to a web page so nothing gets installed….  phew! \n NazmusLabs \n Facebook can’t be uninstalled because it’s not installed, silly. It’s just a bookmark to the messenger website. It opens up in a side bar like window, but it’s just a shortcut to the site. Nothing else. \n swagnoodle \n No, it’s built in. The option is always there, and it loads immediately with its own UI elements and everything. Who knows what else Facebook has to do with the browser now? \n Nekomajin43 \n Man, it loads in its own document window like any other sidebar panel or toolbar bubble. \n Arjan van Leeuwen \n No, not at all: the sidebar button opens another tab running the messenger.com site (just one that opens next to / over other tabs). If you don’t open it, it doesn’t load. There are no ‘UI elements’ of Facebook in Opera: Opera is a browser, it’s just showing another window into a web site :). \n led9ru \n >Opera is a browser, it’s just showing another window into a web site \nYou forgot about advertising – you advertise facebook, like all reputable browsers. You probably do it for free, it’s just a good thing to advertise, and you use it yourself. And all  employees in your office take advantage of this, and even , I read myself, Trump uses it. 🙂 \n trawel \n Sometimes when closing a tab, all the others disappear for a few seconds (like slide completely left) and return. Also is there any possibility to have facebook messenger like in this gif (I have additional part with stuff like shared photos, contact options, etc) and would like only contact list and chat window. \n Paweł \n Just bring back grouping tabs, like in older versions of Opera, nothing else is needed.. I’m sick and tired of having every damn tab (and I have around 50) opened side by side making it almost impossible to find a certain one :/ \n Herr Pietrus \n To be honest on the Opera 12 opening the tab groups was even more frustrating for me so I stopped using tab stacking really quickly. \nI don’t even remember – where these tabs in groups switched from left to right when we use keyboard shortcuts or were we moved to the next group using them? \nIn these first scenario I must admit that nowadays tab stacking would be sometimes rally useful for me… \n Momfer1 \n This looks great !!! It’s the best Opera I’ve seen so far. \n Matheus Bitencourt \n Please bring TAB STACKING again! It’s one of the most requested feature \n led9ru \n 1. I want back TRANSPARENT, AERO title bar of Opera windows!! +”untranslatable local expressions of displeasure” \n2. Sidebar on start page = WHY IS NOT OPTIONAL? Even if I disable it, you still REMAINS DARK FIELD ON START PAGE – REMOVE THIS DARK FIELD !! \n dacomboman \n Option to hide sidebar completely would be welcome. \n Btw, the use of capital letters are aggressively annoying. \n Clasan Ibanez \n Flash plugin is not working on Debian 8.7 x64. \nIn Vivaldi, Firefox and Chrome is OK… \n Arjan van Leeuwen \n This happens because older versions of Flash have security issues, and it ended up on Opera’s blacklist. Install the newest Flash directly from adobe.com (  https://get.adobe.com/flashplayer/otherversions/  , they have deb packages) and it’ll work again. \n Clasan Ibanez \n Thanks for answer! \n Here’s how to get it: \n1.Uninstall (purge) any old version of pepperflashplugin-nonfree you might have on your system. \n2.Open  https://get.adobe.com/flashplayer/otherversions/  select “Linux (32 or 64-bit)” and then “FP 24.0 for other Linux XX-bit (.tar.gz)-PPAPI” \n3.Click the “Download now” button and put the .tar.gz file in some directory. \n4.Open the directory in Thunar, right-click “extract here”. \n5.In the new “flash_player_ppapi_linux” directory you should find (among others) libpepflashplayer.so and manifest.json \nCopy (as root) those two files into some suitable system directory (in my case was /usr/lib/PepperFlash). \nIt works! \nTks! \n Arjan van Leeuwen \n Doesn’t the package marked as ‘Ubuntu’ (it includes both the PPAPI and the NPAPI plugins) work on Debian too? That should save you some copying around, will allow you to uninstall, and possibly even update 🙂 \n Clasan Ibanez \n It’s opening xdg, so I prefer this way. \n I found a script from Ruario that can help too. \n https://gist.github.com/ruario/215c365facfe8d3c5071 \nTks! \n Arturo Martínez \n After close a tab, the rest shrink for no reason.. \n http://i.imgur.com/fFvrCyt.gif \n Der Herr Nick \n Same thing here. Strange. \n Leonardo Gomes \n It’s already known. \n Nachiketa Ramesh \n A few suggestions: \nIf you are going for a W10 style look and feel, make the dark mode truly dark as in use black instead of dark grey, and dark grey instead of your lighter grey like how UWPs theme. \n The rounded edges on speed dial items does also not look good with this theme on W10. \n Also, the gap on top of the tabs look bad. \n It would be nice if the hide sidebar button were at the bottom or in the settings instead of a persistent button. \n L33t4opera \n Hi, regarding the sidebar: \n1. You can switch it on/off in  Settings > Browser > Sidebar > Show sidebar , \n2. You can also add a keyboard shortcut to toggle it in  Settings > Browser > Shortcuts > Configure Shortcuts > Show sidebar. \n Nachiketa Ramesh \n But can I remove the button on the bottom of the sidebar? Because its aesthetics is the issue. \n L33t4opera \n Hi Nachiketa, as far as I know, such option is not available at the moment. \n F Scan \n Great update. Good to see, that Opera tries to look more integrated into the system (especially on Windows 10) but also keeps its own style. \n P.S. it would be great, if settings page on Windows would use system buttons and drop-downs, instead of custom ones. Additionally, there is no simple way (for average user) to change search engine on Speed Dial 🙁 \n Nekomajin43 \n What are you talking about? It looks like shit on every OS except Win10. \n Herr Pietrus \n I think you wanted to say: “Opera tries to look more integrated into the system (I mean only on Windows 10) and it’d great that it doesn’t have it’s own style any more”. \n  Your avatar is very meaningful. \n Andrew \n No frills, no words. Simply Best!!! Thank you guys. \n Jiri Motejlek \n Wow, it looks amazing, needs polishing yeah, but it’s a great start, well done! \n Piotr Dworaczyk \n That’s some great news! \nDon’t know if there is or where one can find a ‘Feature request’ page for the Opera Browser – in addition to the much requested page stacking, I’d also like to point to a neat little feature in the Vivaldi Browser i.e. Save page as JPG (or something similiar). Would be great and very useful if you could add that one too. Thanks \n Nekomajin43 \n There is no such page. You can use forums.opera.com for feature requests. \n The screenshot tool will be implemented, perhaps, bcause it was in the Neon experiment. Until that, you can find several extensions for this task. \n Leonardo Gomes \n Besides the forum, you can also make your requests here like many people do.  \n rek \n What will happen to the sidebar we have at the moment? Will it be possible to add extensions to the new sidebar as well? \n Herr Pietrus \n Ok guys, perhaps it’s not the best place but I’d like to remind you about one thing I was asking for. Since you removed “unsorted bookmarks” that were opened by default when we entered Bookmarks Manager can the first folder on the list be opend automatically? Now we get folder’s list on the left and on the right side of the window. Not really useful. \n It would be great also to finally have an opportunity to choose a search engine for the separate search box and to save that choice permanently. The search results should be opened in the new tab by default too. in this way we can search for something without opening new tab first and without using alt+enter. \n Matheus Bitencourt \n Really HORRIBLE design choices. I prefer the previous one. Here’s why: \n 1) Sidebar doesn’t match with address bar. Sidebar is just darker than address bar (dark theme). Horrible. \n 2) Sidebar looks awkward. \n 3) Dark theme NEEDS to be darker. It’s not black, it’s gray. It needs to be back like M$ Edge, and with REALLY WHITE icons and address bar suggestions. \n 4) The back/foward icons (and the other icons in general) are way smaller than previous Opera. It’s ugly. Make ’em big again. \n 5) Some text, just “Menu”, looks so vanished over the Dark Theme. Make it bolder and whiter. \n I know, this is just a pre-alpha release. a concept. But please, don’t ignore what I said. I think 90% people here are complaining about the same subjects that I am. \n PLUS:  Bring back Opera 11 TAB STACKING! \n Pedro Ramos \n Tab stacking… oh, good times. \n Recai Kandemir \n awsome \n shadow118 \n As some others have stated, I think the dark theme needs to be a bit darker \nAlso, you could add a separate option to show only icons in the bookmarks bar and make it more compact. I currently have just deleted all the names from bookmarks to get only the “only icons” effect. While this works, compared to Vivaldi or Edge, the icons are spread quite far apart. \n kimpimdpo \n Something I have now ceased through the VPN Opera show blocked sites. \nA couple of days ago, I quietly went on linkedin.com, and today gives “Error ssl: Your connection is not private… \nYou can not continue because the website operator has requested heightened security for this domain. ” \nProvider – MTS (Russia). \nAll right? \nWhat is the reason? \n LamiaLove \n I would assume the problem is living in Russia, but who knows, maybe there’s a bug with the VPN. What do I know?… \n kimpimdpo \n I think that it is not in Russia and in the Opera as an extension for Google solves this problem: \n https://chrome.google.com/webstore/detail/%D0%B4%D0%BE%D1%81%D1%82%D1%83%D0%BF-%D0%BA-linkedin/cgfhdokcgndnhkcjapbfanddfhecklio \n Kirie \n Please, native tab notifications. No extensions, native, please. \n https://k61.kn3.net/A/E/F/7/8/5/8A3.png \n Leonardo Gomes \n What would be a  tab notification?  \n Nekomajin43 \n I think the image is a pretty good hint. \n LamiaLove \n I’m impressed you cropped the image from the Vivaldi blog and uploaded it somewhere instead of just linking to it or something equally easy. \nHorrified, but impressed. :)) \n Kirie \n Yes, it is Vivaldi. It’s totally unnecessary to link to the blog, the image is what matters. I was only concise, and, Sorry, but… I don’t understand your horror. n.n’ Ridiculous.:)) \n LamiaLove \n The waste of energy for something which could have been accomplished so easily is humongous, thus horrifying :)) \nEasier to do it like this:  https://vivaldi.com/wp-content/uploads/2016/12/vivaldi-tab-notifications-1.jpg \n Kirie \n Hilarious. But thanks for your unnecessary effort. \nRedundant. n.n \n pytajnik \n Can you guys implement an option to add synced notes just like in good old Opera? that was one of the greatest features imo. \n vatnik91 \n А где гарантия, что Мессенджер Фейсбук даже отключенный, не будет собирать сведения о действиях пользователя в Интернете? Нафига ВООБЩЕ добавлять в Оперу Мессенджер Фейсбук? Пусть Фейсбук сам выпускает свой браузер и впихивает туда всё что захочет. \nА в Опере он никому не нужен. \n__ \nAnd where is the guarantee that the Facebook Messenger even disabled, will not collect data on user actions on the Internet? Why DO you add Facebook Messenger? Let Facebook itself releases your browser and thrusts in there all they want. And in Opera, nobody wants it. \n Nekomajin43 \n Since when bookmarks collect any data? \n Umutcan Alparslan \n hey please look my website and click to ads please. Thank you \n Юлия \n Is it only a bookrmark? It has even a defined shortcut field. While you can unallocate the shortcut, the field remains, which means it’s deeper integrated into Opera (after all why would you do that much only to a bookmark which one can remove?). \n https://i.imgur.com/gVkvVNN.png \nNote that there’s also an actual sidebar toggle field to assign a key combination. \n i noticed your reply to my initial comment too, but there’s too much to scroll so i’ll reply here \n Nekomajin43 \n Yes, it is. You can assign a shortcut to every sidebar or toolbar extension. \n led9ru \n Я думаю, что они им заплатили. \ntranslation: money money money 🙂 \n Arjan van Leeuwen \n It’s the Facebook Messenger site, that runs in a separate window, same as would happen when you open a tab and go to messenger.com. They have no special rights at all and there’s no access to your browsing behavior. If you don’t open it, messenger.com isn’t loaded – the same as you *not* visiting messenger.com. \n Nekomajin43 \n It is still a bad practice to offer preselected services. I get it, you have to use something to demo the feature, but I hope it will change in the future builds. \n Umutcan Alparslan \n hey guys please look my website and click to ads please. Thank you \n Ghirahim \n Dark theme isn’t dark, it looks awful. Make it black! \n Юлия \n You’re forcing this theme on Windows 7 too? I just realised this as I was away from my PC. It looks terrible and out of place. \n https://i.imgur.com/XDX0ULf.jpg \n And there’s no way to disable it, these flags do nothing: \n chrome://flags/#windows-10-skin \n chrome://flags/#submodule-native-theme-alt \n I’m downgrading to Opera_Developer_44.0.2494.0_Setup_x64 until you sort this out. I’m using Windows 7, not Winblows 10. \n led9ru \n Dear Developers, Windows Aero, “glass effect into windows frames” is a pleasant thing, “my precious” – can be added even in windows 8 and 10 with third-party programs, such as  http://www.glass8.eu \n What have you done in this release? You are forbidden to me and other fans Aero use it. What is this if not a mockery? \n Why did you take away from the Aero users the possibility be happy? Stop it! \n g d \n facebook ‘mess’ anger sell-out! Please get rid of this button. \ntheme is white on white for dark contrast. \ndo you think everyone in world has same color on their computer? \n Harry \n I just spent a few hours testing this on my Win7 Toshiba laptop. \n To be honest, I don’t find this version to be that fast at all compared to the normal version. \n The light (no theme) color presents a washed-out appearance. The address bar icons ( Back, Forwards, Reload) etc. need more depth. Same with the menu bar. \n Dmitriy \n Please do not make more dark theme, I like gray! Or make three choices: black, gray and white! \n Ariane Lu \n I don’t like gray theme, like smog. \n Isaac \n Double click closed tab please firefox is my best browser but Opera also missing double click tab close \n L33t4opera \n Hi, you can close a tab with Shift+Click, or Middle-Click on the tab. \n LamiaLove \n I never could understand why middle-click is not obvious to some people. \nI saw a guy complaining about this for some other browser and saying he doesn’t want to “have to remember” that middle click closes a tab. \nHoly shit! If middle click is hard to remember, it would be hilarious to see him use a keyboard. \n DMCA \n After reading the blogs about ‘neon’ and ‘opera44’ i come to the conclusion that a lot can’t read and scream by the first word writen. \nMy system saw only one other browser and that was IE because i had to google Opera. \nSo please stop talking about that other browsers are better, just use them and delete Opera. \nAbout win10, if win10 was from apple you’ll would run to the store and buy it for $1200. \n but it’s free so it must be crap? just stop whining about it, you can’t stop the future. \nAbout opera44. I like the messenger idea to keep it in one window, love the dark theme. \nGo for it Opera Team lets make the www a better place. \n Nekomajin43 \n You originate from the “newer is always better” concept. \n swagnoodle \n Except the latest version of macOS is just as free as Windows 10, and it’s actual quality software, unlike Windows 10. \n BK \n thanks ! \n Paweł K. \n Tab bar works terribly. When I close some cards, the other cards jumps, compres on the left side of the bar or just disappear until i move cursor out from the bar. terribly. \n Mikolaj Boc \n Fixed already, next release shouldn’t have it. \n Paweł K. \n i see another performance problem –  during playback youtube, my Surface Pro 3 is almost burn \n Sebastián Lalaurette \n I’d very much have the menu not obscure my leftmost tab, thanks. 😉 \n Also, what was wrong with the titlebar being colored according to my desktop? I enjoy that. \n PaweelOS (Paweł A.) \n Changing a plus. I suggest that more Menu change to a darker color. Sam darker colors, it looks a little pale. I think the more vivid colors, better to look. \n Anonimo \n Seems like I can’t disable windows 10 theme! even with “windows 10 skin” set to “Disabled” in opera://flags \nI’m on windows 7 and Opera looks inconsistent with my OS \n Momfer1 \n Time to upgrade to 10. \n Nekomajin43 \n Time to implement native OS skin. \n Anonimo \n I can’t for a various reasons. \n Ariane Lu \n I think this is not “Windows 10 theme”, It’s a new theme for all user. \n inDigazzZ \n Bookmarks bar behavior like in Chrome, please… \nShow only in Speed Dial or always show \n Anonimo \n Resizing window with 500+ tabs is almost impossible… It’s really slow in comparison to old UI… \nSame problem is with resizing the sidebar,  it lags with refreshing everything… \nCan we have option to disable tabs bar and leave the title of the active tab only? I use dropdown tab list menu, since tabs have 1px. \n Ari \n 500 tabs lol, dude wtf \n Anonimo \n 500 is nothing when I work… I have 1891 right now. With previous Opera there were no hiccups, the experience was really smooth, but now it’s just so bad I can’t work. I switch tabs using popup and I use vertical tabs extension as well, so yeah…. managing so many tabs is really easy. \n Apostoł \n Maybe you should start closing them..? There is such function, you know. \n Anonimo \n I don’t close tabs with documentation when I’m programming, it’s faster than bookmarking-reopening and scrolling to find something I had open just a second ago. This way I save bandwidth, and my precious time. I don’t have to excuse myself to a user that uses maybe 10% of the browser’s capabilities. I’m just signaling to devs there is a huge performance regression in this build, because there were absolutely no problems before this update. Think of it whatever you want. \n Apostoł \n Good for devs, that such extreme conditions tester like you exists. Not kidding. \n Blapidoup \n If there is a regression in performances, it should be addressed as it is a huge problem. \n LamiaLove \n 1891 tabs open… \nYou are insane. \nI love you. \nMay I please have a screenshot? \n Anonimo \n sure: \n http://pasteboard.co/BZD52a1Wh.jpg \n LamiaLove \n That is insanely cool. \nDoes that extension do lazy loading or something like that? \nIf not, how much RAM do 1891 tabs use? \nDo you even need bookmarks if you use tabs this way? \n Anonimo \n I developed my own extension that keeps a determined amount of processes alive, when let’s say I set it to 100, if there are more tabs created, the oldest will be killed, of course list is constantly updated when tabs are activated. When tab is activated and its process is dead, the extension will reload the page. In this way Opera takes around 10GB of RAM (I have 32GB, so it’s perfectly fine). The extension in question is that square skull like icon. It’s at the most right on the screenshot. There is a catch tho, it works in Opera Developer only, since chrome.processes API is available in “opera developer” aka “chrome canary” builds only. \nI can upload it for you if you are interested. \n EDIT: \nLazy loading is already available in Opera, so only one tab is loaded when Opera starts. \nCheck in Opera’s Settings “Delay loading of background tabs”, but you must change one more thing, since Opera folks recently “decided” to lazy load tabs in the background anyway (I don’t know what for). \nOpen: \nopera://flags/#extended-lazy-session-loading \nand set it to “Disabled” \n Yes I use bookmarks, but rarely. Just in case if I lose my session. Even if I frequently do backups of “Current Session” file in the profile folder. \n LamiaLove \n Thanks a lot for the offer, but I don’t really use Opera anymore for anything other then just checking out what the latest features are. Just for old times sake. And I also don’t like to use beta software or worse. \nBUT that extension sounds like a lot of invested time and effort. I think people might appreciate it. Is it complicated to add it to Opera extensions store? Does it also work in Chrome? Is it complicated to upload it to Chrome store? \nWho knows, if there’s nothing like it around, you might even make a few bucks for it. \n Sebastián Lalaurette \n Relevant xkcd:  https://xkcd.com/1172/ \n GeekyMonkey \n You’re interneting wrong. \n s fauske \n crashes every time. worst browser \n Ralf Brinkmann \n No, does not. Best browser. \nAnd now? 😉 \nW10x64 \n Momfer1 \n Indeed. Best browser. No problems at all. \nAlso W10x64. \n Anonimo \n What is your OS? Some more info? You can try with a fresh profile and if it still crashes, please report a bug. \n Sean Köllewood (Doc Köllewood) \n [SORRY GER] \nIch hoffe es bekommt endlich vernünftige Lesezeichen Synchronisation / Import / Export \n Ich liebe ja NEON und wenn NEON die neue MOBILE Variante (für Android&iOS)wäre (die es auch für Windows Desktop & UWP oder wie das heißt gäbe wäre ich zufrieden \n Mikolaj Boc \n Halo, du kannst die Lesenzeichen mit Opera Sync synchroniziesien. Kuck mal: \n https://www.opera.com/help/account#sync \n GogaRUFI \n Dear Opera developers,  \n When I have a lot of tabs open they become too thin. I can see neither titles nor logos. Even the close button becomes almost invisible. Why don’t you want to make it configurable, so that we could define minimum width of the tabs ourselves and then if there are a lot of them open the tabs bar just becomes scrollable – like it is done in Firefox. “Recently Closed” is not helpful at all, every time I need to find a tab – I have to open it and then scroll from the top to the bottom. It seems that no one else here suffers from this tabs implementation, but all the developers I know have a lot of tabs open all the time, they have to use all these ugly extensions with vertical tabs. Also hotkeys are not helpful – when there are a lot of tabs it takes way more time to use hotkeys going through all of them than finding one on the tabs bar by quick scrolling. Eh, I would like to use Opera more, but the tabs are killing me and my time.  \n Please, please, please make the tabs bar scrollable and the minimum width of the tabs configurable – then everyone will be happy and I will finally close all other browsers and use my favourite Opera for work as well. \n Thank you! \n filbo \n Opera devs, please see DNAWIZ-10592 along these lines.  Text of this, as \nsubmitted, is attached below. \n ========================================================== \n Date: Thu, 05 Jan 2017 06:59:04 +0000 \n Summary: favicons when lots of tabs \n Requesting a little feature brought back from the Presto days: \n In Opera <= 12, if you opened truly a large number of tabs, the browser went \nto considerable trouble to retain viewable favicons in every tab.  I am \nasking you to consciously focus on this again. \n Today, Opera is far (far!) better than Chrome and Firefox at this.  Chrome & \nFF use those ridiculous pyramidal tabs, blatantly wasting horizontal space. \nOnce you're up to about 20 tabs, say goodbye to any idea what's in each tab. \n Opera (44-dev at the moment) does much better.  I can get up to over 100 \ntabs before things start really deteriorating.  But O12 could handle 250 or \nmore tabs without a problem. \n WHAT DO I MEAN? \n Currently you do a good job of splitting the tab bar space into same-size(*) \nvertical areas.  But you do not shrink the favicon beyond a certain limit, \nnor do you reduce the border/margin/whatever it is.  As we approach the \"too \nmany tabs\" limit, the favicons start getting clipped on the right, while \nstill having a relatively large border on the left. \n O12 would shrink favicons as small as — I think — 2×2 pixels, while STILL \nretaining enough visual difference that I could tell different sites apart. \nAt the same time, it would shrink the margins so that this 2-pixel blobette \nwas either *touching* the next one, or perhaps there was a single pixel \nvertical line between — I forget. \n I'm asking you to return to that.  When you reach the limit behind which \nnone of the title *text* can be visible, drop any associated margin.  When \nthe favicon will need to be shrunken below perhaps 8×8 pixels, remove one \npixel of border; then another; until at the furthest extreme, there is *no* \nenforced border inside the tab, only the single vertical pixel drawn between \nadjacent tabs. \n Even, I think, conduct some experiments on whether favicons remain more \nrecognizable if you shrink them less in the vertical dimension (which after \nall is not diminished by large numbers of tabs) — that is, perhaps \ntransition from shrinking to 6×6 to 5×6, 4×6, 3×5, 2×5 ???  I don't mean to \nconduct a huge study, but surely someone could spend an hour deciding \nwhether to go all the way to 2×2, or whether allowing it some vertical \nstretching room, 2×5 or whatever, produces better overall results.  (You \ncould also use some of that vertical space to display 1-3 chars — in tiny \nfont — of what the title would have been.  Be creative!) \n Superb handling of huge numbers of tabs was a mighty strength of Opera \nPresto.  Please reach for that. \n (*) Same-size, except for the current tab which has a 'x' close box \ndistorting its size.  On an Opera window with a huge number of tabs, this \ndistortion is truly ugly.  I have never wanted an 'x' on any of my tabs, not \nall of them, not the current one, not one I'm hovering.  Please give back \nthe ability to disable it. \n (*) I think pinned tabs also have different size rules; I mention this for \ncompleteness — I don't use them. \n NOTE: for test purposes I just open a few actual web site tabs, then lean on \ncontrol-T for a while.  Empty tabs don't create processes in my setup, \nthough this may vary depending on various lazy-stuff and \nwhat-to-put-in-new-tab settings… \n Geazi Soares \n Mouse Gestures Settings plsssss!!!! \n inDigazzZ \n Settings – Start page – Maximum number of columns \nShould be linked to device. \nAt home i have 1440×900 and want to set ‘Maximum number of columns = 4’ \nAt work i have 1920×1080 and want to set ‘Maximum number of columns = 7’ \n Leonardo Gomes \n And what prevents you from doing that? \n inDigazzZ \n I’ve set 4 columns at home and got 4 columns at work instead of 7 that was already. \n Leonardo Gomes \n Do you have sync enabled? \n Anyway, you can set 7 on both because the number of columns will always depend on your screen size. \n Blapidoup \n Facebook by default… ok… \nPlease make it so that you can at least remove it entirely from the browser. Nothing specific like that should ever be built-in. \n That animation when hovering the speed dial is horrific too. It feels like the UI is buggy and it’s really irritating! \n alexandrep56 \n Please I want Emojis for TouchBar on the new MacBook Pro ! \nStill using Safari for that… \n Rade Martinović \n Extension bar (F4) is does not change with Dark mode – it stays white. \n useYbrain \n Where is facebook messenger notification beeps or visual settings? \n Krteq \n I’d also like to know. Where I can disable those irritating notification beeps???  \n They are still there when I’m logged off facebook and even when messenger is not active in a sidebar. \n dacomboman \n Side panel has disappeared! \nHow can we get it back? \n Leonardo Gomes \n You can enable it in Settings.  \n dacomboman \n Duh! gee boss!! \nWould be nicer to have a hotkey for that. \nThanks! 😉 \n x a \n Extension sidebar can be toggled via Ctrl-Shift-S or O-Menu»Extensions»Sidebar. \n New Sidebar can be collapsed clicking on the →| arrow at its bottom; it can be reenabled from Speed dial and other internal pages clicking on the |← arrow in the lower left corner or in the settings, as LG suggested. \n dacomboman \n Ctrl-Shift-S etc. only gives me a sidebar with + sign for extensions. \nA glitch maybe? \n Leonardo Gomes \n This is the extensions sidebar. Click on ‘+’ to add extensions to it. \n dacomboman \n After doing Ctrl+E to show extensions, i clicked on show/hide sidebar and it’s back to normal. Ctrl+Shift+S did not but, as posted, only extensions + sign came out. \n reiner1302 \n Dark Theme highly appreciated. But when can we have a polished version? \ni.e. active tab color, colored sidebar, etc. \n Leonardo Gomes \n What would be a ‘colored sidebar’?  \n reiner1302 \n the sidebar is white and does not match the dark theme colour. \n Leonardo Gomes \n Ah, so you want a side bar that follow the theme? It would be nice. \n Marko Koivuniemi \n I like this facebook messenger thing – but now behaviour is not the same with another sidebar items. I would like to close item when clickin symbol again – just like happens with messenger.  I understand that messenger opens it’s own windows but still. I would think it’s easier to use if items in same place behave just like others. \n Shtorov \n Please, give us opportunity to add own sites in sidebar. \nWithout hardcoded preselected(and limited) lists \n Marcos Jacoby \n In Linux x64, Opera stable and beta redirect address opera:plugins but this dev version says don’t reach the page. Is there a workaround? \n Leonardo Gomes \n Redirect to what? The opera://plugins no longer exist. \n Marcos Jacoby \n As I said, opera-stable and opera-beta show the installed plugins when it is typed opera: plugins but opera-developer shows the default page that says “Can not access this site”. How do I access the list of plugins installed on opera-developer? \n Leonardo Gomes \n You are seeing that message because that page no longer exists as I said. \n Try opera://components. \n Marcos Jacoby \n components list nothing. some other option? \n Leonardo Gomes \n Nope. \n Marcos Jacoby \n Well hopping now and crossed fingers to opera:plugins be reinstated in developer….. \nOne more question: \nIn Linux versions (specifically ubuntu) where opera stores or catch or both the path of the plugins? How modify directly in opera config instead affecting entire system to do the same? Specially for adobe flash plugin PPAPI. \n Leonardo Gomes \n Opera://plugins is dead for good.  Opera://components should list all plugins, I guess.  \n Sorry, not a Linux user myself so I have no idea.  \n Marcos Jacoby \n The problem with plugins page is that function was removed in chrome version 57 that is the actual base of opera-developer….. \n Leonardo Gomes \n Yep,  Chromium deprecated it.  \n Marcos Jacoby \n In Linux versions (specifically ubuntu) where opera stores or catch or both the path of the plugins? How modify directly in opera config instead affecting entire system to do the same? Specially for adobe flash plugin PPAPI. \n L33t4opera \n Hi Marcos, you can modify the paths for the PPAPI Flash in “pepper_flash_config.json” file – you can find this file in Opera’s root installation/resources subfolder (check the path in opera:about, the default path for Ubuntu 64-bit should be as follows: /usr/lib/x86_64-linux-gnu/opera-developer). The current list of the plugins, and their settings are stored in the “Preferences” file, under the “plugins_list” section – you can find the file in the profile’s root directory (check the path in opera:about). \n xirit64 \n I’m on windows 7 and don’t like having anything “windows 10” on my machine, otherwise I would have “upgraded” long ago. Please don’t force this look to us and look so much like Vivaldi either, the way it is now is perfect. \n We still got 3 full years of windows 7 support! \n LamiaLove \n Ypu say Opera 43 is perfect and should not be changed. \nOpera 12 fans say Opera 12 was perfect and should not be changed. \nOpera 11 fans say Opera 11 was perfec and should not be changedt \netc. \nDo you see a pattern here? \nWhere should it stop? Before we even had browsers? \n xirit64 \n No, there is no  pattern the way you describe it. It’s all about how it doesnt’t respect windows 7 and forces windows 10 as “normality”. \n LamiaLove \n You are wrong. \nI have heard people say Opera 12 was the best Opera. \nI have heard people say Opera 11 was the best Opera. \n That pattern exists, whether you are willing or not to admit you are part of it. Everyone  in the pattern, regardless of which stage they are on, has their own reasons which they strongly believe in. \nOf course, the ones at the latest stage of the pattern dismiss the others in the pattern as being just fussy and they are the ones who are right while also not believing the others who tell them they are also part of the pattern. \n LamiaLove \n Denying the pattern doesn’t make it go away, you know. \nI can understand why you would be pissed about not respecting Windows 7 GUI, but Microsoft started it. Visual Studio does the same thing. \n Simn Go \n it is not dark theme(black theme like in the egde) it is a gray theme \nI’m so sad \n Leonardo Gomes \n Well, it’s a dark theme but may not be a black one. \n Simn Go \n Windows 10 task bar – black \nWindows 10 new menu – black \nWindows 10 egde – black \nOpera 44 – gray, why? \n Daphen \n You can change the color on everything in Windows 10. \n Simn Go \n Yes, but I can’t change Opera gray to black \n Daphen \n Yeah, I installed it on Windows 10 when I got home and it’s nowhere as pretty as the Mac version. Oh well. ¯_(ツ)_/¯ \n raphah \n I want bookmarks button in the top bar, like 5 years ago \n inDigazzZ \n Try  https://addons.opera.com/ru/extensions/details/bookmarks-2 \n raphah \n I know this. but native would be better \n BF3000 \n Still waiting for the stacking tabs. \nThat is exact reason why I’m still use other desendant of original Presto Opera. \nIt’s slow, its buggy, but unlike chromeopera it have things I need in the interface. \n LamiaLove \n IKR? Vivaldi FTW! \nI always said even on Vivaldi forums that if Opera 12 would be revived and supported again or every major feature from Opera 12 would be added to new Opera, I would drop Vivaldi in a second even though Vivaldi has a great idea with the “web” GUI. \n Unfortunately, Opera is going Chinese and I have serious doubts about its future, but I would still be VERY tempted to leave Vivaldi. At the very least Vivaldi would be my secondary browser unless Opera would screw up something big-time. \n skobkin \n I like the dark theme. But I can’t say that this is well readability: \n https://storage4.static.itmages.ru/i/17/0221/h_1487671043_6910120_94a5761cc4.png \n White text on light grey background? \n And why the theme can be chosen in the speed dial settings while it applies to the whole browser? \n L33t4opera \n Hi, you can also select it in Settings > Basic/Browser > Themes. \n skobkin \n I know. But why this setting is accessible via Speed Dial settings? \n L33t4opera \n Most probably because the SD is the default page, that is displayed when you open a new tab, and is expected to be seen as the start page of the browser, so in that case it’s quite logical, that you can select a theme here. It seems to have also one more advantage, when you’re doing it here, you can see a larger part of the background, than in the Settings, and therefore you can better see, if this is really what you want. \n Blapidoup \n After a few days of tests, I have to say the UI has a lot of problems: \n – If you close a tab, tge remaining ones goes to the left and it’s very buggy. \n – It never goes maximised, there are like 5 pixels of empty space all around the screen (even at the bottom). If you click on it it moves the browser window. \n – When going from tab/history/etc. to Settings on the sidebar, the screen will entirely refresh. \n – There is a lot of wasted space in the tab bar between the “+” button and the “Tab Menu” button. \n – The maximise button does not work at all when already maximised. Sometimes it is even totally blank. \n – The minimize button is really weird being stick to the bottom \n skobkin \n > If you close a tab, tge remaining ones goes to the left and it’s very buggy. \nVery-very irritating bug. \n refi64 \n That’s probably why it’s not the stable release yet… \n Blapidoup \n And that’s why we need people to report it….. \n Krteq \n Where can I disable those irritating messenger notification beeps? \n They are still there when I’m logged off facebook and even when messenger is not active and not present in a sidebar. \n dacomboman \n What are these windows that show at start up, always different from one another? \n http://imagizer.imageshack.com/img924/373/6Ag7Qs.png \nCan these notifications be disabled? \n Leonardo Gomes \n I’ve never seen it before. What OS? \n dacomboman \n Windows 10 64bit on SSD \nHere’s another: \n http://imagizer.imageshack.com/img924/3859/oNLEDp.png \n filbo \n How to disable or use personally modified browser.js in modern Opera? \n I specifically want to change the behavior of an existing Opera browser.js function, to see if it is causing a problem.  If I edit it while Opera’s running, it doesn’t pick up the changes; if I edit it then start Opera, Opera replaces it with a clean version.  Which isn’t surprising, given it’s digitally signed. \n How do I override that? \n L33t4opera \n Hi, you can disable it for the current session in opera:browserjs. \n filbo \n I’d prefer to be able to more surgically just remove the one patch I want to focus on — i.e. use my own-provided browser.js invoked at the same exact point in DOM startup as the “real” browser.js — but I guess that will do.  Thanks… \n landry \n Hahah! New updates and the few first comments are all about to override, disabling & removing. So sad, i used to love Opera, I thought it was the best thing that ever come from humanity 🙂 \n LamiaLove \n But IT WAS the best thing. That part will always be true. \n Blapidoup \n Another problem: with the sidebar enabled, if I click on the speedial icon for example, I expect it to open it in the current tab, NOT a new tab. If I want a new tab I will press shift before clicking or middle mouse click. \nI noticed that consistent behaviour has been lost a lot in the Chromium Opera, sometimes it opens in the current tab, sometimes not. What happened to the ergonomic team in Opera? 🙁 \nJust let the user decide of what s.he wants! \n Another behaviour that could be expected is that it opened a larger sidebar with the speeddials icons instead of a new tab. Same as with the Facebook Messenger. \n Junaid Ahmed \n Some kind of Messenger integration is a very cleaver/good move and a good replacement feature of old Mail integration. Hoping to see it in the beta version soon. \n Nekomajin43 \n No, it’s not. \n Junaid Ahmed \n Maybe for some it’s not but Windows 10 has light built in always running mail client(it doesn’t always work properly but it works for most of the people. Plus most of the young people today use messenger instead of mail). Sooner or later everyone has to switch to Windows 10. Then costing valuable time in mail integration will be useless. \n Nekomajin43 \n I don’t need a built in mail client, but I am against any preselected service.  It must be a general solution. FYI, this is only a web panel, there is no integration. \n pauloaguia \n I like the idea of being able to see some often used pages this way – quickly checking if I have new email without having to look for its tab or be notified of a new conversation in Slack, for instance, would be very welcomed. And this is indeed a move in that direction – just allow the user to configure a page to be displayed on the sidebar and use the Desktop notifications the website already provides to know when to decorate the icon… \n Favoring a particular application or interfering with the workflow of people that prefer to use in a different way (like all the comments complaining of being notified twice about new messages) is not such a good move in my oppinion… but that’s why the developer edition comes before the beta and stable ones 🙂 \n Jonattan Chuquimia \n I think that android version (not mini) has a better approach, I mean, the home permanent mini-tab, the minimalist hamburger menu button, the red colored text in active tab, the thin red loading progressbar under toolbar, and the posibility of having a speech button in addressbar, all those details create a better experience for users \n Bow Carlos \n Windows version 44.0.2505.0 (PGO) \nEvery time I close the last tab by clicking the “X” button, the other tabs shrink. \n https://vid.me/8TKK \n Leonardo Gomes \n There are already several comments on this. \n Anda Panda \n Crash all time on youtube! \n Leonardo Gomes \n What OS? I have no problems with Youtube here on Windows 10. \n shadow118 \n I don’t like the dissapearing scroll bar. You have to first scroll with the mouse wheel to even make it visible. so that’s already an extra step (what if your mouse wheel is broken or you just want to smoot scroll with the good old click-and-drag method?) and if the site has a black background, you just can’t see it at all. \nOne solution could be to make it appear when you hover your mouse over the right side or just not make it dissapear entirely \n L33t4opera \n Hi, go to  opera:flags#overlay-scrollbars , and disable it, restart the Opera, and see if this is what you expect 😉 \n shadow118 \n Thanks, this is what I wanted 🙂 I do like how the dissapearing one looks, but it’s just not very practical, at least for now \n redfox \n I like the tabs with rounded corners. Will there be an option to use the previous look (up to O43)? \n pauloaguia \n Because it’s now harder to see the space between the tabs and the top of the window, when it’s not maximized, I accidently dragged a tab outside of the main browser window, into a new one. \nEvery time I tried to put the tab back, the browser crashed. Running on Windows 7 64 bits \n On the plus side, restarting the browser was much quicker 🙂 \nOn the down side, a crash is obviously not acceptable and after 3 or 4 restarts, I lost all my open tabs into an empty session :(( \n Der Herr Nick \n Same here 🙁 \n pauloaguia \n In the meantime I figured out that I can grab the browser by the sidebar (if it’s visible) and that is not prone to trigger this problem (which obviously should be fixed). I can even maximize / restore the window size by double clicking the sidebar, which is useful. \nObviously, for those that prefer to keep it hidden, this is not a workaround… \n Daphen \n Is it just me or is Facebook really low res when using the new Opera Browser? \nMust say that I really like it though, all the keyboard shortcuts and customizability really suits me, I’m going to try it out for a while. \n Кostadin \n OK so this is now officially beta. Waiting for 45 🙂 \n ovidiu \n I would really like the tabs on the side, not on top of the browser. This frees up vertical space for websites on wide screens. \n voyager75000 \n Because of Reborn, I switched back from Beta to Developer branch. Really nice work, you’ve done there!!! \n Ideas for improvements: \n– Fullscreen video has some bars / dots / thingies in the top corners (screenshot if necessary, happens at least on youtube and amazon prime) \n– I’d really love a WhatsApp Extension, like the Facebook Messenger one in the sidebar \n Keep up with the good work 🙂 \n Przemek Kudła \n The full screen issue was fixed already, available in the next update. \n yigido \n In this build, I tried to delete a bookmark in bookmark fodler, and Opera crashed. \nThe old (resolved) bug is back! Please take alook at it. \nThe multiple tabs usage is a bit laggy and buggy on dark theme, FYI. \n Der Herr Nick \n I really like the upcoming possibility to integrate messenger web panels. But for the sake of better optics, can you replace the original icon by something that fits better into Opera’s native sidebar icons? \n Leonardo Gomes \n They already said that they can’t. \n Der Herr Nick \n Sniff \n Der Herr Nick \n BTW: \n♫Sidebar toogle! \nSidebar toggle! \nSidebar toggle!♫ \n Tratsing \n I suggest that Opera would had a dark favorites bar and address bar in private browsing as it is in normal browsing mode. \n andreybest 20027 \n Fix, please, very bad bugs. When you open some tabs and close the last tab, another tabs will be some smaller, when were. \nBugs with Youtube… 480p, 720p qualities seems like 240p \nAdd please animations in sidebar, when it is locket in startpage. \nAnd, add please more animated back, refresh, … buttons! They are some boring. \nDesign – beautiful! Thanks! But bugs are realy problem… \n Leonardo Gomes \n What OS? Youtube videos look fine here on Windows 10. \n andreybest 20027 \n I am using windiws 7, i dont like w10 \n andreybest 20027 \n Chrome does not have problems with this, but chrome spend a lot of CP resources. Because it i love Opera 🙂 \n postdante \n well, that’s little too late. \nAlready on Vivaldi awaiting more exciting features 😛 \n what threw me off the Opera was a total destruction of Opera Mobile with it’s new ‘bombastic’ design and anti-usability ‘improvements’. \n David_Gould \n Both this and the last Developer version have a memory leak here.  The Neon preview build didn’t have this problem.  Is there a way to view memory allocation to see what’s going on? \n All I know at the moment is that the memory leak is on the thread that uses the most memory. \n Also, Tabs Outliner doesn’t work in this version.  It can be installed but the window won’t open. \n Cristian Cornejo Díaz \n other sidebar soon? \ni´m waiting for twiter, telegram, whatsapp, gmail!!! \n Leonardo Gomes \n Why other sidebar? \n Cristian Cornejo Díaz \n other app “in sidebar” \n M92 \n Sometimes when I’m opening a new tab in the background, it just loads a black screen. I’m using 44.0.2505.0 (PGO) on Win10 x64. \n andreybest 20027 \n Downloads panel has clean button. But this button cleans ALL downloads, running too. In stable this button removes only completed downloads and it is beautiful. \n SiMcarD \n There will be a new build tomorrow? \n Leonardo Gomes \n We will know tomorrow. 🙂 \n nanana1 \n 🙂 No need to wait till tomorrow because they are made available today on build 45.0.2522.0 \n https://get.geo.opera.com/ftp/pub/opera-developer/45.0.2522.0/ \n L33t4opera \n The  change log , and the  announcement . \n lunafag \n Good changes(especially with the recent fixes – nasty downloads bug and crash at window merging are gone) but the colors are very jarring, previous behavior(adapting to system color) was better. Could you provide a color picker at least? \n ShadowTech \n Can you guys add a way to auto hide the sidebar and maybe some more sidebar apps (twitter, gmail, hangouts, etc) \n Maciek \n Autohide, especially when you have maximized window would result with lots of reflows. That’s not only costly but also annoying for the eye as things would keep moving left right whenever it would appear. More things? We’ll think about it 🙂 \n pauloaguia \n Only if the sidebar pushes things to the side. But it can just “float” over the rest of the browser for as long as the mouse is hovering over the sidebar – in this case there would be no reflows or things moving around… Just a little bit of content hidden under the sidebar (like what happens with the menus at the top of this page here). \n bryan gee \n Does anyone know how to display other tool-bars in the v44.0 of opera, the help says to click on settings > toolbars, but there is no option for tool-bars at all in the menu, or in settings. \nAlso, don’t see any sidebar described above, mine has 7 buttons on it/ \nNo customization options, nothing, if this has no tool-bars or other options to personalize how it looks, then it’s back to firefox for me, at least you can actually customize that \n Leonardo Gomes \n How did you reach help page? It seems that you looked at a very old one for the old Opera Presto.  \n About the side bar, are you using the above build or a newer one from developer channel?  \n And no, Opera doesn’t allow that much customization.  \n Milan Nikolić \n Hey, \nI can’t get flash to work in opera. I downloaded the latest version of flash from the website and installed it, but opera doesn’t seem to see it.  \n Help. what do I do. \n Leonardo Gomes \n OS? \n Stanislav Sobotka \n Will there be addons for the new sidebar? I tried the Google Keep sidebar addon, but it pops in the old extension bar instead. I love the new look by the way 🙂 Thank you. \n Maciek \n Enjoy. Preselected messengers are just step one for this sidebar. There’s lots of things to continue with. \n Szymon Kowalewski \n After 10 minutes of using messenger and whatsapp are stop working on linux \n My1 \n is there a way to revert that theme now that it hit stable, honestly I dont like it, especially since the top bar isnt following the system style (in my case a win 7 theme with transparent borders etc) anymore. why cant software just follow the system theme instead of having to make their own stuff??? \n especially since this isnt firefox where I can throw some lines of CSS into stylish and fix the whole thing \n My1 \n how about you make the context menu, the title bar etc follow the goddamn system theme, instead of cooking your own stuff? in earlier versions there were special changes for win8 which I could easily kill off in the flags, please give me such an option for reborn. \n did you guys even think like a split second about that enforced grey titlebar? now there’s almost thing left to see whether opera is in focus or not. not happy. \n Hüseyin Ekrem YAZICI \n We need god damn editable toolbars for themes. I’m using black theme and those white bars burning my eyes. \n My1 \n it should in general be editable including an option to follow the system theme. having it suddenly override my system titlebar background completely was not funny. \n Hüseyin Ekrem YAZICI \n It will be okay too for me. All of my themes are in black 🙂 \n Alex Haskins \n Definitely consolidate the sidebars. Having two sidebars is ugly at best. I’m sure you guys are working on that. Love the dark mode in general and great work! \n Namma \n If I could customize the UI to MY specs and not some desk jockey’s wet dream of an “all mobile world” (insert high squeaky breathless intonation) then I might try it. FORGET the pipe dream of “all mobile world”. The desktop is NOT dead and people will want phablets or tablets in the future, or a wider display if we ever get holograms. You nutbakes in exec and dev departments need to stop getting on a child’s hobby horse and riding it like you’ve lost your minds.  \n Put user customization in and THEN you will have a win. It’s really quite stupid how all these browser developers want to dictate to the user when they are NOT the user and haven’t even done the due diligence to ASK the user. Disgusting behavior. \n Romuh \n Please, we really would like to have possibility to move the sidebar to the right side. I dont know why is it glued to the left? Also 2nd problem is that with couple windows there’s many instances of the same each messenger and it doesnt work, logging in each every time. \n Piotr Łabuda \n I’d kill for more customisation, though.Ideally I’d have the sidebar not present at all, while being able to bring up messengers with something simpler than three keys combo. There’s a ton of options under function keys that I do not use and could rebind for quick messenger access. \n ReaperDQ \n how do i remove the sidebar? \n lukasz kapuscinski \n right click on sidebar and unpin:) \n ReaperDQ \n that’s what i was doing but nothing happened, i restarted it and then worked 😀 \n lukasz kapuscinski \n hello how to change font size for facebook messenger (on sidebar) its far to big. tkanks \n lukasz kapuscinski \n … \n Preschian Febryantara \n Love it \nPlease add mobile.twitter.com in sidebar \n Arthur Wai \n how do i revert back this update is so shit \n GigaHertz[GHz] \n Ever since I installed the update Opera 45, every time I open it, it keeps on pinning itself on my taskbar. Even if I unpin it, it just keeps on pinning itself. \n Jakub Wasilewski \n How about giving sidebar messenger a shortcut? That would be awesome. :3 \n Roman Fröhlich \n New design is fucked up, I mean, seriously? This is the best you can come up with? Why there is setting for system color if this ugly parody of a browser does not respect my system color? I currently search for a good browser with password sync, your experiments are driving me mad. SHAME ON YOU OPERA DEVS. Bad, very bad. \n Phương Trần Ngọc \n this good, a little bit awesome with new design, but I think need to more customs for user, ex. change color, add new applications other in to reborn… \n Yehor \n Does #windows-10-skin option not work anymore? It was very useful. \n Dazy \n I chose Opera and have remained with opera because it was a basic browser marked by simplicity not bells and whistles that eat up ram… why have you messed with something that was so good….not happy seems you’re trying to become the awful google chrome browser I long left behind \n Karen Nerak \n dark theme + possibility of setting 4K wallpapers (looking at you, chrome!) = great customization I know I’m not going to just lose in a few years \nWish I could change up the colors how I wanted though \n InquisitiveTraveller \n I’m having a strange problem with my Opera browser on my Mac.  It isn’t showing Facebook properly.  The page is distorted.  This is the only page (Facebook) that is distorted on Opera.  Everything is very small and it’s impossible to read it.  I’m not having this problem with any other Websites, nor am I having this problem with any other web browsers.  Google and Safari are showing Facebook just as it should.  My tablet is also showing facebook, even with Opera Mini, correctly.  I’ve cleared my Opera browsing history, cleared the cash and even removed cookies but no change.  Can anyone out there help me out with this?  About a week ago all was well, just as when Opera was 1st installed a couple years ago.  Let me know what your thoughts are.  Thanks! \n alex ko \n i ve deleted messenger from sidebar and cant find it to add it back help plz \n Przemek Kudła \n Click the right mouse button on the sidebar and you should see a list of available applications. The messenger should be there, just tick it. \n Hasta Castanyo \n i hate flat design \n Bobby \n I can’t find the main menu button, toolbar button or theme manager button anywhere, even though all these are mentioned in your help document! I’m using Opera for the first time, so I’m not carrying any baggage in terms of expectations. However, I certainly expect your documentation to be in sync with your product. Kindly help, as the default fonts for webpages are  very difficult to read and I’m unable to find a way to change them via browser settings (any changes in browser settings are ignored, except for the minimum font size) \n marian antonov \n The design is so beautiful… from now my main browser is Opera 🙂 Thank you for this great browser \n KRis \n Will be there Viber build in sidebar like messenger, whatsapp… \n Search \n Search for: \n Follow us \n Latest downloads Opera (stable) Windows Windows (Offline) Windows x64 (Offline) macOS Linux Opera beta Windows Windows (Offline) Windows x64 (Offline) macOS Linux Opera developer Windows Windows (Offline) Windows x64 (Offline) macOS Linux What is the difference between Opera, Opera beta, and Opera developer? Tags beta \n developer \n news \n Opera \n opera beta \n opera developer \n Opera for computers \n Opera Stable \n stable \n update \n Archives   2017 \n January \n February \n March \n April \n May \n June \n July \n August \n September \n October \n November \n 2016 \n January \n February \n March \n April \n May \n June \n July \n August \n September \n October \n November \n December \n 2015 \n January \n February \n March \n April \n May \n June \n July \n August \n September \n October \n November \n December \n 2014 \n January \n February \n March \n April \n May \n June \n July \n August \n September \n October \n November \n December \n 2013 \n January \n February \n March \n April \n May \n June \n July \n August \n September \n October \n November \n December \n Share \n Twitter \n Facebook \n LinkedIn \n Google+ \n Footer menu \n Top \n Follow Opera \n Facebook \n Google+ \n Twitter \n Youtube \n LinkedIn \n Instagram \n Download Opera \n Computer browsers \n Mobile browsers \n - \n Help & support \n Opera blogs \n Opera forums \n Dev.Opera \n Beta version \n Opera Neon \n - \n Services \n Add-ons \n Opera account \n Opera B2B \n Operator solutions \n OEM solutions \n Partner with Opera \n Business blog \n About Opera \n Jobs \n Investors \n Press info \n Contact us \n Follow Opera \n Facebook \n Google+ \n Twitter \n Youtube \n LinkedIn \n Instagram \n © Opera Software \n Privacy \n Terms of Use \n Top"}