{"url": "http://legisquebec.gouv.qc.ca/en/ShowDoc/cs/T-11.011", "content": "Légis Québec \n Home \n Contact us \n Site map \n Quebec portal \n FAQ \n Français \n Advanced search \n   0 \n Consolidated Statutes and Regulations \n Consolidated Statutes \n Consolidated Regulations \n Annual Statutes and Regulations \n Annual Statutes \n Annual Regulations \n Additional information \n Québec Official Publisher \n What’s new? \n Information note \n Policy of the Minister of Justice \n Laws: Amendments \n Laws: Provisions not in force \n Laws: Provisions  brought into force \n Annual Statutes: PDF versions since 1996 \n Regulations: Amendments \n Annual Regulations: PDF versions since 1996 \n Court Decisions \n T-11.011  - Lobbying Transparency and Ethics Act \n Table of contents  \n\t\t\t\t\t\tRegulations  4   \n Alphanumerics \n Title \n T-11.011, r. 1 \n Lobbying Transparency and Ethics Act Exclusions Regulation  \n T-11.011, r. 2 \n Code of Conduct for Lobbyists  \n T-11.011, r. 3 \n Lobbyists Registry Regulation  \n T-11.011, r. 4 \n Tariff of fees respecting the lobbyists registry  \n Occurrences  0 \n Updated to 1 September 2017 This document has official status. \n Full text  \n chapter  T-11.011 Lobbying Transparency and Ethics Act LOBBYING TRANSPARENCY AND ETHICS 06 June  13   2002 06 June  13   2002 CHAPTER  I PURPOSE AND APPLICATION 1 .   While recognizing that lobbying is a legitimate means of access to parliamentary, government and municipal institutions and that it is in the interest of the public that it be able to know who is attempting to influence such institutions, this Act is designed to foster transparency in the lobbying of public office holders and to ensure that lobbying activities are properly conducted. \n 2002, c. 23, s. 1 . 2 .   Any oral or written communication with a public office holder in an attempt to influence or that may reasonably be considered by the initiator of the communication as capable of influencing a decision concerning ( 1 )    the development, introduction, amendment or defeat of any legislative or regulatory proposal, resolution, policy, program or action plan, ( 2 )    the issue of any permit, licence, certificate or other authorization, ( 3 )    the awarding of any contract, otherwise than by way of a call for public tenders, or of any grant or other financial benefit or the granting of any other form of benefit determined by government regulation, or ( 4 )    the appointment of any public office holder within the meaning of the Act respecting the Ministère du Conseil exécutif ( chapter M-30 ) or the appointment of any deputy minister or other holder of a position referred to in section 55 of the Public Service Act ( chapter F-3.1.1 ) or any holder of a position referred to in section 57 of that Act, constitutes lobbying or a lobbying activity within the meaning of this Act. The arranging by a lobbyist of a meeting between a public office holder and any other person is considered to be a lobbying activity. \n 2002, c. 23, s. 2 . 3 .   Consultant lobbyists, enterprise lobbyists and organization lobbyists are considered to be lobbyists for the purposes of this Act. In this Act, “ consultant lobbyist ”  means any person, whether or not a salaried employee, whose occupation or mandate consists, in whole or in part, in lobbying on behalf of another person in return for compensation ; “ enterprise lobbyist ”  means any person a significant part of whose job or function within a profit-seeking enterprise consists in lobbying on behalf of the enterprise ; and “ organization lobbyist ”  means any person a significant part of whose job or function consists in lobbying on behalf of an association or other non-profit group. \n 2002, c. 23, s. 3 . 4 .   The following persons are considered to be public office holders for the purposes of this Act: ( 1 )    government ministers and members of the National Assembly, as well as persons on their staff; ( 2 )    government employees; ( 3 )    persons appointed to a government agency within the meaning of the Auditor General Act ( chapter V-5.01 ), as well as employees of any such agency; ( 4 )    persons appointed to a non-profit agency established for the purpose of managing and providing financial support for activities of a public nature out of funds originating principally from the Government, without itself delivering products or services to the public, as well as employees of any such agency; and ( 5 )    mayors, municipal or borough councillors, wardens, chairs and other members of the council of a metropolitan community, as well as persons on their staff and employees of municipalities and municipal bodies referred to in section 18 or 19 of the Act respecting the Pension Plan of Elected Municipal Officers ( chapter R-9.3 ). \n 2002, c. 23, s. 4 ;  2013, c. 16, s. 127 . 5 .   This Act does not apply in respect of ( 1 )    any submission made in or prior to judicial or adjudicative proceedings ; ( 2 )    any submission made to a parliamentary committee of the National Assembly or at a public meeting of a municipal council or municipal body ; ( 3 )    any submission made in public proceedings, or in proceedings that are a matter of public record, to any person or body having jurisdiction or powers conferred by an Act, an order in council or a ministerial order ; ( 4 )    any submission made by a person other than a consultant lobbyist concerning the granting of a form of benefit referred to in subparagraph 2 or 3 of the first paragraph of section 2, where the public office holder having the power to make the decision is only authorized in this regard to ascertain whether the legal requirements for the granting of such benefit are satisfied ; ( 5 )    any submission made outside a process for the granting of a benefit referred to in subparagraph 2 or 3 of the first paragraph of section 2 and for the sole purpose of informing a public office holder of the existence and characteristics of a product or service ; ( 6 )    any submission made in the negotiation, subsequent to the awarding of a contract, of conditions for the performance of the contract ; ( 7 )    any submission made in the negotiation of an individual or collective labour contract or in the negotiation of a collective agreement for the provision of professional services, in particular an agreement under the Health Insurance Act ( chapter A-29 ) ; ( 8 )    any submission made by a person other than a consultant lobbyist on behalf of a professional order or the Conseil interprofessionnel du Québec to the Minister responsible for the administration of legislation respecting the professions or a member or employee of the Office des professions concerning the development, introduction, amendment or defeat of proposals regarding the Professional Code ( chapter C-26 ), the Act or letters patent constituting a professional order or the regulations under those Acts ; ( 9 )    any submission made by public office holders when acting in their official capacity ; ( 10 )    any submission made in response to a written request from a public office holder, including any submission made in response to a call for public tenders issued under the public office holder’s authority ; or ( 11 )    any submission the disclosure of which could reasonably be expected to threaten the safety of a lobbyist or a lobbyist’s client, a public office holder or any other person. \n 2002, c. 23, s. 5 . 6 .   Any communication for the sole purpose of inquiring as to the nature or scope of the legal rights or obligations of a client, an enterprise or a group does not constitute a lobbying activity and, as such, is excluded from the application of this Act. \n 2002, c. 23, s. 6 . 7 .   This Act does not apply to any of the following persons when acting in their official capacity : ( 1 )    members of the Senate or House of Commons of Canada, the legislative assembly of another province, the council or legislative assembly of a territory, or persons on the staff of such members ; ( 2 )    employees of the Government of Canada or of the government of another province or of a territory ; ( 3 )    members of the council of a band as defined in section 2 of the Indian Act (Revised Statutes of Canada, 1985, chapter I-5) or of the council of an Indian band established by an Act of the Parliament of Canada, or persons on the staff of such members or employees of such a council ; ( 4 )    diplomatic agents, consular officers or official representatives in Canada of a foreign government ; ( 5 )    employees of a specialized agency of the United Nations in Canada or employees of any other international governmental organization to whom privileges and immunities are granted by law ; ( 6 )    official representatives in Québec of the government of a province, state or any similar division of a foreign country. \n 2002, c. 23, s. 7 . CHAPTER  II DISCLOSURE OF LOBBYING ACTIVITIES DIVISION  I REGISTRATION OF LOBBYISTS 8 .   Every person considered a lobbyist for the purposes of this Act must be registered in the registry of lobbyists in accordance with the rules of this division. Registration is effected by the lobbyists themselves in the case of consultant lobbyists and by the senior officer of the enterprise or group on whose behalf a lobbyist is acting in the case of enterprise lobbyists or organization lobbyists. \n 2002, c. 23, s. 8 . §  1 .  —  Initial return 9 .   A consultant lobbyist is registered on the filing of a return setting out the following information : ( 1 )    the name and the business name and address of the consultant lobbyist ; ( 2 )    the name and address of the client and the name and address of any person, partnership or association that, to the knowledge of the consultant lobbyist, controls or directs the activities of the client and has a direct interest in the outcome of the consultant lobbyist’s activities on behalf of the client ; ( 3 )    if the client is a legal person, the name and address of each subsidiary that, to the knowledge of the consultant lobbyist, has a direct interest in the outcome of the consultant lobbyist’s activities on behalf of the client ; ( 4 )    if the client is a subsidiary of a legal person, the name and address of that legal person ; ( 5 )    if the client is funded, in whole or in part, by a government or a municipality or by a government or municipal body or agency, the name of the government, municipality or body or agency, and the amount of funding involved ; ( 6 )    the subject-matter of the consultant lobbyist’s activities, and particulars to identify such subject-matter ; ( 7 )    the duration of the lobbying activities ; ( 8 )    the name of any parliamentary, government or municipal institution in which any public office holder is employed or serves with whom the consultant lobbyist has communicated or expects to communicate, as well as the ministerial, deputy-ministerial, managerial, professional or other nature of the functions of the public office holder ; ( 9 )    the range, among the following, within which the amount or value of any financial or other compensation received or to be received in return for the lobbyist’s activities falls: less than $10,000, from $10,000 to $50,000, from $50,000 to $100,000 and $100,000 or more ; ( 10 )    the techniques of communication the consultant lobbyist has used or expects to use ; and ( 11 )    if applicable, the nature and term of any public office the consultant lobbyist held in the two years preceding the date on which the consultant lobbyist was engaged by the client. \n 2002, c. 23, s. 9 . 10 .   An enterprise lobbyist or an organization lobbyist is registered on the filing of a return setting out the following information : ( 1 )    the name of the senior officer of the enterprise or group on whose behalf the lobbyist is acting, the name of the lobbyist and the name and address of the enterprise or group ; ( 2 )    if the enterprise or group is a legal person, the name and address of each of its subsidiaries that, to the knowledge of the person filing the return, has a direct interest in the outcome of the lobbyist’s activities on behalf of the enterprise or group ; ( 3 )    if the enterprise or group is a subsidiary of a legal person, the name and address of that legal person ; ( 4 )    if applicable, the financial year of the enterprise or group ; ( 5 )    a description in summary form of the business or activities of the enterprise or group, and any information to identify such business or activities ; ( 6 )    if the enterprise or group is funded, in whole or in part, by a government or a municipality or by a government or municipal body or agency, the name of the government, municipality or body or agency, and the amount of funding involved ; ( 7 )    the subject-matter of the lobbying activities, and particulars to identify such subject-matter ; ( 8 )    the duration of the lobbying activities ; ( 9 )    the name of any parliamentary, government or municipal institution in which any public office holder is employed or serves with whom the lobbyist has communicated or expects to communicate, as well as the ministerial, deputy-ministerial, managerial, professional or other nature of the functions of the public office holder ; ( 10 )    the techniques of communication the lobbyist has used or expects to use ; and ( 11 )    if applicable, the nature and term of any public office the lobbyist held in the two years preceding the date on which the lobbyist was engaged by the enterprise or group. \n 2002, c. 23, s. 10 . 11 .   The address of a natural person means the person’s professional or business address or, in the absence of such an address, the person’s residential address. \n 2002, c. 23, s. 11 . 12 .   A legal person is considered to be a subsidiary of another legal person if ( 1 )    securities of the legal person to which are attached more than 50 % of the votes that may be cast to elect directors of the legal person are held, otherwise than by way of security, by or for the benefit of the other legal person ; and ( 2 )    the votes attached to such securities are sufficient to elect a majority of the directors of the legal person. \n 2002, c. 23, s. 12 . 13 .   Two or more enterprise lobbyists or two or more organization lobbyists may be registered by the filing of a single return containing the required information concerning each of the lobbyists. \n 2002, c. 23, s. 13 . 14 .   A consultant lobbyist must be registered no later than the thirtieth day, and an enterprise or organization lobbyist, no later than the sixtieth day, after the lobbyist begins to conduct lobbying activities on behalf of a client. \n 2002, c. 23, s. 14 . §  2 .  —  Updating and renewal 15 .   Any change in the information contained in the return concerning a lobbyist, including the termination of his or her engagement or any new lobbying activities, must be stated in a notice of change filed in the registry no later than the thirtieth day following the occurrence of the change. \n 2002, c. 23, s. 15 . 16 .   The registration of a consultant lobbyist must be renewed no later than the thirtieth day following the anniversary of the initial registration ; the registration of an enterprise lobbyist or organization lobbyist must be renewed no later than the sixtieth day following the end of the financial year of the enterprise or group. \n 2002, c. 23, s. 16 . 17 .   Notices of change or renewal are filed by the lobbyists themselves in the case of consultant lobbyists and by the senior officer of the enterprise or group on whose behalf the lobbyists are acting or acted in the case of enterprise lobbyists or organization lobbyists. \n 2002, c. 23, s. 17 . §  3 .  —  Certification and receipt 18 .   Returns and notices filed in the registry of lobbyists must bear a certification by the person filing the return or notice that the information they contain is true. Returns and notices are deemed to be filed at the time they are received by the Lobbyists Registrar. \n 2002, c. 23, s. 18 . DIVISION  II LOBBYISTS REGISTRAR 19 .   The Personal and Movable Real Rights Registrar is responsible, as Lobbyists Registrar, for keeping a registry of lobbyists at the Personal and Movable Real Rights Registry Office. Except as regards information that is subject to a confidentiality order issued under section 49, the registry is public and open for registration purposes or public inspection on registry premises or by remote access, during the time determined by the Registrar. \n 2002, c. 23, s. 19 . 20 .   The Registrar may examine whether the returns and notices submitted contain all the required information and whether they are submitted in the prescribed form and manner. \n 2002, c. 23, s. 20 . 21 .   The Registrar may refuse to accept, or remove from the registry, any return or notice that does not contain all the required information or that is not submitted in the prescribed form or manner. The Registrar shall inform the person having submitted the return or notice of the reason for the refusal or removal and, if practicable in the circumstances, may allow the person to make the required corrections within the time determined by the Registrar. If the required corrections are not made within the allotted time, the Registrar shall maintain the refusal or proceed with the removal. \n 2002, c. 23, s. 21 . 22 .   The Registrar may issue and publish notices concerning the form, contents and filing of the returns and notices provided for in this Act. \n 2002, c. 23, s. 22 . 23 .   Any return or notice received by the Registrar may be recorded by means of any information storage device, including any system of mechanical or electronic data processing, that is capable of reproducing the stored return or notice in intelligible form within a reasonable time. In any prosecution for an offence under a provision of this Act, a copy of a return or notice so reproduced that is certified by the Registrar as a true copy is admissible in evidence without proof of the certification or official capacity of the certifier and, in the absence of any evidence to the contrary, has the same probative force as the original would have if it were proved in the ordinary way. \n 2002, c. 23, s. 23 . 24 .   No later than 30 September each year, the Registrar shall submit a report to the Minister with regard to the Registrar’s activities for the preceding year. The report shall include any information prescribed by the Minister. The Minister shall lay the report before the National Assembly within the next 15 days or, if the Assembly is not sitting, within 15 days of resumption. \n 2002, c. 23, s. 24 . CHAPTER  III REGULATION OF LOBBYING ACTIVITIES DIVISION  I PROHIBITED ACTS 25 .   No person may lobby a public office holder without being registered in the registry of lobbyists in respect of such lobbying activities. \n 2002, c. 23, s. 25 . 26 .   No consultant lobbyist or enterprise lobbyist may act in return for compensation that is contingent on the achievement of a result or the lobbyist’s degree of success. Furthermore, no consultant lobbyist or enterprise lobbyist may act in return for compensation derived from a grant or loan received from the Government, a municipality or a government or municipal body or agency. \n 2002, c. 23, s. 26 . 27 .   No lobbyist who, in the course of lobbying activities, receives, from a public office holder, the mandate to award a contract, a grant or any other form of benefit may award it to himself or herself, to the enterprise or organization on whose behalf the lobbyist is acting or to any third person that is related to the lobbyist within the meaning of the Taxation Act ( chapter I-3 ). No such third person, enterprise or organization may accept such a contract, grant or benefit. \n 2002, c. 23, s. 27 . 28 .   No person having held a public office during one year or more in the two years preceding the date on which the person ceased to be a public office holder may lobby a public office holder as a consultant lobbyist. This prohibition applies only if the person held the office of ( 1 )    member of the Executive Council or Member of the National Assembly authorized to sit in Cabinet ; ( 2 )    member of the executive staff, other than the support staff, of a person holding an office referred to in subparagraph 1, deputy minister or other holder of a position referred to in section 55 of the Public Service Act ( chapter F-3.1.1 ) or holder of a position referred to in section 57 of that Act. \n 2002, c. 23, s. 28 . 29 .   No person may lobby a public office holder who is employed or serves in the same parliamentary, governmental or municipal institution in which the person held a public office in the year preceding the date on which the person ceased to be a public office holder or in such an institution with which the person had significant and direct official relations during that year. This prohibition applies only if the person held the office of ( 1 )    member of the Executive Council, Member of the National Assembly authorized to sit in Cabinet, mayor, borough chair, warden, chair of the council of a metropolitan community or member of the executive committee of a municipality or metropolitan community ; or ( 2 )    member of the executive staff, other than the support staff, of a person holding an office referred to in subparagraph 1, deputy minister or other holder of a position referred to in section 55 of the Public Service Act ( chapter F-3.1.1 ), holder of a position referred to in section 57 of that Act, director general or assistant director general of a municipality or metropolitan community or secretary-treasurer of a municipality governed by the Municipal Code of Québec ( chapter C-27.1 ). \n 2002, c. 23, s. 29 . 30 .   The prohibitions established by sections 28 and 29 apply for a period of two years or one year from the date on which the person ceased to hold an office referred to in those sections, according to whether the person held an office referred to in subparagraph 1 or 2 of the second paragraph of the section concerned. \n 2002, c. 23, s. 30 . 31 .   No person may derive undue advantage in the course of lobbying activities from having held a public office, or lobby in respect of a procedure, negotiation or other specific operation in which the person was involved in or in connection with the exercise of that office. \n 2002, c. 23, s. 31 . 32 .   No person may, in the course of lobbying activities, disclose confidential information obtained in or in connection with the previous exercise of a public office, or advise anyone on the basis of information that is not available to the public concerning either the parliamentary, governmental or municipal institution in which the person held a public office, or a person with which the person had significant and direct relations in the year preceding the date on which the person ceased to hold a public office in that institution. \n 2002, c. 23, s. 32 . DIVISION  II LOBBYISTS COMMISSIONER §  1 .  —  Appointment 33 .   On the proposal of the Prime Minister and with the approval of 2/3 of its members, the National Assembly shall appoint a Lobbyists Commissioner, who shall be responsible for monitoring and controlling the lobbying of public office holders. The remuneration, employment benefits and other conditions of employment of the Commissioner shall be determined by the Assembly in the same manner. The function of Commissioner shall be exercised on a full-time basis. \n 2002, c. 23, s. 33 . 34 .   The Commissioner shall be appointed for a fixed term which shall not exceed five years. At the end of the term, the Commissioner remains in office until he or she is reappointed or replaced. The Commissioner may resign at any time by giving notice in writing to the President of the National Assembly. The Commissioner may be removed only by a resolution of the Assembly approved by 2/3 of its members. \n 2002, c. 23, s. 34 . 34.1 .   If the Lobbyists Commissioner ceases to act or is unable to act, the President of the National Assembly, after consulting with the Leaders of the authorized parties that are represented in the National Assembly and any independent Members of the Assembly, may designate, from among the personnel of a body whose members are appointed by a two-thirds majority of the Members of the Assembly or from among the personnel of a person designated by a two-thirds majority of the Members of the Assembly to perform duties that come under the Assembly, a person to act as Lobbyists Commissioner for a period not exceeding six months. The Government determines the designated person’s additional salary and allowances. \n 2009, c. 37, s. 1 . 35 .   The Commissioner shall prepare annual budgetary estimates and submit them to the Office of the National Assembly, which shall approve them with or without modification. The members of the personnel of the Commissioner shall be appointed in accordance with the Public Service Act ( chapter F-3.1.1 ). \n 2002, c. 23, s. 35 . §  2 .  —  Code of conduct 36 .   On or before the 180th day following the date of the Commissioner’s accession to office, the Commissioner shall submit a draft code of conduct for lobbyists to the President of the National Assembly. In preparing the draft code of conduct, the Commissioner may consult any person, partnership or association that is interested in its object or expresses interest in that regard, particularly professional orders. \n 2002, c. 23, s. 36 . 37 .   The President of the National Assembly shall lay the draft code of conduct before the National Assembly within the next 15 days or, if the Assembly is not sitting, within 15 days of resumption, so that it may be examined by the appropriate committee of the National Assembly. After receiving the report of the committee, the Commissioner shall adopt the code of conduct with or without amendments. \n 2002, c. 23, s. 37 . 38 .   As soon as the code of conduct is adopted, the Commissioner shall publish it in the  Gazette officielle du Québec . The code of conduct comes into effect on the fifteenth day following its publication. \n 2002, c. 23, s. 38 . §  3 .  —  Inquiries, inspections and reports 39 .   The Lobbyists Commissioner may, on the Commissioner’s own initiative or on request, conduct inquiries if the Commissioner believes on reasonable grounds that there has been a breach of any provision of this Act or of the code of conduct. The Commissioner may specially authorize any person to conduct such inquiries. \n 2002, c. 23, s. 39 . 40 .   The Commissioner and any person specially authorized by the Commissioner to conduct an inquiry have, for the purposes of the inquiry, the powers and immunity conferred on commissioners appointed under the Act respecting public inquiry commissions ( chapter C-37 ), except the power to order imprisonment. \n 2002, c. 23, s. 40 . 41 .   The Commissioner may act or authorize any person to act as an inspector to determine whether the legislative provisions or the provisions of the code of conduct are being complied with. A person acting as an inspector may ( 1 )    enter, at any reasonable time, the establishment of a lobbyist or a public office holder or the establishment where the lobbyist or the public office holder engages in his or her activities or exercises his or her functions ; ( 2 )    require the persons present to provide any information concerning the activities engaged in or the functions exercised by the lobbyist or the public office holder, and to produce any book, register, account, record or other related document ; and ( 3 )    examine and make copies of documents containing information relating to the activities engaged in or the functions exercised by the lobbyist or the public office holder. Every person who has custody, possession or control of the documents referred to in this section must, on request, give access to them to the person conducting the inspection and facilitate their examination. \n 2002, c. 23, s. 41 . 42 .   The persons authorized by the Commissioner to act as inspectors must, on request, identify themselves and produce a certificate of their authorization. The authorized persons may not be prosecuted for anything done in good faith in the exercise of their functions. \n 2002, c. 23, s. 42 . 43 .   The Commissioner must submit every inquiry report in which the Commissioner ascertains a breach of a provision of this Act or the code of conduct to the Director of Criminal and Penal Prosecutions. \n 2002, c. 23, s. 43 ;  2005, c. 34, s. 84 . 44 .   The Commissioner may, on summary examination, dismiss any application for an inquiry the Commissioner judges to be frivolous or clearly unfounded. The Commissioner shall inform the applicant and the other persons concerned in writing. \n 2002, c. 23, s. 44 . 45 .   No later than 30 September each year, the Commissioner shall submit an activity report for the preceding calendar year to the President of the National Assembly. The President shall lay the report before the National Assembly within the next 15 days or, if the Assembly is not sitting, within 15 days of resumption so that it may be examined by the appropriate committee of the National Assembly. \n 2002, c. 23, s. 45 . 46 .   No civil action may be instituted by reason of the publication of a report of the Commissioner or the publication in good faith of an extract from or a summary of such a report. \n 2002, c. 23, s. 46 . 47 .   Neither the Commissioner nor the persons authorized by the Commissioner to conduct inquiries may be compelled to give testimony relating to information obtained in the exercise of their functions or to produce any document containing such information. \n 2002, c. 23, s. 47 . 48 .   Except on a question of jurisdiction, no application for judicial review under the Code of Civil Procedure ( chapter C-25.01 ) may be pursued and no injunction may be granted against the Commissioner or the persons authorized by the Commissioner to conduct inquiries or to act as inspectors. A judge of the Court of Appeal may, on an application, annul on summary examination any decision, order or injunction rendered or granted contrary to the first paragraph. \n 2002, c. 23, s. 48 ;  I.N. 2016-01-01 (NCCP) . §  4 .  —  Confidentiality orders 49 .   At the request of a person who is required to effect a registration in the registry of lobbyists, the Lobbyists Commissioner may order that some or all of the information contained in the return that must be filed for registration purposes be kept confidential if the information relates to an investment project of the client or enterprise concerned the disclosure of which would likely seriously prejudice the economic or financial interest of the client or enterprise. Unless the Commissioner extends the order at the request of the interested person for the period determined by the Commissioner, the decision of the Commissioner shall cease to have effect at the expiry of six months from the filing of the return concerned in the registry of lobbyists. The Commissioner shall send a notice of the decision to the Lobbyists Registrar. An extension of the order may be renewed, with the necessary modifications, in accordance with the provisions of this section. \n 2002, c. 23, s. 49 . 50 .   On the filing of a copy of a confidentiality order, the Lobbyists Registrar shall file the return, but shall ensure that the information covered by the order is kept confidential. The confidentiality of the information may only be lifted on the receipt by the Registrar of a notice from the Commissioner authorizing it. \n 2002, c. 23, s. 50 . 51 .   The annual activity report of the Commissioner shall state the number of orders issued or renewed during the year pursuant to this subdivision. \n 2002, c. 23, s. 51 . §  5 .  —  Notice 52 .   Except as regards matters that are within the purview of the Lobbyists Registrar pursuant to section 22, the Lobbyists Commissioner may issue and publish notices concerning the carrying out, interpretation or application of this Act, a regulation thereunder or the code of conduct. \n 2002, c. 23, s. 52 . CHAPTER  IV DISCIPLINARY MEASURES AND PENALTIES DIVISION  I DISCIPLINARY MEASURES 53 .   If the Lobbyists Commissioner ascertains that a lobbyist has gravely or repeatedly breached the obligations imposed on lobbyists by this Act or the code of conduct adopted under this Act, the Commissioner may prohibit the registration of the lobbyist in the registry of lobbyists or order the cancellation of all entries in the registry concerning the lobbyist. The prohibition or cancellation period may not exceed one year from the effective date of the decision of the Commissioner. \n 2002, c. 23, s. 53 . 54 .   Before issuing a decision, the Commissioner must inform the lobbyist of the intended decision and the reasons therefor and of the content of any complaints regarding the lobbyist. The Commissioner must also give the lobbyist the opportunity to present observations and, where necessary, to file documents to complete his or her file. \n 2002, c. 23, s. 54 . 55 .   The Commissioner’s decision is enforceable according to the terms and conditions stated therein provided the lobbyist has received a copy of the decision or has otherwise been advised of it. \n 2002, c. 23, s. 55 . 56 .   On receiving a copy of a decision of the Commissioner to such effect, the Lobbyists Registrar shall cancel all entries in the registry concerning the lobbyist. The Registrar shall refuse to make any entry in the registry concerning the lobbyist until the expiry of the prohibition or cancellation period. \n 2002, c. 23, s. 56 . 57 .   A decision of the Commissioner may, upon an application served on the Commissioner, be appealed by the lobbyist concerned before a judge of the Court of Québec. The appeal does not suspend the decision of the Commissioner unless the judge decides otherwise. The appeal is heard and decided by preference. The decision of the judge is final. \n 2002, c. 23, s. 57 ;  I.N. 2016-01-01 (NCCP) . 58 .   On receiving an inquiry report from the Commissioner ascertaining that a lobbyist has in any way breached the obligations imposed on lobbyists by this Act or the code of conduct, the Attorney General may claim from the lobbyist the amount or value of any financial or other compensation received by or payable to the lobbyist on account of the activities having occasioned the breach. In such a case, the lobbyist is liable toward the State for the amount established in the Attorney General’s claim. The enterprise or group within which the lobbyist was acting at the time of the breach is solidarily liable with the lobbyist for payment of the amount claimed by the Attorney General. The provisions of this section also apply, with the necessary modifications, to a third person, enterprise or organization which has contravened section 27. \n 2002, c. 23, s. 58 . 59 .   The measures provided for in this division are prescribed three years after the occurrence of the breach. \n 2002, c. 23, s. 59 . DIVISION  II PENALTIES 60 .   Any person who contravenes any provision of Division I of Chapter II or of sections 28 to 32 is guilty of an offence and liable to a fine of $500 to $25,000. \n 2002, c. 23, s. 60 . 61 .   Any person who files in the registry of lobbyists a return or a notice containing information that the person knows to be false or misleading or who contravenes any provision of section 25, 26 or 27 is guilty of an offence and liable to a fine of $500 to $25,000. \n 2002, c. 23, s. 61 . 62 .   Any person who hinders the work of the Lobbyists Commissioner or of a person authorized by the Commissioner to exercise a power under section 40 or 41 is guilty of an offence and liable to a fine of $500 to $5,000. \n 2002, c. 23, s. 62 . 63 .   Any lobbyist who contravenes any provision of the code of conduct adopted under this Act is guilty of an offence and liable to a fine of $500 to $25,000. \n 2002, c. 23, s. 63 . 64 .   Any lobbyist who engages in lobbying activities in contravention of a decision of the Lobbyists Commissioner prohibiting the registration of the lobbyist in the registry of lobbyists or ordering the cancellation of all entries in the registry concerning the lobbyist is guilty of an offence and liable to fine of $5,000 to $25,000. \n 2002, c. 23, s. 64 . 65 .   The fines provided for in this division shall be doubled in the case of a second or subsequent offence. \n 2002, c. 23, s. 65 . CHAPTER  V REGULATIONS 66 .   The Government may make regulations ( 1 )    determining other forms of benefits in respect of which decisions may be influenced within the meaning of subparagraph 2 or 3 of the first paragraph of section 2 ; ( 2 )    excluding persons, bodies or agencies or lobbying activities from the application of this Act or determining special conditions under which persons, bodies or agencies or lobbying activities are subject to its application ; ( 3 )    prescribing media and modes for the transmission of returns and notices of change required for the registration of a lobbyist in the lobbyists registry or for the updating of the information entered in the registry, as well as forms to be used for the filing of returns and notices ; ( 4 )    prescribing fees, which may vary according to the medium or mode of transmission used, for the filing of returns and notices of change in the lobbyists registry, as well as fees for the consultation of the registry on the registry premises or by remote access ; ( 5 )    determining, according to the medium and mode of transmission used, the time at which the returns and notices of change required by this Act are considered received by the Lobbyists Registrar ; ( 6 )    prescribing any additional information to be included in returns filed in the lobbyists registry ; and ( 7 )    prescribing any other measure that is necessary for the carrying out of this Act. \n 2002, c. 23, s. 66 . CHAPTER  VI MISCELLANEOUS, TRANSITIONAL AND FINAL PROVISIONS 67 .   The Minister of Justice is responsible for the administration of this Act. \n 2002, c. 23, s. 67 . The Minister responsible for Access to Information and the Reform of Democratic Institutions exercises the functions of the Minister of Justice provided for in this Act. Order in Council 40-2016 dated 28 January 2016, (2016) 148 G.O. 2 (French), 1260. 68 .   Within five years of 13 June 2002, the Minister shall report to the Government on the implementation of this Act and of the code of conduct adopted under this Act and on the advisability of amending them. The report shall be laid before the National Assembly by the Minister within the next 15 days or, if the Assembly is not sitting, within 15 days of resumption. The report shall be examined by the appropriate committee of the National Assembly. \n 2002, c. 23, s. 68 . 69 .   The provisions of this Act are applicable to lobbying activities in progress on 13 June 2002. However, the 30-day and 60-day periods provided in section 14 for the filing of returns concerning those activities in the registry of lobbyists are extended to 60 days and 90 days, respectively, and run from 28 November 2002. \n 2002, c. 23, s. 69 . 70 .   The prohibitions set out in sections 28 to 30 are not applicable to persons who, without otherwise being subject to such prohibitions pursuant to a directive or to an agreement, were already engaged in lobbying activities before 13 June 2002. \n 2002, c. 23, s. 70 . 71 .   The provisions of this Act which concern municipalities and municipal bodies shall only be applicable to municipalities of fewer than 10,000 inhabitants and the related municipal bodies from 1 July 2005. The dates mentioned in sections 69 and 70 are replaced, in respect of those municipalities and bodies, by 1 July 2005. \n 2002, c. 23, s. 71 . 72 .   Until the date of coming into force of the first regulation made under paragraph 2 of section 66 or until 1 March 2003, whichever is earlier, the definition of “organization lobbyist” in section 3 shall read as follows : “  “ organization lobbyist ”  means any person a significant part of whose job or function consists in lobbying on behalf of an association or other non-profit group constituted to serve management, union or professional interests or the majority of whose members are profit-seeking enterprises or representatives of profit-seeking enterprises  ”. \n 2002, c. 23, s. 72 . 73 .   (Amendment integrated into c. M-31, s. 69.1). \n 2002, c. 23, s. 73 . 74 .   (Amendment integrated into c. M-31, s. 69.6). \n 2002, c. 23, s. 74 . 75 .   (Amendment integrated into c. M-31, s. 69.8). \n 2002, c. 23, s. 75 . 76 .   (Omitted). \n 2002, c. 23, s. 76 . 77 .   (Omitted). \n 2002, c. 23, s. 77 . REPEAL SCHEDULE In accordance with section 9 of the Act respecting the consolidation of the statutes and regulations (chapter R-3), chapter 23 of the statutes of 2002, in force on 1 April 2003, is repealed, except sections 76 and 77, effective from the coming into force of chapter T-11.011 of the Revised Statutes. \n Copy \n Select this element \n Select parent element \n Unselect all \n Copy to Arbortext \n Copy to LAW \n × \n Copy to Clipboard \n To copy : Ctrl+C \n OK \n Contact us \n Site map \n Quebec portal \n Accessibility \n Privacy policy \n © Gouvernement du Québec \n × \n Selections \n Show \n Selections in current document \n All selections in the collection \n Selected elements \n Delete all selections \n Show selections \n Close \n × \n Cyberlex \n\t\t\t\t\t\tVersion 1.0.19.0"}