{"url": "https://en.wikipedia.org/wiki/New_product_development", "content": "New product development - Wikipedia \n New product development   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article has multiple issues.  Please help  improve it  or discuss these issues on the  talk page .  ( Learn how and when to remove these template messages ) \n This article may  require  cleanup  to meet Wikipedia's  quality standards . The specific problem is:  article is overly business- and marketing-centric; does not adequately cover the technical/engineering side of New product development. See Talk page.   Please help  improve this article  if you can.   (May 2009)   ( Learn how and when to remove this template message ) \n This article  needs attention from an expert in Economics .  Please add a  reason  or a  talk  parameter to this template to explain the issue with the article.  WikiProject Economics  may be able to help recruit an expert.   (November 2008) \n ( Learn how and when to remove this template message ) \n In  business  and  engineering ,  new product development  ( NPD ) covers the complete process of bringing a new  product  to market. A central aspect of NPD is  product design , along with various business considerations. New product development is described broadly as the transformation of a  market opportunity  into a product available for sale. [1]  The product can be tangible (something physical which one can touch) or intangible (like a  service ,  experience , or  belief ), though sometimes services and other processes are distinguished from \"products.\" NPD requires an understanding of customer needs and wants, the competitive environment, and the nature of the market. [2]  Cost, time and quality are the main variables that drive customer needs. Aiming at these three variables,  companies  develop continuous practices and strategies to better satisfy  customer requirements  and to increase their own  market share  by a regular development of new products. [ citation needed ]  There are many uncertainties and challenges which companies must face throughout the process. The use of  best practices  and the elimination of barriers to communication are the main concerns for the  management  of the NPD process. [ citation needed ] \n Contents \n 1   Process structure \n 2   Models \n 3   Marketing considerations \n 3.1   Fuzzy Front End \n 3.2   Other approaches \n 4   Organizations \n 5   Strategies \n 6   Management \n 7   Related fields \n 8   See also \n 9   References \n Process structure [ edit ] \n The product development process typically consists of several activities that firms employ in the complex process of delivering new products to the market. A  process management  approach is used to provide a structure. Product development often overlaps much with the  engineering design  process, particularly if the new product being developed involves application of math and/or science. Every new product will pass through a series of stages/phases, including  ideation  among other aspects of  design , as well as  manufacturing  and market introduction. In highly complex engineered products (e.g. aircraft, automotive, machinery), the NPD process can be likewise complex regarding management of personnel, milestones and deliverables. Such projects typically use an  integrated product team  approach. The process for managing large sale complex engineering products is much slower (often 10-plus years) than that deployed for many types of consumer goods. \n The product development process is articulated and broken down in many different ways, many of which often include the following phases/stages: \n Fuzzy front-end  (FFE) is the set of activities employed before the more formal and well defined  requirements specification  is completed.  Requirements  speak to what the product should do of have, at varying degrees of specificity, in order to meet the perceived market or business need. \n Product design  is the development of both the  high-level  and  detailed-level  design of the product: which turns the  what  of the requirements into a specific  how  this particular product will meet those requirements. This typically has the most overlap with the  engineering design  process, but can also include  industrial design  and even purely aesthetic aspects of design. On the marketing and planning side, this phase ends at pre-commercialization analysis [ clarification needed ]  stage. \n Product implementation  often refers to later stages of detailed engineering design (e.g. refining mechanical or electrical hardware, or software, or  goods  or other product forms), as well as  test process  that may be used to validate that the prototype actually meets all design specifications that were established. \n Fuzzy back-end  or commercialization phase represent the action steps where the  production  and market launch occur. \n The front-end marketing phases have been very well researched, with valuable models proposed. Peter Koen et al. provides a five-step front-end activity called front-end innovation: opportunity identification, opportunity analysis, idea genesis, idea selection, and idea and technology development. He also includes an engine in the middle of the five front-end stages and the possible outside barriers that can influence the process outcome. The engine represents the management driving the activities described. The front end of the innovation is the greatest area of weakness in the NPD process. This is mainly because the FFE is often chaotic, unpredictable and unstructured. [3]  Engineering design is the process whereby a technical solution is developed iteratively to solve a given problem [4] [5] [6]  The design stage is very important because at this stage most of the product life cycle costs are engaged. Previous research shows that 70–80% of the final product quality and 70% of the product entire life-cycle cost are determined in the product design phase, therefore the design-manufacturing interface represent the greatest opportunity for cost reduction. [7]  Design projects last from a few weeks to three years with an average of one year. [8]  Design and Commercialization phases usually start a very early collaboration. When the concept design is finished it will be sent to manufacturing plant for prototyping, developing a Concurrent Engineering approach by implementing practices such as  QFD ,  DFM / DFA  and more. The output of the design (engineering) is a set of product and process specifications – mostly in the form of drawings, and the output of manufacturing is the product ready for sale. [9]  Basically, the design team will develop drawings with technical specifications representing the future product, and will send it to the manufacturing plant to be executed. Solving product/process fit problems is of high priority in information communication design because 90% of the development effort must be scrapped if any changes are made after the release to manufacturing. [9] \n Models [ edit ] \n Conceptual models have been designed in order to facilitate a smooth process. The concept adopted by IDEO, a successful design and consulting firm, is one of the most researched processes in regard to new product development and is a five-step procedure. [10]  These steps are listed in chronological order: \n Understand and observe the market, the client, the technology, and the limitations of the problem; \n Synthesize the information collected at the first step; \n Visualise new customers using the product; \n Prototype, evaluate and improve the concept; \n Implementation of design changes which are associated with more technologically advanced procedures and therefore this step will require more time. \n One of the first developed models that today companies still use in the NPD process is the Booz, Allen and Hamilton (BAH) Model, published in 1982. [11]  This is the best known model because it underlies the NPD systems that have been put forward later. [12]  This model represents the foundation of all the other models that have been developed afterwards. Significant work has been conducted in order to propose better models, but in fact these models can be easily linked to BAH model. The seven steps of BAH model are: new  product strategy , idea generation, screening and evaluation, business analysis, development, testing, and commercialization. \nA pioneer of NPD research in the consumers goods sector is Robert G. Cooper. Over the last two decades he conducted significant work in the area of NPD. The Stage-Gate model developed in the 1980s was proposed as a new tool for managing new products development processes. This was mainly applied to the consumers goods industry. [13]  The 2010 APQC benchmarking study reveals that 88% of U.S. businesses employ a stage-gate system to manage new products, from idea to launch. In return, the companies that adopt this system are reported to receive benefits such as improved teamwork, shorter cycle time, improved success rates, earlier detection of failure, a better launch, and even shorter cycle times – reduced by about 30%. [14]  These findings highlight the importance of the stage-gate model in the area of new product development. \nOver the last few years, the  Lean Startup  movement has grown in popularity, challenging many of the assumptions inherent in the stage-gate model. \n Marketing considerations [ edit ] \n There have been a number of approaches proposed for analyzing and responding to the marketing challenges of new product development. Two of these are  the eight stages  process of Peter Koen of the  Stevens Institute of Technology , and a process known as  the fuzzy front end. \n Fuzzy Front End [ edit ] \n The Fuzzy Front End  (FFE) is the messy \"getting started\" period of new product engineering development processes. It is in the front end where the organization formulates a concept of the product to be developed and decides whether or not to invest resources in the further development of an idea. It is the phase between first consideration of an opportunity and when it is judged ready to enter the structured development process (Kim and Wilemon, 2007; [15]  Koen et al., 2001). [16]  It includes all activities from the search for new opportunities through the formation of a germ of an idea to the development of a precise concept. The Fuzzy Front End phase ends when an organization approves and begins formal development of the concept. \n Although the Fuzzy Front End may not be an expensive part of product development, it can consume 50% of development time (see Chapter 3 of the Smith and Reinertsen reference below), [17]  and it is where major commitments are typically made involving time, money, and the product's nature, thus setting the course for the entire project and final end product. Consequently, this phase should be considered as an essential part of development rather than something that happens \"before development,\" and its cycle time should be included in the total development cycle time. \n Koen et al. distinguish five different front-end elements (not necessarily in a particular order): [16] \n Opportunity Identification \n Opportunity Analysis \n Idea Genesis \n Idea Selection \n Idea and Technology Development \n The first element is the opportunity identification. In this element, large or incremental business and technological chances are identified in a more or less structured way. Using the guidelines established here, resources will eventually be allocated to new projects.... which then lead to a structured NPPD (New Product & Process Development) strategy. \n The second element is the opportunity analysis. It is done to translate the identified opportunities into implications for the business and technology specific context of the company. Here extensive efforts may be made to align ideas to target customer groups and do market studies and/or technical trials and research. \n The third element is the idea genesis, which is described as evolutionary and iterative process progressing from birth to maturation of the opportunity into a tangible idea. The process of the idea genesis can be made internally or come from outside inputs, e.g. a supplier offering a new material/technology or from a customer with an unusual request. \n The fourth element is the idea selection. Its purpose is to choose whether to pursue an idea by analyzing its potential business value. \n The fifth element is the idea and technology development. During this part of the front-end, the business case is developed based on estimates of the total available market, customer needs, investment requirements, competition analysis and project uncertainty. Some organizations consider this to be the first stage of the NPPD process (i.e., Stage 0). \n The Fuzzy Front End is also described in literature [ by whom? ]  as \"Front End of Innovation\", \"Phase 0\", \"Stage 0\" or \"Pre-Project-Activities\". [ citation needed ] \n A universally acceptable definition for Fuzzy Front End or a dominant framework has not been developed so far. [18]  In a glossary of PDMA, [19]  it is mentioned that the Fuzzy Front End generally consists of three tasks: strategic planning, idea generation, and, especially, pre-technical evaluation. These activities are often chaotic, unpredictable, and unstructured. In comparison, the subsequent new product development process is typically structured, predictable, and formal. The term  Fuzzy Front End  was first popularized by Smith and Reinertsen (1991). [20]  R.G. Cooper (1988) [21]  describes the early stages of NPPD as a four-step process in which ideas are generated (I), subjected to a preliminary technical and market assessment (II) and merged to coherent product concepts (III) which are finally judged for their fit with existing product strategies and portfolios (IV). \n Other approaches [ edit ] \n Other authors have divided predevelopment product development activities differently: [22] \n Preliminary \n Technical assessment \n Source-of-supply  assessment: suppliers and partners or alliances \n Market research : market size and segmentation analysis, VoC ( voice of the customer ) research \n Product idea testing \n Customer value  assessment \n Product definition \n Business and financial analysis \n These activities yield essential information to make a Go/No-Go to Development decision. \n One of the earliest [ citation needed ]  studies using the case study method defined the front-end to include the interrelated activities of: [23] \n product strategy formulation and communication \n opportunity identification and assessment \n idea generation \n product definition \n project planning \n executive reviews \n Economical analysis, benchmarking of competitive products and modeling and prototyping are also important activities during the front-end activities. The outcomes of FFE are the: [ citation needed ] \n mission statement \n customer needs \n details of the selected idea \n product definition and specifications \n economic analysis of the product \n the development schedule \n project staffing and the budget \n a business plan aligned with corporate strategy \n A conceptual model of Front-End Process was proposed which includes early phases of the innovation process. This model is structured in three phases and three gates: [24] \n Phase 1: Environmental screening or opportunity identification stage in which external changes will be analysed and translated into potential business opportunities. \n Phase 2: Preliminary definition of an idea or concept. \n Phase 3: Detailed product, project or service definition, and Business planning. \n The gates are: \n Opportunity screening \n Idea evaluation \n Go/No-Go for development \n The final gate leads to a dedicated new product development project. Many professionals and academics consider that the general features of Fuzzy Front End (fuzziness, ambiguity, and uncertainty) make it difficult to see the FFE as a structured process, but rather as a set of interdependent activities ( e.g. Kim and Wilemon, 2002). [25]  However, Husig et al., 2005 [10] argue that front-end not need to be fuzzy, but can be handled in a structured manner. In fact Carbone  [26] [27]  showed that when using the front end success factors in an integrated process, product success is increased. Peter Koen [28]  argues that in the FFE for incremental, platform and radical projects, three separate strategies and processes are typically involved. [28]  The traditional Stage Gate (TM) process was designed for incremental product development, namely for a single product. The FFE for developing a new platform must start out with a strategic vision of where the company wants to develop products and this will lead to a family of products. Projects for breakthrough products start out with a similar strategic vision, but are associated with technologies which require new discoveries. \n Incremental, platform and breakthrough products include: [28] \n Incremental products  are considered to be cost reductions, improvements to existing product lines, additions to existing platforms and repositioning of existing products introduced in markets. \n Breakthrough products  are new to the company or new to the world and offer a 5-10 times or greater improvement in performance combined with a 30-50% or greater reduction in costs. \n Platform products  establish a basic architecture for a next generation product or process and are substantially larger in scope and resources than incremental projects. \n Organizations [ edit ] \n Product Development and Management Association  (PDMA) \n Association of International Product Marketing & Management \n ISPIM  (The International Society for Professional Innovation Management) \n Society of Concurrent Product Development (SCPD) \n Strategies [ edit ] \n Lean product development \n Design for six sigma \n Flexible product development \n Quality function deployment \n Phase–gate model \n User-centered design \n Management [ edit ] \n This section may need to be  rewritten entirely  to comply with Wikipedia's  quality standards , as it consists of lists, where coherent text should be. Phrasing is sometimes confused / confusing at best.  You can help . The  discussion page  may contain suggestions.   (September 2014) \n [29]  Companies must take a holistic approach to managing this process and must continue to innovate and develop new products if they want to grow and prosper. \n CUSTOMER CENTERED New Product Development. Focuses on:\n Finding new ways to solve customer problems. \n Create more customer-satisfying experience \n Companies often rely on technology, but the real success comes from understanding customer needs and values. \n The most successful companies were the ones that: \n Differentiated from others \n Solved major customer problems \n Offered a compelling customer value proposition \n Engaged customer directly \n TEAM BASED New Product Development\n An approach: \n To deserving new products in which various company's departments work closely together overlapping the steps in the product development process in order to:\n Save time \n Increase effectiveness \n Company departments work closely together in cross functional teams overlapping the steps in the product development process (to save time and increase effectiveness). \n Those departments are: legal, marketing, finances, design and manufacturing, suppliers and customer companies. \n If there is a problem, all the company can work. \n SYSTEMATIC New Product Development\n Development process should be holistic (alternative) and systematic not to good ideas die. \n This process is installed on Innovation Management System that collect, review, evaluate new product ideas and manage\n the company appoints to a senior person to be the Innovation Manager who encourage all the company \n employees, suppliers, distributors and dealers to become involved in finding and developing new products. \n Then, there is a Cross-Functional Innovation Management Committee which:\n Evaluate new products ideas \n Help bringing good ideas \n To sum up, New-Product success requires: \n New ways to create valued customer experience, from generating and screening new product ideas to create and roll out want-satisfying products. \n New Product Development IN TURBULENT TIMES\n When we are in a tough economic situation usually management reduces spending on: new-product development. Usually it is done from a short-sighted point of view. \n Tough times might even call for:\n Greater new-product development, offering solutions for changing customer needs and tastes. \n Innovation helps \n Making the company more competitive \n Positioning it better for future. \n Virtual product development \n Uses collaboration technology to remove need for co-located teams \n Reduces G&A overhead costs of consulting firms \n Advent of 24-hour development cycle \n Related fields [ edit ] \n End user \n Brand management \n Engineering \n Industrial design \n Marketing \n Product management \n See also [ edit ] \n Choice modelling \n Commercialization \n Conceptual economy \n Product lifecycle \n Pro-innovation bias \n Requirements management \n Social design \n Soft launch \n Market penetration \n References [ edit ] \n ^   A dictionary of business and management  (5th ed.). Oxford [England]: Oxford University Press. 2009.  ISBN   9780199234899 .  OCLC   277068142 .   \n ^   Kahn, Kenneth B. (2012).  The PDMA handbook of new product development  (3 ed.). Hoboken, New Jersey: John Wiley & Sons Inc.  ISBN   978-0-470-64820-9 .  A thorough understanding of customers' needs and wants, the competitive situation, and the nature of the market is an essential component of new product success.   \n ^   Koen, Peter A.  \"The fuzzy front-end for incremental, breakthrough and platform products and services\"   (PDF) . Consortium for corporate entrepreneurship . Retrieved  February 5,  2017 .   [ dead link ] \n ^   Smith, P. Robert; Eppinger, P. Steven (1997). \"Identifying controlling features of engineering design iteration\".  Management Science .  43  (3): 276–293.  doi : 10.1287/mnsc.43.3.276 .   \n ^   Yassine, Ali; Braha, Dan (2003), \"Complex Concurrent Engineering and the Design Structure Matrix Approach.\"  Concurrent Engineering: Research and Applications,  11  (3):165-177 \n ^   Yassine, Ali; Joglekar, Nitin; Braha, Dan; Eppinger, Steven; Whitney, Daniel (2003),\"Information hiding in product development: the design churn effect.\" Research in Engineering Design,  14  (3): 131-144. \n ^   Yan-mei, Zhou (2009). \"Cost-benefit of interface management improvement in design-manufacturing chain\".  Chinese academy of science and technology management .  14  (3): 380–384.     |access-date=  requires  |url=  ( help ) \n ^   Hargadon, Andrew (1997). \"Technology brokering and innovation in a product development firm\".  Administrative Science Quarterly .  42  (4): 716–749.  doi : 10.2307/2393655 .   \n ^  a   b   Adler, S. Paul (1995). \"Interdepartmental interdependence and coordination: the case of the design/manufacturing interface\".  Organisation Science .  6  (2): 147–167.  doi : 10.1287/orsc.6.2.147 .   \n ^   Moen, Ron. \"A review of the IDEO process\".  http://www.rwjf.org/content/dam/web-assets/2001/10/a-review-of-the-ideo-process .     External link in  |website=  ( help );   Missing or empty  |url=  ( help );   |access-date=  requires  |url=  ( help ) \n ^   Allen & Hamilton, Booz. \"New products management for the 1980s\". Booz, Allen & Hamilton - original from Indiana University.     |access-date=  requires  |url=  ( help ) \n ^   Bruiyan, Nadia (2011). \"A framework for successful new product development\".  Journal of Industrial Engineering and Management .  4  (4): 746–770.     |access-date=  requires  |url=  ( help ) \n ^   Cooper, Robert (1990). \"Stage-gare systems: A new tool for managing new products\".  Business Horizons .  33  (3): 44–55.  doi : 10.1016/0007-6813(90)90040-i .   \n ^   Kenneth, Kahn (2013).  The PDMA handbook of new product development  (Third ed.). Hoboken, New Jersey: John Wiley & Sons Inc. p. 34.  ISBN   978-0-470-64820-9 .   \n ^   Kim, J.; Wilemon, D. (2007). \"Sources and assessment of complexity in NPD projects\".  R&D Management .  33  (1): 16–30.   \n ^  a   b   Koen; et al. (2007). \"Providing clarity and a common language to the 'fuzzy front end ' \".  Research Technology Management .  44  (2): 46–55.   \n ^   Smith, Preston G. and Reinertsen, Donald G. (1998)  Developing Products in Half the Time , 2nd Edition, John Wiley and Sons, New York, 1998. \n ^   Husig and Kohn (2003), Factors influencing the Front End of the Innovation Process: A comprehensive Review of Selected empirical NPD and explorative FFE Studies, Brusell, Juni 2003, p.14. \n ^   \"The PDMA Glossary for New Product Development\" . Product Development & Management Association. 2006. Archived from  the original  on 2009-03-21.   \n ^   Smith, Preston G., Reinertsen Donald G. (1991) Developing products in half the time, Van Nostrand Reinhold, New York \n ^   Cooper, R.G. Predevelopment activities determine new product success, in: Industrial Marketing Management, Vol.17 (1988), No 2, pp. 237-248 \n ^   Cooper R.G., Edgett, S.J. (2008), Maximizing productivity in product innovation, in: Research Technology Management, March 1, 2008 \n ^   Khurana, A; Rosenthal, S.R. (1998). \"Towards Holistic 'Front Ends' in New Product Development\".  Journal of Product Innovation Management .  15  (1): 57–75.  doi : 10.1016/S0737-6782(97)00066-0 .   \n ^   Husig, S; Kohn, S; Poskela, J (2005).  The Role of Process Formalisation in the early Phases of the Innovation Process . 12th Int. Prod. Development Conf. Copenhagen.   \n ^   Kim, J., Wilemon, D. (2002): Accelerating the Front End Phase in New Product Development  [1] \n ^   Thomas A. Carbone, Critical Success Factors in the Front-End of High Technology Industry New Product Development, Doctoral Dissertation, University of Alabama in Huntsville, November, 2011. \n ^   Thomas A. Carbone, et. al., Front-end success factors and the impact on high technology industry new product development.  2012 IEEE International Technology Management Conference, Dallas, Tx, USA. \n ^  a   b   c   Koen, Peter A. (2004), \"The Fuzzy Front End for Incremental, Platform, and Breakthrough Products\",  PDMA Handbook of New Product Development, 2nd Ed. : 81–91   \n ^   Gary Armstrong, P. K. (2013). Marketing an introduction (11th ed.). Harlow, England: Pearson. \n Authority control \n GND :  4139402-1 \n NDL :  00570301 \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=New_product_development&oldid=810721569 \"\t\t\t\t\t \n Categories :  Design Product development Product management Innovation Industrial design Systems engineering Hidden categories:  All articles with dead external links Articles with dead external links from July 2017 Pages using citations with accessdate and no URL CS1 errors: external links Pages using web citations with no URL Articles needing cleanup from May 2009 All pages needing cleanup Cleanup tagged articles with a reason field from May 2009 Wikipedia pages needing cleanup from May 2009 Articles needing expert attention with no reason or talk parameter Articles needing expert attention from November 2008 All articles needing expert attention Economics articles needing expert attention All articles with unsourced statements Articles with unsourced statements from March 2017 Wikipedia articles needing clarification from April 2015 Articles with specifically marked weasel-worded phrases from February 2014 Articles with unsourced statements from February 2014 Wikipedia articles needing rewrite from September 2014 All articles needing rewrite Wikipedia articles with GND identifiers   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons   \n Languages \n العربية Deutsch Español فارسی Français 한국어 Hrvatski Nederlands 日本語 Norsk Norsk nynorsk Português Română Русский Српски / srpski Suomi Svenska Українська 中文   \n Edit links   \n  This page was last edited on 17 November 2017, at 01:06. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}