{"url": "http://www.boxofficemojo.com/reviews/?id=94&p=.htm", "content": "Movie Review: Once Upon a Time in Mexico \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n > REVIEWS \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n ONCE UPON A TIME IN MEXICO \n U.S. Release Date: \n September 12, 2003 \n Distributor:  Sony / Columbia \n Director:   Robert Rodriguez Writer:   Robert Rodriguez Producer:   Robert Rodriguez Cast:   Antonio Banderas ,  Salma Hayek ,  Johnny Depp ,  Mickey Rourke ,  Eva Mendes ,  Willem Dafoe Running Time:  1 hour and 37 minutes MPAA Rating:  R (strong violence and language) \n A Fistful of Pesos \nby  Scott Holleran   \n Once Upon a Time in Mexico  is one long, bloody jeer at the universe. The final picture in Robert Rodriguez' Mariachi trilogy, which includes 1992's  El Mariachi  and 1995's  Desperado , undercuts its own charisma.  \n It was fun to watch guitar-strumming Antonio Banderas team with sexy Salma Hayek in  Desperado  as they kicked butt for justice, like watching a Latino James Bond and his Bond girl in acrobatic action.  Desperado  was a feverish satire with a distinctly Hispanic sense of fatalism. The dazzling romantic gunplay between Hayek and Banderas was the reward.  \n Hayek and Banderas are all but gone in  Once Upon a Time in Mexico . Somebody ought to clock Banderas' screen time, which seems like 20 minutes. Forget the picture's busty billboard ads: Hayek's curvy moves amount to a cameo.  \n Instead, 11 years after writer and director Rodriguez made  El Mariachi , he has decided to darken the series' tone with explicit nihilism. A romp with nothingness disarms Rodriguez of the finest weapon for executing taut action—a reason to kill.  \n The random blood flood robs Mexico of any sustained sense of fun. Where there was high-flying romance on the run, Rodriguez substitutes Johnny Depp and Willem Dafoe. This only adds to  Mexico 's pretentiousness. The plot—essentially the same as before: drug lords, double crosses and mistaken identity—is predictable. Its banality is only disrupted by Depp's campy killer.  \n Banderas and Hayek are fine in their small roles. Dafoe and Depp are not. Dafoe is caked in makeup and his Spanish is as convincing as John Ashcroft in a sombrero. Depp is bothersome—his undercover CIA character wears t-shirts emblazoned with phrases such as \"I'm With Stupid\" (the arrow points to his crotch), and he fires off one-liners like he's on Comedy Central. Depp's not acting. He's putting us on.  \n Depp's screen persona ranges wildly from street hustler to Jack Nicholson. In a climactic scene, he first resembles Michael Jackson and winds up looking like Marilyn Manson—and we're supposed to like him. If this is acting, somebody retroactively give Faye Dunaway an Oscar for  Mommie Dearest .  \n Depp is not alone. Enrique Iglesias as Banderas's whiny gunmate and Eva Mendes as a bosomy agent really do add insult to injury. Singer Iglesias's role is restricted to a pouty look and an affinity for the \"f\" word. The less said about Mendes the better. Each character speaks three languages: Spanish with English subtitles, English and something in between. Sometimes, a character speaks all three in one scene. Subtitles surface as frequently, and as annoyingly, as pop-ups.  \n Except for veteran Banderas, no one exhibits composure amidst the chaos—there is only campy, crummy acting.  \n It is fitting that what is central to  Mexico 's prototypical girl, whether Hayek or Mendes, mirrors the movie's unabashed theme: death. Like its cinematic cousin  Pulp Fiction ,  Mexico  exhorts us to worship death as the highest value. Banderas's robotic character is constantly reminded that he's already dead.  \n Rodriguez has made the logical next step in his trilogy, minus the wink that lets us in on the joke. By the time the curtain closes, the result is neither funny nor original: bloody limbs, eye sockets and the skinned face of death.  \n MORE REVIEWS: So Close Charlie's Angels Hong Kong Style Matchstick Men A Caper with Character Lost in Translation Sleepless in Tokyo Igby Goes Down Richie Glitch Uptown Girls Breakfast at J.C. Penney's Freddy Vs. Jason The Horror, the Horror... \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n ADVERTISEMENT \n  \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}