{"url": "http://deadline.com/2012/02/oscars-production-designer-stuart-craig-harry-potter-233768/", "content": "OSCARS: Production Designer Stuart Craig — 'Harry Potter'   | Deadline \n\t\t\t\t\t\t\tClick to Skip Ad\n Closing in... \n Menu \n Deadline \n Awardsline OSCARS: Production Designer Stuart Craig — 'Harry Pott…   \n Home \n Film \n TV \n Awardsline \n Box Office \n Business \n INTL \n Video \n Jobs \n Got A Tip? \n Top Stories \n Business   \n Trump “Incorrect” About Time Person Of The Year Claims \n by by  The Deadline Team \n Awardsline   \n Pete Hammond: ‘Wonder’, ‘Dunkirk’ Make Awards Play \n by by  The Deadline Team \n Box Office   \n ‘Coco’ Sweet $70M+, ‘Justice League’ $59M+: Turkey Trot \n by by  The Deadline Team \n TV   \n CBS & Dish Reach Carriage Deal \n by by  The Deadline Team \n Awardsline \n OSCARS: Production Designer Stuart Craig — 'Harry Potter' \n by  The Deadline Team \n February 20, 2012 2:35pm \n\t\t\t\t\t5\t\t\t\t \n\t\t\t\t\tAwardsline\t\t\t\t \n\t\t\t\t\tOscars\t\t\t\t \n\t\t\t\t\tHarry Potter and the Deathly Hallows Part 2\t\t\t\t \n\t\t\t\t\tOscars\t\t\t\t \n\t\t\t\t\tStuart Craig\t\t\t\t \n Anthony D’Alessandro  is a contributor to AwardsLine \n When it comes to staging an epic, leave it to production designer  Stuart Craig . As the set architect behind the entire  Harry Potter  series, his work on  Harry Potter And The Deathly Hallows Part 2  called for blueprints displaying the remnants of a near-apocalyptic battle, specifically one that took its toll on Hogwarts Castle. Given those ambitious demands, the VFX artists took over, rendering the first complete virtual rendition of Hogwarts over the sets constructed in earlier films. “My work required the same drawings, but instead of giving my designs to the carpenters, I gave them to the VFX team instead,” Craig says. \n 1. This shot, from the end of the epic battle, shows Harry, Hermione and Ron on their way to destroy Voldemort’s wand. Craig’s most recent credit: Having a hand in the design of Universal Studios Florida’s The Wizarding World of Harry Potter. \n 2. “This causeway leads you to the front door of the big hall. The set is made of plywood, and the castle in the back is digital. The bridge is a classic Norman architecture. In the  Potter  films there was never a distinguished architecture. We always had a fun eclectic mix of styles since Hogwarts has been around for 1,000 years. Near the Loch Shiel location where  Potter  is filmed in Scotland, there’s a viaduct which this bridge is modeled after. The viaduct is made of concrete whereas this bridge is made to look like it’s made of granite,” Craig explains. \n 3. “Statues are medieval suits of armor. They were first seen in the entrance of the great hall in  Deathly Hallows Part 1 . They’re made of Styrofoam with a hard texture on top.” \n 4. “The lampposts are made of woks which we bought from a hardware store. They look vaguely Roman and art deco which shows the architectural history we pulled from in designing Hogwarts.” \n 5. Dumbledore’s Office. \n 6. “Hogwarts is largely a gothic castle. During the early films we shot on location at the Durham Cathedral, Gloucester Cathedral and a bit of Oxford University. Cathedrals are far richer in detail architecture-wise than castles. Durham from the Norman 11th-12th century period. Gloucester is Gothic, 16th century. The castle is made of the rock on which it stands. The rock of the mountain is the rock of the castle. The castle is an extension of the earth.” \n 7. The astronomy tower where Dumbledore met his fate. \n 8. “The color palette used throughout the films has been restrained. When the kids were younger and the world was more optimistic, the stones in Hogwarts had a warm honey color tone. However as the movies got darker, we literally darkened the walls of Hogwarts.” \n   Subscribe to  Deadline Breaking News Alerts  and keep your inbox happy \n\t\t\t\t5\t\t\t \n JavaScript is required to load the comments. \n Loading comments... \n What's Hot on Deadline   \n 1 \n 'Thursday Night Football' Ratings Down From Thanksgiving 2016, Macy's Parade Steady, 'Young Sheldon' Up \n 2 \n 'Coco' Cooking $70M+; 'Justice League' At $59M+; 'Wonder' Wows At $32M+: Saturday AM Update \n 3 \n Trump Person Of The Year? Hollywood Snickers, Mark Hamill Offers 'Jedi' Bribe \n 4 \n 'Padmavati': Threats Of Violence, Protests Over Bollywood Movie Extend To UK \n 5 \n YouTube Begins Purging \"Non-Family Friendly\" Content As Advertisers React \n 6 \n Time Responds To Donald Trump's \"Incorrect\" Claims Of Turning Down Person Of The Year — Update \n 7 \n Pete Hammond's Notes On The Season: 'Wonder' Makes Awards Play; 'Dunkirk' Storms The Q&A Circuit; Netflix Sends A Pig To Voters \n 8 \n Uma Thurman To Harvey Weinstein: \"I'm Glad It's Going Slowly, You Don't Deserve A Bullet... Stay Tuned\" \n 9 \n 'Stranger Things' Star Charlie Heaton Speaks Out After LAX Incident - Update \n 10 \n LAPD Has 28 Open Sex Crimes Investigations Of Hollywood And Media \n Latest Awardsline News \n\t\t\t\t\t\t‘Detroit’ Stars On The “Eye-Opening” Experience Of Participating In Haunting Historic Drama\t\t\t\t\t \n\t\t\t\t\t\tFilmmakers Call For Berlin Film Festival Overhaul When Dieter Kosslick Exits\t\t\t\t\t \n\t\t\t\t\t\tPete Hammond’s Notes On The Season: ‘Wonder’ Makes Awards Play; ‘Dunkirk’ Storms The Q&A Circuit; Netflix Sends A Pig…\t\t\t\t\t \n\t\t\t\t\t\tKumail Nanjiani On How A Pitch To Judd Apatow About A Ghost Witch Movie Begat ‘The Big Sick’ – The…\t\t\t\t\t \n\t\t\t\t\t\t‘Arthur Miller: Writer’ Helmer Rebecca Miller Discusses Her Doc Portrait Of Father Arthur Miller\t\t\t\t\t \n\t\t\t\t\t\tDenis Villeneuve On His Love Of Sci-Fi, Working With Ridley Scott On ‘Blade Runner 2049’ & Revisiting ‘Dune’ – Behind…\t\t\t\t\t \n More \n Marketplace \n Featured Jobs \n Creative Development Coordinator Triptyk Studios, New York, New York \n Account/Project Coordinator (Ad Agency) \r\nPetrol Advertising, Burbank, California\r\n Media Specialist \r\nBridgewater Associates, Westport, Connecticut\r\n Executive Director, Aspen Film \r\nCompany Confidential, Aspen, Colorado\r\n Associate Director, YouTuber & Gamer Partnerships \r\nSave the Children, Fairfield, Connecticut\r\n SEE MORE JOBS \n Mar del Plata: 'Dancing,' 'Nonmoral Upbringing,' 'Flare' Amog… \n The Brave's Natacha Karam Still Can't Believe Jaz Missed That… \n 'Marshall': Cast of previously-nominated TV actors should boost… \n Beyonce Needs To Apologize For Kim Kardashian Snub Insists Kanye… \n The 10 best free iPhone games of the week \n About Us \n Advertise \n Terms of Use \n Privacy Policy \n Your Privacy Rights \n Google+ \n The Power of Content \n Variety \n india.com \n Hollywoodlife \n SPY \n TV Line \n GOLDDERBY \n WWD \n Footwear News \n Copyright © 2017 Penske Business Media, LLC. All rights reserved. \n\t\t\tHOLLYWOOD™ & Design © 2017 Hollywood Chamber of Commerce. The Hollywood Sign is a trademark and intellectual property of Hollywood Chamber of Commerce. All Rights Reserved.\n Powered by  WordPress.com VIP \n ad"}