{"url": "http://www.osc.gov.on.ca/en/Investors_osc-community_index.htm", "content": "OSC in the Community \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   Investors   /   The Investor Office   /   OSC in the Community \n Investors \n Hide Section Menu   × \n OSC's Role \n Investor Protection Funds \n Ombudsman for Banking Services and Investments (OBSI) \n The Investor Office \n Reports \n Investor News \n Re: Investing \n OSC in the Community \n Research \n Fact Cards \n Media Campaigns \n Investor Advisory Panel \n Panel Members \n Meeting Agendas \n IAP Notices and Information \n Initiatives \n Submissions to the OSC \n Other Submissions \n Check Before You Invest \n Investor Warnings \n Investor Alerts \n Warning List \n Learning About Investing \n Tools & Resources \n Check Registration \n Disclosure Documents \n Brochures \n Things to consider if investing in medical marijuana companies \n Questions & Complaints \n    Related Information\n Check Registration   \n OSC Investor News  \n Small and Medium Enterprises Resources \n   \n   Section Menu \n About   \n Events   \n Resources   \n Contact   \n Welcome to OSC in the Community \n The OSC wants to hear from Ontarians and share insights into investor protection as well as how changes in securities law may affect their business. To this end, OSC staff are travelling across the province to deliver investor seminars about fraud awareness and to meet with local enterprises, including small businesses and start-up organizations, on access to capital issues. \n The  Protect Your Money  seminar provides Ontarians with resources and tips to protect against investment fraud. \n Updates on new and proposed capital raising rules  including prospectus exemptions offer greater clarity on how local enterprises, including small businesses and start-ups, can grow. \n Background \n In early 2013, the Ontario Securities Commission launched OSC in the Community, an outreach program which takes the OSC’s regulatory mandate from Bay Street to Main Street. OSC staff are traveling to communities across Ontario to deliver investor seminars on fraud prevention and to meet with local businesses, government officials, law enforcement and other community organizations that are impacted by securities regulation in the province. \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}