{"url": "https://www.snap.com/en-US/supplier-responsibility/", "content": "Supplier Responsibility – Snap Inc. \n Snap Inc. Jobs News Investors Supplier Responsibility Supplier Code of Conduct Anti-Slavery Conflict Minerals Supplier Responsibility \n Making Products the Right Way \n At Snap Inc., we work to make products responsibly. That’s why we’re committed to safeguarding human rights, labor rights, health and safety, and the environment in our supply chain. Snap Inc. is a member of the  Electronics Industry Citizenship Coalition  (EICC) and fully supports the EICC’s vision and goals.  \n Supplier Code of Conduct \n Our  Supplier Code of Conduct  codifies the standards we expect our suppliers to meet to ensure safe working conditions, fair worker treatment, and responsible environmental practices. It includes social-responsibility standards drawn from the EICC Code of Conduct, the Universal Declaration of Human Rights, and other guiding principles of international law.  \n Among other things, the Code requires suppliers to uphold workers’ human rights and treat workers with dignity and respect; reject any use of forced or child labor; set reasonable working hours; avoid discrimination; and conform to industry-standard health and safety practices. The Code also requires our suppliers to respect the environment by obtaining required permits, minimizing pollution, and safely managing hazardous substances. And the Code requires our suppliers to uphold the highest standards of ethics by, for example, rejecting commercial bribery and respecting third parties’ intellectual-property rights. \n     \n Anti-Slavery \n Our  Anti-Slavery Statement  demonstrates our commitment to ensure that our suppliers respect human rights. Snap Inc. requires our suppliers to certify that slavery and human trafficking are not taking place in their businesses. And as we explain below, we verify those commitments through a detailed risk assessment and auditing process.  \n Conflict Minerals \n Our  Conflict Minerals Statement  lays out the steps we take to fully comply with all laws, in the United States and abroad, regarding conflict minerals. \n The term “conflict minerals” refers to four metals -- tantalum, tin, tungsten, and gold -- that may be sourced from mines in the Democratic Republic of Congo. Illegal armed groups may use proceeds from those mines or nearby transit routes to fund their violent operations. \n  Snap Inc. is committed to complying with rules and guidelines regulating the use of conflict minerals, regardless of whether they technically apply to our operations. We require our suppliers to certify that they source minerals from conflict-free smelters and exercise proper due diligence on their own suppliers. And we have engaged a supply chain data-management company to facilitate supply-chain tracking and ensure that our suppliers are living up to their commitments. \n Audits and Remediation \n We use a risk assessment methodology and, where appropriate, conduct third-party supplier audits to assess compliance with the above standards. But we do more than hold our suppliers responsible for meeting these standards; we also provide them the support they need to do so. If we think that a supplier can correct its missteps, we look to use experienced third parties to work with the supplier to develop an effective corrective action plan. Working with suppliers to improve labor and environmental conditions is fundamental to our program. \n © 2017 Snap Inc. Privacy Policy Terms of Service Other Terms & Policies Impressum Dansk Deutsch English (US) English (UK) Español Français Italiano 日本語 Nederlands Norsk Polish Português (Brasil) Suomi Svenska"}