{"url": "https://kbp.wikipedia.org/wiki/Alimiiniy%C9%94%C9%94m", "content": "Alimiiniyɔɔm — Wikipediya \n Alimiiniyɔɔm   \n Pɩlɩɩna Wikipediya   \n\t\t\t\t\tWolo:\t\t\t\t\t tʋʋzɩtʋ , \t\t\t\t\t ñɩnɩ \nLingot aluminium \n Kpɛlɩ kpɛlɛkʊʊ wonuu nakʊyʊʊ payaɣ se alimiiniyɔɔm. Kɩ-pʊyʊ ñɩɩɩ mayaɣ kɛ 13. Ki-kumoɖe kɛ Al. Pɛtɛyɩ ñɩɣlɩm mbʊ pɩ-taa takɩlɩ wɛʊ camɩyɛ yɔ hɔɔlɩŋ ndɩ ndɩ taa. Alimiiniyɔɔm wɛ tindimiye 13 ñɩnɖɛ taa. Alimiiniyɔɔ kɛ ñɩɣlɩm wonuu ŋgʊ ɛyʊ pɩzɩɣ enuuti-kʊ yem kɛlɛʊ yɔ. Kɩwɛna ñɩɣlɩm wonuu ŋgʊ payaɣ se arɩzaɣ yɔ kɩ-tɔlɩm. Alimiiniyɔɔm ɛɛmʊʊ kalɩkɔdaɣ yem. Ɖɔɖɔ lɛ, kɩfɛyɩna kpɩndʊʊ (densité) pʊɖɔɔ. Ñɩɣlɩm wondu taa payɩ lɛ, ɔkɩsiizɛɛnɩ nɛ siliisiyɔɔm pa-wayɩ lɛ, alimiiniyɔɔm kɩlɩna tɔyʊʊ tɛtʊ yɔɔ cɩnɛ. Ɖɛ-tɛtʊ ilemiye ɖɩnɛ ɖɩ-yɔɔ lɛ, yee pɛtɛyɩ ñɩɣlɩm wondu tɩŋa payɩ tam mɩnɩʊ kɔyɔ, alimiiniyɔɔm kpakɩɣ hɔɔlɩŋ lutozo mpilim. \nAluminium foil \n Paapɩzɩɣ pakpaɣ alimiiniyɔɔm ɖeke nɛ palabɩna pʊyʊ, mbʊ yɔ kɩkɩlɩɣ yoluu. Pesidiɣ-kʊ nɛ ñɩɣlɩm wondu lɛɛtʊ ndɩ ndɩ nɛ pʊcɔ palabɩna-kʊ nɛ tʊmɩyɛ. Pesidiɣ-kʊ nɛ ñɩɣlɩm wondu ndʊ yɔ, tɩtalɩɣ 270 mbʊ yɔ. Ñɩɣlɩm tɛtʊ ndʊ payaɣ se pɔkɩsiti yɔ ndʊ kɩlɩɣna ɖɔʊ alimiiniyɔɔm taa. Alimiiniyɔɔm taa lɛ, pɔkɩsiti ŋgʊ kɩwɛɣ ɛzɩ kalɩkɔdaɣ wonuu nakʊyʊ yɔ. Kalɩkɔdaɣ wonuu ŋgʊʊ palakɩ tʊmɩyɛ nɛ palɩzɩ ñɩɣlɩm wonuu ŋgʊ payaɣ se alimiini yɔ. Papɩzɩɣ palɩzɩ alimiini ñɩɣlɩm wonuu ɖɔɖɔ ñɩlɩm wonuu ŋgʊ payaɣ se nefeliini (néphéline) yɔ kɩ-taa. Papɩzɩɣ palɩzɩ-kʊ ɖɔɖɔ ñɩɣlɩm wondu tʊnɛ tɩ-taa. Ndʊʊ yɔ : lesiiti (leucite) nɛ silimaniiti (sillimanite) nɛ andalusiiti (andalousite) nɛ misikoviiti (muscovite). \nPresident Lula visit to Aluminum factory \n\t\t\t\t\t\tPɩɖaɣna mʋʋna \" https://kbp.wikipedia.org/w/index.php?title=Alimiiniyɔɔm&oldid=7978 \"\t\t\t\t\t \n Pɩlɩŋ  :  !Main category Ñɩɣtʋ Wondu   \n Ɖiwoɖe tʋʋzʋʋ \n Man-kɩlabɩnaʋ \n Non connecté Ndɔnjɔɔlɩyɛ Tambaɣ Tʋlɩ koozaɣ Kpɩtɩna   \n Hɩla loniye \n Takayɩhayʋʋ Ndɔncɔɔlɩyɛ   \n Ndɩ ndɩ \n Taaɖɩtʋ \n Kalɩ Ñɔɔzɩ Ñɔɔzɩ wikicode Caanaʋ tɔm kɛdʋʋ   \n Sɔzʋʋ \n Ñɩnɩ \n Tʋʋzɩtʋ \n Talɩ ɖeu Ŋgbɛyɛ Sɔnɔ tɔm Wayɩ wayɩ ñɔɔzɩtʋ Takayɩhayʋʋ nakʋyʋ yem Sɩnaʋ Ha haɖɛ   \n Lɩzɩ takayahayʋʋ kɩlɩʋ / poliŋ taa wonaʋ \n La takayaɣ Poliŋ taa mʋʋ ɛzɩ PDF yɔ Ñɔɔzɩtʋ kɩlɛɣzɩtʋ kɩlɩʋ lone   \n Tambasɩ lɛɛsɩ taa \n Wikimédia Commons   \n Kɩlabɩnaʋ \n Takayɩhatʋ kɩtamtʋ Takayɩhatʋ ndʋ tɩtamsɩna kanɛ yɔ tɩ-tɩŋʋʋ Tiyina poliŋ taa takayaɣ Takayɩhatʋ ndɩ Ɖɩtɩlɩyɛ caɣdam Takayɩhayʋʋ yɔɔ kiheyitu Wonuu Wikidata Tasɩ yaʋ takayɩhayʋʋ kʋnɛ   \n Kʋnʋmɩŋ lɛɛŋ \n Afrikaans Alemannisch አማርኛ Aragonés العربية অসমীয়া Asturianu Azərbaycanca تۆرکجه Башҡортса Žemaitėška Беларуская Беларуская (тарашкевіца)‎ Български भोजपुरी বাংলা བོད་ཡིག Brezhoneg Bosanski Буряад Català Mìng-dĕ̤ng-ngṳ̄ Cebuano ᏣᎳᎩ کوردی Corsu Čeština Чӑвашла Cymraeg Dansk Deutsch Ελληνικά English Esperanto Español Eesti Euskara فارسی Suomi Võro Føroyskt Français Nordfriisk Furlan Frysk Gaeilge Gàidhlig Galego ગુજરાતી Gaelg 客家語/Hak-kâ-ngî Hawaiʻi עברית हिन्दी Fiji Hindi Hrvatski Kreyòl ayisyen Magyar Հայերեն Interlingua Bahasa Indonesia Ilokano Ido Íslenska Italiano 日本語 Patois La .lojban. Basa Jawa ქართული Gĩkũyũ Қазақша ភាសាខ្មែរ ಕನ್ನಡ 한국어 Ripoarisch Kurdî Коми Кыргызча Latina Lëtzebuergesch Лезги Limburgs Ligure Lumbaart ລາວ Lietuvių Latviešu Malagasy Македонски മലയാളം Монгол मराठी Кырык мары Bahasa Melayu မြန်မာဘာသာ Эрзянь Plattdüütsch नेपाली नेपाल भाषा Nederlands Norsk nynorsk Norsk Novial Diné bizaad Occitan Livvinkarjala ଓଡ଼ିଆ Ирон ਪੰਜਾਬੀ Kapampangan पालि Polski Piemontèis پنجابی پښتو Português Runa Simi Rumantsch Română Armãneashti Русский Русиньскый Kinyarwanda संस्कृतम् Саха тыла Sicilianu Scots Srpskohrvatski / српскохрватски සිංහල Simple English Slovenčina Slovenščina Soomaaliga Shqip Српски / srpski Seeltersk Basa Sunda Svenska Kiswahili தமிழ் తెలుగు Тоҷикӣ ไทย Tagalog Türkçe Татарча/tatarça ئۇيغۇرچە / Uyghurche Українська اردو Oʻzbekcha/ўзбекча Vepsän kel’ Tiếng Việt Winaray Хальмг ייִדיש Yorùbá Vahcuengh 中文 文言 Bân-lâm-gú 粵語   \n Ñɔɔzɩ kpasɩ   \n  Takayahayʋʋ kɩfalʋ wayɩ wayɩ ñɩŋgʋ ñɔɔzɩtʋ 16 Kɩyɛɛna fenaɣ 2017 wiye, 15:59 yɔɔ. \n Ŋpɩzɩɣ ŋna takayɛsɩ sɩnɛ cɩnɛ:  licence Creative Commons Attribution-tɛyʋʋ mbʋ pɩlɩ ɖama yɔ ;\npapɩzɩɣ paɖʋ paɣtʋ lɛɛtʋ.\n\\nCɔna  Labɩnaʋ paɣtʋ  nɛ ŋtasɩ pɩ-taa nɩʋ camɩyɛ.\" \n Mɛsaɣ tɛɛ tɔm ɖɔkʋʋ paɣtʋ \n pɩlɩɩna Wikipediya \n Paɣʋ \n Leɣtʋ tɩlɩyaa \n Déclaration sur les témoins (cookies) \n Nesi tɛɛ kaŋgalafʋ taaɖʋʋ"}