{"url": "https://youradchoices.ca/fr/", "content": "Choix de pub – The Canadian AdChoices Program | Le programme canadien Choix de pub \n Français \n English  ( Anglais ) \n La publicité en ligne Outil de retrait   Outil de retrait   Aide – Page de retrait   Protéger mes choix   AppChoices Entreprises participantes Information sur l’inscription   4 étapes pour s’inscrire     Éléments du programme   Don d’espaces publicitaires   Trousse de bienvenue     Les principes     Propriétaires de sites   Tiers   Prestataires de services     Formulaire d’inscription Plaintes FAQ   Foire aux questions (FAQ)   FAQ à l’intention des entreprises DAAC   Au sujet de la DAAC   Associations membres de la DAAC   Actualités   Webinaires et bulletins   Select Page La publicité en ligne Outil de retrait — Outil de retrait — Aide – Page de retrait — Protéger mes choix — AppChoices Entreprises participantes Information sur l’inscription — 4 étapes pour s’inscrire — — Éléments du programme — — Don d’espaces publicitaires — — Trousse de bienvenue — Les principes — — Propriétaires de sites — — Tiers — — Prestataires de services — Formulaire d’inscription Plaintes FAQ — Foire aux questions (FAQ) — FAQ à l’intention des entreprises DAAC — Au sujet de la DAAC — Associations membres de la DAAC — Actualités — Webinaires et bulletins \n\t\t\t\t\tBienvenue sur notre site!\t\t\t\t\t\t\t\t\t \n Apprenez-en plus sur votre Choix de pub en ligne! \n Exercez votre Choix de pub à l’aide de l’outil de retrait \n Consultez la liste des entreprises participantes \n Choix de pub  \n  Choix de pub est le programme canadien d’autoréglementation de la publicité ciblée par centres d’intérêt en ligne (aussi connue sous le nom de « publicité comportementale en ligne » ou de « publicité ciblée par centres d’intérêt ») destiné à permettre aux internautes/consommateurs de mieux comprendre et de mieux contrôler les publicités qui leur sont présentées en fonction de leurs centres d’intérêt en ligne. L’Alliance de la publicité numérique du Canada (DAAC) est un organisme canadien sans but lucratif qui supervise le programme à l’échelle de l’industrie canadienne. \n POUR LES UTILISATEURS DU WEB \n Avez-vous remarqué cette icône triangulaire bleue sur le Web?   Apprenez-en davantage  sur cette icône en consultant notre site Web. Vous y trouverez également un outil de retrait qui vous aidera à gérer les témoins publicitaires présents dans votre navigateur. \n POUR LES ENTREPRISES \n Apprenez  comment  participer à notre programme. Consultez les principes du programme et inscrivez-vous dès aujourd’hui! \n AU SUJET DE LA DAAC \n Découvrez les  associations de l’industrie   qui ont institué ce programme au Canada ainsi que l’essor que connaît ce programme dans le monde entier. Vous souhaitez savoir quelles sont les entreprises qui participent au programme?  Cliquez ici . \n Au sujet de l’icône Choix de pub \n  Apprenez-en davantage sur la publicité ciblée par centres d’intérêt en ligne et sur l’icône triangulaire bleue que vous avez pu voir sur des sites Web et dans des publicités en ligne. \n  En savoir plus    \n   \n Le programme Choix de pub : de plus en plus présent  à l’échelle mondiale! \n Actualités \n L’Alliance de la Publicité Numérique du Canada Publie les Résultats d’un Sondage Auprès des Consommateurs sur le Programme Choix de Pub \n September 28, 2017 \n Q et R avec une responsable de la conformité du Programme de responsabilité Choix de pub de NCP \n August 23, 2017 \n Autres nouvelles   Autres nouvelles \n Sélectionner un mois \n  September 2017  \n  August 2017  \n  May 2017  \n  March 2017  \n  February 2017  \n  September 2016  \n  July 2016  \n  December 2015  \n  June 2015  \n Entreprises participantes   Pour accéder à la liste complète des entreprises qui participent activement au programme canadien Choix de pub, cliquez sur le bouton ci-après.\r\n Voir la liste des entreprises    \n Outil de retrait   Utilisez notre outil pour gérer vos préférences en matière de publicités ciblées par centres d’intérêt.\r\n Découvrir l’outil    \n\t\t\t\tCopyright © 2017 The Digital Advertising Alliance Of Canada Privacy Policy  |  Legal"}