{"url": "https://ww2.ticketpro.ca/?languageid=-1", "content": "Ticketpro.ca Ontario\n | Tickets for Concerts | Quebec Concert Venues | Concerts | Festivals | Music | Comedy | Ticketing Solutions | Montreal\n Menu For Screen Reader \n   Main Content   Page Navigation   Ticket Categories   Go to accessibility information   Cart   Open session   Français \n   Tweet   \n                      West / Ontario\n                      Quebec\n                      Atlantic\n                      All\n                      Music\n                      Comedy\n                      Festival\n                      Arts\n                      Sports\n                      Producers\n                      Media\n                      Ticketing Solutions\n                      FAQ\n Venues \n                      Newsletter\n Ticketpro Outlets \n                      Contact\n                      Press Release\n1-888-655-9090\t\t\t\t\t \n View Option:   \n\t\t Photo   | \n\t\t List \n Filter:   \n                 Today   | \n                 New this week \n 2017-2018 Season Horizon Stage Performing Arts Centre Spruce Grove, AB 2018 Boston Pizza Cup Spruce Grove Curling Club 2018 OBIAA Trade Show 43rd Annual Summerfolk Music & Crafts Festival August 17-19, 2018 FEO 2018 OSAC Stars for Saskatchewan 2017-2018 Season AURA Basilique Notre-Dame Montréal, QC by Moment Factory Barrie Colts 2017-2018 Season Bert Church Live Theatre Biggar & District Arts Council Blue Mountain Resort NYE Party Bragg Creek Performing Arts Society Burton Cummings & Band CAFE Webinars Canadian Ice Fishing Expo Celebrate the Child Presented by the Benton Street Baptist Church and Heritage College & Seminary Don's CountryCountry Classic Show Estevan Arts Council Global Legacy Boxing Presents: GLB VII: Thunder at the Falls Holiday Extravaganza Kindersley & District Arts Council LCHS Musical Theatre presents  Joseph and the Amazing Technicolor Dreamcoa Linus Hand Productions in Association with the Winter Festival of Lights Disney's The Little Mermaid Maclab Centre for the Performing Arts Leduc, AB Mini Pop Kids: Make it Pop Tour! Moosomin & District Arts Council Practically Hip Quill Plains Regional Arts Council Rave On The Buddy Holly Tribute Rock This Town Orchestra's Christmas Spectacular Ron James Full Throttle Scotiabank Convention Centre Niagara Falls, ON Shaunavon Arts Council Shell Theatre Fort Saskatchewan, AB Shopkins Live! Shop It Up! Hamilton, ON Sunrise Concerts International presents Rik Emmett CANCELLED Swift Current Arts Council The Child The Max Center The Timmins Rock Junior A Hockey Club Proudly Presents: LIVE WITH GERRY DEE THEOP 2017-2018 Season Theory of a Deadman Live by the Falls Timmins Rock 2017-2018 Tisdale Arts Council Watrous & District Arts Council Weyburn Concert Series Yorkton Arts Council \n                Media\n                FAQ\n                Newsletter\n                Advanced Search\n                Ticketpro Outlets\n                Venues\n                Ticketing Solutions\n                Contact\n                West / Ontario\n                Quebec\n                Atlantic\n                International\n        © Ticketpro.ca  2003-2017 Confidentiality policy\n        Ticketpro.ca Accessibility Policy"}