{"url": "http://www.mondaq.com/canada/x/358282/Trade%20Secrets/Copyright%20Implications%20of%20a%20Right%20to%20be%20Forgotten%20Or%20How%20to%20TakeDown%20the%20Internet%20Archive", "content": "Copyright Implications Of A \"Right To Be Forgotten\"? Or How To Take-Down The Internet Archive. - Intellectual Property - Canada \n We use cookies to give you the best online experience. By using our website you agree to our use of cookies in accordance with our cookie policy.  Learn more here . Close Me \n Home  >  Canada  >  Intellectual Property   \n Canada : Copyright Implications Of A \"Right To Be Forgotten\"? Or How To Take-Down The Internet Archive. \n Last Updated: December 5 2014 \r\nArticle by  Richard  Stobbe Field LLP \n Your  LinkedIn  Connections  at Firm They say the internet never forgets. From time to time, someone\r\nwants to challenge that dictum. \n In our earlier posts, we discussed the so-called \"right to\r\nbe forgotten\" in connection with a Canadian  trade-secret misappropriation and\r\npassing-off case  and an  EU privacy\r\ncase . In a brief ruling in October, the Federal\r\nCourt reviewed a copyright claim that fits into this same category.\r\nIn  Davydiuk v. Internet Archive\r\nCanada , 2014 FC 944 (CanLII), the plaintiff\r\nsought to remove certain pornographic films that were filmed and\r\nposted online years earlier. By 2009, the plaintiff had\r\nsuccessfully pulled down the content from the original sites on\r\nwhich the content had been hosted. However, the plaintiff\r\ndiscovered that the Internet Archive's \"Wayback\r\nMachine\" had crawled and retained copies of the content as\r\npart of its archive. \n If you're not familiar with the Wayback Machine, here is the\r\ncourt's description: \"The 'Wayback Machine' is a\r\ncollection of websites accessible through the websites\r\n'archive.org' and 'web.archive.org'. The collection\r\nis created by software programs known as crawlers, which surf the\r\ninternet and store copies of websites, preserving them as they\r\nexisted at the time they were visited. According to Internet\r\nArchive, users of the Wayback Machine can view more than 240\r\nbillion pages stored in its archive that are hosted on servers\r\nlocated in the United States. The Wayback Machine has six staff to\r\nkeep it running and is operated from San Francisco, California at\r\nInternet Archive's office. None of the computers used by\r\nInternet Archive are located in Canada.\" \n The plaintiff used copyright claims to seek the removal of this\r\ncontent from the Internet Archive servers, and these efforts\r\nincluded DMCA notices in the US. Ultimately unsatisfied with the\r\nresults, the plaintiff commenced an action in Federal Court in\r\nCanada based on copyrights. The Internet Archive disputed that\r\nCanada was the proper forum: it argued that California was more\r\nappropriate since all of the servers in question were located\r\nin the US and Internet Archive was a California entity. \n Since Internet Archive raised a doctrine known as \"forum\r\nnon conveniens\", it had to convince the court that the\r\nalternative forum (California) was \"clearly more\r\nappropriate\" than the Canadian court. It is not good enough to\r\nsimply that there is an appropriate forum elsewhere, rather the\r\nparty making this argument has to show that  clearly  the\r\nother forum is more appropriate, fairer and more efficient. The\r\nFederal Court was not convinced, and it concluded that there was a\r\nreal and substantial connection to Canada. The case will remain in\r\nCanadian Federal Court. A few interesting points come out of this\r\ndecision: \n This is not a privacy case. It turns upon copyright claims,\r\nsince the plaintiff in this case had acquired the copyrights to the\r\noriginal content. Nevertheless, the principles in this case (to\r\ndetermine which court is the proper place to hear the case) could\r\nbe applied to any number of situations, including privacy,\r\ncopyright or personality rights. \n Interestingly, the fact that the plaintiff had used American\r\nDMCA notices did not, by itself, convince the court that the US was\r\nthe best forum for this case. \n The court looked to a recent trademark decision\r\n( Homeaway.com Inc. v. Hrdlicka ) to show that a trademark\r\nsimply appearing on the computer screen in Canada constituted use\r\nand advertising in Canada for trademark law purposes. Here,\r\naccessing the content in Canada from servers located in the US\r\nconstituted access in Canada for copyright purposes. \n While some factors favoured California, and some favoured\r\nCanada, the court concluded that California was not  clearly\r\nmore appropriate . This shows there is a first-mover advantage\r\nin commencing the action in the preferred\r\njurisdiction.   \n The content of this article is intended to provide a general\r\nguide to the subject matter. Specialist advice should be sought\r\nabout your specific circumstances. \n To print this article, all you need is to be registered on Mondaq.com.  Click to  Login  as an existing user or  Register  so you can print this article. \n Do you have a Question or Comment? Click here to email the Author Interested in the next Webinar on this Topic? Click here to register your Interest \n Contributor Richard  Stobbe Field LLP \n Email  Firm View  Website   Events  from this Firm     \n More  from this Firm   More  from this Author       News  About this Firm     \n Authors Richard  Stobbe More Popular Related Articles on  Intellectual Property  from  Canada     \r\n\tDomain Name Squatters Lose - Again  \n McMillan LLP \n As any startup company that has built a consumer facing brand will tell you, there are countless names to secure, from choosing a corporate name  and registering a trademark... \n\tCannabis-Related Trade-Marks: Take Care In Choosing Correctly \n McMillan LLP \n As previously reported in our bulletin, Bill C-45, an Act respecting cannabis and to amend the Controlled Drugs and Substances Act, the Criminal Code and other Acts... \n\tIntellectual Property Meets Real Property: Recent Copyright Infringement Cases \n Bennett Jones LLP \n Two recent copyright infringement disputes involved the rare intersection of intellectual property with real property. \n\tIdentifying And Enforcing Trade Secrets  \n Bereskin & Parr LLP \n Trade secrets provide a business with an opportunity to obtain a commercial advantage over competitors who do not know or use the secret.  \n\tRegistering And Discharging Intellectual Property Security Interests  \n Norton Rose Fulbright Canada LLP \n Intellectual property often forms an important part of a target's assets, especially for start-ups and high-tech companies. It is important for both the purchaser and the vendor to understand the.... \n\tOpen Court Principle Means No Secret Proceedings If They Would Directly Affect A Competitor's Rights \n Bennett Jones LLP \n Courts in Canada are presumed to be open and accessible to the public. \n\tProposed New Canadian Patent Rules: Our Detailed Review – Part 1 \n Bereskin & Parr LLP \n As we previously reported on August 3, 2017, the Canadian Intellectual Property Office (CIPO) has recently published proposed new amendments to the Patent Rules. \n\tChoosing A Brand Name – International Considerations \n Goldman Sloan Nash & Haber LLP \n When a brand name is used internationally additional issues can arise. \n \t\t  \n In association with   \r\n\tMondaq Advice Centre (MACs)\r\n Intellectual Property \n International Trade and Anti-Corruption \n Privacy and Data Protection \n More  Advice Centers Related Topics Similar Topics \nIntellectual Property\r\nCopyright\r\nTrade Secrets\r\nIntellectual Property\r\nLicensing & Syndication\r\nPatent\r\nTrademark\r\n Related Articles Recently Viewed   \n\tOntario Court Of Appeal Confirms Broad Scope Of Crown Copyright \n Fasken Martineau \n\tIntellectual Property Meets Real Property: Recent Copyright Infringement Cases \n Bennett Jones LLP \n\tNoel Courage Authoured 'International Enforcement Of Trade Secrets' Originally Published By AIPLA Biotechnology Buzz \n Bereskin & Parr LLP \n\tIdentifying And Enforcing Trade Secrets  \n Bereskin & Parr LLP \n\tRegistering And Discharging Intellectual Property Security Interests  \n Norton Rose Fulbright Canada LLP \n\tIntellectual Property Weekly Abstracts Bulletin — Week Of October 30, 2017 \n Borden Ladner Gervais LLP \n\tProtecting Cannabis Strains In Canada: A Growing Concern \n Blake, Cassels & Graydon LLP \n\tProtect Your Assets: 3 Best Practices For Intellectual Property (IP) Owners \n McInnes Cooper \n\tUne soirée cinéma pour lever des fonds?  \n Norton Rose Fulbright Canada LLP \n\tCopyright Board Releases Decision On Scope Of Making Available Right Under The Copyright Act \n Deeth Williams Wall LLP \n Recently viewed items tracks each article you read and gives you a quick link back to that article if you need to review it again. To activate recently viewed, you just need to login or register with us above.   \n\tRelated Video\r\n\tProtecting Innovation In-House With Tanya Rothe Of D-Wave Systems (Video)  \n Blake, Cassels & Graydon LLP \n\tHot Topic: Trans-Pacific Partnership Treaty & Intellectual Property \n Gowling WLG  \n\tIP Ownership For R&D Companies: Cautionary Tales And Best Practices \n Gowling WLG  \n View  More Videos \nUp-coming Events Search\r\n Region / Country... Worldwide Latin America Europe Asia Pacific Africa Middle East Australasia Asia European Union Australia U.K. Belgium Canada Cyprus Germany Hungary India Ireland Israel Italy Luxembourg Netherlands Panama South Africa UK United States Guernsey Show  More Filters Timeframe... This Week Next Two Weeks Next Month Next Quarter Event Type... Business Breakfast Conference Other Podcast Seminar Speaking Engagement Webinar Workshop Location... Australia -   Adelaide -   Melbourne Belgium -   Brussels Canada -   Calgary -   Montreal -   Ottawa -   Toronto Cyprus -   Nicosia Germany -   Frankfurt -   Munich Guernsey -   St Peter Port Hungary -   Budapest India -   Mumbai Ireland -   Dublin Israel -   Tel Aviv Italy -   Milan Luxembourg -   Luxembourg Netherlands -   Amsterdam Panama -   Panama City South Africa -   Cape Town -   Johannesburg UK -   Edinburgh -   London -   Manchester United States -   Boston -   California -   Los Angeles -   New York -   San Francisco -   Virginia -   Washington, DC GO \n\tTools\r\n Print \n Font Size: Translation \r\n Channels Mondaq on Twitter       Free  News Alert \n Custom  RSS Feed \n Download on iPhone & Android \n Contact Us \n  |  \n Your Privacy \n  |  \n Feedback \n  © Mondaq® Ltd 1994 - 2017 \r\nAll Rights Reserved\r\n     \n News Alert | Login | Register  Login \r\n/  Register \n Free News Alert \n Privacy/ Cookies \n Terms & Conditions \n About Mondaq \n Unsubscribe \n TOPICS | REGIONS | CONTRIBUTORS | ADVICE CENTRE | OUR SERVICES   \n Employment |\r\n Commercial |\r\n Litigation |\r\n Tax |\r\n IP |\r\n Immigration |\r\n Real Estate |\r\n Energy |\r\n Healthcare |\r\n Finance |\r\n Environment |\r\n International |\r\n More  \n Compliance \n Wealth Mgt \n Law Practice \n Law Performance \n Accounting \n Strategy \n Consumer \n Anti-trust \n Transport \n Criminal \n Insolvency \n Media & IT \n Technology \n Privacy \n Government \n Family \n Insurance \n All Regions \r\n| USA \r\n| Canada \r\n| UK \r\n| Europe \r\n| Offshore \r\n| Asia Pacific \r\n| Australia \r\n| Latin America \r\n| Middle East & Africa \r\n| India \r\n| \n More  \n   Contributors A-Z  |\r\n   Most Popular Contributors  |\r\n   Most Popular Authors  |\r\n   Author League  |\r\n   Award Winners    |\r\n   Become a Contributor   \n   About Mondaq  |\r\n   Become a Contributor   |\r\n   Become a Partner  |\r\n   What's New  |\r\n    Contact Us  \n Become a MAC Partner Select Advice Centre | Mondaq Advice Centre - About | \n Albania  \n Argentina  \n Austria  \n Barbados  \n Belgium  \n Bermuda  \n Brazil  \n British Virgin Islands  \n Cayman Islands  \n Chile  \n China  \n Colombia  \n Cyprus  \n Czech Republic  \n Ecuador  \n France  \n Germany  \n Gibraltar  \n Guernsey  \n Hong Kong  \n Hungary  \n India  \n Indonesia  \n Ireland  \n Isle of Man  \n Israel  \n Italy  \n Japan  \n Jersey  \n Kazakhstan  \n Luxembourg  \n Malaysia  \n Malta  \n Mauritius  \n Mexico  \n Netherlands  \n New Zealand  \n Nigeria  \n Oman  \n Panama  \n Peru  \n Poland  \n Portugal  \n Qatar  \n Romania  \n Russian Federation  \n Saudi Arabia  \n Singapore  \n South Africa  \n South Korea  \n Spain  \n Switzerland  \n Turkey  \n Ukraine  \n United Arab Emirates  \n Uruguay  \n Vietnam  \n Accounting and Audit \n Anti-trust/Competition Law \n Compliance \n Consumer Protection \n Corporate/Commercial Law \n Criminal Law \n Employment and HR \n Energy and Natural Resources \n Environment \n Family and Matrimonial \n Finance and Banking \n Food, Drugs, Healthcare, Life Sciences \n Government, Public Sector \n Immigration \n Insolvency/Bankruptcy/Re-structuring \n Insurance \n Intellectual Property \n International Law \n Law Department Performance \n Law Practice Management \n Litigation, Mediation & Arbitration \n Media, Telecoms, IT, Entertainment \n Privacy \n Real Estate and Construction \n Strategy \n Tax \n Technology \n Transport \n Wealth Management \n All Regions \n USA \n Canada \n UK \n Europe \n Offshore \n Asia Pacific \n Australia \n Latin America \n Middle East & Africa \n Other Countries \n Albania \n Argentina \n Austria \n Barbados \n Belgium \n Bermuda \n Brazil \n British Virgin Islands \n Cayman Islands \n Chile \n China \n Colombia \n Cyprus \n Czech Republic \n Ecuador \n France \n Germany \n Gibraltar \n Guernsey \n Hong Kong \n Hungary \n India \n Indonesia \n Ireland \n Isle of Man \n Israel \n Italy \n Japan \n Jersey \n Kazakhstan \n Luxembourg \n Malaysia \n Malta \n Mauritius \n Mexico \n Netherlands \n New Zealand \n Nigeria \n Oman \n Panama \n Peru \n Poland \n Portugal \n Qatar \n Romania \n Russian Federation \n Saudi Arabia \n Singapore \n South Africa \n South Korea \n Spain \n Switzerland \n Turkey \n Ukraine \n United Arab Emirates \n Uruguay \n Vietnam \n Register for Access and our Free Biweekly Alert for    \n This service is completely free.  Access 250,000 archived articles from 100+ countries and get a personalised email twice a week covering developments (and yes, our lawyers like to think you’ve read our Disclaimer). \n  \t \n Email Address   \n Company Name   \n Password   \n Confirm Password\t \n Position CEO, Owner, Chairman, President, Mng Director \n Director, Vice President, Senior Company Executive \n Inhouse Counsel, Lawyer in Company/Government \n CFO/FD, Inhouse Accountant, Treasurer \n Corporate/Company Secretary, Compliance Officer \n Lawyer in Law Firm, Private Practice, Barrister \n Consultant, Accountant in Accountancy Firm, Practicing Accountant \n Banker, Stockbroker, Analyst, Economist \n Marketing, Business Development \n Editor, Journalist, Researcher \n IS/IT \n Student, Academic \n HR \n Please Select Position \n Mondaq Topics -- Select your Interests  Accounting\r\n  Anti-trust\r\n  Commercial\r\n  Compliance\r\n  Consumer\r\n  Criminal\r\n  Employment\r\n  Energy\r\n  Environment\r\n  Family\r\n  Finance\r\n  Government\r\n  Healthcare\r\n  Immigration\r\n  Insolvency\r\n  Insurance\r\n  International\r\n  IP\r\n  Law Performance\r\n  Law Practice\r\n  Litigation\r\n  Media & IT\r\n  Privacy\r\n  Real Estate\r\n  Strategy\r\n  Tax\r\n  Technology\r\n  Transport\r\n  Wealth Mgt\r\n Regions  Africa\r\n    Asia\r\n    Asia Pacific\r\n    Australasia\r\n    Canada\r\n    Caribbean\r\n    Europe\r\n    European Union\r\n    Latin America\r\n    Middle East\r\n    U.K.\r\n    United States\r\n     Worldwide Updates   \n Check   to state you have read and  agree to our Terms and Conditions  \n Terms & Conditions and Privacy Statement \n Mondaq.com (the Website) is owned and managed by Mondaq Ltd and as a user you \r\nare granted a non-exclusive, revocable license to access the Website under its \r\nterms and conditions of use. Your use of the Website constitutes your agreement \r\nto the following terms and conditions of use. Mondaq Ltd may terminate your use \r\nof the Website if you are in breach of these terms and conditions or if Mondaq \r\nLtd decides to terminate your license of use for whatever reason. \n Use of  www.mondaq.com \n You may use the Website but are required to register as a user if you wish to \r\nread the full text of the content and articles available (the Content). You may \r\nnot modify, publish, transmit, transfer or sell, reproduce, create derivative \r\nworks from, distribute, perform, link, display, or in any way exploit any of the \r\nContent, in whole or in part, except as expressly permitted in these terms & \r\nconditions or with the prior written consent of Mondaq Ltd. You may not use \r\nelectronic or other means to extract details or information about Mondaq.com’s \r\ncontent, users or contributors in order to offer them any services or products \r\nwhich compete directly or indirectly with Mondaq Ltd’s services and products. \r\n Disclaimer \n Mondaq Ltd and/or its respective suppliers make no representations about the \r\nsuitability of the information contained in the documents and related graphics \r\npublished on this server for any purpose. All such documents and related \r\ngraphics are provided \"as is\" without warranty of any kind. Mondaq Ltd and/or \r\nits respective suppliers hereby disclaim all warranties and conditions with \r\nregard to this information, including all implied warranties and conditions of \r\nmerchantability, fitness for a particular purpose, title and non-infringement. \r\nIn no event shall Mondaq Ltd and/or its respective suppliers be liable for any \r\nspecial, indirect or consequential damages or any damages whatsoever resulting \r\nfrom loss of use, data or profits, whether in an action of contract, negligence \r\nor other tortious action, arising out of or in connection with the use or \r\nperformance of information available from this server.  \n The documents and related graphics published on this server could include \r\ntechnical inaccuracies or typographical errors. Changes are periodically added \r\nto the information herein. Mondaq Ltd and/or its respective suppliers may make \r\nimprovements and/or changes in the product(s) and/or the program(s) described \r\nherein at any time.  \n Registration \n Mondaq Ltd requires you to register and provide information that personally \r\nidentifies you, including what sort of information you are interested in, for \r\nthree primary purposes:  \n To allow you to personalize the Mondaq websites you are visiting. \r\n   To enable features such as password reminder, newsletter alerts, email a \r\n  colleague, and linking from Mondaq (and its affiliate sites) to your website. \r\n   To produce demographic feedback for our information providers who provide \r\n  information free for your use.  \n Mondaq (and its affiliate sites) do not sell or provide your details to third \r\nparties other than information providers. The reason we provide our information \r\nproviders with this information is so that they can measure the response their \r\narticles are receiving and provide you with information about their products and \r\nservices. \n If you do not want us to provide your name and email address you may opt out \r\nby clicking here  . \n If you do not wish to receive any future announcements of products and \r\nservices offered by Mondaq by clicking here  .  \n Information Collection and Use \n We require site users to register with Mondaq (and its affiliate sites) to \r\nview the free information on the site. We also collect information from our \r\nusers at several different points on the websites: this is so that we can \r\ncustomise the sites according to individual usage, provide 'session-aware' \r\nfunctionality, and ensure that content is acquired and developed appropriately. \r\nThis gives us an overall picture of our user profiles, which in turn shows to \r\nour Editorial Contributors the type of person they are reaching by posting \r\narticles on Mondaq (and its affiliate sites) – meaning more free content for \r\nregistered users.  \n We are only able to provide the material on the Mondaq (and its affiliate \r\nsites) site free to site visitors because we can pass on information about the \r\npages that users are viewing and the personal information users provide to us \r\n(e.g. email addresses) to reputable contributing firms such as law firms who \r\nauthor those pages. We do not sell or rent information to anyone else other than the authors of those pages, who may change from time to time. Should you wish us \r\nnot to disclose your details to any of these parties, please tick the box above \r\nor tick the box marked \"Opt out of Registration Information Disclosure\" on the \r\nYour Profile page. We and our author organisations may only contact you via \r\nemail or other means if you allow us to do so. Users can opt out of contact when \r\nthey register on the site, or send an email to unsubscribe@mondaq.com with “no \r\ndisclosure” in the subject heading  \n Mondaq News Alerts \n In order to receive Mondaq News Alerts, users have to complete a separate \r\nregistration form. This is a personalised service where users choose regions and \r\ntopics of interest and we send it only to those users who have requested it. \r\nUsers can stop receiving these Alerts by going to the Mondaq News Alerts page \r\nand deselecting all interest areas. In the same way users can amend their \r\npersonal preferences to add or remove subject areas.  \n Cookies \n A cookie is a small text file written to a user’s hard drive that contains an \r\nidentifying user number. The cookies do not contain any personal information \r\nabout users. We use the cookie so users do not have to log in every time they \r\nuse the service and the cookie will automatically expire if you do not visit the \r\nMondaq website (or its affiliate sites) for 12 months. We also use the cookie to \r\npersonalise a user's experience of the site (for example to show information \r\nspecific to a user's region). As the Mondaq sites are fully personalised and \r\ncookies are essential to its core technology the site will function \r\nunpredictably with browsers that do not support cookies - or where cookies are \r\ndisabled (in these circumstances we advise you to attempt to locate the \r\ninformation you require elsewhere on the web). However if you are concerned \r\nabout the presence of a Mondaq cookie on your machine you can also choose to \r\nexpire the cookie immediately (remove it) by selecting the 'Log Off' menu option \r\nas the last thing you do when you use the site.  \n Some of our business partners may use cookies on our site (for example, \r\nadvertisers). However, we have no access to or control over these cookies and we \r\nare not aware of any at present that do so.  \n Log Files \n We use IP addresses to analyse trends, administer the site, track movement, \r\nand gather broad demographic information for aggregate use. IP addresses are not \r\nlinked to personally identifiable information.  \n Links \n This web site contains links to other sites. Please be aware that Mondaq (or \r\nits affiliate sites) are not responsible for the privacy practices of such other \r\nsites. We encourage our users to be aware when they leave our site and to read \r\nthe privacy statements of these third party sites. This privacy statement \r\napplies solely to information collected by this Web site.  \n Surveys & Contests \n From time-to-time our site requests information from users via surveys or \r\ncontests. Participation in these surveys or contests is completely voluntary and \r\nthe user therefore has a choice whether or not to disclose any information \r\nrequested. Information requested may include contact information (such as name \r\nand delivery address), and demographic information (such as postcode, age \r\nlevel). Contact information will be used to notify the winners and award prizes. \r\nSurvey information will be used for purposes of monitoring or improving the \r\nfunctionality of the site.  \n Mail-A-Friend \n If a user elects to use our referral service for informing a friend about our \r\nsite, we ask them for the friend’s name and email address. Mondaq stores this \r\ninformation and may contact the friend to invite them to register with Mondaq, \r\nbut they will not be contacted more than once. The friend may contact Mondaq to \r\nrequest the removal of this information from our database.  \n Emails \r\n From time to time Mondaq may send you emails promoting Mondaq services including new services. You may opt out of receiving such emails by clicking below.\r\n  *** If you do not wish to receive any future announcements of services offered by Mondaq you may opt out by clicking here  .  \n Security \n This website takes every reasonable precaution to protect our users’ \r\ninformation. When users submit sensitive information via the website, your \r\ninformation is protected using firewalls and other security technology. If you \r\nhave any questions about the security at our website, you can send an email to \r\n webmaster@mondaq.com . \r\n Correcting/Updating Personal Information \n If a user’s personally identifiable information changes (such as postcode), \r\nor if a user no longer desires our service, we will endeavour to provide a way \r\nto correct, update or remove that user’s personal data provided to us. This can \r\nusually be done at the “Your Profile” page or by sending an email to  EditorialAdvisor@mondaq.com . \n Notification of Changes \n If we decide to change our Terms & Conditions or Privacy Policy, we will \r\npost those changes on our site so our users are always aware of what information \r\nwe collect, how we use it, and under what circumstances, if any, we disclose it. \r\nIf at any point we decide to use personally identifiable information in a manner \r\ndifferent from that stated at the time it was collected, we will notify users by \r\nway of an email. Users will have a choice as to whether or not we use their \r\ninformation in this different manner. We will use information in accordance with \r\nthe privacy policy under which the information was collected.  \n How to contact Mondaq \n You can contact us with comments or queries at  enquiries@mondaq.com . \n If for some reason you believe Mondaq Ltd. has not adhered to these \r\nprinciples, please notify us by e-mail at  problems@mondaq.com  and we will use \r\ncommercially reasonable efforts to determine and correct the problem promptly."}