{"url": "http://www.boxofficemojo.com/studio/?view=company&view2=allstudios&p=.htm", "content": "Market Share and Box Office Results by Movie Studio \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n Box Office by Studio \n BY STUDIO BY MAJOR STUDIO BY PARENT COMPANY \n STUDIO MARKET SHARE \n Yearly Breakdown \n Yearly Comparisons \n Studio List \n Basic List |  Detail List Top Studios Studios 20th Century Fox Paramount Buena Vista Paramount Classics DreamWorks SKG Sony / Columbia Focus Features Sony Classics Fox Searchlight Universal Lionsgate Warner Bros. MGM/UA Warner Independent Miramax Weinstein Company New Line Advertisement All Studios Studios 108 Pics Four Seasons Panorama 120 Degree Films Four of a Kind Parade Deck Films 1st National Film Group Fox Intl Classics Paradise Acres 20th Century Fox Fox Meadows Films Paragon 21st Century Film Fox Rhythm Paramount 21st Century Film Production Fox Searchlight Paramount Classics 25th Frame Fox Star Studios Paramount Insurge 26 Aries Fox Trail Productions Paramount Vantage 28 Entertainment Fred Herman Co. Parker 2Silk Freestyle Releasing Parkside Releasing 2nd Generation Friedman-Nadler Participant Media 3D Entertainment Front Street Films Pascack Media 4th and Broadway Frontier Films Pasidg Productions 518 Media Full Circle Releasing Pathfinder 600 West Full Moon Pictures Peace Arch Entertainment 7-57 Releasing Fun Academy Peace Film 7A Productions Future Educational Films Peaches Christ 7th Art GKIDS Pelican House 8X Entertainment GVN Releasing Peninsula A24 Gaatri Media Penland ABS-CBN International Gabriel Film Group People Pictures ADV Films Gabriel's Messenger Films Phaedra AFFRM Gaiam Vivendi Entertainment Phantom Pain Films ALMI Galaxy International Phase 4 AMBI Garlin Pictures Picture Me Rollin AMC Theaters Garwood Picture This! APD/Cinema Conservancy Gatekeeper Picturehouse ATO Pictures Gathr Films Picturehouse (II) AVCO Embassy Gaumont British Picture Corporation Pillen's Farm Pictures Aascar Film Gemelli Pioneer Abkco Films Geneon Entertainment Plainview Pictures Abramorama Ghosts Media, Inc. Play Now Enterprise Academy Entertainment Giant Flick Plexifilm Access Giant Screen Films Plymptoons Active Fox Productions Gigantic Releasing Pocket Releasing AdLabs Gigapix Releasing PolyGram Adopt Films Global Digital Postmill After Dark Films GoDigital Power Point AfterLight GoGoGo Entertainment Prabhudheva Air Bud Entertainment Gold Cap Films Prime Media Pictures Alaska Gold Circle Primesco Alchemy Goldcrest Films Priority Films Aliquot Films Goldsmith Productions Pro-Motion Pictures Alive Films Goldwyn Distributing Company Producers Distribution Agency Alive Mind Cinema Good Deed Proud Mother Pictures All Rise Films Good Machine Providence Alliance Goodbye Cruel Releasing Providence Film Partners Allied Artists Gorilla Factory Productions Psychic Girls, LLC Alluvial Film Company Gramercy Purdie Distribution Aloha Releasing Grasshopper Film Pure Flix Alpha Galore Gravitas Ventures Purple Amazon Studios Gravity Arch Quadratic Media Ambassador Film Great India Films Quaker Media Amer. Film Theatre Green Forest Films Quality Flix American Cinema Green Valley Quantum Entertainment American Experience Films Grey Lady Quartet American International Pictures Greycat Quixotic Media American Zoetrope Gringo Wedding LLC RAF Industries Amplify Group 1 RBC Radio Analysis Film Rel. Gunpowder & Sky RCR Distribution Anchor Bay Films H Collective RKO Andes Film Company HB Filmworks RMH Media Andora Pictures HP Releasing RS Angelika Hacienda Rada Film Group Animation Show Halestorm Radio London Films Annapurna Pictures Hallmark Rel. Radius-TWC Anywhere Road Halo8 Releasing Rainbow Films Apollo Associates Hammond Rainbow Releasing Apparition Hamzeh Mystique Rainforest Applied Art Hannover House Rajshri Intl. Arab Film Dist. Hanover Multimedia Ram Entertainment Arc Entertainment Hansen Entertainment Random Productions ArcAngelo Entertainment Hanson Brothers Reactor 88 Studios Archstone Heartland Film Real Bean Arclight Films Heliograph Real Women Area23a Hemdale Realart Pictures Inc. Arenaplex Hey Jude Productions Red Bull Arenas Entertainment Hibernation Red Chillies Argentum High Cotton Films Red Dirt Pictures Argot Pictures High Top Releasing Red Envelope Entertainment Aries Films Hiqi Media Red Flag Releasing Ariztical Entertainment Holedigger Studios Redeemable Armando Montelongo Productions Hollywood Classics Redwood Palms Pictures Aron Govil Productions Hollywood Global Reel Diva Consultants Arrival Pictures Holt Hamilton Films Reel One Arrow Films Hombre Reel Source Arrow Releasing Honorara Productions Regent Releasing ArtAffects Horizon Relativity Arthouse Films Horne Ent. Reliance Big Pictures Arthur Mayer & Joseph Burstyn I House Lights Media Reliance Films Artificial Eye Humble Magi Republic Artigo/Ajemian Hummingbird Pictures Revolver Artisan ICA Rialto Artist Tribe/One Step IDP Richmond Media Ent. Artistic License IFC Right Brained Releasing Artmattan Prods. IFEX Rim Film Dist. Artrution IM Global/Blumhouse Riot Studios Arts Alliance America IMAX Ripple Effect Inc. Ascendant Pictures IMG Films River Rain Asia Releasing IRS Media Rizzoli Aspiration Media ISA Releasing Roadshow Associated Film Dist. Ibex Roadside Attractions At Risk Films Icarus Films Roam Films Atlantic Illuminare Entertainment Rocket Releasing Atlas Distribution Image Entertainment Rockstone Releasing Atopia ImaginAsian Pictures Rocky Mountain Pictures Attitude Films Imperial Ent. Roebuck Media Audience Alliance In Pictures Rogue Arts Autlook Films In the Family Rogue Pictures Avalanche In the Light Rolling Thunder Avatar Independent Romar Entertainment Avenue Pict. Independent Artists Roxie Aviron Indican Ruff Nation Azoland IndieVest Pictures Rumur Releasing B.D. Fox Indomina Media Running Entertainment B4U Films Industrial House S2BN Films BBC Worldwide North America IndustryWorks SK Films BEV Pictures Innovation Film Group SModcast Pictures BH Tilt Inspired Life STX Entertainment Balcony Releasing Instrum Int SVSC Bandai Insurgent Releasing Saban Films Banner Entertainment Int'l Cinema Saboteur Media Barking Cow Media Group InterPositive Media Sag Harbor Basement Barn Owl International Cinema Sagewood Cinema Ventures Bauer Martinez Distribution International Film Circuit Saint Juste Baxter Bros. International Film Exchange Sakura Production USA Beech Hill Films International Film Marketing Salient Media Better Than Something International WOW Samuel Goldwyn Big Ain't Bad Prods. Interstar Sanrio Communications Big Beach Films Invincible Pictures Sarkasmos Big Fat Movies Iron Satori Big Pictures Island Alive Saturn International Big Sky Productions Island Pictures Savage Pictures Big World Pictures JBG Pictures Savoy Bigfoot Ascendant JF Productions Scarlet Sky Productions Bill Plympton JS Media & Entertainment Sceneries Distribution Biograph Films JSC Entertainment SchwarzSmith & Taskovski Films Blackrock Films JSenko Scotti Bros. Bleecker Street Jampa Screen Gems Blind Dog Janson Media Screen Media Bloodvine Media Janus Films Screenland Films Blowtorch Entertainment Jeff Lipsky Screenvision Blue Collar Releasing Jenkins Seatzy Blue Llama Jensen Farley Seatzy/IMA Blue Sky Cinema Jet Films Secret Identity Blue Steel John Aaron SeeThink Productions Bluff City Films Joules Films Selznick Releasing Boll Films Jour de Fete SenArt/Scranton-Lacy Films Bond/360 Jujitsu Films Senator Distribution Bonfire Films of America Jung N Restless Films Seneca International Borde Releasing K Film Set Pictures Borotoro KDK Factory Seven Arts Distribution Bow and Arrow KKM Seven Clubs Boxcar Kartemquin Films Seventh Art Brainstorm Media Kathi Arts Seville Brainstorm and Double Hope Kenilworth Films Shadow Dist. Bramacharia, LLC Kenn Viselman Presents Shakey Branded/Peck Ent. Ketchup Entertainment Shapiro-Glickenhaus Brandon Films Inc. Keystone Shemaroo Bread & Water KimStim Shoot First Inc. Breaking Glass Pictures KimStim/Zeitgeist Films Shooting Gallery Broad Green Pictures Kindred Media Group Shorts International Brothers' Ink Productions Kings Road Ent. Shotown Pictures Bubble Distribution Kino Shout! Factory Bud Yorkin Co. Kino Classics Showtime Buena Vista Kino Lorber Sideshow Releasing Bullz Eye Productions Kinobild Releasing Sidetrack Films Burton/Floyd Kit Parker Films Silver Nitrate CAVU Koch Lorber Films Silver Plane Films CBS Films Kosmic Films Sister Films CFI Releasing Kria, Inc. Skouras CFP Intl Krian Media Sky Island Films CJ Entertainment Kristin Marie Productions Skylight Pictures Cabin Films LD Entertainment Slamdance on the Road Cafe Entertainment Studio Laemmle / Zeller Films Slater Brothers Cafe Pictures Lafayette Films Slippery Chicken Pictures Caledonia Pictures Lambert Releasing Slowhand Cinema California Newsreel Lang Films Slugger Pictures Callbox LLC Lange Releasing Small Island CanWest Films Lantern Lane Small Planet CanZion Films Lavendar House Films Smarthouse Candlelight Media Group Le Petit Canyon Smith Global  Candy Factory Leave It Better Snagfilms Cannon Films Lee Daniels Entertainment Social Media Productions Capitol Entertainment Legacy Society Films Capricorn Distribution Leisure Time Somerset Films Captured Light Distribution Level 33 Entertainment Somford Entertainment Cardinal Entertainment Level Films Sony / Columbia Carl Jackson Liberation Entertainment Sony BMG Carlotta Films Libero, LLC Sony Classics Cartuna Liberty Street Films South Gate Entertainment Castle Hill Liberty Studios Spacey LTD Category One Life Sentence Films/mTuckman Media Spanish Moss Cavalier Films LifeWay Films Spark Media Cheapo Films Lifesize Spats Films Check Entertainment Lightyear Entertainment Speak Productions Chicago Pictures Limelight Intl Spectrafilm China Lion Linn Productions Spit N' Glue Cho Lionsgate Stand Up Films Chris. Little Flower Starz Media Christal Films Little Villa Steelyard Pictures CineGalaxy Live Stone Five Studios Cinebella Logo Features Story Island Entertainment Cinecom Loki Films Storyman Pictures Cinedigm Entertainment Lone Wolf Bridge Releasing Strand Cinedigm/Brian&Barrett Lonely Seal Releasing Strasson Group Cinelou Films Long Shot Factory Strata Prods. Cinema 5 Lookhu Stratosphere Cinema Connection Loop Filmworks Streamline Cinema Conservancy Lopert Pictures Corporation Streetlight Cinema Four Lorber Films Striped Entertainment Cinema Guild Lorimar Studio 18 Cinema Libre Lot 47 Studio 8 Cinema Libre Studio Lovett Releasing Studio Three Cinema Purgatorio Lucid Dreaming Inc. Submarine Deluxe Cinema Service Luke Films Success Films Cinema Tropical Lumiere Productions Sumbadhat Productions Cinema Ventures Luminous Velocity Releasing Sumerian Films Cinema Village M D Wax / Courier Films Summit Entertainment Cinemax MAC Releasing Sundance Film Series Cineplex Odeon MCEG Sundance Selects Cinerama MCR Releasing Sunn Classics Pictures Cinestaan MDP Worldwide Super Cinetel MEI Releasing Super Chief Films Cineville MGM/UA Surla Films Cinipix MK2 USA Swen Circle MPE Swipe Films Citizens United MPI Media Group Sycamore City Drive Films MSK Productions TLA Releasing City Lights Pictures Releasing MUBI TODpix Clarius Entertainment Mac and Ava Motion Pictures TSG Clay Way Media MacGillivray Freeman Films TVA Cleopatra Films Madhu Entertainment Tag Entertainment Cloud Ten Maelstrom Tara Releasing Cockeyed Caravan Magic Lamp Tartan Codeblack Entertainment Magnolia Taurus Ent. Cohen Media Group Main Street Films Televisa Cine Collective Eye Main Street Movie Co. Ten Furlongs Compass Mainstreet Tentmakers Entertainment Comworld Man Ray Assoc. Testimony Concorde Mance Media The 7th Floor Content Media Mandt Bros. Productions The American Film Company Continental Motion Pictures Manga The Ashton Times Convex Group Mangusta Productions The Bigger Picture Corinth Films Manhattan The Ciesla Foundation Corinth/TV360 Manifesto Films The Disinformation Co. Corsair MarVista Entertainment The Documentary Group Cortelyou Films Margin The Film Arcade Counterpoint Films Masters Media The Film Collaborative Cowboy Matson Films The Film Collective Crane Movie Company Maxmedia/Endgame Pictures The Film Desk Creative Thinking Maya Entertainment The Happy Sad LLC Crimson Films/PMK*BNC Meadowbrook Pictures The Martindale Group Crimson Forest Medallion The Nobelity Project Cristal Media Blasters The Only Real Game Movie CrowdStarter Media Partners The Orchard Crown Megastar The Vladar Company Cyan Pictures Mela Films The World According to Shorts D Street Releasing Mellow Manor Productions ThinkFilm DDM Film Corp. Menemsha Thinking Man Films DEG Methinx Entertainment Third Rail Releasing DEJ Metro Pictures Corporation Thread Cross Films Dada Films Michael Moore Three Kings Productions Dalton Pictures Microangelo Entertainment Tidepoint Pictures Dark Coast Pictures Midnight Movies Entertainment Tilapia Film Dark Frames Mile End Films Tips Datari Turner Productions Milestone Toho Company David & Layla, LLC Millennium Ent. Tombstone David Keith Millennium Films, Inc. Tostie Productions Deep Focus Millimeter Touch the Wall, LLC Define American Mind the Gap Productions Tozart Delaware Pictures Minority Films Trans World Ent. Delphi Film Foundation Miracle Film Distribution Transatlantic Destination Miramax Transcendent Films DigiNext Mirror Images Ltd. Transparent/Outerstratosphere Dimension Films Mitropoulos Films Treetops Productions Dinsdale Releasing Mochary Films Trela Media Direct Cinema Limited Moki TriCoast Worldwide DisruptiveLA Momentum Tribeca Film Distrib Films Monarch Trillian Distributors Corporation of America Mongrel Media Trillion Diversa Films Monogram Pictures Corporation Trimark Documented Film Monterey Media, Inc. Trio Docurama Films Monument Releasing Triton Dog Lover's Symphony Moon Pictures Triumph Doppelganger Releasing Moonstone Troma Dos Corazones Films Mormon Movies Truly Indie Drafthouse Morning Star Truth Aid DreamWorks SKG Motion Film Group Turbulent Arts Dreamwest Mountain Top Releasing Twelve Thirty Dressed Mousetrap Films, LLC Two Moon Releasing Drift Releasing Movie Partners Typecast Releasing Drive-in Doc LLC Moviestore Ent. Tyscot Manhaddon & Releve Driving With Our Eyes Shut Movin' Picture Studios USA Films Dutchmen Films Moving Pictures UTV Communications Dylan Moving Pictures Institute Unapix Ent. ESX Entertainment Moving Visions Entertainment Uncork'd EXP Ent. Mulberry Square Under the Milky Way Eagle One Media/iFN Music Box Films Unico Entertainment Eagle-Lion Films Music Masala Films Union Station Eammon Films Musicwave UnionDocs Echelon Ent. Mypheduh Films Unison Films Echo Bridge Entertainment Myriad Entertainment Group Unison/Paladin EchoLight Studios Myriad Pictures United Entertainment Partners Economic Projections N Wave United Film Distribution Company Either/Or Films Nascent United Motion Pictures Organization Electric Entertainment National Amusements Unitel Pictures Elephant Eye Films National General Universal Eleven Arts National Geographic Entertainment Universal Classics Ellinas Prods. NeoClassics Films Universal Focus Embassy Neon Universal Home Entertainment Embrem Entertainment Net Effect Unknown Emerging Pictures Netflix Unstuck Emissary Productions Neverland Urban Vision Empire New American Vision Urbanworld Empire Film Group New Century Vanguard Empire Pictures New Deal Pictures Vanguardia Films Empowerment Project New Dog Distribution Vanish Films Emshell Prod. Group New Films Cinema Vanishing Angle Films Engel Entertainment New Generation Variance / Everest Ent. Highway New Latin Variance Films Entertainment One New Line Velvet Films Entertainment Studios New Love Films Venevision Epic Pictures New Millennia Venice Film Merchants Equinox New World Veracity Eros New World Pictures Vertical Entertainment EuropaCorp New Yorker Vestron European Classics Newcity Vid. European Int'l Newmarket Video Sound Evergreen Films Newport Films Vineyard Distribution Every Tribe Next Millenium Visio Entertainment Excel NoCoast Artists Vision Intl. Exclusive Media Nocturnal Features Visionbox Exile Non-Fiction Films Vitagraph Exorcism The Movie, LLC Norador Productions Vitagraph Pictures Extra Butter North American Film Theatrical Corp Viva Pictures Distribution FIP North Poplar Pictures Vivendi Entertainment FM Ent. Intl. North by Northwest Viz Media FUNimation Films North/South Pictures Vladar Company Fabrication Films Northern Arts WGB. Facets Noujaim Films WRA Productions Factory Novus Waking Giants Fader Films OA Investment Holdings Waldo West Productions Fair Trade Pictures OFI Walking on Water Films Famous Players-Lasky Corporation Ocean Avenue Entertainment Wanderman Fathom Ocean Releasing Warner Bros. Feature Presentations Releasing Oceanside Warner Independent Fellowship Adventure Group October Warren Miller Film Acres Odeon Warrior Poets Releasing Film Arts Guild Odyssey Watch Releasing Film Desk Off-Holywd. Dist. Watchman Pictures Film Foundry Oilrag Productions Wave Releasing Film Movement Old Glove Productions Wavelength Film Sales Company Olive Films Weinstein Company Film Ventures Intl Omni Lab/Freestyle Releasing Well Go USA FilmBuff Omniverse Vision Wellspring FilmBuff/Participant Media One Big Head White FilmDallas Onyx Films Whitewater Films FilmDemic Open Edge Wild Rose FilmDistrict Open Road Films Wildcat Releasing FilmRise Organic Pictures Wine Women & Song Filmmates Corp. Original 4 Releasing Wingate Distribution Filmopolis Original Cinema Winstar Films Philos Orion Classics Winter Star Filmways Orion Pictures Wishing Well Pictures Fine Line Oscilloscope Pictures Wolfe Releasing Fine Line Media Outrider Women Make Movies First Independent Pictures Outsider Films Wonder Vision First Look Outsider Pictures Word Films First National Pictures Overture Films World Artists First Pond P & A Releasing Worldwide Distributors First Run PBS Distribution Wrekin Hill First Stripe Productions PFM Wringing Hands Prods. Fish Eye PMK*BNC Xenon Pictures Fisher-Klingenstein Films Pacific Films Xlrator Media Five & Two Pictures Pack Wolf Productions Yari Film Group Five Minutes Page 124 Productions Yash Raj Five Sisters Painted Zebra Releasing Yeah Flashlight Pak Films / Shotwell Media Young Medium Flatland Paladin Zee TV Flicker Alley Paladin/108 Media Zeitgeist Focus Features Paladin/Film Buff Zell-Koj Studio Focus World Paladin/Unison Zenith International Films Follow Your Nose Films Palisades Ent. Zion Foremco Pictures Palisades Tartan Zipporah Films Forewarned Palm Zorya Films Fork Films Palmera International eOne Entertainment Found-Charger Cinema Palo Alto Pictures erbp Film Four Eyed Monsters Pan Media & Entertainment mTuckman Media BY STUDIO BY MAJOR STUDIO BY PARENT COMPANY \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}