{"url": "http://parcolympique.qc.ca/le-parc-olympique/montreal-ville-olympique/medailles-et-autres-donnees/", "content": "Médailles et autres données |  Parc olympique de Montréal \n Notre organisme \n Comment se rendre \n FAQ \n English \n Menu Le Parc La Tour de Montréal L'Esplanade Financière Sun Life Le Stade Le Centre sportif Autres attraits  Close Nouvelles Activités Événements Parcours touristiques Organiser un événement \n Médailles et autres données \n Date d’ouverture \n 17 juillet 1976 \n Date de clôture \n 1er août 1976 \n Participation \n 94 nations \n6 084 athlètes (1 260 femmes, 4 824 hommes) \n414 athlètes représentant le Canada \n2661 accompagnateurs \n196 épreuves \n3 195 170 spectateurs \n1 milliard de téléspectateurs \n Ouverture officielle des Jeux \n Sa Majesté la reine Elizabeth II \n Allumage de la vasque olympique \n Stéphane Préfontaine (16 ans) et Sandra Henderson (15 ans) \n Serment olympique \n Pierre St-Jean (haltérophilie) \n Serment officiel \n Maurice Forget (athlétisme) \n Sports au programme (21) \n Athlétisme \n Hockey sur gazon \n Aviron \n Judo \n Basket-ball \n Lutte \n Boxe \n Natation* \n Canoë / Kayak \n Pentathlon moderne \n Cyclisme \n Sports équestres \n Escrime \n Voile \n Football \n Volley-ball \n Gymnastique \n Tir \n Haltérophilie \n Tir à l'arc \n Handball \n *incluant plongeon et water-polo \n Aucun sport en démonstration \n27 lieux de compétition \n Sécurité \n Environ 16 000 personnes (police et armée) \n Tableau des médailles \n Nation \n Or \n Argent \n Bronze \n 1. URSS  URS \n 49 \n 41 \n 35 \n 2. République Démocratique Allemande  GDR \n 40 \n 25 \n 25 \n 3. États-Unis d'Amérique  USA \n 34 \n 35 \n 25 \n 4. République Fédérale d'Allemagne  FRG \n 10 \n 12 \n 17 \n 5. Japon  JPN \n 9 \n 6 \n 10 \n 6. Pologne  POL \n 7 \n 6 \n 13 \n 7. Bulgarie  BUL \n 6 \n 9 \n 7 \n 8. Cuba  CUB \n 6 \n 4 \n 3 \n 9. Roumanie  ROM \n 4 \n 9 \n 14 \n 10. Hongrie  HUN \n 4 \n 5 \n 13 \n 11. Finlande  Fin \n 4 \n 2 \n 0 \n 12. Suède  SWE \n 4 \n 1 \n 0 \n 13. Grande-Bretagne  GBR \n 3 \n 5 \n 5 \n 14. Italie  ITA \n 2 \n 7 \n 4 \n 15. France  FRA \n 2 \n 3 \n 4 \n 16. Yougoslavie  YUG \n 2 \n 3 \n 4 \n 17. Tchécoslovaquie  TCH \n 2 \n 2 \n 4 \n 18. Nouvelle-Zélande  NZL \n 2 \n 1 \n 1 \n 19. Corée  KOR \n 1 \n 1 \n 4 \n 20. Suisse  SUI \n 1 \n 1 \n 2 \n 21. République Populaire Démocratique de Corée  PRK \n 1 \n 1 \n 0 \n 22. Jamaïque  JAM \n 1 \n 1 \n 0 \n 23. Norvège  NOR \n 1 \n 1 \n 0 \n 24. Danemark  DEN \n 1 \n 0 \n 2 \n 25. Mexique  MEX \n 1 \n 0 \n 1 \n 26. Trinité-et-Tobago  TRI \n 1 \n 0 \n 0 \n 27. Canada  CAN \n 0 \n 5 \n 6 \n 28. Belgique  BEL \n 0 \n 3 \n 3 \n 29. Pays-Bas  NED \n 0 \n 2 \n 3 \n 30. Portugal  POR \n 0 \n 2 \n 0 \n 31. Espagne  ESP \n 0 \n 2 \n 0 \n 32. Australie  AUS \n 0 \n 1 \n 4 \n 33. République Islamique d'Iran  IRI \n 0 \n 1 \n 1 \n 34. Mongolie  MGL \n 0 \n 1 \n 0 \n 35. Vénézuela  VEN \n 0 \n 1 \n 0 \n 36. Brésil  BRA \n 0 \n 0 \n 2 \n 37. Pakistan  PAK \n 0 \n 0 \n 1 \n 38. Porto Rico  PUR \n 0 \n 0 \n 1 \n 39. Thaïlande  THA \n 0 \n 0 \n 1 \n 40. Autriche  AUT \n 0 \n 0 \n 1 \n 41. Bermudes  BER \n 0 \n 0 \n 1 \n Médaille des Jeux de 1976 \n Sur l’avers, le dessin de Giuseppe Cassioli, conçu pour les Jeux d’Amsterdam en 1928. Les principaux symboles sont la Victoire, la Fraternité et l’Universalité. Le revers a été volontairement conçu dépouillé. Il est composé d’une couronne de laurier stylisée, symbole de la victoire depuis les Jeux de l’Antiquité, et de l’emblème des Jeux de Montréal. \n L’emblème des Jeux de 1976 \n L’emblème est composé des anneaux olympiques surmontés d’un podium olympique, qui est également l’interprétation graphique de la lettre «M», initiale de Montréal. Au centre, la piste d’athlétisme, lieu privilégié des Jeux. Cet emblème évoque à la fois la fraternité universelle que propose l’idéal olympique, la gloire des vainqueurs, l’esprit chevaleresque de leurs luttes et l’accession de Montréal au rang de ville olympique. L’emblème a été conçu par le graphiste Georges Huel qui a également dessiné le flambeau en compagnie de Michel Dallaire. \n La mascotte des Jeux de 1976 \n Baptisé «Amik», un terme tiré de la langue algonquine signifiant «castor», cet animal été choisi comme mascotte parce qu’il est reconnu pour sa patience et son ardeur au travail. Il a de plus occupé une place importante dans le développement du Canada à l’époque où la traite des fourrures était une activité de premier plan en Amérique du Nord. Grand symbole national canadien, on le retrouve sur certaines pièces de monnaie, ainsi que sur certains timbres. La mascotte est ceinturée d’une bande rouge portant l’emblème des Jeux et symbolisant le ruban auquel est attachée la médaille remise aux vainqueurs. \n La musique \n Les thèmes des musiques de scène ont été tirés de l’œuvre du pianiste-compositeur André Mathieu (1929-1968). Le directeur musical et chef d’orchestre était Vic Vogel qui aura Art Philips, spécialiste des arrangements d’orchestre, pour collaborateur. \n Une flamme virtuelle \n Une première : la flamme olympique arrive de Grèce par voie électronique. Elle a été expédiée sous forme d’impulsions codées transmises par câble téléphonique vers un transmetteur en direction d’un satellite du réseau Intelsat. Elle a par la suite été acheminée jusqu’à un récepteur à Ottawa. Là, un rayon laser lui redonne son aspect original. \n Absence des Africains \n En dépit de l’absence des Africains, engagés dans une action de boycottage menée par la Tanzanie et à laquelle 22 pays se sont ralliés, pour protester contre une récente tournée en Afrique du Sud de l’équipe nationale de rugby de Nouvelle-Zélande, les Jeux Olympiques de 1976 ont connu d’excellentes compétitions. \n Domination soviétique \n L’équipe soviétique termine en tête de tous les pays avec 49 médailles d’or, 41 d’argent et 35 de bronze. \n Classement des médailles \n Au classement des médailles, sept pays socialistes se classent parmi les dix premiers, avec l’URSS et la RDA en tête. \n Le Canada termine au 13e rang du classement pour le nombre de médailles par pays, avec une récolte de 11 médailles (5 d’argent et 6 de bronze). \n La performance des nageurs canadiens mérite d’être soulignée. Ils récoltent 8 des 11 médailles du Canada. \n Une médaille pour les Bermudes \n Les Bermudes sont devenues le pays le moins peuplé (53 500 habitants) à obtenir une médaille au Jeux d’été, grâce à Clarence Hill qui remporta la médaille de bronze en boxe dans la catégorie des poids lourds. \n Du gazon artificiel \n Le hockey est pratiqué sur gazon artificiel pour la première fois. \n Plus d’épreuves pour les femmes \n Les femmes voient le nombre d’épreuves augmenter pour elles avec l’apparition d’épreuves féminines en basket-ball, handball et aviron. \n La reine Nadia \n La gymnaste roumaine Nadia Comaneci est la première gymnaste de l’histoire olympique à obtenir un score parfait de 10. Elle réussit son premier 10 parfait aux barres asymétriques, puis les juges lui décernent la note maximale à six reprises. \n Super Viren \n Le Finlandais Lasse Viren repousse les limites des plus grands coureurs de fond en gagnant pour la deuxième fois consécutive le 5 000 m et le 10 000 m. Il participe au marathon, tente de rééditer le triplé d’Emil Zatopek en 1952, mais finit cinquième pour sa première tentative sur cette distance. \n Plongeon à l’italienne \n Avec sa victoire dans le haut-vol, l’Italien Klaus Dibiasi devient le premier plongeur à remporter trois médailles d’or successives et à obtenir des médailles dans quatre éditions des Jeux. \n Les médaillés olympiques canadiens \n Argent \n Cheryl Gibson \n Natation, 400 m quatre nages, épreuve individuelle chez les femmes \n Greg Joy \n Athlétisme, saut en hauteur chez les hommes \n Michel Vaillancourt \n Sports équestres, Grand Prix de saut d’obstacles, épreuve individuelle \n John Wood \n Canoë, C-1, 500 m chez les hommes \n Stephen Pickell \nGraham Smith \nClay Evans \nGary MacDonald \n Natation, relais 4 x 100 m quatre nages, épreuve chez les hommes \n Bronze \n Nancy Garapick \n Natation, 100 m dos, épreuve individuelle chez les femmes \n Nancy Garapick \n Natation, 200 m dos, épreuve individuelle chez les femmes \n Becky Smith \n Natation, 400 m quatre nages, épreuve individuelle chez les femmes \n Shannon Smith \n Natation, 400 m nage libre, épreuve individuelle chez les femmes \n Gail Amundrud \nBarbara Clark \nBecky Smith \nAnne Jardin \n Natation, relais 4 x 100 m nage libre, épreuve chez les femmes \n Wendy Hogg \nRobin Corsiglia \nSusan Sloan \nAnne Jardin \n Natation, relais 4 x 100 m quatre nages, épreuve chez les femmes \n Cérémonie d’ouverture – Faits saillants \n 76 433 spectateurs réunis au Stade. \n Près de 8 200 personnes participent au défilé. \n Près d’un demi-milliard de téléspectateurs suivent la cérémonie. \n Sa Majesté, la reine Elizabeth II d’Angleterre, proclame l’ouverture officielle des Jeux. \n La présence du maire Jean Drapeau est saluée par une ovation. \n 80 jeunes filles lâchent des pigeons porteurs d’un message d’amitié aux peuples de la terre. Ce geste rappelle le cortège des vierges qui accompagnaient les athlètes dans la tradition antique. Le nombre fait référence au 80e anniversaire des premiers Jeux de l’ère moderne. \n Deux jeunes athlètes francophone et anglophone (symbolisant les deux peuples fondateurs), Sandra Henderson de Toronto, et Stéphane Préfontaine de Montréal, portent la flamme et allument la vasque au centre du Stade. \n Pierre St-Jean (haltérophile québécois) prononce le serment olympique au nom de tous les athlètes. \n Le juge Maurice Forget (athlétisme) fait le serment des juges et officiels. \n Cérémonie de clôture – Faits saillants \n 76 433 spectateurs réunis au Stade. \n La cérémonie de clôture donne lieu à un spectacle haut en couleurs. \n 500 jeunes filles vêtues de capes blanches exécutent une chorégraphie formant les couleurs et les anneaux du drapeau olympique. \n Afin de souligner l'union fraternelle du sport olympique, les athlètes entrent sans distinction de nationalité. Plus de 500 Amérindiens, arborant leur costume d'apparat, escortent les athlètes et pénètrent dans les cinq anneaux formés par les jeunes filles, pour y ériger des tentes aux couleurs des anneaux olympiques. \n La fin des Jeux étant proclamée, le drapeau olympique est abaissé sous le chant d'adieu. Huit athlètes le transportent hors du Stade. \n La flamme olympique s'éteint. Place aux prochains Jeux. Sur des écrans géants, en direct de Moscou, des danseurs et des chanteurs exécutent un court spectacle, puis présentent une immense bougie à l'écran. \n Dans le Stade, la foule brandit des bougies et des bâtonnets lumineux en guise de témoignage d'amitié. La XXIe édition des Jeux olympiques d'été prend ainsi fin. \n Pour plus de détails, visitez le site du  Comité international olympique (CIO) . \n   Notre organisme \n Formulaire de demande de gratuité ou de commandite \n Message de la présidente \n Mission et vision \n Structure administrative \n Plans d’action \n Diffusion de l'information \n Travailler au Parc olympique \n Offres d'emploi \n Rapports annuels \n Données et statistiques \n Fiches d'information \n Politique de droits d’auteur \n Politique de confidentialité \n Politique concernant les commandites et les dons \n Bulletin Info-Travaux \n Règlement sur les normes de sécurité et de comportement au Parc olympique \n Montréal, ville olympique \n La construction \n Jeux olympiques de 1976 \n Médailles et autres données \n Comité-conseil sur l’avenir du Parc olympique \n Partenaires \n Le Stade \n La Tour de Montréal \n L'Esplanade \n Le Centre sportif \n Autres attraits \n Comment se rendre \n À propos \n Partenaires \n Bon voisinage \n Salle de presse \n Offres d'emploi \n Règlement   \n Contactez-nous \n\t\t\t\t\t4141, avenue Pierre-De Coubertin \r\n\t\t\t\t\tMontréal, Québec \r\n\t\t\t\t\tH1V 3N7\r\n\t\t\t\t\tTéléphone : 514 252-4141 ou 1 877 997-0919 \r\n\t\t\t\t\tTélécopieur : 514 252-0372 \r\n\t\t\t\t\tCourriel :  rio@rio.gouv.qc.ca"}