{"url": "https://csu.qc.ca/fr/hojo/rent-receipts", "content": "Rent Receipts | Concordia Student Union | csu.qc.ca \n English \n Français \n Menu \n À Propos Notre Mission Conseil des Représentants Le Comité Exécutif Conseil Juridique Conseil d’administration Financement et Frais Le Sénat Répertoire Emplois@CSU Services Advocacy Centre Clinique d’information juridique Centre du logement et de l’emploi hors campus (HOJO) Régime de soins de santé et dentaire Diner gratuit au Café Hive Réservations Info-courriel CSU Live Projets Rénovations du Bar Reggie's Service de Garderie Café Solidaire Co-op Hive Coopérative d’Habitation Étudiante Le Congrès des étudiants de Concordia Campaigns Campagnes Déclaration de soutien aux accusé-e-s du tribunal Souveraineté autochtone Mouvement étudiant Justice climatique Désinvestissement Anti-consommation Campagnes précédentes Vie étudiante Associations d'étudiants Groupes Financés par les Cotisations Les bourses du CSU Projets spéciaux d'investissemnt  D’autres sources de financement Développement durable Financement pour des projets spéciaux pour le système alimentaire Ressources vouées à la durabilité sur nos campus Une réforme du système alimentaire Clubs Clubs actifs Comment gérer votre club Créer un nouveau club Infomation Contact - Clubs Approbation - Clubs Budget- Club Enregister vos Clubs Financement spécial de Club Ressources   \n Accueil   \n Rent Receipts \n  Aug 17, 2015   kmcloughlin   \n Language  \n Undefined\n Did you know that it is your right under the Civil Code of Quebec to recieve a reciept for each payment of rent you make to your landlord? \n The HOJO always recommends you exercise this right to ensure you have proof of payment for your rent. Even if you pay by bank card or transfer still ask your landlord for a reciept. If they do not have a way of offering you one then you can use this generator to create your own.  \n http://www.rentreceipt.net/ \n Remember if you don't have proof you paid it's like you never did. Landlords can and do take advantage of tenants this way. Know your rights so that you can better protect yourself.  \n   \n HOJO Articles \n   涨房租：   \n   不要带着床虫搬家哦！？   \n   搬家季快到了，你准备好了么？   \n   致旅游者：千万不要带着床虫回家哦！   \n   魁省租房之租约解密！   \n   HOJO Intern Reports   \n   Beware of e-mail scams   \n   Announcing a new and improved classifieds.csu.qc.ca website!   \n   Finding Internet Service Providers in Montreal   \n   Rent Receipts   \n   Banking in Montreal   \n   Where to get a Cell Phone in Montreal   \n   Basic Facts About Renting in Quebec (English and Mandarin PDF)   \n   Financial Assistance for your Studies at Concordia   \n   Learning and Improving French in Montreal   \n   \n 1 of 3 \n next › \n ​   \n Quick Links \n Login \n Resources \n Jobs \n Contact Information \n Downtown: 1455 de Maisonneuve Blvd West, H-711 Montréal, QC H3G 1M8 \n Loyola: 7141 Sherbrooke Street West, CC-426 Montréal, QC H4B 1R6 \n Phone - 514 848-7474 | Fax: 514 848-7450 \n Email -  contactus@csu.qc.ca \n Concordia Student Union | Copyright 2016 | All Rights Reserved"}