{"url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-dis-audio.html", "content": "Understanding Success Criterion 1.4.2  | Understanding WCAG 2.0\n    \t\t\t\t Understanding WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  SC  1.4.1 [Use of Color] Next:  SC  1.4.3 [Contrast (Minimum)] On this page: Intent Examples Related Resources Techniques & Failures Key terms   -   Audio Control : Understanding  SC  1.4.2 \n 1.4.2  Audio Control:  \n                If any audio on a Web page plays automatically for more than 3 seconds, either a  mechanism  is available to pause or stop the audio, or a mechanism is available to control audio volume independently from the overall system volume level. \n\t\t\t\t\t(Level A)\n\t\t\t\t Note:  Since any content that does not meet this success criterion can interfere with a user's ability to use the whole page, all content on the Web page (whether or not it is used to meet other success criteria) must meet this success criterion. See  Conformance Requirement 5: Non-Interference . \n\t\t\t\tIntent of this Success Criterion\n\t\t\t Individuals who use screen reading software can find it hard to hear the speech output if there is other audio playing at the same time. This difficulty is exacerbated when the screen reader's speech output is software based (as most are today) and is controlled via the same volume control as the sound. Therefore, it is important that the user be able to turn off the background sound. Note: Having control of the volume includes being able to reduce its volume to zero. Note:  Playing audio automatically when landing on a page may affect a screen reader user's ability to find the mechanism to stop it because they navigate by listening and automatically started sounds might interfere with that navigation. Therefore, we discourage the practice of automatically starting sounds (especially if they last more than 3 seconds), and encourage that the sound be  started  by an action initiated by the user after they reach the page, rather than requiring that the sound be  stopped  by an action of the user after they land on the page. See also  \n    Understanding Success Criterion 1.4.7 Low or No Background Audio . \n\t\t\t\tSpecific Benefits of Success Criterion 1.4.2:\n\t\t\t Individuals who use screen reading technologies can hear the screen reader without other sounds playing. This is especially important for those who are hard of hearing and for those whose screen readers use the system volume (so they cannot turn sound down and screen reader up). This Success Criterion also benefits people who have difficulty focusing on visual content (including text) when audio is playing. \n\t\t\t\tExamples of Success Criterion 1.4.2 An audio file begins playing automatically when a page is opened. However, the audio can be stopped by the user by selecting a \"silent\" link at the top of the page. \n                A Flash splash page with sound that plays and then stops in less than 3 seconds.\n                A Flash splash page with sound that plays automatically includes a control at the top that allows users to turn the sound off. \n\t\t\t\tRelated Resources\n\t\t\t Resources are for information purposes only, no endorsement implied. (none currently documented) \n\t\t\t\tTechniques and Failures for Success Criterion 1.4.2 - Audio Control Each numbered item in this section represents a technique or combination of techniques that the  WCAG  Working Group deems sufficient for meeting this Success Criterion. However, it is not necessary to use these particular techniques. For information on using other techniques, see  Understanding Techniques for WCAG Success Criteria , particularly the \"Other Techniques\" section. \n\t\t\t\tSufficient Techniques  \n G60: Playing a sound that turns off automatically within three seconds \n G170: Providing a control near the beginning of the Web page that turns off sounds that play automatically \n G171: Playing sounds only on user request \n SL24: Using AutoPlay to Keep Silverlight Media from Playing Automatically  (Silverlight)\n FLASH18: Providing a control to turn off sounds that play automatically in Flash  (Flash)\n FLASH34: Turning off sounds that play automatically when an assistive technology is detected  (Flash)\n SL3: Controlling Silverlight MediaElement Audio Volume  (Silverlight)\n\t\t\t\t Additional Techniques (Advisory) for 1.4.2 Although not required for conformance, the following additional techniques should be considered in order to make content more accessible. Not all techniques can be used or would be effective in all situations. \n        Providing a site-wide preference to turn off audio in addition to providing a control near the top of the Web page that turns off sounds that play automatically (future link)\n\t\t\t\t Common Failures for  SC  1.4.2 The following are common mistakes that are considered failures of Success Criterion 1.4.2 by the  WCAG  Working Group. \n F23: Failure of  1.4.2 due to playing a sound longer than 3 seconds where\n                    there is no mechanism to turn it off \n F93: Failure of Success Criterion 1.4.2 for absence of a way to pause or stop an HTML5 media element that autoplays \n Key Terms   mechanism \n process  or technique for achieving a result Note 1:\n\t\t\t\t\t The mechanism may be explicitly provided in the content, or may be  relied upon  to be provided by either the platform or by  user agents , including  assistive technologies . Note 2:\n\t\t\t\t\t The mechanism needs to meet all success criteria for the conformance level claimed. \n               Top Contents Intro Previous:  SC  1.4.1 [Use of Color] Next:  SC  1.4.3 [Contrast (Minimum)] This Web page is part of  Understanding WCAG 2.0: A guide to understanding and implementing WCAG 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}