{"url": "http://www.boxofficemojo.com/reviews/?id=52&p=.htm", "content": "Movie Review: Freddy Vs. Jason \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n > REVIEWS \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n FREDDY VS. JASON \n U.S. Release Date: \n August 15, 2003 \n Distributor:  New Line \n Director:   Ronny Yu Composer:   Graeme Revell Running Time:  1 hour and 38 minutes MPAA Rating:  R (pervasive strong horror violence/gore, gruesome images, sexuality, drug use and language) \n The Horror, the Horror... \nby  C.A. Wolski   \nFace it, a movie featuring killers Freddy Krueger and Jason Voorhees is not attempting to be high cinematic art. The characters' individual outings have ranged from not bad (the original  Friday the 13th  and  Nightmare on Elm Street  are both legitimate splatter horror classics) to high camp (last year's  Jason X ). But the stunningly incompetent  Freddy vs. Jason  is so bad that it is nearly unwatchable.  \n What we have in director Ronny Yu's franchise showdown is the grotesque wrapped in a kitsch package. There is not an ounce of anything approaching originality or brainpower in the concrete block of a script by writers Damian Shannon and Mark Swift. The only brain matter on tap is splattered all over the screen at regular intervals.  \n The story, what there is of it, concerns the efforts of the evil spirit of Freddy Krueger (Robert Englund) to regain his power to enter the dreams of the teenagers of Elm Street. The town has successfully exorcised Freddy by making the children forget about him, costing him his demonic hold. To rectify this problem, Freddy resurrects hockey-masked killer Jason (Ken Kirzinger) to raise the fear level and give the dream killer the power he needs to do his ungodly acts.  \n Jason carries out his mission with silent efficiency, killing a lunk-headed jock while his drunken girlfriend showers unaware of the mayhem in the next room (as in the original movies, Jason targets teenagers who are sexually active and/or those who use alcohol or other drugs), and later more people at an out door bacchanalia. In the meantime, hero Will (Jason Ritter) breaks out of a local insane asylum to save long-ago girlfriend Lori (Monica Keena)—though they serve more as meat for the grinder than as characters we want to root for.  \n While the idiot savant heroes try to figure out how to save themselves, Jason and Freddy have a falling out and begin beating the undead snot out of each other in an absolutely stupid dream sequence that borders on the comedic.  \n The final showdown at Jason's old killing ground, Crystal Lake, is just as idiotic. Teenagers die, Freddy and Jason have duke it out, and the end has a \"twist\" that voids the entire movie.  \n That there is no one to root for in this dingy, ugly picture is bad enough, but the casual way in which innocent people are killed and all manner of sadism depicted (which includes the rape of an unconscious teenager and implied violence against children) pushes  Freddy vs. Jason  beyond the pale. The movie plays all of this as if it is a big joke with Freddy offering clever one-liners and the indestructible Jason immune to flame, bullets and sharp objects. But this is just plain nastiness that should be avoided at all costs.  \n MORE REVIEWS: Uptown Girls Breakfast at J.C. Penney's Igby Goes Down Richie Glitch So Close Charlie's Angels Hong Kong Style Once Upon a Time in Mexico A Fistful of Pesos Matchstick Men A Caper with Character Lost in Translation Sleepless in Tokyo \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n ADVERTISEMENT \n  \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}