{"url": "https://en.wikipedia.org/wiki/Cruciatus_Curse", "content": "Magic in Harry Potter - Wikipedia \n Magic in  Harry Potter   \n From Wikipedia, the free encyclopedia     (Redirected from  Cruciatus Curse ) \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article has multiple issues.  Please help  improve it  or discuss these issues on the  talk page .  ( Learn how and when to remove these template messages ) \n This article  may contain an excessive amount of  intricate detail  that may only interest a specific audience .  Please help by  spinning off  or  relocating  any relevant information, and removing excessive detail that may be against  Wikipedia's inclusion policy .   (July 2016)   ( Learn how and when to remove this template message ) \n This article  describes a work or element of fiction in a primarily  in-universe  style .  Please  help rewrite it  to  explain the fiction more clearly and provide non-fictional perspective .   (July 2016)   ( Learn how and when to remove this template message ) \n ( Learn how and when to remove this template message ) \n In the  Harry Potter  series created by  J. K. Rowling ,  magic  is depicted as a supernatural force that can be used to override the usual  laws of nature . Many fictional  magical creatures  exist in the series, while ordinary creatures sometimes exhibit new magical properties in the novel's world.  Objects , too, can be enhanced or imbued with magical property. The small percentage of humans who are able to perform magic are referred to as witches and wizards, in contrast to the non-magical  muggles . \n In humans, magic or the lack thereof is an inborn attribute. It is inherited, carried on \"dominant resilient genes\". [1]  Magic is the norm for the children of magical couples and less common in those of muggles. Exceptions exist: those unable to do magic who are born to magical parents are known as  squibs , whereas a witch or wizard born to muggle parents is known as a  muggle-born , or by the  derogatory term  \"mudblood\". While muggle-borns are quite common, squibs are extremely rare. \n Contents \n 1   Using magic \n 1.1   Spellcasting \n 2   The limits of magic \n 2.1   Death \n 2.2   Principal Exceptions to Gamp's Law of Elemental Transfiguration \n 2.3   Emotion \n 3   Magical abilities \n 3.1   Animagi transformation \n 3.2   Metamorphmagi \n 3.3   Parseltongue \n 3.4   Seers \n 3.5   Legilimency and Occlumency \n 3.6   Apparition and Disapparition \n 3.7   Other teleportation \n 3.8   Veela charm \n 3.9   Magical resistance \n 4   Subjects at Hogwarts \n 4.1   Transfiguration \n 4.2   Defence Against the Dark Arts \n 4.3   Charms \n 4.4   Potions \n 4.5   Astronomy \n 4.6   History of Magic \n 4.7   Herbology \n 4.8   Arithmancy \n 4.9   Study of Ancient Runes \n 4.10   Divination \n 4.11   Care of Magical Creatures \n 4.12   Muggle Studies \n 4.13   Alchemy \n 4.14   Flying \n 4.15   Apparition \n 5   Spell-like effects \n 5.1   Unbreakable Vow \n 5.2   Priori Incantatem \n 6   Dark Arts \n 6.1   Unforgivable Curses \n 6.2   Dark Mark \n 6.3   Inferius \n 6.4   Horcrux \n 7   Portraits \n 7.1   Portraits in the Headmaster's office \n 7.2   The Fat Lady \n 7.3   Photographs \n 8   References \n 9   Further reading \n 10   External links \n Using magic [ edit ] \n Witches and wizards need training to learn how to control their magic. With young and untrained children, magic will manifest itself subconsciously in moments of strong apprehension, fear, anger and sadness. [2]  For example,  Harry Potter  once made his hair grow back after a bad haircut, set a boa constrictor on his cousin  Dudley  at the London Zoo, and made  Aunt Marge  inflate to an enormous size. While this reaction is usually uncontrollable, as an untrained child,  Lord Voldemort  was able to make things move without touching them, make animals do what he wanted without training them, make \"bad things happen to people\" who annoyed him, or make them hurt if he wanted to. [3]  In addition,  Lily Potter  was able to guide and control the blooming of a flower by wanting to. \n Almost all magic is done with the use of a  wand . On the subject of wandless magic, Rowling says: [4] \n “ \n You can do unfocused and uncontrolled magic without a wand (for instance when Harry blows up Aunt Marge) but to do really good spells, yes, you need a wand. \n ” \n A wizard or witch is only at their best when using their own wand. When using another's wand, one's spells are not as strong as they normally would be. [HP1] \n Within the books, technical details of magic are obscure. Of Harry's lessons, only those involving  magical creatures ,  potions  or divination are given in any detail. \n Severus Snape  once told  Harry Potter  that \"Time and space matter in magic\" during Harry's first Occlumency lesson in  Harry Potter and the Order of the Phoenix  and  Albus Dumbledore  told Harry after finding the magically concealed boat to reach the locket  Horcrux  that \"Magic always leaves traces, sometimes very distinctive traces.\" [HP6] \n Spellcasting [ edit ] \n Spells  are the every-purpose tools of a wizard or witch; short bursts of magic used to accomplish single specialised tasks such as opening locks or creating fire. Typically casting requires an  incantation , most often in a modified form of  Latin  (see  Dog Latin ), and gesturing with a  wand . However, Rowling has revealed that particularly talented wizards can cast spells without the aid of wand, although magic produced with one is generally more precise and powerful. [5]  Spells can also be cast non-verbally, but with a magical wand. This special technique is taught in the sixth year of study at Hogwarts and requires the caster to concentrate on the incantation. Some spells (e.g.  Levicorpus ) are apparently designed to be used non-verbally. While most magic shown in the books requires the caster to use their voice, some do not (and this may depend on the witch or wizard). Dumbledore has been known to do impressive feats of magic without speaking, such as  conjuring  enough squashy purple sleeping bags to accommodate the entire student population [HP3]  or during his duel with Voldemort towards the end of  Order of the Phoenix . \n It is possible to use a wand without holding it. In  Order of the Phoenix , Harry himself performs  Lumos  to light his wand when it is lying on the ground somewhere near him. [HP5]  Additionally,  Animagi  and  Metamorphmagi  do not need wands to undergo their transformations. \n Spells are divided into rough categories, such as \" charms \", \" curses \", \"hexes\", or \" jinxes \". Although offensive and potentially dangerous curses exist in number, three are considered usable only for great evil, which earns them the special classification of \" Unforgivable Curses \". \n The limits of magic [ edit ] \n Before publishing the first  Harry Potter  novel, Rowling spent five years establishing the limitations of magic—determining what it could and could not do. \"The most important thing to decide when you're creating a fantasy world,\" she said in 2000, \"is what the characters CAN'T do.\" For instance, while it is possible to conjure things out of thin air, it is far more tricky to create something that fits an exact specification rather than a general one; moreover, any objects so conjured tend not to last. [6] \n Death [ edit ] \n Rowling has described death as the most important theme in the books. [7]  Consequently, as Dumbledore states in  Harry Potter and the Goblet of Fire , there is no spell that can truly bring the dead back to life. While corpses can be transformed into obedient  Inferi  on a living wizard's command, they are little more than  zombies  with no soul or will of their own. However, there are some methods of communicating with the dead, though with limited results. For example, all Hogwarts headmasters appear in a  portrait  when they die, allowing consultation by future generations. It is also possible through the rare  Priori Incantatem  effect to converse with ghost-like \"shadows\" of magically murdered people. The  Resurrection Stone  also allows one to talk to the dead, but those brought back by the Stone are not corporeal, nor do they wish to be disturbed from their peaceful rest. Throughout the series, this limit is continually mentioned, and wizards try to transcend it at their own folly. \n Likewise, it is not possible to make oneself immortal unless one makes use of an object of great power to sustain life, such as the  Philosopher's Stone  or  horcruxes . If one were to possess the three  Deathly Hallows , it is fabled that they would possess the tools to become the \"master of death\". However, it is hinted that to be a true \"master of death\" is to be willing to accept that death is inevitable. Other methods of extending life include drinking unicorn blood, which will keep a person alive even if death is imminent, but at the terrible price of being cursed forever. Being magical can contribute to one's  longevity , as there are several characters in the series who are unusually long-lived (such as  Griselda Marchbanks , who was an invigilator during Albus Dumbledore's O.W.L examinations). It is revealed by  Nearly Headless Nick  in the fifth book that all witches and wizards have the choice of becoming  ghosts  upon dying; however, it is described as \"a pale imitation of life\". Snape states that a ghost is merely \"the imprint of a departed soul left upon the earth\". \n Death is studied at the  Department of Mysteries  in a chamber containing an enigmatic veil, which Rowling has described as \"the divide between life and death\". With regard to what is on the other side, she elaborated: \"Do I believe you go on? Yes, I do believe you go on. I do believe in an afterlife, although I'm absolutely doubt-ridden and always have been but there you are.\" [8]  Sirius falls through this veil in  Order of the Phoenix  after he is hit with a curse from Bellatrix. \n Principal Exceptions to Gamp's Law of Elemental Transfiguration [ edit ] \n The  Principal Exceptions to Gamp's Law of Elemental Transfiguration  is a magical theory mentioned by Hermione and later repeated by Ron in the final book. She explains that food is one of these: witches or wizards can cook and prepare food using magic, and even multiply it, but not create it out of nothing. There are numerous examples in the series of food  appearing  to have been conjured from nothing, such as the sudden materialisation of ingredients in the pots of Molly Weasley's kitchen and when Professor McGonagall creates a self-refilling plate of sandwiches for Harry and Ron in  Chamber of Secrets . In all cases, these events can be reasonably explained as food either being multiplied or transported from elsewhere. One example of the latter is banqueting at Hogwarts—the food is prepared by elves in the kitchens and laid onto four replica tables, directly below the actual house tables in the Great Hall. The food is then magically transported to the tables. \n This is the only exception mentioned explicitly in the series. However, Rowling herself has stated once in an interview that  money  is something wizards cannot simply materialise out of thin air, [6]  or the economic system of the wizarding world would then be gravely flawed and disrupted. While the  Philosopher's Stone  does permit  alchemy , this is portrayed as an extremely rare, even unique, object, whose owner does not exploit its powers. \n Emotion [ edit ] \n As explained earlier, young untrained wizards can trigger uncontrolled magic when they are in the state of heightened emotions. But emotions also affect trained witches and wizards and their magical abilities. For instance, in  Half-Blood Prince , a heartbroken  Nymphadora Tonks  temporarily loses her power as a  Metamorphmagus  when  Remus Lupin  starts distancing himself from her. The form of her  Patronus  changes to reflect her depression. Another example is  Merope Gaunt , who only demonstrated any magical ability when removed from her father's oppression, but then lost it again when her husband abandoned her. \n Several magical spells require the use of certain emotions when casting them. The Patronus charm, for example, requires the caster to concentrate on a happy memory. (Force of will, under extenuating circumstances, helps a lot. An example of this is when Harry is able to conjure a corporeal Patronus when Sirius is in danger of being administered the Dementor's Kiss.) [HP3]  Another example is the  Cruciatus Curse , which causes immense pain; as Harry discovers during a duel with  Bellatrix Lestrange , effective use of this forbidden dark magic requires sadistic desires. [HP5] \n Love (in its broadest meaning) is depicted as a particularly powerful form of magic. According to Dumbledore, love is a \"force that is at once more wonderful and more terrible than death, than human intelligence, than forces of nature.\" [HP5]  Lily's voluntary sacrifice on Harry's behalf saves him from Voldemort as a baby, and Harry makes a similar sacrifice to save his friends at the end of  Deathly Hallows . [HP7]  A certain key prophecy in the series describes Harry as having \"power the Dark Lord knows not\", referencing his capacity for love. [HP5] \n True love is impossible to create magically;  Amortentia , a love potion, can only create a powerful sense of infatuation and obsession. \n Magical abilities [ edit ] \n The following is a list of special abilities that a wizard or witch in the Harry Potter universe may have. \n Animagi transformation [ edit ] \n An Animagus ( portmanteau  of animal and  magus ) is a witch or wizard who can turn into a particular animal or magical creature at will. This ability is not innate: it must be acquired by magical means. All Animagi must register at a central authority by law, though a number of characters are revealed over the course of the series to have remained unregistered illegally:  James Potter ,  Sirius Black ,  Peter Pettigrew  and  Rita Skeeter . \n Animagi transformation can be performed wandlessly. Sirius and Peter are left wandless for over 10 years, but both retain the ability with no apparent ill effects. When Animagi transform, they take on the appearance of a normal animal. However, in  Harry Potter and the Prisoner of Azkaban , it is noted that Ron's pet rat Scabbers (later revealed as Peter Pettigrew's Animagus form) has lived over twelve years when only expected to live three. Also, an Animagus in animal form retains the ability to think like a human, which is the principal difference between being an animagus and being transfigured into an animal. Otherwise, they would forget that they were a wizard and be trapped, unknowingly, in this form unless transformed back by another wizard. Characteristics of an Animagus' human form can manifest themselves in the animal transformation; for example, the markings around McGonagall's eyes as a cat resemble her glasses. When an Animagus registers, they must record all the defining physical traits of their animal form so that the Ministry can identify them. \n Each Animagus has a specific animal form, and cannot transform into any other animal. The animal cannot be chosen: it is uniquely suited to that individual's personality, and in most cases the Animagus will change into the same animal used in the person's  Patronus Charm . [9] \n Explicit emphasis is placed in the books on the differences between Animagi and  werewolves . Animagi have full control over their transformations and retain their minds, whereas werewolves' transformations are involuntary and include severe changes in personality. After the person has transformed into a werewolf, he no longer remembers who he is; he would kill his best friend if he got anywhere near him. A werewolf only responds to the call of his own kind. The only way that a werewolf can retain his sanity, intelligence and memory while transformed is using the Wolfsbane Potion. \n Metamorphmagi [ edit ] \n A  Metamorphmagus  (a  portmanteau  of  metamorph  and  magus ) is a witch or wizard born with the innate ability to change some or all of their appearance at will. The talent cannot be acquired; a witch or wizard who has it must be born with it. \n Nymphadora Tonks  and her son,  Teddy Lupin  are currently the only known Metamorphmagi in the series; it is a very rare ability, possibly hereditary. Tonks is known to change her hair colour and style according to her mood. She even appears as an old woman on occasion. She can also change her nose appearance, as she does when eating with the Weasley family to entertain Ginny and Hermione. Her son, Teddy Lupin, also inherited this trait, as his hair is mentioned repeatedly changing colour. \n The extent of these appearance-altering abilities and the limits thereof are not entirely clear. According to Rowling, a Metamorphmagus can alter his or her appearance completely, for instance, from black to white, young to old, handsome to plain and so on. [10]  In one example, Tonks changes her facial appearance by reshaping her nose into \"a beaklike protuberance like Snape's\", to \"something resembling a button mushroom\", and \"one like a pig snout\" which reminded Harry of his cousin Dudley. [11]  The emotional state of a Metamorphmagus can affect their abilities. \n Parseltongue [ edit ] \n Parseltongue  is the language of snakes. It is often associated with Dark Magic, although Dumbledore stated that it is not necessarily an evil quality. Those possessing the ability to speak it (\" Parselmouths \") occur very rarely. People apparently acquire the skill through learning or via a method of  xenoglossia , such as through genetic inheritance (or by use of Dark or dangerous Magic). Harry was a Parselmouth until the age of 18.  Harry Potter and the Chamber of Secrets  explains this was because of Voldemort's passing on some of his abilities to Harry the night he tried to kill him.  Deathly Hallows  reveals that a part of Voldemort's soul within Harry grants him this ability, which is later destroyed leaving Harry stripped of the ability. [12] \n Other known Parselmouths include  Salazar Slytherin  and his descendants, including the  Gaunts  and Voldemort. Dumbledore can also understand Parseltongue; however, he learned it and did not naturally possess the ability. [13]  In  Half-Blood Prince  he repeats Morfin Gaunt's words \"the big house over the way\", which were spoken in Parseltongue. \n Ron uses Parseltongue in the final book to reopen the  Chamber of Secrets , but he is only imitating the sound of a phrase Harry used earlier in the book. \n Rowling borrowed the term from \"an old word for someone who has a problem with the mouth, like a  hare lip \". [14] \n Professor  Francis Nolan , Professor of Phonetics at University of Cambridge, designed the version of Parseltongue used in the films as an  ergative-absolutive  language featuring  geminate  consonants and  VSO word order . It has a high frequency of  fricative  and  pharyngeal consonants  to acoustically approximate the physiology of a snake. [ citation needed ] \n Seers [ edit ] \n A  Seer  is a witch or wizard with the  clairvoyant  ability to predict future events. The predictions given through this ability can sometimes be  self-fulfilling prophecies , and Dumbledore states in  Order of the Phoenix  that not all of them come true, depending on the choices made by those mentioned. This would seem to indicate that a Seer predicts possible or likely events, at least in some cases. \n In the  Hall of Prophecy  at the  Department of Mysteries , thousands upon thousands of glass spheres are imbued with records of prophecies made by Seers. Only a person mentioned in a prophecy can safely retrieve it; anyone else who tries to do so will be driven insane. \n According to McGonagall, true Seers are extremely rare.  Sybill Trelawney  is the only Seer portrayed in the books, although it is mentioned that Sybill's great-great-grandmother, Cassandra Trelawney, was a renowned Seer in her day. Trelawney is considered an \"old fraud\" by her students, and is sacked by  Dolores Umbridge  in the fifth book for it. However, she has twice made true prophecies. Sybill Trelawney is noted to never remember that she has made a prophecy when it is a true one. She speaks in a hoarse voice, and only if a wizard is present will anyone know about it. \n Legilimency and Occlumency [ edit ] \n Legilimency  is the magical skill of extracting feelings and memories from another person's mind—a form of magical \" telepathy \" (although Snape, an able practitioner of the art, dismisses the colloquial term \"mind-reading\", as a drastic oversimplification). It also allows one to convey visions or memories to another person, whether real or imaginary. A witch or wizard possessing this skill is called a  Legilimens,  and can, for example, detect lies and deceit in another person, witness memories in another person's past, or \"plant\" false visions in another's mind. \n The counter-skill to Legilimency is  Occlumency  (and its user, known as an  Occlumens ), by which one can compartmentalize one's emotions, or prevent a Legilimens from discovering thoughts or memories which contradict one's spoken words or actions. An advanced form of Occlumency is planting false temporary memories inside an Occlumens' own head while blocking all other true memories, so if a Legilimens, even a highly skilled one, were to attempt to read the mind, he or she would find false memories only and believe everything was right. \n The skills are first elaborated in  Order of the Phoenix . Legilimency and Occlumency are not part of the normal curriculum at Hogwarts, and most students would graduate without learning them. \n Voldemort,  Snape , and Dumbledore are all known to be skilled in Legilimency and Occlumency. Voldemort is said to be the master of Legilimency by Snape, as he, in almost all cases, immediately knows if someone lied to him. In addition, in  Deathly Hallows , Voldemort repeatedly uses Legilimency to interrogate his victims. Voldemort practices Occlumency throughout the period of  Half-Blood Prince  to deny Harry access to his thoughts and emotions. However, in  Deathly Hallows , Voldemort repeatedly loses grip, resulting in occasional but very powerful burst of thoughts, visions and emotions to be sent to Harry. \n Throughout the books, Snape is repeatedly said to be highly skilled in Occlumency. [15]  This is how Snape was able to lie to Voldemort for years. Even before  Order of Phoenix , Harry repeatedly gets the impression that Snape can read minds. \n Bellatrix Lestrange and Draco also have skill in Occlumency, since Bellatrix was clearly said to have taught Draco to shield his thoughts from Snape. [HP6] \n During the  Order of Phoenix  Snape is instructed by Dumbledore to give Harry lessons in Occlumency. Whether as a result of Snape's poor instruction, or poor aptitude on Harry's part, Harry did not make any progress. (Only once did Harry manage to overcome Snape with the use of Occlumency.) [16]  In  Deathly Hallows , Harry finally masters Occlumency—shutting his mind to Voldemort—when Dobby dies. He realises that his grief—or as Dumbledore calls it, love—is what can block out the Dark Lord. \n Queenie Goldstein, in  Fantastic Beasts and Where to Find Them , is shown to be a proficient Legilimens, as she was easily able to read the minds of Jacob Kowalski and others in the film, as well as sense and hear them through their thoughts. However, she says she has problems with Brits like Newt Scamander, because of the accent. \n Apparition and Disapparition [ edit ] \n Apparition  is a magical form of  teleportation , through which a witch or wizard can disappear (\" Disapparate \") from one location and reappear (\" Apparate \") in another. It is sometimes accompanied by a distinctive cracking or popping sound, though the most skilled wizards can Apparate \"so suddenly and silently\" that they seem to have \"popped out of the ground\" (Dumbledore). The act is also accompanied by a very unpleasant squeezing sensation, as though being sent through a tight rubber tube, according to Harry. [HP6] \n The Ministry of Magic licenses Apparition. A witch or wizard must be 17 years old or older and have a licence to Apparate as a means of transportation in much the same way real-world governments require individuals to have a  licence to drive a motor vehicle . Students at Hogwarts may attend Ministry-administered Apparition lessons during their sixth year, and take their examination once they turn seventeen. It is shown that although it is possible to Apparate without a licence, it is not usually done (unless in lessons) and is illegal. In  Deathly Hallows , Harry does not possess a licence, but since his Trace has been lifted, the Ministry is likely unaware that he does it. \n Learning to Apparate is difficult, and students run the risk of  splinching —being physically split between the origin and destination—which requires the assistance of the Ministry's  Accidental Magic Reversal Squad  to undo properly, although essence of  dittany  can also mend certain wounds. Splinching is quite common during lessons, and can be uncomfortable (and at times rather gruesome) depending on the body parts splinched, but is ultimately harmless if properly reversed. It is implied that though Ron can Apparate, he isn't terribly skilled at it, seeing as he splinches himself at least three times (once losing half an eyebrow, two fingernails and part of his arm.); Harry and Hermione both pick up the skill quickly in comparison. As explained in the  Half-Blood Prince , there is no word spell to Apparate or Disapparate, but the caster has to concentrate on the location on which he has to apparate, needs to be fully focused on the spell, and also has to \"feel\" it through the whole body. \n It has been indicated that it is considered rude to Apparate directly into a private area, such as a home. Dumbledore states in  Half-Blood Prince  that it would be \"quite as rude as kicking down the front door\". For this reason, and for reasons of security, many homes have Anti-Apparition spells protecting them from uninvited intrusions. The accepted way to travel to a home is to Apparate to a nearby location and continue to the final destination on foot. Apparition is considered unreliable over long distances, and even experienced users of the technique sometimes prefer other means of transport, such as  broomsticks . Rowling has stated that Apparating over long distances depends on the skill of the wizard, and \"Cross-continental Apparition would almost certainly result in severe injury or death.\" [17]  Indeed, even the prodigiously skilled  Lord Voldemort  elects to fly back to England after visiting the far-flung  Nurmengard . \n For reasons of security, the grounds and buildings of Hogwarts are protected by ancient Anti-Apparition and Anti-Disapparition spells, which prevent humans from Apparating on the school grounds. There is also a spell that prevents individuals from Disapparating, which Dumbledore places on the Death Eaters captured at the Ministry in  Order of the Phoenix ; a sister spell, which allows one to Apparate into a location but prevents them from Disapparating out of it, is cast by the Death Eaters in Hogsmeade in concordance with the Caterwauling Charm. Dumbledore is the only person who can both Apparate and Disapparate from the school grounds, since he is the headmaster. \n A witch or wizard can use  Side-Along Apparition  to take others with them during Apparition. Dumbledore successfully transports Harry this way several times in  Half-Blood Prince , and notably, Harry's first non-lesson attempt at the skill is the Side-Along Apparition with the weakened Dumbledore when they return from the seaside cave. \n In the  Order of the Phoenix  film, Death Eaters and Order members Apparate and Disapparate in clouds of smoke. Death Eaters appear and disappear in black smoke, Order members in white. In the film, both sides also appear to be able to \"half-apparate\" in which their bodies were made out of smoke, giving them the ability to fly. Interestingly, both times Fred and George apparated and disapparated, they did it with a  pop  as in the books. \n In the books, the words \"Apparate\" and \"Disapparate\", like many other  neologisms  used by Rowling, are  capitalised , whereas established English words such as \"jinx\" and \"hex\" are not. The words themselves are most likely derived from the French  apparaître  and  disparaître , meaning 'to appear' and 'to disappear'. Another possible derivation is from the English word \"apparition\", meaning \"a supernatural appearance of a person or thing; anything that appears, especially something remarkable or startling; an act of appearing\", which comes from the Latin  \"apparitio\" , meaning attendance. \"Disapparate\" probably comes from the same word but with the prefix: \"dis-\" expressing negation or reversal. \n Other teleportation [ edit ] \n Some magical creatures have their own forms of instantaneous travel, such as a house elf's ability to teleport or a phoenix's ability to appear and disappear in a burst of flame. Unlike wizards, these creatures are not restricted by anti-Apparition magic.  Dobby ,  Kreacher  and the rest of the house-elf population can Apparate within the Hogwarts grounds, as is demonstrated on multiple occasions, most notably when Dobby visits Harry in the hospital wing, and when Dobby and Kreacher are summoned by Harry and assigned to tail Draco Malfoy.  Fawkes  disapparates from the headmaster's office at Hogwarts along with Dumbledore when the latter manages to evade arrest at the hands of Ministry officials in  Order of the Phoenix . \n Some magical devices like the  Floo Network ,  Portkeys  and  Vanishing Cabinets  also provide forms of magical teleportation. \n Veela charm [ edit ] \n An ability attributed to  Veela  and those of Veela heritage, such as  Fleur Delacour . It is used to charm males, much like the  Sirens  in  The Odyssey . Men who are exposed to it over time become more resistant to it, although the Veela charm takes full effect if the Veela surprises the man, as noted by Ron in  Half-Blood Prince . \n As shown in  Goblet of Fire , Veela hair can be used as cores to create magical wands. According to famed wandmaker Mr. Ollivander, these wands are a little \"temperamental\". \n Magical resistance [ edit ] \n This refers to a certain degree of immunity against hexes and spells found in powerful creatures such as  trolls ,  dragons , and  giants . Hagrid is resistant to certain spells, like the Stunning Spell, due to his giant blood. This type of resistance is not insurmountable; if enough Stunning Spells, for example, are fired at a creature with magical resistance at once, the creature may still be rendered unconscious. Also, wizards and witches can resist certain spells with the power of their own sheer will, such as Harry did in  Goblet of Fire , when  Barty Crouch Jr.  disguised as Alastor Moody tried to control Harry with the Imperius curse and Harry resisted. \n Subjects at Hogwarts [ edit ] \n At Hogwarts, students must study a core group of subjects for the first two years, after which they must choose between several electives. During their final two years, students are permitted to take more specialized subjects such as Alchemy. \n Transfiguration, Defence Against the Dark Arts, Charms, Potions, Astronomy, History of Magic, and Herbology are compulsory subjects for the first five years, as well as flying lessons. At the end of their second year, students are required to add at least two optional subjects to their syllabus for the start of the third year. The five choices are Arithmancy, Muggle Studies, Divination, Study of Ancient Runes and Care of Magical Creatures. Very specialised subjects such as  Alchemy  are sometimes offered in the final two years, if there is sufficient demand. There is a total of twelve named  Professors  at Hogwarts, each specializing in one of these subjects. \n Transfiguration [ edit ] \n Transfiguration  is essentially the art of changing the properties of an object. [18]  Transfiguration is a theory-based subject, including topics such as \"Switching Spells\" (altering only a part of some object, such as when Hagrid gave Dudley a pig tail); Vanishing Spells (causing an object to completely disappear); [OotP Ch.13]  and Conjuring Spells (creating objects out of thin air). [OotP Ch.13]  It is possible to change inanimate objects into animate ones and vice versa—Minerva McGonagall, the class's teacher, transfigures her desk into a  pig  and back in  Philosopher's Stone . [PS Ch.8] \n Defence Against the Dark Arts [ edit ] \n Defence Against the Dark Arts , commonly shortened to  D.A.D.A. , [19]  is the class that teaches students defensive techniques to defend against the  Dark Arts , and to be protected from Dark creatures. In  Harry Potter and the Deathly Hallows , with Death-Eaters in charge of the school, the subject is renamed the  Dark Arts , and involves pupils practicing the  Cruciatus Curse  on those who have earned detentions. [DH Ch.29]  The subject has an extraordinarily high turnover of staff members—throughout the series no Defence Against the Dark Arts teacher has retained the post for more than one school year. Harry is exceptionally skilled in this subject. During the period the story takes place, the class is taught by  Quirinus Quirrell  ( book one ),  Gilderoy Lockhart  ( book two ),  Remus Lupin  ( book three ),  Bartemius Crouch Jr  impersonating  Alastor \"Mad-eye\" Moody  ( book four ),  Dolores Umbridge  ( book five ),  Severus Snape  ( book six ), and  Amycus Carrow  ( book seven ). Hagrid suggests in  Harry Potter and the Chamber of Secrets  that  \"They're startin' ter think the job's jinxed. No one's lasted long for a while now.\"  In  Half-Blood Prince , Dumbledore suggests that Voldemort cursed the position because his application for it was rejected. [HBP Ch.20]  The existence of the jinx was eventually confirmed by Rowling. The position had also been coveted by Snape, but he was denied the position as well. Snape was finally appointed D.A.D.A. professor in  Half-Blood Prince . Rowling announced in an interview that once Voldemort had died, the jinx he placed on the office was lifted and a permanent professor had been teaching the subject between the end of  Deathly Hallows  and the  epilogue , set nineteen years afterwards. Furthermore, she imagines that Harry Potter occasionally comes to the class to give lectures on the subject. [20] \n Charms [ edit ] \n Charms  is the class that teaches how to develop incantations for the uses of bewitchment. Rowling has described Charms as a type of magic spell concerned with giving an object  new  and unexpected properties. [18]  Charms classes are described as notoriously noisy and chaotic, as the lessons are largely practical. [OotP Ch.18]  Many of the  exposition  sequences in the books are set in Charms classes, which are on the second floor of Hogwarts. The class is taught by  Filius Flitwick . \n Potions [ edit ] \n Further information:  Potions in Harry Potter \n Potions  is described as the art of creating mixtures with magical effects. It requires the correct mixing and stirring of ingredients at the right times and temperatures. As to the question of whether a muggle could brew a potion, given the correct magical ingredients, Rowling has said, \"Potions seems, on the face of it, to be the most muggle-friendly subject. But there does come a point in which you need to do more than stir.\" [21]  Rowling later confirmed on  Pottermore  that \"There is always some element of wandwork necessary to make a potion.\" [22]  Snape's lessons are depicted as unhappy, oppressing times set in a gloomy dungeon in the basement of the castle, whilst Slughorn's, who replaces Snape as Potions Master, are shown as more cheerful and even fun at times. \n Astronomy [ edit ] \n Astronomy  classes take place in the Astronomy Tower, the tallest tower in Hogwarts, and are taught by Professor Aurora Sinistra. Lessons involve observations of the night skies with  telescopes . No astronomy lessons are shown in the books, but they are frequently referenced. Rowling describes one of Harry's Astronomy exams in  Harry Potter and the Order of the Phoenix . Also, bits of the Astronomy Tower are seen throughout the  film series , such as HP2 and HP3, and featured in  Half-Blood Prince , as the place where Dumbledore died, and seen in  Deathly Hallows . Known student homework activities include learning the names of stars, constellations and planets, and their location, movements, and environments. \n History of Magic [ edit ] \n History of Magic  is the study of magical history.  Cuthbert Binns ' lessons are depicted as some of the most boring at Hogwarts. They are only lectures, given without pause, about significant events in wizarding history. Topics have included goblin rebellions, giant wars, and the origins of wizarding secrecy. This is the only class at Hogwarts that is taught by a ghost, as the professor never noticed he had died and simply continued teaching as if nothing had changed. \n Herbology [ edit ] \n Herbology  is the study of magical plants and how to take care of, utilise and combat them. There are at least three greenhouses described in the books, holding a variety of magical plants. Herbology is also the only subject Neville excels in. The epilogue to  Deathly Hallows  explains that he later replaces Professor Sprout as the Herbology teacher. \n Arithmancy [ edit ] \n Arithmancy  is a branch of magic concerned with the magical properties of numbers. As neither Harry nor Ron take this class; almost nothing is known about it. It is, however, a favourite subject of Hermione. Arithmancy is reportedly difficult, as it requires memorising or working with many charts. In  Order of the Phoenix , it is mentioned that the study of Arithmancy is required to become a Curse-Breaker for  Gringotts . The subject is taught by Professor Septima Vector. \n Study of Ancient Runes [ edit ] \n Study of Ancient Runes , more commonly known as  Ancient Runes , is a generally theoretical subject that studies the ancient runic scripts. Because only  Hermione  studies it, little else is known about this subject, taught by Professor Bathsheba Babbling. [23]  In  Deathly Hallows  Dumbledore bequeaths his copy of  The Tales of Beedle the Bard , which is written in ancient runes, to  Hermione . \n Divination [ edit ] \n Divination  is the art of predicting the future. Various methods are described, including  tea leaves ,  fire omens ,  crystal balls ,  palmistry ,  cartomancy  (including the reading of conventional  playing cards  and the  tarot ),  astrology , and  dream interpretations . Divination is described by Professor McGonagall as \"one of the most imprecise branches of magic\". [PA Ch.6]  Supporters of the subject claim that it is an inexact science that requires innate gifts such as the \"Inner Eye\". Those opposed claim that the subject is irrelevant and fraudulent. Harry is first taught Divination by Professor Trelawney, and then later by Firenze after Trelawney is sacked by  Dolores Umbridge  in Harry's fifth year. In the sixth (and presumably seventh) year, Firenze and Professor Trelawney share Divination classes, divided by year. \n Care of Magical Creatures [ edit ] \n Care of Magical Creatures  is the class which instructs students on how to care for  magical beasts . Classes are held outside the castle. In Harry's first two years, the class is taken by Professor Silvanus Kettleburn who then retires \"in order to enjoy more time with his remaining limbs\". Dumbledore then recruits the gamekeeper  Rubeus Hagrid  to accept a teaching position along with his gamekeeping duties. Although Hagrid is obviously very experienced and knowledgeable, he doesn't \"have a normal person's view of what's dangerous\", an example being that the Care of Magical Creatures students were required to get a literally ferocious textbook called the \"Monster Book of Monsters\", and so consistently misjudges the risk that the animals he uses in his lessons pose to his students [PA Ch.6] [GF Ch.13] , which sometimes results in chaos. When Hagrid is absent, his lessons are taken over by Wilhelmina Grubbly-Plank, a witch and an acquaintance of Dumbledore's. \n Muggle Studies [ edit ] \n Muggle Studies  is a class which involves the study of the  muggle  (non-magical) culture \"from a wizarding point of view.\" The only need for witches and wizards to learn about muggle  ways  and  means  is to ensure they can blend in with muggles while needing to do so (for example, at the 1994 Quidditch World Cup). As the class is only mentioned as being taken by  Hermione , and for just one year, little is known about its curriculum. In the opening chapter of the final book, Voldemort murders Professor  Charity Burbage  because she portrays muggles in a positive light and is opposed to limiting wizardry to only people of pure-blood origins. For the rest of the academic year covered by  Deathly Hallows , the Death Eater  Alecto Carrow  teaches Muggle Studies. However, her lessons (which are made compulsory) mainly describe muggles and muggle-borns as subhuman and worthy of persecution. \n Alchemy [ edit ] \n Alchemy  classes are not mentioned in the  Harry Potter  series; however, Rowling has used Alchemy as an example of a 'specialized' subject offered when there is sufficient demand. Alchemy is a philosophical tradition searching for the  philosopher's stone , which is said to have the power to turn base metals into gold and to contain the  elixir of life , which makes or keeps the drinker young and immortal. As mentioned in  Harry Potter and the Philosopher's Stone , Nicholas Flamel created a Philosopher's Stone, but it was destroyed at the end of Harry's first year. \n Flying [ edit ] \n Flying  is the class that teaches the use of  broomsticks  made for the use of flying and is taught only to Hogwarts first years by  Rolanda Hooch . The subject is the only one that requires physicality. The only flying lesson depicted in the Harry Potter series is in  Harry Potter and the Philosopher's Stone . \n Apparition [ edit ] \n Apparition  is an optional class for those in the sixth and seventh years at Hogwarts, in preparation for obtaining their licence. In Harry's sixth year,  Wilkie Twycross , a Ministry of Magic Apparition instructor, teaches the lessons. Magical enchantments on Hogwarts castle and grounds prevent Apparition and Disapparition inside the castle; however  Half-Blood Prince  explains that these protections are temporarily relaxed within the Great Hall for short periods to permit students to practice. Students are warned, though, that they will not be able to Apparate outside of the Great Hall and that it would be unwise to try. \n Spell-like effects [ edit ] \n Unbreakable Vow [ edit ] \n The  Unbreakable Vow  is a voluntary agreement made between two witches or wizards. It must be performed with a witness (\"Bonder\") on hand, holding their wand on the agreeing persons' linked hands to bind them with magic as a tongue of flame. The Vow is not literally \"unbreakable\" as the person taking it is still able to go back on his or her word, but doing so will cause instant death. The Unbreakable Vow was first introduced in  Half-Blood Prince , in which Snape made a promise to Narcissa Malfoy to protect Draco, with Bellatrix as the \"Bonder\", as her son attempted to fulfil the Dark Lord's task, and for Snape to fulfil the task if something should prevent Draco from doing it. Another example in  Half-Blood Prince  occurs when Ron tells Harry how Fred and George tried to make him undertake an Unbreakable Vow, but because of their father's intervention, they did not succeed. \n Priori Incantatem [ edit ] \n Priori Incantatem , or the  Reverse Spell Effect , is used to detect the spells cast by a wand. The spells cast by the wand will emerge in smoky or ghost-like replicas in reverse order, with the latest spell emerging first. It is first encountered in  Goblet of Fire  when the house elf Winky is found holding Harry's wand. This spell is used to reveal that it was indeed Harry's wand that cast the Dark Mark. In  Harry Potter and the Half Blood Prince , it is revealed that the teenage Voldemort murdered his father and grandparents using his uncle Morfin's wand, knowing that, when examined, the wand would incriminate Morfin as the murderer. In  Deathly Hallows , Harry fears that a  Priori Incantatem  spell will be used on Hermione's wand after the  Death Eaters  get hold of it. This would reveal that she had accidentally broken his holly-and-phoenix-feather wand when a curse misfired and they both narrowly escaped Voldemort earlier. As a result, the protection of the shared cores was lost and, worse still, this would now be made known to Voldemort. During the final duel between Harry and Voldemort, the latter mentions that he knows that the holly and phoenix wand is destroyed, implying that the Priori Incantatem has indeed been performed on Hermione's wand, as they had feared. \n Forcing two wands that share the source of their cores to do battle can also cause a more potent form of Priori Incantatem. The tips of the two wands will connect, forming a thick golden \"thread\" of energy, and the two wands' masters fight a battle of wills. The loser's  wand  will regurgitate shadows of spells that it has cast in reverse order. This phenomenon occurs during the duel between Harry and Voldemort at the end of  Goblet of Fire . Their simultaneous spells (Harry and Voldemort cast \"Expelliarmus\" and \"Avada Kedavra\" respectively) trigger the threads, and as Voldemort loses the battle of wills, his wand regurgitates, in reverse order, echoes of the people his wand had last murdered:  Cedric Diggory ;  Frank Bryce ;  Bertha Jorkins ; as well as Harry's parents. Harry was previously informed by  Mr. Ollivander  that the holly wand that \"chose\" Harry was the \"brother\" of the yew wand that gave him the lightning-shaped scar on his forehead, although the significance of this was not discussed then. Dumbledore later reveals to Harry that his and Voldemort's wands both contain a tail feather given by Dumbledore's pet  phoenix ,  Fawkes . \n Dark Arts [ edit ] \n The  Dark Arts  are those magical spells and practices that are usually used for  malicious purposes . Practitioners of Dark Arts are referred to as Dark witches or wizards. The most prominent of these is Voldemort, known to them as the Dark Lord. His followers, known as  Death Eaters , practice the Dark Arts while doing his bidding. \n The type of spells characteristic of Dark Arts are known as curses, [24]  which usually cause harm to the target. All, to a certain degree, are in some circumstances justifiable. The motivation of the caster affects a curse's result. This is most notable in the case of  Cruciatus : when cast by Harry, angered by the death of his godfather at Bellatrix's hands and desiring to punish her, it causes a short moment of pain. As Bellatrix herself comments, righteous anger does not allow the spell to work for long. When cast by figures such as Voldemort, who desire to inflict pain for its own sake, it causes intense agony that can last as long as the Dark witch or wizard desires. Use of Dark Magic can corrupt the soul and body; Voldemort has used such magic in his quest to prolong his life and obtain great power. The Dark Arts also cause Voldemort to look deformed and inhuman, a side effect of splitting his soul into Horcruxes. \n According to Snape, the Dark Arts \"are many, varied, ever-changing and eternal... unfixed, mutating, indestructible\". [25]  In magical dueling, there are any number of spells that may be used to attack, immobilise, or disarm an opponent without causing pain or lasting harm; however, spells such as the Cruciatus Curse or Sectumsempra, judged to be Dark by reliable authorities, wound or seriously distress a victim in some way. Dark spells can be classified into three groups: jinxes, hexes & curses. \n In the wizarding world, use of the Dark Arts is strongly stigmatised and even illegal; however, these spells are prevalent enough that even before the rise of Voldemort, many schools, (including Hogwarts), taught  Defence Against the Dark Arts  as a standard subject. Techniques include anti-curses and simple spells to disable or disarm attackers or fight off certain creatures. Some schools, such as  Durmstrang , teach Dark Magic. A Dark Arts class is also taught at Hogwarts while it is under Death Eater control. \n Unforgivable Curses [ edit ] \n The  Unforgivable Curses  are some of the most powerful known Dark Arts spells. They were first classified as unforgivable in 1717. Used by the books' villains, such as Voldemort and the  Death Eaters  and in some cases the Ministry of Magic, their use inspires horror and great fear amongst others. The curses are so named because their use is forbidden and unforgivable in the wizarding world and is punishable by a life sentence in  Azkaban . The only exception is if a person is proved to have done them under the influence of mind control. These curses are thus very rarely used openly. \n The Unforgivable Curses include: \n Avada Kedavra , the Killing Curse. The curse is used for murder. This is one of the most powerful curses. Normally, it cannot be stopped or deflected, but it can be dodged or obstructed with a physical object. The spell causes immediate, painless death, and cannot be reversed. Casting it requires immense magical power, so much so that the combined power of an entire class of 4th year students is not sufficient for it. The curse, when summoned, is shown as a bright green light (a bolt or beam of green light in the films).  Harry Potter  is the only person known to have survived (twice), nullified (once) and deflected (once) this curse. \n Crucio , the Cruciatus Curse. The curse is used for  torturing  a person by causing them physical pain and agony. The strength of the curse is determined by the person who cast it. The curse is so powerful that it can even torture a person to the point that they are exhausted to death, or in a more sadistic case, it causes permanent amnesia and insanity (the case of Neville's parents, who were tortured by Bellatrix Lestrange). Effective casting requires the caster to have sadistic desires. Harry finds out in  Order of the Phoenix  while attempting to use the Cruciatus Curse on Bellatrix that the caster must truly want their victim to suffer for the spell to work, and that his righteous anger is not enough. The curse, when summoned, is shown in a bright-faded blue light (though it is usually invisible or even a red bolt of light in the films). When  Hogwarts  was under  Death Eater  control, the Dark Arts teacher forced the students in his class to use the Cruciatus Curse on students who had been assigned detention. \n Imperio , the Imperius Curse. The curse is used for  mind control  or  hypnosis  and can force the victim to do things he/she would be unwilling to do or even incapable of under normal circumstances. The strength (and also the duration) of the curse is determined by the determination of the person who cast it, as well as by the level of resistance of the victim. The curse, when summoned, is shown in a bright haze (while it was either invisible or green, mist-like haze in the films). Harry Potter resisted an Imperius Curse cast by Voldemort. \n The use of the Unforgivable Curses was authorised against Voldemort and his followers by  Bartemius Crouch Sr , during the First Wizarding War. (Shortly after his resurrection, Voldemort names two Death Eaters \"killed by  Aurors \".) In addition, in  Deathly Hallows , the Unforgivable Curses are used liberally by good characters, ranging from  Professor McGonagall  with the Imperius Curse, to Harry effectively using the Cruciatus Curse. He also uses the Imperius Curse on a goblin and a suspicious Death Eater during their disguised attack upon Gringotts Bank. \n Dark Mark [ edit ] \n The  Dark Mark  is the symbol of Voldemort and the Death Eaters and takes the form of a skull with a snake coming out of the mouth in place of a tongue. The mark is cast into the sky by  Death Eaters  whenever they have murdered someone. The spell used by Death Eaters to conjure the Mark is Morsmordre. It first appears in  Goblet of Fire  and is described as a \"colossal skull, composed of what looked like emerald stars, with a serpent protruding from its mouth like a tongue\". Once in the sky it was \"blazing in a haze of greenish smoke\". Dark Marks are also branded on the left forearm of the closest followers of Voldemort. The mark serves as a connection between Voldemort and each who bears it; he can summon them by touching his mark, causing it and those of his followers to burn and change colour. Death Eaters can summon Voldemort in the same fashion. Following Voldemort's ultimate defeat, the Dark Marks on his Death Eaters fade into a scar \"similar\" to Harry's. [12]  In the books, the Dark Mark is described as green; however, in the films, it was only green at the Quidditch World Cup. In all other film appearances it has been grey. \n Inferius [ edit ] \n Distinguish from  Infernus . \n An  Inferius  (plural:  Inferi ) is a  corpse  controlled through a Dark wizard's spells. An Inferius is not alive, but a dead body that has been bewitched into acting like a puppet for the  witch  or wizard; this manifests itself as a white mist in the controlled corpse's eyes. They cannot think for themselves: they are created to perform a specific duty assigned by the Dark wizard who commands them, and as seen in the Inferi guarding Voldemort's Horcrux in a seaside cave, remain idle until their task can be performed. This task is then thoughtlessly carried out, whether or not it will produce any result. Inferi are difficult to harm by magic; however, they can be repelled by fire or any other forms of heat or light, as the Inferi in Voldemort's cave had never been exposed to either of these elements. When defeated, they return to their idle state. \n Inferi are considered dangerous and frightening enough by the magical world that impersonating an Inferius (as  Mundungus Fletcher  does in  Half-Blood Prince ) is an offence worthy of imprisonment in  Azkaban . \n The Ministry of Magic fears that Voldemort is killing enough people to make an army of Inferi: as they are dead, they are very difficult to stop. When Voldemort was hiding one of his  Horcruxes  in the past, he filled a lake in a cave with many Inferi, which were to attack and drown anyone but Voldemort who came into the cavern and took the locket. When Harry and Dumbledore took the locket, the Inferi attacked Harry; Dumbledore repelled them with a rope of fire. It is also revealed that the Inferi almost killed Kreacher after he drank from the basin to help Voldemort hide his Horcruxes, but having been ordered to return to his master after his task with Voldemort was complete, he was able to apparate out of the cave. These Inferi later killed Regulus Black when he stole the Horcrux and ordered Kreacher to destroy it. \n In Latin, the word  inferus  (plural:  inferi ) means \"below\", often referring in the plural to \"the gods below\" (see  di inferi )  or the spirits of the dead. [26]   Inferius  is a neuter singular form of  inferior , a  comparative adjective  meaning \"lower\". [26] [27] \n Horcrux [ edit ] \n Main article:  Horcrux \n A  horcrux  is an object created using dark magic to attain effective immortality. The concept is first introduced in the sixth novel,  Harry Potter and the Half-Blood Prince , although horcruxes are present in earlier novels without being described or expanded upon. \n A horcrux is created when a soul-shard split from a murderer's soul is infused into an object, which is then hidden or in some other manner kept safe. (When a person commits murder, his soul becomes traumatized and splits into more than one piece. A horcrux is nothing more than the fused object/soul-shard created when the portion of the murderer's soul that was split off is infused into some material object.) The point of creating a horcrux is to prevent the passage of a soul to the afterlife (death) by anchoring a portion of the soul in the material world. \n Ordinarily, when one's body is killed, the soul departs for the next world. If, however, the body of a horcrux owner is killed, that portion of his soul which had remained in his body will not pass on to the next world, but will rather exist in a non-corporeal form capable of being resurrected by another wizard, as in  Half-Blood Prince  and  Deathly Hallows . If all of someone's horcruxes are destroyed, then his soul's only anchor in the material world would be his body, the destruction of which would then cause his final death. \n Portraits [ edit ] \n In the  Harry Potter  series the subjects of  magical portraits  (even those of characters that are dead) can move, interact with living observers, speak and demonstrate apparent emotion and personality. Some can even move to other portraits to visit each other, or relay messages, or (if more than one painting of the subject exists) move between separate locations by way of their portraits. An example of this is Phineas Nigellus Black, who has a painting in the Headmaster's office and at Number 12 Grimmauld Place. Many such portraits are found on the walls of Hogwarts. \n Some portraits are used to conceal the entrance of a room or passageway. For example, the Fat Lady's portrait covers the entrance to the  Gryffindor  common room, and she can swing the portrait open when given the correct password or close to prevent entry. In  Harry Potter and the Deathly Hallows , there is a portrait of Ariana Dumbledore in the  Room of Requirement  that conceals a secret passageway to the Hog's Head. There is also a painting of a large fruit bowl in front of the Hogwarts kitchen, which will swing open if the pear is tickled to reveal a hidden door. \n Portraits are enchanted to move by the artist, but the degree to which they can interact with others depends on the power of the subject. [28]  Rowling has commented that a portrait is merely a faint imprint of the deceased subject, imitating their basic personality and thought patterns. They are therefore \"not as fully realised as ghosts\". [29]  In  Harry Potter and the Cursed Child  the portrait of Albus Dumbledore describes himself as only \"paint and memory\" and Professor McGonagall (his successor as headteacher of Hogwarts) comments that, although she speaks to Dumbledore to help her in making decisions, she is careful to remember that \"portraits don't represent even half of their subjects\". \n Portraits in the Headmaster's office [ edit ] \n The portraits in the Headmaster's office depict all the former Heads of Hogwarts, with the exception of Dolores Umbridge. They advise the Headmaster and are \"honour-bound to give service to the present headmaster\" (according to Armando Dippet). Rowling has explained that portraits of past headteachers tend to be more realistic than most, as the subject in question usually imparts knowledge and teaches them how to behave before their death. [28] \n The Fat Lady [ edit ] \n The portrait of  the Fat Lady  covers the door to  Gryffindor  Tower. She will open it (sometimes grudgingly) when the correct password is uttered. She is often upset after being awoken, and is sometimes seen drunk with her best friend, Violet. The Fat Lady has no other known name -- even the unfailingly polite Albus Dumbledore refers to her only as \"the Fat Lady\" -- and it may be that she does not represent a real person but is instead an invention of her portrait's artist. In  Philosopher's Stone , she leaves her portrait in the middle of the night, locking Harry, Ron, Hermione, and Neville out of Gryffindor Tower, forcing them to run across the school. Luckily for them, when they return, she has returned to her portrait, allowing them to escape into Gryffindor Tower. In  Prisoner of Azkaban , Sirius Black slashes the Fat Lady's portrait when she won't let him in without a password and it is some time before she dares to guard Gryffindor Tower again. After her portrait is restored, she requests protection in case someone tries to attack her portrait again. Thus, two security trolls are hired. In  Half Blood Prince , she gets so annoyed with Harry's late return that she pretends the password has changed and tries to call him back when he heads off to talk to Dumbledore. When Harry later confirms Dumbledore's death, she lets out a sob and, for the only time in the series, she opens without the password for Harry in her grief. \n In the  first film  the Fat Lady is played by  Elizabeth Spriggs , and by  Dawn French  in the  third film . \n Photographs [ edit ] \n Wizarding photographs of people have similar properties to magical painted portraits: the figures within move about or even sometimes leave the frame. They appear in wizard newspapers and other print media, as well as on  Chocolate Frog  cards. [HP1]   Colin Creevey  mentions in  Chamber of Secrets  that a boy in his dormitory said that if he develops the film from his Muggle camera 'in the right potion', the pictures will move. [30]  However, unlike portraits, figures in wizarding pictures cannot speak and display little sentience. It appears that they do have some knowledge of current events, as in  Order of the Phoenix , the family photograph on Arthur's desk shows everyone except Percy \"who appeared to have walked out of it\", [31]  mirroring the deterioration of Percy's relationship with his family. It is also mentioned that in a photo taken by  Colin Creevey  of  Gilderoy Lockhart  and Harry, Harry's picture had walked out and was resisting all of Lockhart's efforts to pull him back in. \n References [ edit ] \n ^   \"FAQ jkrowling.com\" . Archived from  the original  on 21 July 2011 . Retrieved  8 May  2017 .   \n ^   \"J.K Rowling Official Site\" . Retrieved  27 February  2008 .   \n ^   [HP6] , chapter 13 \n ^   \"2001: Accio Quote!, the largest archive of J.K Rowling interviews on the web\" . Archived from  the original  on 27 August 2008 . Retrieved  27 February  2008 .   \n ^   \"History of Magic in North America\" .  Pottermore . Retrieved  5 May  2017 .   \n ^  a   b   \"JKR quotes about \"the rules\" of Harry Potter's Wizarding World:\" . Retrieved  27 February  2008 .   \n ^   Harry Potter and Me .  Accio Quote . 28 December 2001. BBC.   \n ^   Anelli, Melissa.  \"More About that Veil\" .  Harry, A History . Archived from  the original  on 20 November 2008 . Retrieved  8 May  2017 .   \n ^   Rowling, J.K.  Pottermore Presents: Short Stories from Hogwarts of Heroism, Hardship and Dangerous Hobbies . Pottermore.  ISBN   978-1-78110-628-0 .   \n ^   \"J.K. Rowling's Official Site, rumour section\" . Archived from  the original  on 2011.   \n ^   Rowling, J.K.: \"Harry Potter and the Order of the Phoenix\", page 85. Scholastic, 2003 \n ^  a   b   \"J.K. Rowling Web Chat Transcript\" . Archived from  the original  on 8 July 2012.   \n ^   \"Transcript of JK Rowling web chat—Harry Potter Beyond\" . Archived from  the original  on 21 February 2008 . Retrieved  27 February  2008 .   \n ^   \"J.K Rowling at the Royal Albert Hall 26 June 2003\" . Retrieved  27 February  2008 .   \n ^   Prince, Alan (2011).  The True Story of Severus Snape: An Essay About Harry Potter's Most Disputed Character , p. 52. \n ^   [HP5] , chapter 26 \n ^   Rowling, J.K.  \"Welcome to my new website!\" .  jkrowling.com . Retrieved  5 May  2017 .   \n ^  a   b   1998: Accio Quote!, the Largest Archive of J.K. Rowling quotes on the web , quick-quote.quill.org \n ^   Rowling, J. K.  (2005). \"Silver and Opals\".  Harry Potter and the Half-Blood Prince .  Bloomsbury .  ISBN   0747581088 .   \n ^   Brown, Jen (24 July 2007).  \"Stop your sobbing! More Potter to come\" .  TODAYshow.com . NBC . Retrieved  24 July  2007 .   \n ^   2006: Accio Quote!, the largest archive of J.K. Rowling interviews on the web , quick-quote.quill.org \n ^   \"Potions\" .  Pottermore . Retrieved  5 May  2017 .   \n ^   Steve Vander Ark.  \"HP-lexicon.org\" . HP-lexicon.org . Retrieved  16 July  2011 .   \n ^   J.K. Rowling's Official Site   Archived  24 January 2008 at the  Wayback Machine . \n ^   [HP6] , chapter 9 \n ^  a   b   Lewis, Charlton T.; Short, Charles (1879).  \"q.v., inferus, as positive noun I.B, as comparative adjective II.A\" .  A Latin Dictionary . Oxford: Clarendon Press.   \n ^   Morphology of inferius by The Perseus Project \n ^  a   b   Rowling, J.K.  \"Hogwarts Portraits\" .  Pottermore . Retrieved  9 May  2017 .   \n ^   \"JK Rowling at the Edinburgh Book Festival\" . J. K. Rowling Official Web Site. 15 August 2004. Archived from  the original  on 21 July 2011.   \n ^   [HP2] , chapter 6 \n ^   [HP5] , chapter 7 \n Further reading [ edit ] \n Highfield, Roger (2002).  The Science of Harry Potter: How magic really works . New York: Viking.  ISBN   978-0-670-03153-5 .   \n Teare, Elizabeth (2002). \"Harry Potter and the technology of magic\". In Whited, Lana A.  The Ivory Tower and Harry Potter: Perspectives on a literary phenomenon . Columbia, Missouri: University of Missouri Press. pp. 29–342.  ISBN   978-0-8262-1549-9 .   \n Black, Sharon (2003). \"The Magic of Harry Potter: Symbols and Heroes of Fantasy\".  Children's Literature in Education .  34  (3): 237–247.  doi : 10.1023/A:1025314919836 .   \n External links [ edit ] \n Magic  on  Harry Potter Wiki,  an external wiki \n v \n t \n e \n The  Harry Potter  series by  J. K. Rowling \n Books \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows \n Film series \n Films \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Music \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Related \n Cast members \n Production of  The Deathly Hallows \n Characters \n Main \n Harry Potter \n Ron Weasley \n Hermione Granger \n Lord Voldemort \n Albus Dumbledore \n Severus Snape \n Rubeus Hagrid \n Draco Malfoy \n Supporting \n Hogwarts staff \n Order of the Phoenix \n Dumbledore's Army \n Death Eaters \n Fictional universe \n Hogwarts \n Magic \n Magical creatures \n Magical objects \n Ministry of Magic \n Muggle \n Places \n Potions \n Quidditch \n Related works \n Fantastic Beasts and Where to Find Them \n Quidditch Through the Ages \n The Tales of Beedle the Bard \n Prequel \n Pottermore \n The Cursed Child \n Hogwarts: An Incomplete and Unreliable Guide \n Short Stories from Hogwarts of Power, Politics and Pesky Poltergeists \n Short Stories from Hogwarts of Heroism, Hardship and Dangerous Hobbies \n Games and toys \n Quidditch World Cup \n Lego Creator: Harry Potter \n Lego Harry Potter: Years 1–4 \n Lego Harry Potter: Years 5–7 \n The Philosopher's Stone \n The Chamber of Secrets \n The Prisoner of Azkaban \n The Goblet of Fire \n The Order of the Phoenix \n The Half-Blood Prince \n The Deathly Hallows – Part 1 \n The Deathly Hallows – Part 2 \n Book of Spells \n Book of Potions \n Trading Card Game \n Lego  Harry Potter \n Attractions \n The Wizarding World of Harry Potter \n Orlando \n Japan \n Hollywood \n Dragon Challenge \n Flight of the Hippogriff \n Harry Potter and the Escape from Gringotts \n Harry Potter and the Forbidden Journey \n Hogwarts Express \n Harry Potter Movie Magic Experience \n Warner Bros. Studio Tour London \n Fandom \n Harry Potter Alliance \n The Leaky Cauldron \n MuggleNet \n LeakyCon \n Wizard rock \n Wrockstock \n Voldemort: Origins of the Heir \n Related \n Influences and analogues \n Legal disputes \n Parodies \n Politics \n Religious debates \n Translation \n A Very Potter Musical \n The Harry Potter Lexicon \n The Magical Worlds of Harry Potter \n Potter Puppet Pals \n   Book \n   Category \n   Portal \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Magic_in_Harry_Potter&oldid=810398982#Unforgivable_Curses \"\t\t\t\t\t \n Categories :  Fictional superhuman features or abilities Harry Potter universe Magic in fiction Hidden categories:  Webarchive template wayback links Use dmy dates from November 2013 Wikipedia articles needing style editing from July 2016 All articles needing style editing Articles that need to differentiate between fact and fiction from July 2016 All articles that need to differentiate between fact and fiction All articles with unsourced statements Articles with unsourced statements from June 2017   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons   \n Languages \n Bosanski Català Čeština Dansk Español فارسی Français 한국어 Hrvatski Bahasa Indonesia Italiano Magyar Bahasa Melayu Nederlands Norsk nynorsk Português Русский Svenska ไทย Türkçe   \n Edit links   \n  This page was last edited on 15 November 2017, at 00:43. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}