{"url": "https://en.wikipedia.org/wiki/Marion_Stokes", "content": "Marion Stokes - Wikipedia \n Marion Stokes   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n For the similarly named historical Oregon architect (d. 1975), see  Francis Marion Stokes . For the similarly named Austrian painter (d. 1927), see  Marianne Stokes . \n Marion Stokes \n Born \n Marion Butler \n November 25, 1929  ( 1929-11-25 ) \n Died \n December 14, 2012  ( 2012-12-15 )  (aged 83) \n Nationality \n American \n Occupation \n Television producer, Archivist \n Marion Stokes  (born  Marion Butler , 25 Nov 1929 – 14 Dec 2012) [1]  was a  Philadelphia ,  Pennsylvania   access television  producer,  civil rights  demonstrator, activist, librarian, and prolific  hoarder  and  archivist , especially known for single-handedly amassing hundreds of thousands of hours of television news footage spanning 35 years, from 1977 until her death at age 83, [2]  at which time she operated nine properties and three storage units. [3] \n Contents \n 1   Television news collection \n 2   Other collections \n 2.1   Macintosh computers \n 3   Legacy \n 4   See also \n 5   References \n 6   External links \n Television news collection [ edit ] \n Stokes' tape collection consisted of  24/7 -coverage of  FOX ,  MSNBC ,  CNN ,  C-SPAN ,  CNBC  and other networks—recorded on as many as eight separate  VCR  machines stationed throughout her house. She had a husband and children, and family outings were planned around the length of a  VHS  tape. Every six hours when the tapes would be ending, Stokes and her husband would run around the house to switch them out—even cutting short meals at restaurants to make it home to switch out tapes in time. Later in life when she was not as agile, Stokes trained a helper to do the task for her. [4]  The archives ultimately grew to live on 40,000 (originally erroneously reported as 140,000 in the media) [5]  VHS and  Betamax  tapes stacked in Stokes' home, as well as apartment units she rented for the sole purpose of storage. [2] \n Stokes' son, Michael Metelits, said that the advent of 24-hour television news networks such as  CNN , as well as  ABC 's nightly coverage of the  Iran hostage crisis  (which later became  Nightline ), acted as  triggers . [6]  She became convinced there was a lot of detail in the news at risk of disappearing forever, and began taping. In an interview with a  WNYC  program, Metelits stated that Stokes \"channeled her natural hoarding tendencies to [the] task [of creating an archive].\" [3] \n While her collection is not the only instance of massive television footage taping, it is unique in the care taken as to its preservation. Known collections of similar scale have not been as well-maintained and lack the timely and local focus. [7] \n Other collections [ edit ] \n In addition to collecting TV news footage, Stokes personally amassed large quantities of other items. She received half a dozen daily newspapers and 100-150 monthly periodicals, [3]  collected for half a century. [4]  Stokes had also accumulated 30,000-40,000 books. Metelits told WNYC that in the mid-1970s, they would frequent the bookstore to purchase $800 worth of new books. [3]  Stokes also held collections of toys and dollhouses. [8] \n Macintosh computers [ edit ] \n Stokes had purchased countless  Macintosh computers  since the brand's inception, [4]  along with various other  Apple  peripherals. At her death, 192 of the computers remained in her possession. Stokes kept the unopened items in a climate-controlled  storage garage  for posterity. The collection, speculated to be one of the last of its nature remaining, sold on  eBay  to an anonymous buyer. [9] \n Legacy [ edit ] \n Stokes bequeathed her son Michael Metelits the entire television collection, with no instructions other than to donate it to a charity of his choice. After a stringent process of considering potential recipients, Metelits gave the collection to The  Internet Archive  one year after Stokes' death. Four  shipping containers  were required to move the collection cross-country to Internet Archive's headquarters in  San Francisco , [2]  a move which cost her estate $16,000. [8]  It was the largest collection they had ever received. [10] \n The group agreed to digitize the volumes, a process which was expected to run fully on round-the-clock volunteers, costing $2 million and taking 20 digitizing machines several years to complete. As of November 2014, the project was still active. [2] \n See also [ edit ] \n List of archivists \n References [ edit ] \n ^   Vernon Clark (21 December 2012).  \"Marion Stokes, coproducer of TV show\" .  The Philadelphia Inquirer . Retrieved  22 August  2014 .   \n ^  a   b   c   d   Morgan Winsor (9 December 2013).  \"TV producer's collection of 840,000 hours of news tapes finds a home\" .  CNN . Retrieved  18 August  2014 .   \n ^  a   b   c   d   PJ Vogt, Alex Goldman (12 December 2013).  \"#9 - The Second Life of Marion Stokes\" .  Onthemedia.org  (Podcast). WNYC . Retrieved  22 August  2014 .   \n ^  a   b   c   Sarah Kessler (21 November 2013).  \"The Incredible Story of Marion Stokes, Who Single-Handedly Taped 35 Years of TV News\" . Retrieved  22 August  2014 .   \n ^   PJ Vogt (26 March 2014).  \"The Internet Archive has Started Uploading 40,000 Videotapes Worth of TV News\" . Onthemedia.org . Retrieved  22 August  2014 .   \n ^   Audra Schroeder (29 March 2014).  \"One woman's incredible VHS collection will live forever on the Internet\" .  Daily Dot . Retrieved  22 August  2014 .   \n ^   Macdonald, Roger.  \"A Dream to Preserve TV News, on the Road to Realization… with Your Help\" .  Internet Archive Blog . Retrieved  15 January  2017 .   \n ^  a   b   \"Librarian Recorded 800,000 Hours of News Footage Over 35 Years\" . NBC Philadelphia. 9 December 2013 . Retrieved  22 August  2014 .   \n ^   Adam Rosen (19 March 2014).  \"Macs in the Box: The Incredible Mac Collection of Marion Stokes. Now For Sale\" . Cult of Mac . Retrieved  22 August  2014 .   \n ^   Nick Vadala (4 December 2013).  \"Germantown's Marion Stokes archived 35 years of TV news\" . Philly.com ( The Philadelphia Inquirer ) . Retrieved  22 August  2014 .   \n External links [ edit ] \n \"Input\"   (1968-71)  - one of the first television programs Marion Stokes was involved in producing at then- CBS  affiliate  WCAU-TV10 , featuring political discussion and debate among people of varying socioeconomic statuses. She saw to it that the original Ampex 1\" tape broadcast reels were preserved, then converted to Betamax L-500 tapes at the outset of the technology in the late 1970s. \n tl;dr podcast episode  on the legacy Marion Stokes, featuring an interview with her son, as well as Roger Macdonald; the director of the Internet Archive's television archive. \n v \n t \n e \n Internet Archive \n Universal access to all knowledge \n Projects \n Wayback Machine \n PetaBox \n Open Library \n NASA Images \n Open Content Alliance \n Archive-It \n SFlan \n Partners & \nCollaborators \n Bibliotheca Alexandrina \n Library of Congress \n American Libraries \n Canadian Libraries \n Biodiversity Heritage Library \n Sloan Foundation \n Collections \n Lists of Internet Archive's collections \n Image \n NASA Images \n USGS Maps \n Texts \n American Libraries \n Canadian Libraries \n Children's Library \n RECAP US Federal Court Documents \n Microfilm \n US Government Documents \n Philosophical Transactions of the Royal Society of London \n Collected texts of Simon Schwartzman \n Audio \n Live Music Archive \n LibriVox \n Video \n NASA Images \n FedFlix \n Democracy Now! \n Marion Stokes \n The Internet Archive Software Collection \n Open Educational Resources \n People \n Brewster Kahle \n David Rumsey \n Rick Prelinger \n Jason Scott \n Software \n Heritrix \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Marion_Stokes&oldid=801086256 \"\t\t\t\t\t \n Categories :  American archivists Activists from Philadelphia Activists for African-American civil rights 20th-century African-American activists African-American librarians American librarians 1929 births 2012 deaths American television producers Internet Archive collections Hidden categories:  Articles with hCards   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Add links   \n  This page was last edited on 17 September 2017, at 15:46. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}