{"url": "https://www.amazon.com/Apartment-1303-Mischa-Barton/dp/B00DPH7Q8O", "content": "Amazon.com: Apartment 1303: Mischa Barton, Rebecca De Mornay, Julianne Michelle, Corey Sevier, John Diehl, Michele Taverna: Movies & TV \n Interesting Finds Updated Daily \n Amazon \n    Try Prime\n Movies & TV \n Select the department you want to search in \n All Departments \n Cyber Monday Deals Week \n Alexa Skills \n Amazon Devices \n Amazon Video \n Amazon Warehouse Deals \n Appliances \n Apps & Games \n Arts, Crafts & Sewing \n Automotive Parts & Accessories \n Baby \n Beauty & Personal Care \n Books \n CDs & Vinyl \n Cell Phones & Accessories \n Clothing, Shoes & Jewelry \n    Women \n    Men \n    Girls \n    Boys \n    Baby \n Collectibles & Fine Art \n Computers \n Courses \n Credit and Payment Cards \n Digital Music \n Electronics \n Garden & Outdoor \n Gift Cards \n Grocery & Gourmet Food \n Handmade \n Health, Household & Baby Care \n Home & Business Services \n Home & Kitchen \n Industrial & Scientific \n Kindle Store \n Luggage & Travel Gear \n Luxury Beauty \n Magazine Subscriptions \n Movies & TV \n Musical Instruments \n Office Products \n Pet Supplies \n Prime Exclusive Savings \n Prime Pantry \n Software \n Sports & Outdoors \n Tools & Home Improvement \n Toys & Games \n Vehicles \n Video Games \n Wine \n Go \n          Search\n Departments \n EN \n  \n Hello. Sign in Account & Lists Sign in Account & Lists Orders Try Prime Cart \n Your Amazon.com Cyber Monday Deals Week Gift Cards Registry Sell Help Disability Customer Support  \n Movies & TV   New Releases   Best Sellers   Deals   Blu-ray   TV Shows   Kids & Family   Anime   All Genres   Amazon Video   Prime Video   Your Video Library   Trade-In \n                Movies & TV\n             ›\n                Genre for Featured Categories\n             ›\n                 Horror\n Share \n Facebook \n Twitter \n Pinterest \n Buy New \n $11.77 \n Qty: \n 1\n 2\n 3\n 4\n 5\n 6\n 7\n 8\n 9\n 10\n 11\n 12\n 13\n 14\n 15\n 16\n 17\n 18\n 19\n 20\n 21\n 22\n 23\n 24\n 25\n 26\n 27\n 28\n 29\n 30\n Qty: 1 \n Free Shipping for Prime Members \n FREE Shipping \n   Get free shipping \n Free 5-8 business-day shipping  within the U.S. when you order $25 of eligible items sold or fulfilled by Amazon. \n Or get 4-5 business-day shipping on this item for $4.98. (Prices may vary for AK and HI.) \n Learn more about free shipping \n on orders over $25—or get  FREE Two-Day Shipping  with  Amazon Prime \n            In Stock.\n        Sold by  Mediaflix  and  Fulfilled by Amazon .\n            Gift-wrap available.\n Fulfillment by Amazon (FBA) is a service we offer sellers that lets them store their products in Amazon's fulfillment centers, and we directly pack, ship, and provide customer service for these products. Something we hope you'll especially enjoy:  FBA items qualify for FREE Shipping and Amazon Prime. \n If you're a seller, Fulfillment by Amazon can help you increase your sales. We invite you to  \n    learn more about Fulfillment by Amazon\n   . \n                    Apartment 1303\r\n                    has been added to your Cart\r\n Add to Cart \n Turn on 1-Click ordering for this browser \n                    Ship to:\n                            Select a shipping address:\n                        To see addresses, please\n                        Sign in\n or \n                        Use this location:\n                                Update\n                                Please enter a valid US zip code.\n                            Please enter a valid US zip code.\n                            Shipping to a APO/FPO/DPO? Please add the address to your address book. Make sure you include the unit and box numbers (if assigned).\n or \n Other Sellers on Amazon \n Add to Cart \n                    $11.77\n &  FREE Shipping  on eligible orders.  Details \n            Sold by:\n            muboutletstore\n Have one to sell? \n            Sell on Amazon\n Image Unavailable \n                Image not available for Color:\n            Sorry, this item is not available in\n            Image not available\n        To view this video download \n            Flash Player\n                \n                        Apartment 1303\n               DVD\n Mischa Barton \n (Actor),  \n Rebecca De Mornay \n (Actor),  \n Michele Taverna \n (Director) \n & \n                  0 \n                 more \n Rated:  \n R \n 1.8 out of 5 stars \n 553 customer reviews \n Prime Video   \n  Stream $0.00 with Prime\n Amazon Video   \n Stream \n              $2.99 — $9.99\n Blu-ray   \n        from $19.46\n DVD   \n      $11.77\n  Additional DVD options \n            Edition\n            Discs\n                     Price\n              New from\n              Used from\n DVD \n \"Please retry\" \n                    —\n                    —\n                                 —\n $6.73 \n $9.98 \n DVD \n (Sep 24, 2013) \n \"Please retry\" \n                    —\n 1 \n $11.77  \n $7.99 \n $1.60 \n DVD \n \"Please retry\" \n                    —\n                    —\n                                 —\n $27.99 \n                            —\n DVD \n \"Please retry\" \n                    —\n                    —\n                                 —\n $36.60 \n                            —\n DVD \n \"Please retry\" \n                    —\n                    —\n                                 —\n $37.86 \n                            —\n See More \n Watch Instantly with \n              Rent\n              Buy\n Apartment 1303 \n $2.99 \n $9.99 \n Unlimited Streaming with Amazon Prime \nStart your 30-day free trial to stream thousands of movies & TV shows included with Prime.\n Start your free trial \n Add to Cart \n        Apartment 1303\n        $11.77\n Free Shipping for Prime Members \n FREE Shipping \n   Get free shipping \n Free 5-8 business-day shipping  within the U.S. when you order $25 of eligible items sold or fulfilled by Amazon. \n Or get 4-5 business-day shipping on this item for $4.98. (Prices may vary for AK and HI.) \n Learn more about free shipping \n on orders over $25—or get  FREE Two-Day Shipping  with  Amazon Prime \n                In Stock.\n            Sold by  Mediaflix  and  Fulfilled by Amazon .\n            Gift-wrap available.\n Fulfillment by Amazon (FBA) is a service we offer sellers that lets them store their products in Amazon's fulfillment centers, and we directly pack, ship, and provide customer service for these products. Something we hope you'll especially enjoy:  FBA items qualify for FREE Shipping and Amazon Prime. \n If you're a seller, Fulfillment by Amazon can help you increase your sales. We invite you to  \n    learn more about Fulfillment by Amazon\n   . \n Frequently bought together \n + + \n Total price:  $33.75 \n Add all three to Cart \n Add all three to List \n Some of these items ship sooner than the others.   Show details \n Buy the selected items together This item: Apartment 1303  by Mischa Barton  DVD   $11.77   In Stock. Sold by muboutletstore and ships from Amazon Fulfillment. FREE Shipping on orders over  $25 .  Details Walled In  by Tim Allen  DVD   $10.99   Only 1 left in stock - order soon. Sold by mithrilenterprises and ships from Amazon Fulfillment. FREE Shipping on orders over  $25 .  Details Homecoming  by Mischa Barton  DVD   $10.99   Only 4 left in stock - order soon. Sold by Mediaflix and ships from Amazon Fulfillment. FREE Shipping on orders over  $25 .  Details \n Customers who bought this item also bought Page  1  of  1   Start over Page 1 of 1   \n This shopping feature will continue to load items. In order to navigate out of this carousel please use your heading shortcut key to navigate to the next or previous heading. \n Back \n            Walled In\n Tim Allen \n 3.4 out of 5 stars \n 36 \n DVD $10.99   Prime \n            Homecoming\n Mischa Barton \n 3.6 out of 5 stars \n 108 \n DVD $10.99   Prime \n            Pulse 3 Pack\n 3.7 out of 5 stars \n 42 \n DVD $6.29   Prime \n            Orphan\n Vera Farmiga \n 4.4 out of 5 stars \n 702 \n DVD $10.95   Prime \n            Richard Simmons: Boogie Down the Pounds\n Richard Simmons \n 4.2 out of 5 stars \n 114 \n DVD $17.85   Prime \n            Unrest (After Dark Horrorfest)\n Corri English \n 3.3 out of 5 stars \n 163 \n DVD $9.99   Prime \n Next \n Special offers and product promotions \n Your cost could be $0.00 instead of $11.77 ! Get a  $50 Amazon.com Gift Card  instantly upon approval for the  Amazon Rewards Visa Card \n                Apply now\n                    Editorial Reviews\n Janet leaves her troubled home for a high-rise apartment, despite warnings about the apartments dark and haunted reputation. Soon after moving in, Janet inexplicably dies, falling out the window of her thirteenth story apartment. Her sister Lana (Mischa Barton) moves in to the apartment, determined to reveal the truth behind her siblings bizarre death. What Lana finds is far more frightening and unexplainable than she had thought possible. Before she knows it, Lana gets pulled into a cycle of supernatural horror as she struggles to escape the apartment before she becomes its next victim.\n Product details \n   Actors:   Mischa Barton ,  Rebecca De Mornay ,  Julianne Michelle ,  Corey Sevier ,  John Diehl \n   Directors:   Michele Taverna \n   Format:  Closed-captioned, Color, Dolby, NTSC, Surround Sound, Widescreen \n Language:  English \n   Region:  Region 1 ( U.S. and Canada only.  Read more about  DVD formats. ) \n   Number of discs:  1 \n   Rated:    \n                R\n        Restricted  \n   Studio:  Phase 4 Films \n   DVD Release Date:  September 24, 2013 \n   Run Time:  101 minutes \n Average Customer Review: \n 1.8 out of 5 stars \n      553 customer reviews\n ASIN:  B00DPH7Q8O \n Amazon Best Sellers Rank:  \n#142,139 in Movies & TV ( See Top 100 in Movies & TV )\n #6297 \n in  Movies & TV  >  DVD  >  Horror \n #13399 \n in  Movies & TV  >  DVD  >  Mystery & Thrillers \nWould you like to  tell us about a lower price ? If you are a seller for this product, would you like to  suggest updates through seller support ? \n Customer reviews 1.8 out of 5 stars 553 1.8 out of 5 stars 5 star 4% 4 star 7% 3 star 10% 2 star 17% 1 star 62% Share your thoughts with other customers Write a customer review See all 553 customer reviews Top customer reviews There was a problem filtering reviews right now. Please try again later. 1.0 out of 5 stars Quite possibly my winner of #1 horrible movie - BEWARE By Island Girl7777 on June 21, 2013 Format: Amazon Video | Verified Purchase No spoiler alert only because this movie makes absolutely no sense & what's worse, the acting (not actors) or their dialogue is hidious.  I'm in to the movie about 20 minutes and I'm regretting my selection and considering ending the (my) torture but no, I continue to watch hoping against all hope that it will improve but it doesn't.  In fact, it continues the descent into what I've only seen a handful of times in my life - oh the agony, the utter and complete pain.  Let this review be your WARNING: Go to your next selection - don't waste your time here.  The story sucks, the acting sucks worse and the ghosts are absurd, horrible.  Please whoever you are please don't ever try to make a movie again. Read more 0 Comment | \n      147 people found this helpful.\n  Was this review helpful to you? Yes No Report abuse 1.0 out of 5 stars And I paid $9.99 to see this??? By Vicky on June 24, 2013 Format: Amazon Video | Verified Purchase Wow, this for sure makes my top 10 list of all time lame movies!!  I was trying to figure out if it was the acting that was terrible or the screen writing because I guess an actor can't deliver a good line if there wasn't one in the script!  I felt almost embarrassed for this cast who tried to pull it off, especially Rebecca De Mornay, who is a normally a decent actress.  Her role was almost ridiculous and she seemed so ill-fit for that role.  I think probably the most ridiculous scene was Mischa (terrible in this role, btw) walking out in a tiny towel from a bath to find the creepy building manager who had let himself into her apartment just sitting there. She demands that he leaves, he doesn't and she says \"I need some water\". Right, a creepy could-be rapist in your place while you're in 1 yard of material and you need a glass of water??  That scene was almost painful to watch. But worse than the acting was the plot, which was flat and anticlimactic. I kept waiting for all of the mysteries to unfold and when the movie was over I was like \"Wait, is there more, this can't possibly be the ending can it??\"  SO stupid! And finally, in terms of horror flicks, or whatever this movie was trying to be, there are only so many scenes of a creepy girl standing in the corner or a creepy girl in the mirror.  They did that scene to death in this movie. I mean normally even in a great movie that scene does not evoke any fear, it's just a person standing in the corner, big deal, but in this movie it was like \"Oh look there is the ghost in the corner, and now look there she is standing there trying to look evil, and look now she's sitting on the railing oh and look, there she is in the mirror and then oh look, there she is in the corner again.\"  The point of a ghost, in my opinion, if to know of its presence, not have it visible in every scene. Bottom line, don't waste even a dime to watch this movie and if you can get it for free then just don't waste your time. Read more 0 Comment | \n      59 people found this helpful.\n  Was this review helpful to you? Yes No Report abuse 1.0 out of 5 stars What a stinker! By Dr. J.L. Kuchta on October 30, 2013 Format: Amazon Video | Verified Purchase I love horror films, whether they are Slashers, psychological, suspense, monster, zombie, or what ever else Hollywood comes up with. I love the old ones, the new ones the grade A, B or C ones. This was NOT a horror flick. This stunk. I wanted to like it, really I did. After all it's about my hometown and birth place, Detroit. But I found nothing, absolutely nothing, to like about this film. I gave it one star because I couldn't give it zero stars. If you're looking for a good scary film, skip this one. Watch \"Night of the Living Dead\" again and count yourself lucky! Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 1.0 out of 5 stars Awful By Leia Strand on August 20, 2013 Format: Amazon Video | Verified Purchase There were 5 of us seated to watch this movie. 30 minutes into the movie there were 2 of us left and 15 minutes later, we turned it off, wishing for the past 45 minutes of our lives back. The $6.99 was a waste of money along with the time! By far, one of the worst movies I've seen. Read more 0 Comment | \n      6 people found this helpful.\n  Was this review helpful to you? Yes No Report abuse 2.0 out of 5 stars Oh no you didn't! By Fern Staton on July 21, 2013 Format: Amazon Video | Verified Purchase I love a good scary movie and can tolerate a \"b\" scary movie but this movie, despite having paid nearly $10 to rent it, was beyond garbage. I'm sorry, but most of the acting was sub-standard: that boozy mom with her acoustic guitar swinging around in front of her: that \"What is that horrible smell\" question asked and answered over and over...I finally shut it off. I lied to my husband and told him it was a free download just because he would have killed me and put me in a closet like the victim in the movie if he knew I'd paid that much to rent it. Thank God I didn't buy it! It would have ended up in my garden, hanging from a string and scaring off birds, which is better than what it did for me. Scared? Hell no. Bored? You bet. Read more 0 Comment | \n      One person found this helpful.\n  Was this review helpful to you? Yes No Report abuse 1.0 out of 5 stars Don't be fooled like me By Kindle Customer on July 25, 2013 Format: Amazon Video | Verified Purchase This movie is ........  Fill in whatever word you want that describes awful.  I am unemployed, and think I have found my next job.  Screenwriter.  If this sells in Hollywood, I will never be out of work again.  The best part about this movie is that it is less than two hours long.  I am most grateful that I did not go to a theater to see this garbage. Nothing about this was mysterious, or remotely scarey. Amazon should give me a refund or a credit for watching this.  I feel cheated! Don't ever do this again please. On the positive side, if you buy the DVD, you can give it to that pesty neighbor or family member that always likes to borrow your movies and never returns them. There is a use for everything! Read more 0 Comment | \n      One person found this helpful.\n  Was this review helpful to you? Yes No Report abuse 1.0 out of 5 stars The worst movie I have seen this year. By Skuttle Bucket on November 15, 2013 Format: Amazon Video | Verified Purchase Holy cow! This has got to be the worst film ever created. I have seen some bad horror, but at least they were so bad that you could have a laugh. Nope- not with this one. The acting was incredibly shallow, no depth to the characters whatsoever.It is so terribly scripted that I have to wonder what idiot thought this would be a  brilliant idea to release it. I will look that up later just to put him (them) on my list of movies to AVOID. I only bothered to leave it streaming because I was to busy working on my art to give a damn. I actually stopped painting for a moment just to stop the ignorance echoing into my ear, then I scrolled to the end to see how badly it would finish off, and YUP- It sure was 100% crap from beginning to end. Fortunately I was smart enough to wait until it was free on Prime. Read more 0 Comment | Was this review helpful to you? Yes No Report abuse See all 553 reviews Write a customer review \n Customer images \n See all customer images \n Most recent customer reviews 5.0 out of 5 stars Five Stars Love The Movie it came on time and it works great \n Published 10 days ago by Marion Adams 1.0 out of 5 stars Awful, just awful. No redeeming qualities. Awful, just awful.  No redeeming qualities. \n Published 3 months ago by Kristina White 5.0 out of 5 stars Five Stars Good movie \n Published 5 months ago by Amazon Customer 5.0 out of 5 stars Five Stars Love this movie \n Published 10 months ago by Diana Rivera 3.0 out of 5 stars ... same name and since it's release has had infamously bad reviews. Not a great movie by any definition ... Apartment 1303 (2012) is a remake of a Japanese horror movie of the same name and since it's release has had infamously bad reviews. Read more \n Published 1 year ago by Adamo 4.0 out of 5 stars watch this good rainy saturday movie \n Published 1 year ago by miss bonnie 3.0 out of 5 stars Its not that bad I actually watched this a while back.  I've seen way worse so I didnt actually think it was that terrible.  I wont be rewatching it though! \n Published 1 year ago by Metro 1.0 out of 5 stars Crap, Crap and more Crap. No redeeming qualities AT ALL!!! WTF, this movie is so terrible, I am writing the review so others don't have to bother. Honestly, the acting is so bad, omG. What is Rebecca DeMorn...whatever doing in this. Read more \n Published 1 year ago by jennifer m hock 1.0 out of 5 stars Horrible, Horrible, Horrible..And More Horrible! I watched this about a year ago on Netflix, a few years after watching the original Japanese version of the movie, which isn't a great movie itself, but I liked it. Read more \n Published on November 18, 2015 by Amazon Customer 1.0 out of 5 stars There is NOTHING good about this movie There are NO redeeming qualities to this \"film\".  The acting is horrible, made worse by awkwardly written dialogue and a nonsensical plot. Read more \n Published on November 3, 2015 by Gen M. Search customer reviews Search \n What other items do customers buy after viewing this item? \n Apartment 1303 \n DVD \n Naoko Otani \n 2.8 out of 5 stars \n 13 \n $10.70   Prime \n Homecoming \n DVD \n Mischa Barton \n 3.6 out of 5 stars \n 108 \n $10.99   Prime \n There's a problem loading this menu right now. \n Learn more about Amazon Prime. \n  Get fast, free shipping with Amazon Prime  \n  Prime members enjoy FREE Two-Day Shipping and exclusive access to music, movies, TV shows, original audio series, and Kindle books.  \n      >\n       Get started \n Back to top \n Get to Know Us Careers About Amazon Investor Relations Amazon Devices Make Money with Us Sell on Amazon Sell Your Services on Amazon Sell on Amazon Business Sell Your Apps on Amazon Become an Affiliate Advertise Your Products Self-Publish with Us Become an Amazon Vendor › See all Amazon Payment Products Amazon Rewards Visa Signature Cards Amazon.com Store Card Amazon.com Corporate Credit Line Shop with Points Credit Card Marketplace Reload Your Balance Amazon Currency Converter Let Us Help You Your Account Your Orders Shipping Rates & Policies Amazon Prime Returns & Replacements Manage Your Content and Devices Amazon Assistant Help \n English \n United States \n Amazon Music   Stream millions  of songs \n Amazon Drive   Cloud storage  from Amazon \n 6pm   Score deals  on fashion brands \n AbeBooks   Books, art  & collectibles \n ACX    Audiobook Publishing  Made Easy \n Alexa   Actionable Analytics  for the Web \n Amazon Business   Everything For  Your Business \n   \n AmazonFresh   Groceries & More  Right To Your Door \n AmazonGlobal   Ship Orders  Internationally \n Home Services   Handpicked Pros  Happiness Guarantee \n Amazon Inspire   Digital Educational   Resources \n Amazon Rapids   Fun stories for   kids on the go \n Amazon Restaurants   Food delivery from  local restaurants \n Amazon Video Direct   Video Distribution  Made Easy \n   \n Amazon Web Services   Scalable Cloud  Computing Services \n Audible   Download  Audio Books \n AudiobookStand   Discount Audiobooks  on Disc \n Book Depository   Books With Free  Delivery Worldwide \n Box Office Mojo   Find Movie  Box Office Data \n ComiXology   Thousands of  Digital Comics \n CreateSpace   Indie Print Publishing  Made Easy \n   \n DPReview   Digital  Photography \n East Dane   Designer Men's  Fashion \n Fabric   Sewing, Quilting  & Knitting \n Goodreads   Book reviews  & recommendations \n IMDb   Movies, TV  & Celebrities \n IMDbPro   Get Info Entertainment  Professionals Need \n Junglee.com   Shop Online  in India \n   \n Kindle Direct Publishing   Indie Digital Publishing  Made Easy\n Prime Now   FREE 2-Hour Delivery  on Everyday Items \n Prime Photos   Unlimited Photo Storage  Free With Prime \n Shopbop   Designer  Fashion Brands \n TenMarks.com   Math Activities  for Kids & Schools \n Warehouse Deals   Open-Box  Discounts \n Whispercast   Discover & Distribute  Digital Content\n   \n Whole Foods Market   America’s Healthiest  Grocery Store \n Withoutabox   Submit to  Film Festivals \n Woot!   Deals and   Shenanigans \n Zappos   Shoes &  Clothing \n Souq.com   Shop Online in  the Middle East \n Subscribe with Amazon   Discover & try  subscription services \n   \n Conditions of Use Privacy Notice Interest-Based Ads © 1996-2017, Amazon.com, Inc. or its affiliates"}