{"url": "http://www.osc.gov.on.ca/en/30336.htm", "content": "Form 52-109F2 - For periods relating to financial years beginning on or after January 1, 2011 \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   Securities Law & Instruments   /   Electronic Filing   /   Reporting Issuer and Issuer Forms   /   Form 52-109F2 - For periods relating to financial years beginning on or after January 1, 2011 \n   Section Menu \n Form 52-109F2 - Certification of Interim Filings Full Certificate \nFor periods relating to financial years beginning  on or after  January 1, 2011 \n Helpful tips on completing this form for submission to SEDAR \n            This form is being provided to you for your convenience in HTML only. Please follow the steps below when completing this form.  \n Step #1 \n            Copy the text of the form between the two lines provided. \n Step #2 \n            Paste the text of the form into your word processing software.  \n            Step #3 \n            Complete the form. Once the form has been completed you may want to save a copy for your records before submission. \n Step #4 \n            Once the form has been completed and is ready for submission to SEDAR, SEDAR requires the form to be converted into an \"Acceptable Electronic Format\". To achieve this the completed form must be converted into .pdf format using Adobe Acrobat. Please refer to the  SEDAR Filer Manual  (Chapter 7 - Preparation of Documents for Electronic Filing) before submission to complete this process.  \n Start to copy after the line provided below   \n FORM 52-109F2 \nCERTIFICATION OF INTERIM FILINGS \nFULL CERTIFICATE \nI,  < identify (i) the certifying officer, (ii) his or her position at the issuer, (iii) the name of the issuer and (iv) if the certifying officer’s title is not “chief executive officer” or “chief financial officer”, indicate in which of these capacities the certifying officer is providing the certificate > , certify the following: \n1.  Review:  I have reviewed the interim financial report and interim MD&A (together, the “interim filings”) of  < identify issuer >  (the “issuer”) for the interim period ended  < state the relevant date > . \n2.  No misrepresentations:  Based on my knowledge, having exercised reasonable diligence, the interim filings do not contain any untrue statement of a material fact or omit to state a material fact required to be stated or that is necessary to make a statement not misleading in light of the circumstances under which it was made, with respect to the period covered by the interim filings. \n3.  Fair presentation:  Based on my knowledge, having exercised reasonable diligence, the interim financial report together with the other financial information included in the interim filings fairly present in all material respects the financial condition, financial performance and cash flows of the issuer, as of the date of and for the periods presented in the interim filings.  \n4.  Responsibility:  The issuer’s other certifying officer(s) and I are responsible for establishing and maintaining disclosure controls and procedures (DC&P) and internal control over financial reporting (ICFR), as those terms are defined in National Instrument 52-109  Certification of Disclosure in Issuers’ Annual and Interim Filings , for the issuer. \n5.  Design:  Subject to the limitations, if any, described in paragraphs 5.2 and 5.3, the issuer’s other certifying officer(s) and I have, as at the end of the period covered by the interim filings \n designed DC&P, or caused it to be designed under our supervision, to provide reasonable assurance that \n material information relating to the issuer is made known to us by others, particularly during the period in which the interim filings are being prepared; and \n information required to be disclosed by the issuer in its annual filings, interim filings or other reports filed or submitted by it under securities legislation is recorded, processed, summarized and reported within the time periods specified in securities legislation; and \n designed ICFR, or caused it to be designed under our supervision, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with the issuer’s GAAP. \n5.1  Control framework:  The control framework the issuer’s other certifying officer(s) and I used to design the issuer’s ICFR is  < insert the name of the control framework used > . \n < insert paragraph 5.2  or 5.3 if applicable.  If paragraph 5.2 or 5.3 is not applicable, insert “5.2  N/A” or “5.3  N/A” as applicable.  For paragraph 5.3, include (a)(i), (a)(ii) or (a)(iii) as applicable, and subparagraph (b). > \n5.2  ICFR – material weakness relating to design: The issuer has disclosed in its interim MD&A for each material weakness relating to design existing at the end of the interim period \n a description of the material weakness;  \n the impact of the material weakness on the issuer’s financial reporting and its ICFR; and \n the issuer’s current plans, if any, or any actions already undertaken, for remediating the material weakness. \n5.3  Limitation on scope of design:  The issuer has disclosed in its interim MD&A \n the fact that the issuer’s other certifying officer(s) and I have limited the scope of our design of DC&P and ICFR to exclude controls, policies and procedures of  \n a proportionately consolidated entity in which the issuer has an interest;  \n a special purpose entity in which the issuer has an interest; or \n a business that the issuer acquired not more than 365 days before the last day of the period covered by the interim filings; and  \n summary financial information about the proportionately consolidated entity, special purpose entity or business that the issuer acquired that has been proportionately consolidated or consolidated in the issuer’s financial statements.  \n6.  Reporting changes in ICFR:  The issuer has disclosed in its interim MD&A any change in the issuer’s ICFR that occurred during the period beginning on  < insert the date immediately following the end of the period in respect of which the issuer made its most recent interim or annual filing, as applicable >  and ended on  < insert the last day of the period covered by the interim filings >  that has materially affected, or is reasonably likely to materially affect, the issuer’s ICFR.  \nDate:  < insert date of filing > \n_______________________ \n[Signature] \n[Title]  \n < If the certifying officer’s title is not “chief executive officer” or “chief financial officer”, indicate in which of these capacities the certifying officer is providing the certificate. >   \n Stop copying before the line provided below   \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}