{"url": "https://en.wikipedia.org/wiki/Wikipedia:Citation_needed", "content": "Wikipedia:Citation needed - Wikipedia \n Wikipedia:Citation needed   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This is an  information page . \n It describes the editing community's established practice on some aspect or aspects of  Wikipedia:Verifiability  policy . It is not one of  Wikipedia's policies or guidelines , as it has not been  thoroughly vetted by the community . \n Shortcut \n WP:CITENEED \n A complete version of the documentation for this template is provided at  Template:Citation needed . \nThe {{ Citation needed }} template aims to promote  accountable  discourse. \n To ensure that all Wikipedia content is  verifiable , anyone may question an  uncited claim  by inserting a simple  {{ Citation needed }}  tag, or by using a more comprehensive  {{Citation needed|reason= Your explanation here |date=November 2017}}  clause. \n Example:  87% of statistics are made up on the spot. [ citation needed ] \n \"Citation needed\" statements are part of Wikipedia's backlog of outstanding problems. Currently there are 330,637 articles with \"Citation needed\" statements. You can  help reduce the backlog ! \n Contents \n 1   When and how to use this tag responsibly \n 2   When not to use this tag \n 3   If your work has been tagged \n 4   How to help reduce the backlog \n 5   See also \n 6   External links \n When and how to use this tag responsibly \n A \"citation needed\" tag is a request for another editor to  verify a statement : a form of communication between members of a collaborative editing community. It is never, in itself, an \"improvement\" of an article. Though readers may be alerted by a \"citation needed\" that a particular statement is not supported, many readers don't fully understand the community's processes. Not all tags get addressed in a timely manner, staying in place for months or years, forming an ever  growing Wikipedia backlog —this itself can be a problem. Best practice recommends the following: \n Tag thoughtfully.  Avoid \"hit-and-run\" or pointed tagging . Try to be courteous and consider the hypothetical fellow-editor who will, hopefully, notice your tag and try to find the citation you have requested. When adding a tag, ask yourself: Is it clear just what information you want cited? Is the information probably factual? (If it is not, then it needs deletion or correction rather than citation!) Is the knowledge so  self-evident  that it really does not need to be cited at all? (Some things do not.) \n Some tags are inserted by people well placed to find a suitable citation themselves. If this is the case, consider adding these articles to  your watchlist  so that you can advise on the changes or revisit the article when you have the opportunity to fix the  verifiability problems  yourself. \n When not to use this tag \n Before adding a tag, at least consider the following alternatives, one of which may prove much more constructive: \n Do not use this tag because you  don't understand a statement , or feel that  \"non-expert\" readers are likely to be confused . Use {{ Clarify }}, {{ Explain }}, {{ Confusing }}, {{ Examples }}, {{ Why }} or {{ Non sequitur }}, as appropriate, instead. \n If the content is nonsense or is unlikely to be true.  Be bold and delete it ! \n Do not tag controversial, poorly sourced claims about living people.  Remove them immediately! \n If you are sure the statement you want to tag is not factual, even if it does not come under either of the preceding headings, it may still be appropriate to simply remove the text (delete it!). Be sure to add a suitable edit summary such as \"Very doubtful – please add a citation if you return the content\". If the original statement was accurate after all, this gives someone the chance to put it back, hopefully with a proper citation this time. \n If a statement sounds plausible, and is consistent with other statements in the article, but you doubt that it is totally accurate, then consider making a reasonable effort to find a reference yourself. In the process, you may end up confirming that the statement needs to be edited or deleted to better reflect the best knowledge about the topic. \n If an article, or a section within an article, is under-referenced, then consider adding an {{ Unreferenced }}, {{ Refimprove }}, or {{ Unreferenced section }} tag to the article or section concerned -- these tags allow you to indicate more systemic problems to the page. \n A reference at the end of a paragraph typically refers to the whole paragraph, and similarly a reference at the end of a sentence may almost always be taken as referring to the whole sentence. If a particular part of a sentence or paragraph seems to require a separate citation, or looks as if it may have been inserted into the text at a sentence or paragraph level, try to check the original reference rather than adding tags to text that may already be well referenced. The extra parameters available in the {{ Citation needed span }} template may allow you to indicate which section you want to refer. \n Do not insert a \"Citation needed\" tag to  make a point, to \"pay back\" another editor, or because you \"don't like\" a subject, a particular article, or another editor . \n If your work has been tagged \n If you can provide a  reliable source  for the claim, then please add it! If you are not sure how to do this, then  give it your best try  and  replace  the \"Citation needed\" template with enough information to locate the source. You may leave the  copyediting  or  Wikifying  to someone else, or learn more about  citing sources on Wikipedia .  This beginners referencing guide for Wikipedia  provides a brief introduction on how to reference Wikipedia articles. \n If someone tagged your contributions with a \"Citation needed\" tag or tags, and you disagree, discuss the matter on the article's  discussion page . The most constructive thing to do in most cases is probably to supply the reference(s) requested, even if you feel the tags are \"overdone\" or unnecessary. \n How to help reduce the backlog \n At the moment, there are over 330,637 articles with \"Citation needed\" statements. You can browse the whole list of these articles at  Category:All articles with unsourced statements . \n Frequently the authors of statements do not return to Wikipedia to support the statement with citations, so other Wikipedia editors have to do work checking those statements. With 330,637 statements that need  WP:Verification , sometimes it's hard to choose which article to work on. The tool  Citation Hunt  makes that easier by suggesting random articles, which you can sort by topical category membership. \n I can help! Give me a random citation to find! \n See also \n Template:Citation needed \n Template:Citation needed span \n Template:Verify source \n Template:Unreferenced  for an article (rather than an individual statement) which does not cite any references or sources. \n Template:Refimprove  for an article (rather than an individual statement) that has some citations, but not enough. \n Template messages – Sources of articles \n Inline verifiability and sources cleanup templates \n Wikipedia:Verification methods  – listing examples of the most common ways that citations are used in Wikipedia articles \n Wikipedia:Citing sources/Example edits for different methods  – showing comparative edit mode representations for different citation methods and techniques. \n Wikipedia:Citation templates  – a full listing of various styles for citing all sorts of materials \n Category:All articles with unsourced statements  - list of all pages with {{ citation needed }} \n External links \n  Media related to  Citation needed  at Wikimedia Commons \n v \n t \n e \n Inline cleanup tags \n Attribution \n {{ According to whom }} \n {{ Attribution needed }} \n {{ By whom }} \n {{ From whom? }} \n {{ Like whom? }} \n {{ To whom? }} \n {{ Who }} \n Clarity \n {{ Ambiguous }} \n {{ Clarify }} \n {{ Clarify span }} \n {{ Clarify timeframe }} \n {{ Context inline }} \n {{ Expand acronym }} \n {{ Incomprehensible inline }} \n {{ Non sequitur }} \n {{ Which one }} \n Precision \n {{ By how much }} \n {{ Definition }} \n {{ Definition needed }} \n {{ Explain }} \n {{ Example needed }} \n {{ Examples }} \n {{ How }} \n {{ Quantify }} \n {{ Specify }} \n {{ Vague }} \n {{ When }} \n {{ Where }} \n {{ Which }} \n {{ Why }} \n {{ Year needed }} \n Excessive \n {{ Duplication span }} \n {{ Importance inline }} \n {{ Relevance inline }} \n {{ Undue weight inline }} \n Miscellaneous \n {{ Chinese script needed inline }} \n {{ Disambiguation needed }} \n {{ Original research inline }} \n {{ Pronunciation needed }} \n {{ Siadn }} \n {{ Synthesis inline }} \n Neutrality \n {{ Lopsided }} \n {{ Peacock term }} \n {{ POV statement }} \n {{ Weasel inline }} \n {{ Weasel word some span }} \n Time-sensitivity \n {{ Clarify timeframe }} \n {{ Update after }} \n {{ Update inline }} \n {{ Anachronism inline }} \n Verifiability \n Dubious \n {{ Contradict-inline }} \n {{ Disputed inline }} \n {{ Dubious }} \n {{ Dubious span }} \n {{ Inconsistent }} \n Missing or \nproblematic \nreference \n {{ Better source }} \n {{ Citation needed }} \n {{ Citation needed lead }} \n {{ Citation needed span }} \n {{ Additional citation needed }} \n {{ Citation not found }} \n {{ Cite quote }} \n {{ Failed verification }} \n {{ Failed verification span }} \n {{ Irrelevant citation }} \n {{ Nonspecific }} \n {{ Excessive citations inline }} \n {{ Primary source inline }} \n {{ Request quotation }} \n {{ Retracted }} \n {{ Self-published inline }} \n {{ Third-party inline }} \n {{ Unreliable source? }} \n {{ Verify quote }} \n {{ Verify source }} \n Incomplete \nor broken \ncitation \n {{ Author incomplete }} \n {{ Author missing }} \n {{ Bare URL inline }} \n {{ Date missing }} \n {{ Dead link }} \n {{ Edition needed }} \n {{ Episode needed }} \n {{ Full citation needed }} \n {{ Incomplete short citation }} \n {{ ISBN missing }} \n {{ Page needed }} \n {{ Place missing }} \n {{ Publisher missing }} \n {{ Season needed }} \n {{ Time needed }} \n {{ Title incomplete }} \n {{ Title missing }} \n {{ Volume needed }} \n {{ Year missing }} \n Wording \n {{ Awkward }} \n {{ Copy edit inline }} \n {{ Buzzword inline }} \n {{ Technical statement }} \n   Inline cleanup templates \n   WikiProject Inline Templates \n v \n t \n e \n Wikipedia referencing \n Policies and guidelines \n Verifiability \n Biographies of living persons \n Identifying reliable sources \n Medicine \n Citing sources \n Scientific citations \n General advice \n Citation needed \n Find sources \n Combining sources \n Offline sources \n Referencing styles \n Citing sources \n Citation Style 1 \n Citation Style 2 \n Citation Style Vancouver \n LSA \n Comics \n Citation templates \n Reflist template \n Inline citations \n Footnotes \n Parenthetical referencing \n Punctuation and footnotes \n Shortened footnotes \n Nesting footnotes \n Help for beginners \n Reference-tags \n Citations quick reference \n Introduction to referencing \n Referencing with citation templates \n Referencing without using templates \n Referencing dos and don'ts \n Citing Wikipedia \n Advanced help \n Cite link labels \n Citation tools \n Cite errors \n Cite messages \n Converting between references formats \n Reference display customization \n References and page numbers \n Template documentation \n {{ Edit refs }} \n {{ Refref }} \n {{ Refref2 }} \n {{ Refstart }} \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Wikipedia:Citation_needed&oldid=808195654 \"\t\t\t\t\t \n Categories :  Wikipedia information pages Wikipedia backlog Citation and verifiability maintenance templates Wikipedia basic information Wikipedia quick introductions Hidden categories:  Wikipedia semi-protected project pages Wikipedia move-protected project pages   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Project page Talk   \n Variants \n Views \n Read View source View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikiversity   \n Languages \n Ænglisc العربية অসমীয়া বাংলা भोजपुरी Cymraeg Deutsch فارسی Français Galego ગુજરાતી हिन्दी Ilokano ລາວ Lëtzebuergesch Македонски മലയാളം မြန်မာဘာသာ Nederlands 日本語 Norsk ଓଡ଼ିଆ پښتو ភាសាខ្មែរ Scots Shqip සිංහල سنڌي தமிழ் ไทย اردو 中文   \n Edit links   \n  This page was last edited on 1 November 2017, at 13:15. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}