{"url": "http://www.osc.gov.on.ca/en/Dealers_forms_index.htm", "content": "Forms and Documents \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   Industry   /   Dealers, Advisers and Investment Fund Managers   /   Forms and Documents \n Industry \n Hide Section Menu   × \n Companies \n Selling Securities \n Prospectus Offerings \n Private Placements \n Fees \n Asking for Relief \n Exemptive Relief Applications \n Pre-Filings \n Fees \n Ongoing Disclosure \n Continuous Disclosure \n Insider Reporting \n Fees \n Take-Over Bids, Issuer Bids, Special Transactions and Early Warning \n Filing Documents Electronically \n SEDAR \n SEDI \n OSC Electronic Filing Portal \n Information for Small and Medium Enterprises \n Calendar of Upcoming Seminars \n Information on IFRS \n Dealers, Advisers and Investment Fund Managers \n Who Needs to Register \n Getting Registered \n Registration Categories \n Initial Requirements \n Applying \n Review and Approval \n OSC Registrant Search \n Ongoing Requirements \n Compliance System \n Business Conduct Requirements \n Financial Requirements \n Updating Information \n OSC Compliance Reviews \n If Your Firm is Selected for Review \n If Your Firm is not in Compliance \n OSC Compliance Reports, Staff Notices & E-mail blasts \n Changes to Registration \n Changing Categories or Jurisdictions \n Transferring to Another Firm \n Suspending and Revoking Registration \n Surrendering Registration \n Reinstating Registration \n Terms and Conditions \n Registrant Outreach \n Calendar of Events \n Topical Guide for Registrants \n Asking for Relief \n Director's Decisions \n Forms and Documents \n Fees \n Types of Fees \n If Fees are not Paid \n Investment Funds & Structured Products \n Selling Securities \n Prospectus Offerings \n Prospectus-Exempt Distributions \n Fund Operations \n Conventional Mutual Funds \n Non-Conventional Investment Funds \n Specialized Funds \n Ongoing Disclosure \n Financial \n Material Changes \n Other Requirements \n Marketing & Sales \n Dealer Oversight \n Sales Communications \n Dealer Compensation \n Asking for Relief \n Filing Procedures \n Fees \n Information on IFRS \n Marketplaces, SROs & Clearing Agencies \n Exchanges \n Alpha Exchange Inc. \n Aequitas NEO Exchange Inc. \n Bourse de Montréal Inc. \n Canadian Securities Exchange (CSE) \n CME Group Exchanges \n ICE Futures Canada \n ICE Futures Europe \n ICE Futures US \n Natural Gas Exchange Inc. (NGX) \n Nodal Exchange, LLC \n OneChicago, LLC  \n TSX Venture Exchange \n TMX Group and TSX Inc. \n Swap Execution Facilities \n Pending Applications \n ATSs \n Nasdaq CXC Limited \n Instinet Canada Cross (ICX) \n Liquidnet Canada \n MATCH Now (operated by TriAct) \n Omega ATS / Lynx ATS \n TMX Select \n CBID / CBID Institutional \n CanDeal \n MarketAxess \n EquiLend Canada Corp. \n Marketplace Notices \n Market Structure Initiatives \n Dark Pools and Dark Orders \n Order Protection Rule \n Best Execution \n Real-time Market Data Fees \n Electronic Trading \n Clearing Agencies \n Canadian Depository for Securities Limited (CDS) \n Canadian Derivatives Clearing Corporation \n Chicago Mercantile Exchange Inc. \n CLS Bank International \n CME Clearing Europe Limited \n Eurex Clearing AG \n FundSERV Inc. \n ICE Clear Canada, Inc. \n ICE Clear Credit LLC \n LCH.Clearnet Limited \n LCH.Clearnet LLC \n Nodal Clear LLC \n Omgeo Canada Matching Ltd. \n Options Clearing Corporation \n SS&C Technologies Canada Corp. \n Self-Regulatory Organizations \n Investor Protection Funds \n Information Processors \n QTRS \n Trade Repositories \n Derivatives Participants \n Rules \n Consultation Papers \n Staff Notices \n Derivatives Seminars \n Applicants for Designation as Trade Repositories \n Legal Entity Identifiers (LEIs) \n Forms and Documents \n How to submit: Form 94-102F3 Customer Collateral Report: Regulated Clearing Agency \n Industry Resources \n    Related Information\n CSA Staff Notice: 31-333 - Follow-up to Broker-Dealer Registration in the Exempt Market Dealer Category   \n Registration Rules FAQ   \n   Section Menu \n Registration forms and other related notices \n The following forms and documents are required to be completed and filed with the Ontario Securities Commission (OSC) under the  Securities Act  (Ontario) or the  Commodity Futures Act  (Ontario). You may need to consider whether you are, or your firm is, required to submit information with other jurisdictions. \n For further filing instructions in Ontario please refer to the  OSC's electronic filing portal . \n Where a fee is due with any of the filings below or for annual participation fees, please refer to further instructions on  paying registrant-related fees. \n Firms \n Form \n Use this form to: \n Submission method \n Form 33-109F6/Form 33-506F6  Firm Registration \n Apply for initial registration as a dealer, adviser or investment fund manager  \n Apply to add a category or jurisdiction to an existing registration  \n Guidance for new firms: \n PDF:  Guide to Completing and  Filing an Application for Registration .  \n Complete the relevant form and submit a copy  online . \n            PDF:  Form 33-109F6 \n            PDF:  Form 33-506F6 \n Form 33-109F3/Form 33-506F3  Business Locations other than Head Office \n Notify the OSC of the opening of, or any change to, a business location of the firm  \n NRD \n            PDF:  Form 33-109F3  *  \n Form 33-109F5/Form 33-506F5  Change of Information \n Notify the OSC of a change to previously submitted registration information  \n * For a change to insurance information, refer to the Insurance information section below for instructions  \n Complete the relevant form and submit a copy  online . \n            PDF:  Form 33-109F5 \n            PDF:  Form 33-506F5 \n Insurance information \n Notify the OSC of a change in, claim made under, or cancellation of an insurance policy (including renewal of an existing policy)  \n Online form \n Monthly Suppression of Terrorism and UN Sanctions Reporting \n Consolidated CSA reporting form for all firms to use in complying with their monthly reporting obligations under the Criminal Code, UN SupTerror, the UN Al-Qaida, the UN NKorea and the UN Iran  \n Online form \n Voluntary surrender  \n Notify the OSC of an application by a firm to voluntarily surrender registration  \n Submit documents  online \n Form or document required to be filed or delivered with respect to terms and conditions \n Submit any forms or documents required to filed or delivered with respect to terms and conditions imposed on a registrant firm's registration.  \n Complete the relevant form or document and submit a copy  online . \n Individuals \n Form \n Use this form to: \n Submission method \n Form 33-109F1/Form 33-506F1  Notice of Termination of Registered Individuals and Permitted Individuals \n Notify the OSC of the termination of a registered or permitted individual’s authority to act on behalf of the firm  \n NRD \n            PDF:  Form 33-109F1  *  \n Form 33-109F2/Form 33-506F2  Change or Surrender of Individual Categories \n Apply for registration or approval in an additional category  \n Surrender a category while maintaining registration in one or more other categories  \n NRD \n            PDF:  Form 33-109F2  * \n Form 33-109F4/Form 33-506F4  Registration of Individuals and Review of Permitted Individuals \n Apply for registration in individual categories or review as a permitted individual  \n NRD \n            PDF:  Form 33-109F4  * \n Form 33-109F5/Form 33-506F5  Change of Information \n Notify the OSC of a change to previously submitted registration information  \n NRD \n            PDF:  Form 33-109F5  * \n Form 33-109F7/Form 33-506F7  Reinstatement of Registered Individuals and Permitted Individuals \n Transfer individual’s registration between sponsoring firms or reinstate an individual’s registration or a permitted individual status  \n NRD \n            PDF:  Form 33-109F7  * \n * PDF form provided for reference purposes only. All filings must be made on NRD. \n Funding Portals \n The following forms and documents apply to a registrant operating as a registered dealer funding portal or restricted dealer funding portal under Multilateral Instrument 45-108 Crowdfunding (MI 45-108). \n Form \n Use this form to: \n Submission method \n Notification by funding portal regarding termination of a distribution pursuant to s. 38(1) of MI 45-108 Crowdfunding\n Notify the OSC if, at any time during the distribution period, the funding portal terminates a distribution pursuant to subsection 28(2) Denial of issuer access and termination of MI 45-108.  \n Prepare the notification and submit the notification  online . \n Report required to be delivered by a funding portal pursuant to s. 38(2) of MI 45-108 Crowdfunding  \n Deliver a report to the OSC within 30 days of the end of the second and fourth quarters of the funding portal’s financial year containing information required under subsection 38(2) of MI 45-108.  \n Prepare the report and submit the report  online . \n Capital and financial requirements \n Form \n Use this form to: \n Submission method \n Form 31-103F1  Calculation of Excess Working Capital   \n            Annual financial statements, interim financial information and other financial information  \n            Repayment of a subordinated loan or termination of a subordination agreement  \n            Form 31-103F4  Net Asset Value Adjustments \n Determine and notify the OSC of a firm’s excess working capital as at the end of a financial year or interim period  \n Deliver required financial information to the OSC  \n Notify the OSC of a repayment of a subordinated loan or termination of a subordination agreement  \n Notify the OSC of a net asset value (NAV) adjustment made in respect of an investment fund managed by the investment fund manager in accordance with paragraph 12.14(1)(c) or paragraph 12.14(2)(c) of National Instrument 31-103  Registration Requirements, Exemptions and Ongoing Registrant Obligations   \n Online form   \n            PDF:  Form 31-103F1 **  \n            PDF:  Form 31-103F4 **  \n Subordination Agreements  \n Notify the OSC that a firm has executed a subordinated loan agreement and relying on it for the purposes of Form 31-103F1 Calculation of Excess Working Capital  \n Online form \n Appendix B - Subordination Agreement \n Capital deficiency \n Notify the OSC of a capital deficiency (i.e. excess working capital of a registered firm is less than zero)  \n E-mail to  registration@osc.gov.on.ca   \n ** PDF form provided for reference purposes only. All filings must be made using the online form. \n Participation Fees \n Form \n Use this form to: \n Submission method \n Form 13-502F4 \n            for firms registered under the  Securities Act  or under both the  Securities Act  and  Commodity Futures Act \n            Form 13-503F1 \n            for firms registered only under the  Commodity Futures Act \n Determine and notify the OSC of participation fees payable.  \n All registered firms, unregistered exempt international firms and unregistered investment fund managers must complete this form by December 1 each year.   \n Form 13-502F4:  Online form \n            PDF:  Form 13-502F4 **  \n            Form 13-503F1:  Online form   \n            PDF:  Form 13-503F1 ** \n Adjusted Form 13-502F4 and Form 13-502F5  Adjustment of Fee for Registrant Firms and Unregistered Exempt International Firms  / Adjusted Form 13-503F1 and completed Form 13-503F2  Adjustment of Fee Payment \n Determine and notify the OSC of adjusted participation fees payable. Firms who provided a Form 13-502F4 or Form 13-503F1 (above) based on estimated revenues must complete these forms electronically within 90 days of their fiscal year end only if their participation fee payable has changed  \n Adjusted Form 13-502F4 and Form 13-502F5:  Online form \n            PDF:  Form 13-502F4-F5 ** \n            Adjusted Form 13-503F1 and Form 13-503F2:  Online form   \n            PDF:  Form 13-503F1-F2 ** \n Exemptions and applications for exemptive relief \n The following forms and documents are required in order to rely on certain exemptions available under the  Securities Act  or  Commodity Futures Act  or to apply for exemptive relief from certain registration requirements under the  Securities Act  or  Commodity Futures Act : \n Form \n Use this form to: \n Submission method \n Form 31-103F2  Submission to Jurisdiction and Appointment of Agent for Service \n Notify the OSC of reliance on the exemption from the registration requirement under sections 8.18  International Dealer  and 8.26  International Adviser  of National Instrument 31-103  Registration Requirements, Exemptions and Ongoing Registrant Obligations   \n Complete the  form  and submit a copy  online . \n Notification to OSC that a firm is no longer relying on an exemption from registration requirements  \n Notify the OSC that a firm is no longer relying on the exemption from the registration requirement under sections 8.18  International Dealer  and/or 8.26  International Adviser  of National Instrument 31-103 Registration Requirements, Exemptions and Ongoing Registrant Obligations  \n Notify the OSC that a firm is no longer relying on the exemption from the investment fund manager registration available under section 4 of Multilateral Instrument 32-102  Registration Exemptions for Non-Resident Investment Fund Manager   \n Prepare the notification and submit  online . \n Form 31-103F3  Use of Mobility Exemption \n Notify the OSC of an individual’s reliance on an exemption from the registration requirement under section 2.2  Client mobility exemption - individuals   \n Complete the  form  and submit a copy  online . \n Form 32-102F1  Submission to Jurisdiction and Appointment of Agent for Service for International Fund Manager \n Notify the OSC of reliance on the permitted client exemption for international investment fund managers under section 4  Permitted clients   \n Complete the  form  and submit a copy  online . \n Form 32-102F2  Notice of Regulatory Action \n Notify the OSC of reliance on the permitted client exemption for international investment fund managers under section 4  Permitted clients   \n Complete the  form  and submit a copy  online . \n Reliance on exemption from investment fund manager registration under Multilateral Instrument 32-102  Registration Exemptions for Non-Resident Investment Fund Managers \n Notify the OSC of reliance on the permitted client exemption for international investment fund managers under section 4  Permitted clients   \n Notify the OSC of the total assets under management attributable to securities beneficially owned by residents of Ontario as at the most recently completed month.  \n Unregistered international investment fund managers must complete this form by December 1 each year  \n Prepare the notification and submit  on-line . \n Form 32-505F1  Information Report for United States Broker-Dealers and Advisers Servicing U.S. Clients from Ontario \n Notify the OSC of reliance on the exemptions from registration for United States Broker-Dealers and Advisers under OSC Rule 32-505  Conditional Exemption from Registration for United States Broker-Dealers and Advisers Servicing U.S. Clients from Ontario   \n Complete the relevant form and submit a copy  online . \n Form 32-505F1 \n Form 35-101F1/Form 35-101F2  Form of Submission to Jurisdiction and Appointment of Agent of Service of Process by Agents of the Broker Dealer  \n To notify the OSC of  United States Broker-Dealers and Agent’s  reliance on the exemptions from registration under National Instrument 35-101  Conditional Exemption from Registration for United States Broker Dealers and Agents   \n Complete the relevant form and submit a copy  online . \n Form 35-101F1 \n Form 35-101F2 \n Forms 45-106F1  Report of Exempt Distribution \n Report a distribution under the exemptions in National Instrument 45-106  Prospectus and Registration Exemptions  and OSC Rule 45-501  Ontario Prospectus and Registration Exemptions   \n Complete the relevant online form and submit a copy using the appropriate link below. \n Report of Exempt Distribution \n Application for exemptive relief and notices under sections 11.9 and 11.10 of NI 31-103  \n Apply for exemptive relief from an eligible securities section or file a notice under sections 11.9 and 11.10 of NI 31-103  \n Online form \n Application pre-filing  \n Make a pre-filing  \n Online form \n Form or document required to be filed or delivered with respect to orders, rulings and decisions issued by the Commission  \n Submit any forms or documents required to filed or delivered with respect to any orders, rulings and decisions issued by the Commission \n Complete the relevant form or document and submit a copy  online . \n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}