{"url": "https://www.namebright.com/Login?dest=%2fSettings", "content": "NameBright - Login\r\n Create a  New Account  Today \n secure \n Forgot? \n My Cart  (0) \n Do you want to  Create a NameBright Account ? \n   LOGIN \n CREATE ACCOUNT \n SEARCH \n BULK CHECK \n PREMIUM DOMAINS \n                            Click here for the Advanced Search of my domain names.\r\n                            Hints on searching...  If you own \"example.com\", typing \"example\" will take you straight to manage your domain.\r\n                            If you want to search for a domain to register, use the search box to search for \"blue red\".  If you want to search your account,\r\n                            click on the down arrow to get to the advanced search of my domains.\r\n Home   /  Login \n Refreshing Page... \n Processing... \r\n                Please note, your browser might freeze for a short period of time while it processes this request.\r\n NameBright Login \n Please Login Here: \n Username: \n Forgot Username? \n Password: \n Forgot Password? \n Security Alert  - Your domain names are valuable assets! Protect them by using best security practices! NEVER share your login credentials!\r\n Don’t Have a NameBright Account? \n Use advanced Bulk Management Tools \n Check out our 'at cost' pricing \n 1 yr FREE WhoIs Privacy Protection! \n Welcome to the future of Domain Registration! \n Create a Free Account \n See the benefits that NameBright offers! \n Why can’t I login? \n You must register before you can login. To login, use the same username and password that you entered when registering for NameBright.\r\n                    If you have registered and are still unable to login, make sure your web browser has “cookies enabled”. You may need to add NameBright to your browser’s list of trusted Web sites.\r\n What happens if I forgot my password? \n                    For security, passwords cannot be retrieved, but they can be reset. \n Click here to request a new password  . A new password will be emailed to the email address we have on record.\r\n 1 yr FREE Whois Privacy    |   \r\n                     'At Cost' Pricing    |   \r\n                     Bulk Domain Management Tools    |   \r\n                     and a whole lot more... \n © 2017 NameBright.com. All Rights Reserved. Get your domain name today! \n Products: \n Domain Search \n Bulk Search \n Transfer \n SSL \n WhoIs \n Email \n Support: \n Knowledge Base \n Features \n API \n Company: \n Terms of Service \n Privacy \n Contact Us \n Committed to Being the Most Advanced Registrar in the World! \n -\r\n Submit Feedback \r\n        Have something to share with us? \r\n        A suggestion? \r\n        A comment?\r\n        Find something that is not working right?\r\n        Share this with our team so we can know what we should focus on!\r\n Like Us On Facebook! \r\n        We would really appreciate your support.\r\n        If you find NameBright useful please like us on Facebook to help spread the word.\r\n        Click the blue icon to like us.\r\n Become a Follower! \r\n        You can follow us on Twitter to get special promotions, deals and offers we will put out there from time to time.\r\n Read Our Blog! \r\n        Our blog covers everything from features, has news stories about domain names and domain management.\r\n        It is also the one place we will post information about downtimes or service outages.\r\n Helpful NameBright Hints \r\n        Click this link to learn how to use NameBright better.\r\n        We will share information and tips on features of NameBright and how you can get more out of the system!\r\n    This date/time is currently being displayed in the following TimeZone: \n Click to change this setting \n Cancel \n Hide Help \n What Does \"Copy\" Do? \nThis is a feature that helps you manage domain names in bulk.  By copying a list of domains you can easily import into Excel, or send yourself a list as a reminder.  It is a convenience for people that manage multiple domain names."}