{"url": "http://www.osc.gov.on.ca/en/NewsEvents_nr_20170704_irroc-oversight-review-report.htm", "content": "CSA News Release: Canadian securities regulators publish IIROC oversight review report \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   News & Events   /   News Releases   /   2017   /   CSA News Release: Canadian securities regulators publish IIROC oversight review report \n            News & Events\n Hide Section Menu   × \n News Releases \n OSC News Releases \n Organizational News Releases \n Regulatory News Releases \n Enforcement News Releases \n OSC Investor Alerts \n CSA News Releases \n Speeches & Events \n Media Room \n Social Media \n OSC in the Community \n Reports and Publications \n OSC Annual Report \n Statement of Priorities \n OSC Investor News \n OSC Dialogue 2017 \n   Section Menu \n For Immediate Release \nJuly 4, 2017 \n Canadian securities regulators publish IIROC oversight review report \n Toronto  – The Canadian Securities Administrators  (CSA) today released the  Oversight Review Report of the Investment Industry  Regulatory Organization of Canada (IIROC) , which evaluates whether specific  regulatory processes are operating effectively and outlines findings that  require corrective action.  \n The coordinated  review was conducted jointly by seven of the provincial securities regulators  that recognize IIROC: the Alberta Securities Commission; the Autorité des  marchés financiers; the British Columbia Securities Commission; the Financial  and Consumer Affairs Authority of Saskatchewan; the Manitoba Securities  Commission; the Nova Scotia Securities Commission; and the Ontario Securities  Commission. IIROC is also recognized by the Financial and Consumer Services  Commission of New Brunswick, the Newfoundland and Labrador Office of the  Superintendent of Securities, and the Prince  Edward Island Office of the Superintendent of Securities  (Recognizing Regulators).    \n Based on the  annual assessment of IIROC’s functional areas and key processes, the  Recognizing Regulators selected above-average risk areas as the focus for the  review, including Business Conduct Compliance, Enforcement, Information  Technology, Market Surveillance, and Trade Review & Analysis. The  Recognizing Regulators considered the previous oversight review and whether  findings identified in that review had been resolved, as well as current issues  and market conditions that could affect IIROC.  \n In summary, CSA  staff acknowledge that IIROC made sufficient progress in resolving specific  issues raised in previous oversight reports. However, CSA staff note a repeat  finding in the Business Conduct Compliance department given IIROC did not  implement necessary changes to their examination programs (high priority).  Also, CSA staff found that IIROC did not make sufficient progress in resolving an  issue raised during the previous oversight review in the area of Information  Technology (medium priority) by not providing an information security program  report to a Board committee on a quarterly basis. In addition, CSA staff raise other medium priority findings in the  Business Conduct Compliance (one), Information Technology (one) and Enforcement  (two) departments.  \n CSA staff will  actively monitor IIROC’s progress in addressing the findings outlined in the  report.  \n The CSA, the  council of the securities regulators of Canada’s provinces and territories,  co-ordinates and harmonizes regulation for the Canadian capital markets. \n - 30 - \n For more information: \n Kristen\n            Rose \n            Ontario Securities Commission \n            416-593-2336 \n Hilary McMeekin \n            Alberta Securities Commission \n            403-592-8186 \n Alison Walker \n            British Columbia Securities Commission \n            604-899-6713  \n            Sylvain Théberge \n            Autorité des marchés financiers \n            514-940-2176\n Jason (Jay) Booth \n            Manitoba Securities Commission \n            204-945-1660 \n Andrew\n            Nicholson \n            Financial and Consumer Services \n            Commission, New Brunswick \n            506-658-3021\n David Harrison \n            Nova Scotia Securities Commission \n            902 424-8586 \n            Janice Callbeck \n            Office of the Superintendent of\n            Securities \n            P.E.I \n            902-368-6288\n            John O’Brien \n            Office of the Superintendent of\n            Securities \n            Newfoundland and Labrador \n            709-729-4909\n            Rhonda Horte \n            Office of the Yukon Superintendent \n            of Securities \n            867-667-5466\n            Jeff Mason \n            Nunavut Securities Office \n            867-975-6591 \n Tom\n            Hall \n            Northwest Territories Securities Office \n            867-767-9305\n            Shannon McMillan \n            Financial and Consumer Affairs \n            Authority of Saskatchewan \n            306-798-4160\n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}