{"url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/minimize-error.html", "content": "Understanding Guideline 3.3  | Understanding WCAG 2.0\n  \t\t\t\t Understanding WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  SC  3.2.5 [Change on Request] Next:  SC  3.3.1 [Error Identification] On this page: Intent Advisory Techniques Success Criteria -   Input Assistance : Understanding Guideline 3.3 Guideline 3.3:  \n            Help users avoid and correct mistakes.\n\t\t\tIntent of Guideline 3.3 Everyone makes mistakes. However, people with some disabilities have more difficulty creating error-free input. In addition, it may be harder for them to detect that they have made an error. Typical error indication methods may not be obvious to them because of a limited field of view, limited color perception, or use of assistive technology. This guideline seeks to reduce the number of serious or irreversible errors that are made, increase the likelihood that all errors will be noticed by the user, and help users understand what they should do to correct an error.     \n\t\t\tAdvisory Techniques for Guideline 3.3 (not success criteria specific) Specific techniques for meeting each Success Criterion for this guideline are listed in the understanding sections for each Success Criterion (listed below). If there are techniques, however, for addressing this guideline that do not fall under any of the success criteria, they are listed here. These techniques are not required or sufficient for meeting any success criteria, but can make certain types of Web content more accessible to more people. Hiding optional form fields (future link) Success Criteria for this Guideline: \n\t\tUnderstanding Success Criterion 3.3.1  [Error Identification]\n\t\tUnderstanding Success Criterion 3.3.2  [Labels or Instructions]\n\t\tUnderstanding Success Criterion 3.3.3  [Error Suggestion]\n\t\tUnderstanding Success Criterion 3.3.4  [Error Prevention (Legal, Financial, Data)]\n\t\tUnderstanding Success Criterion 3.3.5  [Help]\n\t\tUnderstanding Success Criterion 3.3.6  [Error Prevention (All)]\n\t Top Contents Intro Previous:  SC  3.2.5 [Change on Request] Next:  SC  3.3.1 [Error Identification] This Web page is part of  Understanding WCAG 2.0: A guide to understanding and implementing WCAG 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}