{"url": "http://www.w3.org/WAI/GL/new-charter-2000.html", "content": "Web Content Accessibility Guidelines Working Group Charter \n   \n WCAG WG \n  Web Content Accessibility Guidelines Working Group (WCAG WG) Charter\nThis charter is written in accordance with section\n 3.2.3\nof the W3C Process .\n  Table of Contents\n Mission \n Scope \n Duration \n Deliverables \n Success \n Schedule \n Confidentiality \n Coordination \n Communication \n Voting \n Participants \n Information about how to join the Working\nGroup \n 1. Mission \nThe mission of the Web Content Accessibility Guidelines (WCAG) working group\nis twofold:\n    to produce Web Content Accessibility Guidelines 2.0;\n    to document accessible techniques for W3C Recommendations (such as XML, RDF,\n    SMIL, SVG, and MathML) as well as specific other Web technologies such as\n    ECMA Script\nas guidance for Web content authors and developers to create Web content\nthat is accessible and usable by the widest audience possible.\nThese activities continue W3C's work on guidelines for creating accessible\ncontent that began with\n WCAG\n1.0 . The history of this group has been documented in the\n\" End of Charter Report for the Web Content\nGuidelines Working Group .\" Also, refer to our\n previous charter .\nThis work is part of the\n WAI Technical\nActivity .\n 2. Scope \n  2.1 Focus of activities\nThe WCAG WG will:\n    produce next-generation normative guidelines for accessibility of Web content,\n    including addressing issues of clarity raised since publication of WCAG 1.0;\n    collect, test, discuss and create techniques for WCAG-conformant content\n    in XML, RDF, SMIL, SVG, MathML and other W3C Recommendations and scripting\n    languages not yet addressed in the Techniques document;\n    produce updated non-normative supporting documents, including techniques\n    documents and implementation tracking information;\n    coordinate with other groups including W3C groups writing guidelines, and\n    EOWG regarding ease-of-use considerations in WCAG WG's development of WCAG\n    2.0.\n  2.2 Intended audience of deliverables\nSince the release of WCAG 1.0, a number of readers have raised ease-of-use\nconcerns with the format and language of WCAG 1.0, given diverse audiences\nwhich must rely on this document, including non-technical audiences. It has\nalso become clear that authoring tool and user agent developers also form\npart of the technical audience of this document when implementing the Authoring\nTool Accessibility Guidelines and the User Agent Accessibility Guidelines.\nWith regard to the WCAG WG's guidelines document, the Working Group will\nproduce a document with sufficient technical precision to be used as a normative\nreference for Web content accessibility, and with language accessible to\nnon-technical audiences. Ease-of-use considerations may be accomplished through\nlayering multiple documents in a set, or by integrating understandable language\nthroughout the document, or by some other means, but are a fundamental part\nof the guidelines document requirements.\n 3. Duration \nThe Working Group is scheduled for 18 months, from November 2000 through\nMay 2002.\n 4. Deliverables \n    Requirements document for the next version of the Web Content Accessibility\n    Guidelines.\n    Web Content Accessibility Guidelines 2.0 (W3C Recommendation) and supporting\n    documents (Errata, translations to other languages, documentation of impact\n    decisions, checklist of checkpoints).\n    Revised and more comprehensive Techniques for Web Content Accessibility\n    Guidelines (W3C Note).\n User Agent Support\n    for Accessibility  (W3C Note)\n\tThe Web Content Accessibility Guidelines 1.0 include a number of checkpoints\n\tthat require content developers to create pages in a particular manner \"until\n\tuser agents\" do the work for them. This page documents user agent support\n\tfor those checkpoints and includes additional Resources for UA support\n    Ongoing documentation of open issues.\n    Working Drafts of all Deliverables.\n    Minutes from WCAG WG meetings.\n    End of charter report: Discuss the accomplishments and impact of the working\n    group, as well as further work that is needed, if any.\n 5. Success \nTo be considered successful, this Working Group must:\n    deliver the set of documents described in the \"Deliverables\" section;\n    test every proposed technique for the Techniques document for efficacy and\n    technical feasibility.\n 6. Schedule \nA list of active working drafts is maintained by the chairs and staff contact.\nThese drafts are maintained by editors assigned by the chair. Changes to\nediting assignments may be negotiated with the chair at any time.\nAll participants are encouraged to draft proposed text and techniques for\nactive working drafts. Proposals should be sent to the mailing list for\nconsideration by the working group.\nThe following schedules are expected to be followed:\n    Internal Working Drafts should be published at least on a monthly basis.\n    Internal Working Drafts are available to the public, but have not been reviewed\n    by the WAI Interest Group and are not published on the W3C Technical Reports\n    page.\n    Public Working Drafts should be published at least every three months (per\n    the Release Policy). These differ from Internal Working Drafts in that they\n    have been reviewed by the WAI Interest Group and are published on the W3C\n    Technical Reports page.\n    Face to Face meetings should occur quarterly.\nA  detailed, proposed timeline  is available.\n 7. Confidentiality \nGroup proceedings, e-mail list, archives, charter, and deliverables are all\npublic.\n 8. Coordination \nThis group coordinates activity with other WAI Working Groups through the\n WAI Coordination Group  [Members\nonly] and through the WAI's participation in the\n Hypertext Coordination Group \n[Members only].\n  8.1 Protocols and Formats\nThe WCAG working group develops guidelines to educate content developers\nabout accessible authoring practices for HTML 4.0, CSS1 and CSS2, XML, SMIL,\netc. This work relies on the investigations of the\n Protocols and Formats Working Group \n(PFWG) to lead us into the recent work of other W3C working groups. Once\nPFWG has identified or worked through an accessibility barrier with a\nspecification, we should reflect the new information in our deliverables.\nFor example, many of the XML and SVG authoring practices have been identified\nby PFWG. The Web Content Guidelines Working Group needs to incorporate these\npractices into the Techniques for WCAG document.\nLikewise, the Protocols and Formats Working Group takes requirements for\naccessibility identified in this working group and negotiates with the relevant\nW3C groups where appropriate.\n  8.2 Authoring Tools\nThe Web Content Accessibility Guidelines need to be usable by content authors\nand developers. Since many content authors are not technically savvy, the\nadoption of the guidelines is dependent on authoring tools that support WCAG\nauthoring practices. Adoption of the Authoring Tool Accessibility Guidelines\nby authoring tool developers is a key step.\nLikewise, the  Authoring Tools Guidelines\nWorking Group  (AU) uses the Web Content Accessibility Guidelines as a\ncore piece of the Authoring Tools Accessibility Guidelines.When needed, the\nWCAG WG clarifies points in WCAG 1.0 and reviews AU work to ensure that\naccessible authoring practices are supported.\n  8.3 User Agents\nThe Web Content Accessibility Guidelines are dependent on how user agents\ninterpret markup as well as how well an assistive technology (where needed)\nis able to make use of content. Therefore, our work is also dependent on\nthe adoption of the WAI User Agent Accessibility Guidelines.\nLikewise, the  User Agent Guidelines Working\nGroup  (UA) should address how to take advantage of content that conforms\nto WCAG 1.0. When needed the WCAG WG clarifies points in WCAG 1.0, and reviews\nUA work to ensure that accessible authoring practices are supported.\n  8.4 Evaluation and Repair Tools\nUntil WAI guidelines are widely adopted, the prototype tools identified,\ndeveloped, or collected by the  Evaluation\nand Repair Tools Working Group  (ERT WG) will help promote the adoption\nof the guidelines by authors and users. Currently, the ERT WG is developing\nevaluation and validation tool techniques for each checkpoint in the Web\nContent Accessibility Guidelines 1.0. Oftentimes, the ERT WG requests\nclarifications or interpretations of checkpoints.\n  8.5 Education and Outreach\nAmong its promotion and education work, the\n Education and Outreach Working Group\n (EOWG) develops some promotional and educational materials based on the\nWeb Content Accessibility Guidelines and other WCAG WG deliverables. The\nEOWG relies on the WCAG WG to review any derivative promotional or educational\nmaterial it produces that is based on WCAG or other WCAG WG deliverables.\nThe WCAG WG relies on EOWG to help advise with regard to ease-of-use\nconsiderations around WCAG deliverables, particularly for its normative\nguidelines.\n  8.6 Mobile, TV and Internationalization\nThe WCAG working group needs to maintain contact with the W3C\n Mobile Activity , the\n TV/Web\nActivity   and the W3C\n Internationalization Activity \n(I18N) as these groups develop content guidelines related to their activities.\nThis contact should be coordinated through the WAI CG chair who also sits\non the Hypertext CG, and through direct liaison with Mobile and I18N as needed.\n  8.7 Other W3C Groups\nWhen developing techniques for other W3C specifications, WCAG WG's work may\nalso require direct coordination with the following working groups or\ncoordination groups. The following links are to the member only areas for\neach of these working groups.\n Cascading Style Sheets Working\n    Group  (CSS)\n Composite Capability/Preference\n    Profiles Working Group  (CC/PP)\n Document Object Model Working Group \n    (DOM)\n Extensible Markup Language Coordination\n    Group  (XML, XLink, XPointer, XBase, XML Query, XML Schema)\n Extensible Stylesheet Language\n    Working Group  (XSL, XSLT)\n Hypertext Markup Language Working\n    Group  (HTML and XHTML)\n Math Markup Language Working Group \n    (MathML)\n Resource Description Framework Working\n    Group  (RDF)\n Scalable Vector Graphics Working\n    Group  (SVG)\n Synchronized MultiMedia Working\n    Group  (SMIL)\n XForms Working Group (XForms)\n  8.8 External organizations\nIn addition, external organizations such as ISO, IEEE, national governments,\ncorporations, etc., may reference the Web Content Accessibility Guidelines.\nExternally developed tools such as CAST's\n\" Bobby \" may use the guidelines as\nthe basis for their site evaluation tools. Coordination with external groups\nreferencing the guidelines is primarily through the WAI International Program\nOffice. Coordination with groups using WCAG WG deliverables as the basis\nof evaluation or repair tools is shared between this group and the Evaluation\nand Repair Tools Working Group.\n 9. Communication \n    Primary communication mechanisms:\n     w3c-wai-gl \n    mailing list and  WCAG home page .\n    Phone meetings: weekly. Phone meetings are primarily to discuss stickier\n    issues.\n    Face-to-face meetings quarterly.\n    Communication with W3C: WAI CG and Hypertext CG.\n    Communication with the developer community: direct involvement in working\n    group (invited experts) and liaisons to other W3C groups.\n    Communication with disability community: direct involvement in working group\n    (invited experts).\n    Communication with research community: direct involvement in working group\n    (invited experts).\n    Communication with W3C Member organizations: Member newswire & newsletter\n    Communication with the public: Education & Outreach Working Group, member\n    presentations, and the WCAG WG group home page.\n 10. Voting \nThe Working Group will follow the\n W3C\nProcess for consensus and votes  (as described in the 11 November 1999\nversion). In case the Working Group is required to vote on a particular issue,\neach Member organization or technical expert's organization will have one\nvote.\n 11. Participants \nParticipants are expected to observe the requirements of the W3C Process\nfor Working Groups. The following is an excerpt from the\n 11\nNovember 1999 Process Document section 3.3.1: \n  Participation on an ongoing basis implies a serious commitment to the Working\n  Group charter, including:\n      attending most meetings of the Working Group.\n      providing deliverables or drafts of deliverables in a timely fashion.\n      being familiar with the relevant documents of the Working Group, including\n      minutes of past meetings.\nFor this Working Group, the following commitment is expected:\n    minimum 4 hours per week;\n    remain current on w3c-wai-gl list and respond in timely manner to postings;\n    participate in weekly phone meetings and face to face meetings as scheduled\n    or send regrets to list.\n Information about how to join the Working\nGroup  is available on the Web.\n  11.1 W3C Members\nParticipation in this working group is open to all employees of W3C member\norganizations.\n  11.2 Invited Experts\nThe following people who may not be employees of a W3C Member organization\nare invited to participate. Those who:\n    develop Web content on a regular basis,\n    work with people with disabilities who use the Web,\n    have a disability and regularly use the Web,\n    instruct people on developing Web content,\n    or have general usability, development, or accessibility knowledge\nare invited to participate. Participation is subject to Chair approval.\n  11.3 W3C Team\n    40% Wendy Chisholm- co-editor Guidelines document, staff contact\n    5% Judy Brewer\n    5% Daniel Dardailler\n 11.4 Intellectual Property Rights (IPR) \nThe purpose of the WCAG WG is to produce public documents available royalty-free\nto everyone, following W3C standard IPR terms. Therefore, anyone commenting\nin the WCAG WG will be considered to offer these ideas as contributions to\nthe WCAG WG documents. Organizations with IPR in areas related to the Web\nContent Accessibility Guidelines or Techniques must disclose IPR as described\nin the W3C Process regarding IPR and W3C's IPR fact sheet. Invited experts\nare required to disclose IPR claims in the same manner as individuals from\nW3C Member organizations.\n  11.5 How to join\n Information about how to join the Working\nGroup \n$Date: 2000/11/27 23:48:57 $  Judy Brewer ,\n Wendy Chisholm \n Copyright  \n©  1999, 2000  W3C \n( MIT ,\n INRIA ,\n Keio  ), All Rights Reserved. W3C\n liability, \n trademark ,\n document\nuse  and  software licensing  rules apply. Your interactions with\nthis site are in accordance with our\n public \nand\n Member \nprivacy statements"}