{"url": "https://www.amazon.com/The-Work-And-Glory/dp/B0007WQHQ2", "content": "Amazon.com: The Work And The Glory: Movies & TV \n Interesting Finds Updated Daily \n Amazon \n    Try Prime\n Movies & TV \n Select the department you want to search in \n All Departments \n Cyber Monday Deals Week \n Alexa Skills \n Amazon Devices \n Amazon Video \n Amazon Warehouse Deals \n Appliances \n Apps & Games \n Arts, Crafts & Sewing \n Automotive Parts & Accessories \n Baby \n Beauty & Personal Care \n Books \n CDs & Vinyl \n Cell Phones & Accessories \n Clothing, Shoes & Jewelry \n    Women \n    Men \n    Girls \n    Boys \n    Baby \n Collectibles & Fine Art \n Computers \n Courses \n Credit and Payment Cards \n Digital Music \n Electronics \n Garden & Outdoor \n Gift Cards \n Grocery & Gourmet Food \n Handmade \n Health, Household & Baby Care \n Home & Business Services \n Home & Kitchen \n Industrial & Scientific \n Kindle Store \n Luggage & Travel Gear \n Luxury Beauty \n Magazine Subscriptions \n Movies & TV \n Musical Instruments \n Office Products \n Pet Supplies \n Prime Exclusive Savings \n Prime Pantry \n Software \n Sports & Outdoors \n Tools & Home Improvement \n Toys & Games \n Vehicles \n Video Games \n Wine \n Go \n          Search\n Departments \n EN \n  \n Hello. Sign in Account & Lists Sign in Account & Lists Orders Try Prime Cart \n Your Amazon.com Cyber Monday Deals Week Gift Cards Registry Sell Help Disability Customer Support  \n Movies & TV   New Releases   Best Sellers   Deals   Blu-ray   TV Shows   Kids & Family   Anime   All Genres   Amazon Video   Prime Video   Your Video Library   Trade-In \n                Movies & TV\n             ›\n                Genre for Featured Categories\n             ›\n                 Kids & Family\n Share \n Facebook \n Twitter \n Pinterest \n Buy New \n $11.99 \n Qty: \n 1\n 2\n 3\n 4\n 5\n 6\n 7\n 8\n 9\n 10\n 11\n 12\n 13\n 14\n 15\n 16\n 17\n 18\n 19\n 20\n 21\n 22\n 23\n 24\n 25\n 26\n 27\n 28\n 29\n 30\n Qty: 1 \n Free Shipping for Prime Members \n FREE Shipping \n   Get free shipping \n Free 5-8 business-day shipping  within the U.S. when you order $25 of eligible items sold or fulfilled by Amazon. \n Or get 4-5 business-day shipping on this item for $4.98. (Prices may vary for AK and HI.) \n Learn more about free shipping \n on orders over $25—or get  FREE Two-Day Shipping  with  Amazon Prime \n            In Stock.\n        Ships from and sold by Amazon.com.\n            Gift-wrap available.\n                    The Work And The Glory\r\n                    has been added to your Cart\r\n Add to Cart \n Turn on 1-Click ordering for this browser \n                    Ship to:\n                            Select a shipping address:\n                        To see addresses, please\n                        Sign in\n or \n                        Use this location:\n                                Update\n                                Please enter a valid US zip code.\n                            Please enter a valid US zip code.\n                            Shipping to a APO/FPO/DPO? Please add the address to your address book. Make sure you include the unit and box numbers (if assigned).\n or \n Buy Used \n $8.75 \n FREE Shipping  on orders over $25.  Details \n      Used: Very Good\n  |  Details \n    Sold by\n         Daniellemariesales \n Fulfilled by Amazon \n Condition: \n      Used: Very Good\n Comment:  Previous rental but well preserved, clean disc, case and art work, small sticker.\n Fulfillment by Amazon (FBA) is a service we offer sellers that lets them store their products in Amazon's fulfillment centers, and we directly pack, ship, and provide customer service for these products. Something we hope you'll especially enjoy:  FBA items qualify for FREE Shipping and Amazon Prime. \n If you're a seller, Fulfillment by Amazon can help you increase your sales. We invite you to  \n    learn more about Fulfillment by Amazon\n   . \n Add to Cart \n Turn on 1-Click ordering for this browser \n Have one to sell? \n            Sell on Amazon\n Image Unavailable \n                Image not available for Color:\n            Sorry, this item is not available in\n            Image not available\n        To view this video download \n            Flash Player\n                \n                        The Work And The Glory\n               DVD\n Rated:  \n PG \n 4.4 out of 5 stars \n 59 customer reviews \n DVD   \n      $11.99\n  Additional DVD options \n            Edition\n            Discs\n                     Price\n              New from\n              Used from\n DVD \n (Apr 26, 2005) \n \"Please retry\" \n                    —\n 1 \n $11.99  \n $3.83 \n $1.80 \n DVD \n \"Please retry\" \n                    —\n                    —\n                                 —\n $33.21 \n                            —\n DVD \n \"Please retry\" \n                    —\n 3 \n $49.99  \n $49.99 \n                            —\n DVD \n (Sep 02, 2008) \n \"Please retry\" \n                    —\n 1 \n                                 —\n                            —\n                            —\n DVD \n (Jan 12, 2010) \n \"Please retry\" \n                    —\n 1 \n                                 —\n                            —\n                            —\n See More \n Unlimited Streaming with Amazon Prime \nStart your 30-day free trial to stream thousands of movies & TV shows included with Prime.\n Start your free trial \n See all buying options \n        The Work And The Glory\n        $11.99\n Free Shipping for Prime Members \n FREE Shipping \n   Get free shipping \n Free 5-8 business-day shipping  within the U.S. when you order $25 of eligible items sold or fulfilled by Amazon. \n Or get 4-5 business-day shipping on this item for $4.98. (Prices may vary for AK and HI.) \n Learn more about free shipping \n on orders over $25—or get  FREE Two-Day Shipping  with  Amazon Prime \n                In Stock.\n            Ships from and sold by Amazon.com.\n            Gift-wrap available.\n Frequently bought together \n + + \n Total price:  $38.23 \n Add all three to Cart \n Add all three to List \n Buy the selected items together This item: The Work And The Glory  DVD   $11.99   In Stock. Ships from and sold by Amazon.com. FREE Shipping on orders over  $25 .  Details The Work and the Glory III: A House Divided  DVD   $11.99   In Stock. Ships from and sold by Amazon.com. FREE Shipping on orders over  $25 .  Details The Work and the Glory - American Zion  by Sam Hennings  DVD   $14.25   In Stock. Ships from and sold by Amazon.com. FREE Shipping on orders over  $25 .  Details \n Customers who bought this item also bought Page  1  of  1   Start over Page 1 of 1   \n This shopping feature will continue to load items. In order to navigate out of this carousel please use your heading shortcut key to navigate to the next or previous heading. \n Back \n            The Work and the Glory III: A House Divided\n 4.6 out of 5 stars \n 38 \n DVD $11.99   Prime \n            The Work and the Glory - American Zion\n Sam Hennings \n 4.3 out of 5 stars \n 44 \n DVD $14.25   Prime \n            17 Miracles\n Jasen Wade \n 4.8 out of 5 stars \n 199 \n DVD $11.99   Prime \n            The Other Side of Heaven\n Christopher Gorham \n 4.7 out of 5 stars \n 285 \n DVD 52 offers from  $1.80 \n            Ephraim's Rescue\n Darin Southam \n 4.8 out of 5 stars \n 258 \n DVD $23.01   Prime \n            Legacy\n Kathleen Beller \n 4.2 out of 5 stars \n 19 \n DVD $12.99   Prime \n Next \n Special offers and product promotions \n Your cost could be $0.00 instead of $11.99 ! Get a  $50 Amazon.com Gift Card  instantly upon approval for the  Amazon Rewards Visa Card \n                Apply now\n                    Editorial Reviews\n Based on the best selling series by Gerald N. Lund, the Work and the Glory blends high-powered fiction with true events from the life of Joseph Smith. Experience the tragedies and triumphs of the Steed family amid the raging controversy that surrounds the teachings of one of the most influential religious leaders in American history. Direction: Russell Holt Actors: Alexander Carroll, Brenda Strong, Brighton Hertford, Eric Johnson, Special Features: Widescreen format. Language: English Year: 2004 Runtime: 110 minutes.\n Special features \n None. \n Product details \n   Format:  Multiple Formats, Color, NTSC \n Language:  English \n   Region:  Region 1 ( U.S. and Canada only.  Read more about  DVD formats. ) \n   Number of discs:  1 \n   Rated:    \n                PG\n        Parental Guidance Suggested  \n   Studio:  Excel Entertainment \n   DVD Release Date:  April 26, 2005 \n   Run Time:  110 minutes \n Average Customer Review: \n 4.4 out of 5 stars \n      59 customer reviews\n ASIN:  B0007WQHQ2 \n Amazon Best Sellers Rank:  \n#29,316 in Movies & TV ( See Top 100 in Movies & TV )\n #2056 \n in  Movies & TV  >  DVD  >  Romance \n #4767 \n in  Movies & TV  >  DVD  >  Kids & Family \n #6915 \n in  Movies & TV  >  DVD  >  Drama \nWould you like to  tell us about a lower price ? If you are a seller for this product, would you like to  suggest updates through seller support ? \n Customer reviews 4.4 out of 5 stars 59 4.4 out of 5 stars 5 star 78% 4 star 10% 3 star 5% 2 star 4% 1 star 3% Share your thoughts with other customers Write a customer review See all 59 customer reviews Top customer reviews There was a problem filtering reviews right now. Please try again later. 5.0 out of 5 stars I LOVE these movies and you can't find them anywhere By Hannah on August 24, 2017 Format: DVD | Verified Purchase I LOVE these movies and you can't find them anywhere! They came brand new and played perfectly. :) For those interested in buying them without prior knowledge on the movie, keep in mind that this is NOT a film based COMPLETELY on facts. There are details added and taken away to add suspense and drama to the original story of Joseph Smith restoring the church. :) Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars A good film for all By Daniel M on November 5, 2013 Format: DVD | Verified Purchase I was 58yrs old when I joined the church and I thank God I have an open mind toward the truth. If, and I am sure what he ( The Lord Jesus Christ ) said is true, by their fruits you shall know them, this is what I was searching for all my life. I have read and heard many negative comments about the Church of Jesus Christ of Latter Day Saints all my life and since joining the church and I thank God I have an open mind and decided to look into it myself. The Church is the most Christ centered church I have ever attended and believe me, I attended them all. I pray with a sincere heart that if you are reading my post and are not already a member, it is not by chance but The Father of all truth led you here, have an open mind and pray with a sincere heart and ask God the Father to lead you into the path of his desire. Knock and it shall be opened unto you, seek and ye shall find, ask and it will be given to you. Oh, the movie or series of movies, there are 3 was excellent, it is about a family seeking the truth and it isn't centered on the Prophet Joseph Smith's. Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Sweet, dramatic, family film By D.Lynd on October 2, 2014 Format: DVD | Verified Purchase Excellent depiction of an amazing book series! Illustrates so many of the struggles the Mormon pioneers experienced at the start up of their church. Very sweet, dramatic, family film. Read more 0 Comment | \n      2 people found this helpful.\n  Was this review helpful to you? Yes No Report abuse 4.0 out of 5 stars Interesting but I am not jumping up and down By Denese McDonald on April 28, 2013 Format: DVD | Verified Purchase Very simple and straightforward.  I appreciate that the contextual information was not dramatize and that there is a story line that makes the historical information a bit more interesting Read more 0 Comment | \n      One person found this helpful.\n  Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Excellant By Gloria Norman on February 7, 2014 Format: DVD | Verified Purchase Love learning more about the prophet Joshet Smith and how they were attacked by non-believers of the LDS church...all thought he was a dreamer or insane....now we have over 15,000,000 members worldwide. Read more 0 Comment | \n      2 people found this helpful.\n  Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars great movie By Rachel C. Trotter on May 12, 2014 Format: DVD | Verified Purchase I bought this movie and wasn't real sure if I'd like it, but I found it to be inspiring.  I don't agree with Morman religion, but over all this is a great movie to watch. Read more 0 Comment | \n      One person found this helpful.\n  Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Five Stars By Lynn Delferriel on January 11, 2017 Format: DVD | Verified Purchase Very good movie, highly recommended Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 2.0 out of 5 stars Two Stars By Amazon Customer on May 11, 2016 Format: DVD | Verified Purchase I expected the three part movies, but instead I paid $25 for the first part of three! Read more 0 Comment | Was this review helpful to you? Yes No Report abuse See all 59 reviews Write a customer review \n Most recent customer reviews 5.0 out of 5 stars Five Stars Good Book \n Published 10 months ago by Russell Bowman 5.0 out of 5 stars Five Stars Good storyline. \n Published 1 year ago by Danny Murphy 5.0 out of 5 stars Five Stars very good book \n Published 1 year ago by Jim 3.0 out of 5 stars my first amazon purchases and it went great great info vhs \n Published on November 16, 2015 by TWAND K 5.0 out of 5 stars I loved the movie and it touched me greatly I loved the movie and it touched me greatly.  However, I wish someone else had been cast as Benjamin Steed. Read more \n Published on September 21, 2015 by Kindle Customer 5.0 out of 5 stars Five Stars Excellent \n Published on April 21, 2015 by Susan Gibson 3.0 out of 5 stars Three Stars OK \n Published on April 5, 2015 by David B. Farley 5.0 out of 5 stars Five Stars Great movie love it \n Published on April 2, 2015 by Mckenzi 5.0 out of 5 stars Five Stars Loved it \n Published on January 26, 2015 by R. S. Brown 5.0 out of 5 stars Five Stars good movie \n Published on December 2, 2014 by Amazon Customer Search customer reviews Search \n Set up an Amazon Giveaway \n Amazon Giveaway allows you to run promotional giveaways in order to create buzz, reward your audience, and attract new followers and customers.  Learn more about Amazon Giveaway \n This item:  The Work And The Glory \n Set up a giveaway \n What other items do customers buy after viewing this item? \n The Work and the Glory III: A House Divided \n DVD \n 4.6 out of 5 stars \n 38 \n $11.99   Prime \n The Work and the Glory - American Zion \n DVD \n Sam Hennings \n 4.3 out of 5 stars \n 44 \n $14.25   Prime \n 17 Miracles \n DVD \n Jasen Wade \n 4.8 out of 5 stars \n 199 \n $11.99   Prime \n The Work and the Glory, Vol. 6: Praise to the Man \n Paperback \n Gerald N. Lund \n 4.8 out of 5 stars \n 159 \n 24 offers from  $2.49 \n Pages with related products. \n See and discover other items:  faith based movies ,  religious movies for kids \n There's a problem loading this menu right now. \n Learn more about Amazon Prime. \n  Get fast, free shipping with Amazon Prime  \n  Prime members enjoy FREE Two-Day Shipping and exclusive access to music, movies, TV shows, original audio series, and Kindle books.  \n      >\n       Get started \n Back to top \n Get to Know Us Careers About Amazon Investor Relations Amazon Devices Make Money with Us Sell on Amazon Sell Your Services on Amazon Sell on Amazon Business Sell Your Apps on Amazon Become an Affiliate Advertise Your Products Self-Publish with Us Become an Amazon Vendor › See all Amazon Payment Products Amazon Rewards Visa Signature Cards Amazon.com Store Card Amazon.com Corporate Credit Line Shop with Points Credit Card Marketplace Reload Your Balance Amazon Currency Converter Let Us Help You Your Account Your Orders Shipping Rates & Policies Amazon Prime Returns & Replacements Manage Your Content and Devices Amazon Assistant Help \n English \n United States \n Amazon Music   Stream millions  of songs \n Amazon Drive   Cloud storage  from Amazon \n 6pm   Score deals  on fashion brands \n AbeBooks   Books, art  & collectibles \n ACX    Audiobook Publishing  Made Easy \n Alexa   Actionable Analytics  for the Web \n Amazon Business   Everything For  Your Business \n   \n AmazonFresh   Groceries & More  Right To Your Door \n AmazonGlobal   Ship Orders  Internationally \n Home Services   Handpicked Pros  Happiness Guarantee \n Amazon Inspire   Digital Educational   Resources \n Amazon Rapids   Fun stories for   kids on the go \n Amazon Restaurants   Food delivery from  local restaurants \n Amazon Video Direct   Video Distribution  Made Easy \n   \n Amazon Web Services   Scalable Cloud  Computing Services \n Audible   Download  Audio Books \n AudiobookStand   Discount Audiobooks  on Disc \n Book Depository   Books With Free  Delivery Worldwide \n Box Office Mojo   Find Movie  Box Office Data \n ComiXology   Thousands of  Digital Comics \n CreateSpace   Indie Print Publishing  Made Easy \n   \n DPReview   Digital  Photography \n East Dane   Designer Men's  Fashion \n Fabric   Sewing, Quilting  & Knitting \n Goodreads   Book reviews  & recommendations \n IMDb   Movies, TV  & Celebrities \n IMDbPro   Get Info Entertainment  Professionals Need \n Junglee.com   Shop Online  in India \n   \n Kindle Direct Publishing   Indie Digital Publishing  Made Easy\n Prime Now   FREE 2-Hour Delivery  on Everyday Items \n Prime Photos   Unlimited Photo Storage  Free With Prime \n Shopbop   Designer  Fashion Brands \n TenMarks.com   Math Activities  for Kids & Schools \n Warehouse Deals   Open-Box  Discounts \n Whispercast   Discover & Distribute  Digital Content\n   \n Whole Foods Market   America’s Healthiest  Grocery Store \n Withoutabox   Submit to  Film Festivals \n Woot!   Deals and   Shenanigans \n Zappos   Shoes &  Clothing \n Souq.com   Shop Online in  the Middle East \n Subscribe with Amazon   Discover & try  subscription services \n   \n Conditions of Use Privacy Notice Interest-Based Ads © 1996-2017, Amazon.com, Inc. or its affiliates"}