{"url": "http://parcolympique.qc.ca/location/en/plan-an-event/tv-and-movie-shoots/", "content": "TV and movie  shoots | Parc olympique \n parcolympique.ca \n Français \n TV and movie  shoots \n A Truly Unique Site \n The Olympic Park offers a  wide range of settings  for television and film productions. This remarkable site includes the Olympic Park Stadium and Tower, a number of outdoor spaces, and vast corridors. Its underground spaces are also well known for providing a unique setting for TV and movie shoots. \n Filming crews have access to  extensive parking areas  and wide corridors that facilitate base camp set up and vehicle access, both indoors and out. \n In recent years, a number of movie, music video, and commercial shoots have been filmed at Olympic Park, including: \n 2013 :  X-Men: Days of Future Past  with Hugh Jackman and Ian McKellen \n2013 : LE GRAND SAUT – reality show \n2012 :  Red 2  with John Malkovich and Helen Mirren \n2011 :  Warm Bodies  with John Malkovich and Nicholas Hoult \n2010 :  Upside Down  with Jim Sturgess \n2009 :  Funkytown  with Patrick Huard \n2006 :  Journey to the Center of the Earth 3D  with Brendan Fraser \n2005 :  Bon Cop, Bad Cop  with Patrick Huard \n Espaces locatifs au Parc olympique - Tournages \n Espaces locatifs au Parc olympique - Tournages \n Red 2_-2 \n Red 2_-2 \n Red 2_-4 \n Red 2_-4 \n IMG_1435 \n IMG_1435 \n warm-bodies \n warm-bodies \n The Tower \n The Tower Space Rental The Tower Tourist Hall Auditorium \n The Stadium \n Baseball layout Football and soccer layouts Amphitheatre and hybrid layouts East hall and east mezzanine West Hall and Salon 76 Salon 300 and private boxes \n The Esplanade Financière Sun Life The Sports Centre Services \n Technical Services Customer Service Plumbing and Electricity Equipment and Amenities Security \n Plan your event \n Wedding Receptions Trade Shows / Conventions / Banquets Sporting Events Motorsport Events Concerts / Galas / Live Performances Training Sessions Fundraising Activities TV and movie  shoots \n Contact us   \n parcolympique.qc.ca \n Français"}