{"url": "http://www.stm.info/fr/a-propos/espace-affaires/activites-commerciales/zone-fournisseurs", "content": "Zone fournisseurs | Société de transport de Montréal \n Aller au contenu principal \n Aller au champ de recherche \n Aller au menu principal de niveau 1 \n Aller au sous-menu de niveau 2 \n Aller au sous-menu de niveau 3 \n Aller au contenu additionnel \n Aller au pied de page \n Société de transport de Montréal \n Société de transport de Montréal \n Menu \n Se déplacer \n Se déplacer \n Infos pratiques \n   Nos réseaux \n Métro \n Bus - Horaires \n Taxi collectif \n      Tout voir       \n   État du service \n État du service métro \n État du service bus \n Travaux \n      Tout voir       \n   Titres et tarifs \n Télécharger la grille tarifaire en vigueur (PDF) \n Carte OPUS et autres supports \n Titres de transport \n      Tout voir       \n   Service à la clientèle \n Nous joindre \n Centres de service \n Objets trouvés \n      Tout voir       \n   Conseils aux passagers \n 5 façons d’obtenir vos horaires \n Outils lors d'interruptions de service \n Visiteurs \n      Tout voir       \n   Règlements et sécurité \n Règlements \n Voyager en sécurité \n Constats d'infraction et amendes \n      Tout voir       \n   Accessibilité réseau \n Accès en fauteuil roulant \n Accès au métro par ascenseur \n Accessibilité déficience intellectuelle ou visuelle \n      Tout voir       \n Vers Infos pratiques \n Transport adapté \n   À propos \n Qu’est-ce que le transport adapté? \n Service à la clientèle \n Bulletin Transport Contact \n      Tout voir       \n   Admission \n Demande d'admission \n Critères d’admission \n Carte d’identité sur OPUS \n      Tout voir       \n   Titres et tarifs \n Titres et support acceptés au Transport adapté \n Montant exact \n 1 passage \n      Tout voir       \n   Utiliser le transport adapté \n Territoire desservi \n Types de déplacements \n Horaire du service \n      Tout voir       \n   Consignes et conseils \n Se préparer au déplacement \n Aides à la mobilité \n Bagages et équipement \n      Tout voir       \n   Formulaires \n      Tout voir       \n Vers Transport adapté \n Offres et sorties \n   Privilèges \n Offres exclusives \n Concours \n      Tout voir       \n   Sorties \n Événements \n Lieux de grands rassemblements \n 375e de Montréal \n      Tout voir       \n   Dans le réseau \n Étoiles du métro \n Lire vous transporte \n Exposition à l'Escale \n      Tout voir       \n   Infolettres \n Mouvement collectif \n Découvrez notre infolettre \n      Tout voir       \n   Boutique STM \n Boutique \n      Tout voir       \n Vers Offres et sorties \n À propos \n   Découvrez la STM et son histoire \n Histoire \n Art dans le métro \n STM INFO \n      Tout voir       \n   Grands projets \n Métro AZUR \n iBUS \n Mesures préférentielles pour bus (MPB) \n      Tout voir       \n   Gouvernance d'entreprise \n Conseil d’administration \n Les membres du conseil d’administration \n Participer aux travaux du conseil d’administration \n      Tout voir       \n   Informations d'entreprise et financières \n Présentation de la STM \n Plan stratégique organisationnel 2025 \n Budgets et rapports d'entreprise \n      Tout voir       \n   Sondages et consultations \n Ma voix ma STM \n Bus électriques \n Consultations publiques \n      Tout voir       \n   Accessibilité \n Accessibilité universelle \n Accessibilité web \n      Tout voir       \n   Espace affaires \n Groupes \n Activités commerciales \n Partenariats et autorisations \n      Tout voir       \n   Développeurs \n Condition d'utilisation \n Description des données disponibles \n      Tout voir       \n Vers À propos \n Découvrez la STM et son histoire   \n Grands projets   \n Gouvernance d'entreprise   \n Informations d'entreprise et financières   \n Sondages et consultations   \n Accessibilité   \n Espace affaires   \n Développeurs   \n Nous joindre   \n Emplois   \n Espace affaires   \n Salle de presse   \n Ma STM   \n English \n Rechercher dans ce site \n Zone fournisseurs \n À propos \n Espace affaires \n Activités commerciales \n Zone fournisseurs \n Groupes   \n Activités commerciales   \n TRANSGESCO- Achat d’espace publicitaire / Immobilier / Technologies / Services conseils   \n Zone fournisseurs   \n Devenir détaillant   \n Lobbyisme   \n Partenariats et autorisations   \n Politiques et code d'éthique \n Loi sur l'intégrité en matière de contrats publics \n Liste des appels d'offres \n Vous êtes un de nos fournisseurs? \n Politiques et code d'éthique   Avis aux fournisseurs : Sollicitation sur les lieux de travail de la STM   La STM est toujours ouverte à considérer de nouvelles opportunités d’affaires avec ses fournisseurs. À cet égard, nous désirons vous rappeler que la sollicitation directe auprès d’employés de la STM, sur les lieux de travail, est interdite.   \t\tVoici la marche à suivre pour nous faire part d’un produit ou d’un service :   Faites parvenir le détail de votre proposition d’affaires à l’adresse courriel :  fichier.fournisseur@stm.info . Un représentant de la Chaîne d’approvisionnement prendra connaissance de toutes les propositions reçues et transmettra l’information aux personnes concernées. Vous serez contacté uniquement si le besoin se précise.   Nous vous remercions de votre collaboration!   Politique d'appels d'offres publics de la STM   Politique de gestion contractuelle   Code d'éthique   Loi sur l'intégrité en matière de contrats publics   À compter du 2 novembre 2015, le seuil du montant des contrats et sous-contrats publics de services pour lesquels toute entreprise devra au préalable obtenir une autorisation de l'Autorité des marchés financiers (AMF) passera de 5M$ à 1M$. Cet abaissement du seuil ne touche que les contrats de services. Pour les contrats et sous-contrats de  travaux de construction , le seuil demeurera au même montant soit  5M$ . Le calcul de ces seuils applicables inclut le montant de la dépense qui serait engagée si toutes les options de renouvellement étaient exercées.   Vous pouvez obtenir plus d'information sur le site de l' AMF   Liste des appels d'offres     Texte important   La liste des contrats attribués par la STM est disponible sur le site du  seao.ca       Liste des appels d'offres publics de la STM de 2017   Liste des appels d'offres publics de la STM de 2016   Vous êtes un de nos fournisseurs?   Voici les détails concernant le mode de paiement et la facturation.     Ouvrir la section:  Mode de paiement     À l’exception des paiements en devises étrangères, le paiement s’effectue obligatoirement par transfert de fonds électroniques au fournisseur, qui doit compléter le  « Formulaire pour le transfert électronique de fonds »   prévu à cet effet. Ce mode de paiement constitue le mode de paiement le plus rapide et le plus fiable pour les deux parties. Les paiements pour des fournisseurs aux États-Unis s’effectuent par chèque. Pour le reste du monde, les paiements s’effectuent par virement international.   Note: Si le fournisseur n’accorde pas d’escompte de paiement, le terme de paiement standard appliqué sera : net 30 jours.    Le fournisseur n'a droit à aucun paiement pour un bien et/ou service livré qui n'a pas été spécifié et autorisée dans une commande officielle de la STM.   Fermer       Ouvrir la section:  Facturation     IMPORTANT :  Le cas échéant, à moins d’indication contraire aux documents contractuels de la STM  (appel d’offres, contrat de gré à gré, etc.), la facturation doit suivre les modalités suivantes :   Présentation de la facture   Le paiement de toute somme exigible s’effectue sur présentation de facture(s) accompagnée(s) des pièces justificatives requises par la STM. Toute facture doit afficher, de façon claire :   Le numéro de la facture (un numéro unique à chaque facture);   La date de la facture;   Les prix facturés avec et sans taxes;   Les montants des taxes applicables (taxe de vente du Québec (TVQ) et taxe sur les produits et services (TPS)) indiqués séparément;   Les numéros d'identification relatifs à la TVQ et la TPS;   Le numéro de commande de SEPT (7) chiffres débutant par UN (1) (1XXXXXX) ou de DIX (10) chiffres débutant par QUARANTE-CINQ (45) (45XXXXXXXX) transmis préalablement par la STM;   Le code STM, le numéro de manufacturier, le numéro de distributeur (s'il y a lieu) et la description du bien livré et/ou du service rendu;   Les termes de paiement doivent apparaître clairement sur la(les) facture(s). Si le fournisseur accorde un escompte, il doit être établi pour une période minimale de DIX (10) jours.   Note  : La STM se réserve le droit de refuser toute facture qui n’est pas conforme aux exigences précitées. Toute facture comportant des erreurs de taux et/ou de calculs pourra aussi être refusée et retournée au fournisseur, pour correction(s).  \t\t   \t\t Mode de transmission des factures    Vous pouvez transmettre vos factures via l’adresse courriel (en indiquant le numéro de contrat/commande en référence):  facture.comptesapayer@stm.info   Cette adresse courriel est RÉSERVÉE UNIQUEMENT à l’envoi de factures et d’états de compte. Aucun message contenu à l’intérieur des courriels ne sera traité. La transmission des factures par courriel doit respecter les conditions suivantes :   La facture doit être en pièce jointe;   Chaque pièce jointe doit contenir une seule facture, mais une facture peut comporter plusieurs pages;   Un courriel peut contenir plusieurs pièces jointes;   Le fournisseur qui envoie une facture ou un état de compte par courriel s'engage, sur demande de la STM, à être en mesure de fournir un original papier de la facture pendant une période de SEPT (7) ans, à partir de la date de la facture, ou de TROIS (3) ans après la fin du Contrat, selon la plus tardive de ces dates;   Si votre contrat prévoit l’envoi électronique de vos factures à un intervenant autre que le Service des comptes à payer de la STM, veuillez poursuivre cette consigne de transmission.   Seules les factures en format PDF seront acceptées et seront traitées;   Vous ne recevrez aucune confirmation par courriel de la réception de votre envoi. Par ailleurs, si le contenu ne respecte pas les conditions énumérées ci-dessus, les factures ne seront pas traitées et aucun courriel ne vous sera envoyé pour vous en informer.   En transmettant une facture à cette adresse courriel, votre entreprise s’engage à respecter les conditions indiquées ci-dessus.   Pour toute question à ce sujet, veuillez contacter le 514-350-0800, poste 87427.   Fermer     \n Haut de page \n Liens utiles   Événements, tournages, photos   Zone fournisseurs   Grille tarifaire en vigueur (PDF)   Location de bus   Location de navettes scolaires et navettes camps de jour    Nous joindre   OPUS & Cie   Plans des réseaux   Titres de transport en grande quantité   Visiteurs   Voyager avec un groupe de jeunes sur le réseau de la STM   Voyager en sécurité   5 façons d’obtenir vos horaires    \n Liens rapides \n Répondre aux sondages \n Accessibilité Réseau \n 5 façons d'obtenir vos horaires \n Service à la clientèle \n Privilèges \n Facebook \n Twitter \n YouTube \n Instagram \n        ©  STM  1997-2017       \n Réseau bus \n Réseau métro \n Notes juridiques \n Développeurs \n Accessibilité Web \n Plan du site \n Restez en contact"}