{"url": "https://so.wikipedia.org/wiki/Kacsi", "content": "Kacsi - Wikipedia \n Kacsi   \n Ka Wikipedia   \n\t\t\t\t\tU bood:\t\t\t\t\t gooshitaan , \t\t\t\t\t raadi \nFarqiga naagta kacsan \n Kacsi  (ingiriis: libido ama sexual arousal) waa dareen naasley helaan waqtiga ey rabaan  galmo . Ragga, galmo diyaar markay u yihiin, guskooda ba kor u kaca. Dumarka, galmo diyaar markay u yihiin,  siilkooda  baa  dareere  ka yimaada. \nFarqiga ninka kacsan \n\t\t\t\t\t\tWaxaa laga keenay \" https://so.wikipedia.org/w/index.php?title=Kacsi&oldid=168642 \"\t\t\t\t\t \n Qeybta :  Bayoloji   \n Liiska laga galo \n Qalabkaaga \n Gudaha kuma jirtid Wadahadalka ciwaanka IP:kaan Contributions Samayso gudagal Gudaha gal   \n Xarun magaceedyada \n Bog Wadahadal   \n Isbedelada \n Muuqaalka \n Akhri Wax ka bedel Wax ka bedel xogta Itusi taariikhda   \n More \n Raadi \n Gooshitaan \n Bogga Hore Bortaalka jaaliyada Dhacdooyinka cusub Isbedelada dhow Ku nasiibso bog Caawinaad Tabarucid   \n Print/export \n Create a book Download as PDF Nooc la daabicikaro   \n In other projects \n Wikimedia Commons   \n Qalabka shaqada \n Maxaa meeshaan la xiriiro Isbedelada la'xiriira Soo geli file bogagga khaaska ah Linkiga daaimka ah Macluumad ku saabsan Qaybta caddeynaha Boggaan soo xigo   \n Luqadaha kale \n Alemannisch العربية Беларуская (тарашкевіца)‎ Български Català Čeština Dansk Deutsch Ελληνικά English Español Eesti Euskara فارسی Suomi Français Frysk Galego עברית Hrvatski Bahasa Indonesia Italiano 日本語 한국어 Lietuvių Bahasa Melayu မြန်မာဘာသာ नेपाल भाषा Nederlands Norsk Polski Português Русский Simple English Slovenčina Svenska ไทย Tagalog Татарча/tatarça Українська 中文   \n Bedel linkiga   \n  Boggan waxaa markii ugu dambeysay wax laga bedelay 11:53, 22 May 2017. \n Qoralka waa la heli karaa sida uu qabo  Ruqasadda Commons ee hindisidda ee marka loo eego la midka ;\nwaxaa soo hoos gali kara qodobo kale.\nEeg  Shuruudaha adeegsiga  ee faahfaahinta. \n Xeerka Wiki \n Ku saabsan Wikipedia \n Masuul la'aan \n Developers \n Cookie statement \n Nuqul mobil"}