{"url": "http://www.w3.org/TR/2016/NOTE-WCAG20-TECHS-20161007/F81", "content": "F81: Failure of Success Criterion 1.4.1 due to identifying required or error fields using color differences only | Techniques for WCAG 2.0\n               Techniques for WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  Failure F80 Next:  Failure F82 On this page: Important Information about Techniques Applicability Description Examples Tests -     F81: Failure of Success Criterion 1.4.1 due to identifying required or error fields using color differences only Important Information about Techniques See  Understanding Techniques for WCAG Success Criteria  for important information about the usage of these informative techniques and how they relate to the normative WCAG 2.0 success criteria. The Applicability section explains the scope of the technique, and the presence of techniques for a specific technology does not imply that the technology can be used in all situations to create content that meets WCAG 2.0. Applicability All technologies This failure relates to: \n\t\t\t\tSuccess Criterion 1.4.1 (Use of Color) \n\t\t\t\t\t\tHow to Meet 1.4.1 (Use of Color)\n\t\t\t\t\t\tUnderstanding Success Criterion 1.4.1 (Use of Color)\n\t\t\t\t\t Description This objective of this technique is to describe the failure that occurs when a required field or an error field is marked with color differences only, without an alternate way to identify the required field or error field. This can cause problems for people who are blind or colorblind, because they may not be able to perceive the color differences that indicate which field is required or which field is causing an error. Examples A user is completing an online form, and the phone number field is required. To indicate that the phone number field is required, the label \"Phone Number\" is displayed in a color different from the color used for optional fields, without any other indication that \"Phone Number\" is a required field. A blind or colorblind user may not be able to identify that \"Phone Number\" is a required field. A user submits an online form and leaves a required field blank, resulting in an error. The form field that caused the error is indicated by red text only, without an additional non-color indication that the field caused an error. Note:  In both examples, the color could be used without failure if the text was sufficiently different in visual presentation (e.g. bold or in a different font) that it would be easily differentiated from the surrounding text if the color were removed. It would also not fail if the color chosen had sufficient luminosity difference (lightness) from the other text that it would be easily be seen as different if viewed in black and white.  In these cases - the information would not be displayed in color (hue) alone but also in \"presentation\" or \"lightness\" respectively.  Tests Procedure For all required fields or error fields in the Web page that are identified using color differences: Check that an non-color way to identify the required field or error field is provided. Expected Results If step #1 is false, then this failure condition applies and content fails the Success Criterion. Top Contents Intro Previous:  Failure F80 Next:  Failure F82 This Web page is part of  Techniques and Failures for Web Content Accessibility Guidelines 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}