{"url": "https://www.gerezmieuxvotreargent.ca/conditions-dutilisation/", "content": "Conditions d’utilisation | GetSmarterAboutMoney.ca \n Passer au contenu \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n A \n Utiliser une police de taille normale \n A \n Utiliser une police de grande taille \n  Contraste\t\t\t \n English \n     Menu \n A \n Utiliser une police de taille normale \n A \n Utiliser une police de grande taille \n  Contraste\t\t\t \n English \n Recherche pour: \n Search \n Investir \n Notions de base sur les placements \n Faites vos premiers pas \n Introduction multilingue \n Comprendre le risque \n Conseils financiers \n Préparer un plan \n Suivi de votre progression \n Produits d’investissement \n Rentes \n Obligations \n Placements complexes \n Fonds négociés en bourse \n Titres dispensés de prospectus \n Fonds communs de placement et fonds distincts \n Immobilier \n Obligations d’épargne \n Actions \n Régimes d’épargne et de retraite au travail \n Régimes d’epargne \n Régimes enregistrés d’épargne-études \n Régimes enregistrés d’épargne-retraite \n Fonds enregistrés de revenu de retraite \n Régimes enregistrés d’épargne-invalidité \n Comptes d’épargne libre d’impôt \n Planifier et gérer \n Notions de base sur la planification \n Comptes bancaires \n Budget \n Planification financière \n Assurance de personnes \n Comprendre l’impôt \n Gérer ses dettes \n Épargner \n Testaments et planification d’une succession \n Les vérités universelles \n Retraite \n Planification de la retraite \n Vivre votre retraite \n Régimes enregistrés d’épargne-retraite \n Fonds enregistrés de revenu de retraite \n Rentes \n Régimes d’épargne et de retraite au travail \n Conseils financiers \n Faire affaire avec un conseiller \n Trouver un conseiller \n Verification de l’inscription \n Porter plainte \n Le rendement des placements et le coût des conseils \n Événements de la vie \n Planifier votre avenir \n Acheter une maison \n Mourir \n Éducation \n Se divorcer \n Se marier \n Avoir un bébé \n Hériter de l’argent \n Planification de la retraite \n Élever une famille \n Protéger votre argent \n Avertissements à l’intention des investisseurs \n Fraude \n Se protéger contre la fraude \n Signaler une escroquerie \n Verification de l’inscription \n Protection des investisseurs \n Réglementation au Canada \n Verification de l’inscription \n Porter plainte \n Introduction du financement participatif en capital \n Le rendement des placements et le coût des conseils \n Calculatrices et outils \n Calculatrices \n Intérêts composés \n Récupérer la valeur d’un placement \n Frais associés aux fonds communs de placement \n Valeur nette \n Rembourser des dettes ou investir \n Rembourser des cartes de crédit et d’autres dettes \n Rendement d’un portefeuille par rapport à des indices de référence \n Épargne REEE \n Épargne REER \n CELI \n Outils \n Le Match monétaire mental \n Aperçu du fonds : exemple interactif \n Questionnaire sur l’amour et l’argent \n Questionnaire sur le profil de risque \n Sondage de 2014 sur l’état d’esprit des Canadiens face aux risques liés à l’argent \n Votre modèle d’énoncé de politique de placement \n Graphique Interactif – Placements \n Feuilles de calcul \n Ressources \n Publications \n Bulletin électronique \n Recherches et rapports \n Glossaire \n Fiches d’information \n Infographies \n Brochures \n Introduction multilingue \n Re: Investir \n Le rendement des placements et le coût des conseils \n Introduction du financement participatif en capital \n Home  >  Conditions d’utilisation \n Conditions d’utilisation \n Conditions d’utilisation \n La Commission des valeurs mobilières de l’Ontario (CVMO) offre le présent site Web et ses sites de médias sociaux (dont ses blogues ainsi que ses pages Facebook, LinkedIn, Pinterest, Twitter et YouTube) en tant que service public sans but lucratif et à des fins d’information et d’éducation uniquement. En accédant au présent site Web ou en l’utilisant, ou encore en participant aux activités des sites de médias sociaux de la CVMO (par exemple en suivant, en lisant, en consultant, en partageant ou en utilisant d’une quelconque façon les éléments affichés ou le contenu), vous reconnaissez avoir lu et compris les présentes conditions d’utilisation et vous acceptez d’être lié par ces conditions d’utilisation, lesquelles peuvent être modifiées périodiquement. SI VOUS N’ACCEPTEZ PAS LES PRÉSENTES CONDITIONS D’UTILISATION, VEUILLEZ NE PAS ACCÉDER AU PRÉSENT SITE WEB NI PARCOURIR UNE QUELCONQUE PARTIE DE CELUI-CI, NI PARTICIPER AUX ACTIVITÉS DES SITES DE MÉDIAS SOCIAUX DE LA CVMO, QUELS QU’ILS SOIENT. Le FEI peut modifier périodiquement les présentes conditions d’utilisation; il lui suffira d’afficher les modifications sur son site Web. Vous devriez passer en revue les conditions d’utilisation chaque fois que vous visitez le présent site Web ou que vous participez à des activités dans les sites de médias sociaux de la CVMO. \n Loi applicable \n Le présent site Web et les sites de médias sociaux de la CVMO sont gérés par la CVMO à partir de ses bureaux situés dans la province de l’Ontario, au Canada. Toutes les questions liées à votre accès ​au présent site Web, et à votre utilisation de celui-ci, ou aux sites de médias sociaux de la CVMOis le contenu s’y trouvant), ou à votre utilisation de ceux-ci, sont régies par les lois de la province de l’Ontario et par les lois du Canada qui s’appliquent aux présentes, sans égard aux principes relatifs aux conflits de lois. En cas de litige, vous acceptez de vous soumettre à la compétence non exclusive des tribunaux de la province de l’Ontario. \n Droits de propriété intellectuelle \n La CVMO détient la totalité des droits d’auteur et des autres droits de propriété intellectuelle liés à la totalité du contenu du présent site Web, au code sous-jacent du site Web et à la totalité du contenu de ses sites de médias sociaux, ou elle a la permission du titulaire de ces droits d’utiliser le contenu dans le présent site Web ou dans les sites de médias sociaux en question. La mention ou l’affichage de marques de commerce, de noms commerciaux ou de marques de service dans le présent site Web ou dans tout site de médias sociaux de la CVMO ne transfère ni ne crée aucune licence ni aucun autre droit d’utiliser les noms et les marques en question. \n Licence restreinte d’utilisation du contenu \n La CVMO vous accorde une licence restreinte pour afficher à votre ordinateur, télécharger, imprimer et utiliser le contenu du présent site Web et des sites de médias sociaux de la CVMO uniquement pour vos propres besoins d’information ou à des fins d’éducation, d’enseignement et de formation. Il vous est interdit de modifier quelque partie que ce soit du contenu que vous utilisez. Il vous est interdit d’utiliser le contenu du présent site Web ou de tout site de médias sociaux de la CVMO à des fins commerciales, quelles qu’elles soient. \n Utilisations devant faire l’objet d’une autorisation écrite préalable \n Si vous souhaitez utiliser le contenu du présent site Web ou de tout site de médias sociaux de la CVMO à d’autres fins, dont : a) la revente de tout contenu; b) l’ajout de tout contenu à un produit que vous créez ou que vous distribuez; c) la copie de tout contenu dans votre propre site Web ou dans tout autre site Web, assujetti aux conditions d’utilisation d’une tierce partie pour tout site de médias sociaux en question, vous devez obtenir l’autorisation écrite préalable de la CVMO. Pour demander cette autorisation, veuillez nous écrire par courriel à l’adresse InvestorOffice@osc.gov.on.ca et décrire l’utilisation prévue du contenu, en précisant le contenu que vous souhaitez utiliser, la manière dont vous comptez l’utiliser et la durée de l’utilisation. Si la CVMO autorise l’utilisation que vous proposez, elle peut exiger que vous respectiez certaines conditions d’utilisation. Si la CVMO rejette votre demande, il vous est alors interdit d’utiliser le contenu aux fins proposées. \n Les renseignements figurant dans le présent site Web ou dans les sites de médias sociaux de la CVMO ne constituent pas la politique officielle de la CVMO ni des conseils juridiques ou financiers \n Les renseignements fournis dans le présent site Web ou dans les sites de médias sociaux de la CVMO doivent être utilisés uniquement à titre d’information ou à des fins d’éducation. Ils ne visent aucunement à fournir des conseils financiers, comptables, légaux, fiscaux, de placement ou autres conseils professionnels et ne doivent d’aucune façon être considérés comme un substitut. Nous vous recommandons de consulter un conseiller professionnel compétent avant d’utiliser toute information ou autre contenu figurant sur le présent site Web, les sites de médias sociaux de la CVMO ou tout site Web pouvant être lié.​ \n Exactitude et garanties \n Même si le contenu du présent site Web, et tout contenu affiché par la CVMO elle-même sur ses sites de médias sociaux, est considéré comme complet et exact au moment de l’affichage, nous ne pouvons garantir qu’il est exact et complet ou qu’il le demeurera ou qu’il sera disponible sans interruption. \n NI LA CVMO NI AUCUN DE SES FOURNISSEURS NE PEUT GARANTIR LA QUALITÉ, L’EXACTITUDE, LE CARACTÈRE ACTUEL OU L’EXHAUSTIVITÉ DE TOUT CONTENU OU CALCUL AFFICHÉ DANS LE PRÉSENT SITE WEB OU DANS LES SITES DE MÉDIAS SOCIAUX DE LA CVMO. NI LA CVMO NI AUCUN DE SES FOURNISSEURS NE POURRA ÊTRE TENU RESPONSABLE D’AUCUN DOMMAGE NI D’AUCUNE RÉCLAMATION, QUELLE QU’EN SOIT LA NATURE, QUI POURRAIT DÉCOULER DE L’UTILISATION OU ÊTRE ASSOCIÉ À L’UTILISATION, SOUS QUELQUE FORME QUE CE SOIT, DU PRÉSENT SITE WEB, DE TOUT SITE DE MÉDIAS SOCIAUX DE LA CVMO OU ENCORE DE LEUR CONTENU OU LEURS CALCULATRICES RESPECTIFS, QUEL QUE SOIT LE BUT DE L’UTILISATION. \n NI LA CVMO NI AUCUN DE SES FOURNISSEURS NE FORMULE DE GARANTIES, DE REPRÉSENTATIONS OU DE CONDITIONS, EXPRESSES OU IMPLICITES, Y COMPRIS, MAIS SANS S’Y LIMITER, DES GARANTIES, DES REPRÉSENTATIONS OU DES CONDITIONS IMPLICITES RELATIVES À LA QUALITÉ MARCHANDE, À LA QUALITÉ ET À L’ADAPTATION À UN USAGE PARTICULIER, À L’ABSENCE DE CONTREFAÇON OU À TOUTE AUTRE VIOLATION DES DROITS DÉCOULANT D’UNE LOI, DE L’USAGE DU COMMERCE, DE LA CONDUITE HABITUELLE DES AFFAIRES OU DE TOUT AUTRE ÉLÉMENT. NI LA CVMO NI AUCUN DE SES FOURNISSEURS NE DONNE AUCUNE  GARANTIE Garantie  Bien ou actifs que vous engagez comme emprunteur afin de garantir le remboursement du prêt. Vous pourriez perdre la garantie si vous ne remboursez pas le prêt. + read full definition  NI NE FAIT AUCUNE DÉCLARATION CONCERNANT L’UTILISATION, L’EXACTITUDE, LE CARACTÈRE ACTUEL, LE CARACTÈRE APPLICABLE, LA PERFORMANCE, LA SÉCURITÉ, L’ACCESSIBILITÉ OU LA FIABILITÉ DU PRÉSENT SITE WEB, DE TOUT SITE DE MÉDIAS SOCIAUX DE LA CVMO, TOUT SITE CONTENANT DU CONTENU INCORPORABLE, NI DE TOUT AUTRE SITE DONT LE LIEN FIGURE DANS LES SITES SUSMENTIONNÉS; ÉGALEMENT, NI LA CVMO NI AUCUN DE SES FOURNISSEURS NE DONNE AUCUNE GARANTIE NI NE FAIT AUCUNE DÉCLARATION CONCERNANT LES RÉSULTATS DÉCOULANT DE L’UTILISATION DES SITES SUSMENTIONNÉS, OU AUTREMENT LIÉS AU CONTENU OU AUX CALCULATRICES DU PRÉSENT SITE WEB, DE TOUT SITE DE MÉDIAS SOCIAUX DE LA CVMO, TOUT SITE CONTENANT DU CONTENU INCORPORABLE, OU DE TOUT SITE DONT LE LIEN FIGURE DANS LE PRÉSENT SITE WEB OU DANS N’IMPORTE LEQUEL DES SITES DE MÉDIAS SOCIAUX EN QUESTION. \n Contenu incorporable \n Lorsqu’un code d’incorporation est fourni pour afficher le contenu sur le présent site Web (« contenu incorporable »), vous recevez une licence restreinte vous permettant d’utiliser et d’afficher le contenu incorporable sur votre site Web sous réserve des conditions supplémentaires suivantes : \n Vous ne pouvez pas facturer l’accès au contenu incorporable aux utilisateurs de votre site Web en vue d’obtenir de la publicité ou de commercialiser le contenu incorporable de toute autre manière. \n Le contenu incorporable est autorisé sous licence « tel quel », vous l’utilisez à vos propres risques et sous réserve des renonciations qui figurent dans les présentes conditions d’utilisation. \n Vous ne pouvez pas suggérer que la CVMO recommande ou appuie votre site Web ou toute entité, tout produit ou contenu, ou opinion exprimée sur votre site Web. \n Vous ne pouvez pas utiliser le contenu incorporable en lien avec tout autre contenu ou site Web qui :\n pourrait être considéré comme diffamatoire, indécent, obscène, harcelant, violent ou répréhensible; \n porte atteinte aux droits d’autrui (notamment aux droits à la vie privée et les droits de propriété) ou enfreint les lois d’une compétence juridique, quelle qu’elle soit; \n se fait passer pour une autre personne ou représente faussement votre identité ou votre statut; \n fait de fausses déclarations quant à une affiliation à une personne ou à un organisme; \n télécharge ou transmet autrement des fichiers contenant des virus ou des données corrompues; \n recueille des renseignements sur d’autres personnes (y compris des adresses de courriel) sans leur consentement. ​ \n ​​​​Vous ne pouvez pas modifier, bloquer, ni enlever les avis de droit d’auteur ou les liens des conditions d’utilisation figurant dans le contenu incorporable. \n Dans la mesure permise par la loi, vous vous engagez à tenir la CVMO et ses membres, employés et agents indemnes et  à couvert À couvert  Stratégie de placement selon laquelle vous achetez une valeur mobilière qui, selon vous, augmentera de valeur. + read full definition  de toute dépense ou réclamation ou tout coût subis par la CVMO, y compris les frais juridiques, les pertes (réelles et consécutives), jugements ou dommages découlant : (i) de votre utilisation du contenu incorporable; (ii) de toute violation de votre  part Part  Ce que vous achetez lorsque vous investissez dans un fonds commun de placement. Semblable à une action. Par exemple, vous pourriez acheter 100 parts dans un fonds commun de placement. + read full definition  des présentes conditions d’utilisation. Si vous êtes un organisme gouvernemental qui ne peut légalement concéder une telle indemnité, cette indemnité ne s’appliquera pas à vous. \n Vous convenez que la CVMO a le droit de surveiller votre utilisation du contenu incorporable, notamment l’achalandage que vous générez. \n La CVMO peut suspendre le fonctionnement du contenu incorporable en tout temps et sans préavis, en cas d’entretien ou pour toute une autre raison. L’accès au contenu incorporable ou à toute page liée, ou leur utilisation, ne sera pas nécessairement ininterrompu ni sans erreur. \n La CVMO se réserve le droit de résilier votre licence ou votre utilisation du contenu incorporable ou d’y mettre fin à tout moment, sans préavis. \n Vous pouvez résilier la présente licence à tout moment en cessant d’utiliser le contenu incorporable et en le retirant de votre site Web. \n Toute résiliation de la présente licence n’affectera en rien les droits acquis ou les obligations de l’une ou l’autre des parties ni les dispositions des présentes, qui sont expressément ou implicitement appelées à entrer ou à rester en vigueur après une telle résiliation, notamment la disposition 6. \nLiens vers d’autres sites Web ou sites de médias sociaux \n ​Les liens hypertextes menant vers d’autres sites Web ou sites de médias sociaux ne sont présentés que par souci de commodité. La CVMO ne cautionne aucune déclaration pouvant être faite ni aucun service ou produit pouvant être mentionné ou annoncé sur ces sites Web ou sites de médias sociaux, pas plus qu’elle ne régit l’utilisation du contenu de ces sites Web ou sites de médias sociaux. \n Liens à partir d’autres sites Web \n L’accès au présent site Web ou à tout site de médias sociaux de la CVMO peut se faire à partir d’un lien hypertexte ou d’un autre lien se trouvant dans un autre site Web ou site de médias sociaux. Bien que la CVMO apprécie les liens fournis dans des sites Web et des sites de médias sociaux de tierces parties et encourage l’utilisation de tels liens, la CVMO n’assume aucune responsabilité quant au contenu de ces sites et ne cautionne pas, n’autorise pas, n’approuve pas, n’atteste pas, ne maintient pas et ne contrôle pas ces autres sites, ni ne garantit l’exactitude, l’exhaustivité, l’efficacité ou le caractère actuel des renseignements se trouvant sur ces sites. \n Utilisations interdites \n Vous ne pouvez pas utiliser le site Web d’une façon qui pourrait endommager, désactiver, surcharger ou affaiblir le site Web ou tout autre système ou réseau connecté au site Web, ou interférer avec l’utilisation et la jouissance du site Web par un tiers. Vous ne tenterez pas d’obtenir un accès non autorisé au site Web ou à tout autre système ou réseau connecté au site Web en le piratant, en récupérant illicitement des mots de passe ou par d’autres moyens. Vous ne pouvez pas obtenir ou tenter d’obtenir des documents ou de l’information, par tout moyen non intentionnel disponible ou fourni par le site Web. \n Retrait du droit d’accès \n La CVMO peut, à tout moment, sans préavis, à sa seule discrétion et sans justification, vous retirer le droit d’accéder au présent site Web ou à tout site de médias sociaux de la CVMO, au contenu incorporable ou le droit d’utiliser ces sites. \n Généralités​ \n Dans le cas où une condition figurant dans les présentes conditions d’utilisation s’avère être invalide, inopposable ou illégale, pour quelque raison que ce soit, les autres conditions demeureront en vigueur. Le défaut de la CVMO d’assurer le respect de ces conditions d’utilisation ne constitue pas une renonciation à tout droit ou privilège de la CVMO en vertu des présentes conditions d’utilisation. Si les présentes conditions d’utilisation sont traduites dans une autre langue que l’anglais et qu’il y a des divergences entre les traductions, la version anglaise prévaudra et aura préséance. \n Directives concernant les médias sociaux \n La CVMO encourage tous les utilisateurs à discuter et à interagir avec la communauté de GerezMieuxVotreArgent.ca/GetSmarterAboutMoney.ca, notamment par l’intermédiaire de ses blogues, de Facebook, de Twitter, de YouTube et d’autres sources de contenu. Nous vous invitons à afficher vos points de vue et vos opinions en réaction à tout contenu affiché par la CVMO ou autrement publié sur les sites de médias sociaux de la CVMO. Toutefois, en participant aux activités de tout site de médias sociaux de la CVMO, vous acceptez de respecter les directives suivantes. \n Aucune recommandation.  Le contenu partagé sur les sites de médias sociaux de la CVMO ne doit pas être considéré comme une recommandation de l’auteur, du contenu partagé ou de tout autre organisme auquel le contenu partagé fait référence. Le fait d’être suivi par la CVMO ne suppose aucune recommandation. \n Conditions concernant les tierces parties.  Vous reconnaissez que votre utilisation des sites de médias sociaux du FEI est régie non seulement par les présentes directives, mais aussi par les directives et autres conditions précisées par l’exploitant du site de médias sociaux. En participant aux activités de tout site de médias sociaux du FEI, vous acceptez de respecter les directives et les conditions de l’exploitant. \n Votre contenu.  Vous reconnaissez que le contenu, les points de vue, les opinions, les réponses aux questions ou autres renseignements que vous téléchargez, exprimez, soumettez ou affichez de quelque façon que ce soit sont mis à la disposition du public. D’autres participants peuvent utiliser les renseignements que vous affichez, indépendamment de la volonté de la CVMO. Si vous ne voulez pas que des renseignements que vous possédez soient rendus publics ou utilisés, publiés, copiés ou imprimés par la CVMO ou par toute autre personne, veuillez ne pas afficher ces renseignements. \n Aucune responsabilité concernant les points de vue ou les opinions des tierces parties.  Le contenu, les points de vue, les opinions, les réponses aux questions et les autres renseignements téléchargés, exprimés, soumis ou affichés de quelque façon que ce soit par les auteurs, les commanditaires, les annonceurs ou les usagers du site de médias sociaux visé, y compris sur les « murs », sur les pages Web, sur les babillards et dans les groupes du site, ou communiqués de quelque façon que ce soit par l’intermédiaire du site, autres que le contenu fourni par la CVMO, ne sont que les points de vue, les opinions et la responsabilité de la personne qui les présente et ne reflètent pas nécessairement les opinions de la CVMO. La CVMO n’est pas responsable du contenu que des tierces parties publient, affichent, téléchargent, distribuent, diffusent ou transmettent de quelque façon que ce soit par l’un ou l’autre des sites de médias sociaux de la CVMO. \n Droit de modération.  La CVMO se réserve le droit exclusif d’examiner, de modifier et de supprimer les commentaires, points de vue, opinions, réponses ou autre contenu qu’il juge inapproprié. La CVMO n’approuve pas le harcèlement, les attaques, les insultes, la vulgarité ou l’indécence à l’écrit. Vous devez vous engager à ne pas faire ce qui suit : (i) télécharger dans l’un ou l’autre des sites de médias sociaux de la CVMO ou transmettre au moyen de ceux-ci du contenu diffamatoire, indécent, obscène, provoquant, violent ou autrement critiquable, ou tout contenu qui est, ou qui pourrait être, protégé par un droit d’auteur, sans la permission du détenteur de ce droit d’auteur; (ii) utiliser l’un ou l’autre des sites de médias sociaux de la CVMO pour porter atteinte aux droits d’autrui (notamment aux droits à la confidentialité et à la protection des renseignements personnels) ou pour enfreindre les lois d’une compétence juridique, quelle qu’elle soit; (iii) faire de fausses déclarations quant à votre affiliation à une personne ou à une organisation; (iv) télécharger dans les sites de médias sociaux de la CVMO ou transmettre au moyen de ceux-ci tout type de publicité ou de sollicitation commerciale; (v) télécharger ou transmettre autrement des fichiers comportant des virus ou des données corrompues; (vi) recueillir des renseignements sur d’autres personnes (y compris des adresses de courriel) sans leur consentement; (vii) télécharger ou transmettre des fichiers ou des photos ou encore inclure des liens (dans des commentaires) qui, selon ce que vous savez ou avez des raisons de croire, ne peuvent pas être diffusés légalement par l’intermédiaire des sites de médias sociaux de la CVMO ou dont vous devez préserver la confidentialité; (viii) vous livrer à toute autre activité ayant pour effet de limiter ou d’empêcher l’utilisation ou l’appréciation des sites de médias sociaux de la CVMO par quelque personne que ce soit ou qui, selon la CVMO, pourrait causer préjudice à la CVMO ou aux visiteurs des sites de médias sociaux de la CVMO ou les rendre vulnérables à des poursuites. \n Aucune obligation de surveiller, de modérer ou de répondre.  Bien que la CVMO se réserve le droit d’examiner, de modifier ou de supprimer les commentaires, points de vue, opinions, réponses ou autre contenu qu’elle juge inappropriés, elle n’est pas dans l’obligation de le faire. Ainsi, vous reconnaissez que la CVMO ne peut examiner l’ensemble du contenu affiché dans ses sites de médias sociaux, pas plus qu’elle ne peut garantir le retrait immédiat du contenu critiquable. Par conséquent, la CVMO n’assume aucune responsabilité pour les actions ou l’inaction concernant les transmissions, les communications ou le contenu fourni par des tierces parties. La CVMO n’a également aucune obligation envers qui que ce soit en ce qui concerne l’exécution ou la non-exécution des activités décrites dans le présent paragraphe et dans le paragraphe précédent. \n Conséquences de la non-conformité.  Si vous ne respectez pas les présentes directives, la CVMO pourrait vous retirer le droit d’accéder à ses sites de médias sociaux. \n Politique de confidentialité \n L’utilisation de ce site Web est assujettie aux conditions de la  politique de confidentialité de la CVMO . \n Dernière mise à jour le  14 juin 2017   \n Communiquez avec nous \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n À notre sujet \n Communiquez avec nous \n Bulletin électronique \n Médias \n Multilingue \n Glossaire \n OSC in the Community \n Site Web de la CVMO \n Conditions d’utilisation \n Politique de confidentialité \n Accessibilité à la Commission des valeurs mobilières de l’Ontario \n Communiquez avec nous \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n Inscrivez-vous à l'Actualité des investisseurs \n Tenez-vous au courant des plus récentes initiatives visant les investisseurs, des ressources pédagogiques ainsi que des avertissements et des alertes à l’intention des investisseurs. \n Inscrivez-vous \n Consulter les numéros précédents \n © Commission des valeurs mobilières de l’Ontario 2017 \n Partager sur Facebook \n Partager sur Twitter \n Partager par courriel \n Imprimer l'article \n Partager sur les réseaux sociaux \n Nous poser une question sur l'investissement \n Partage sur les réseaux sociaux \n Fermer le lien sur l'investissement \n Partager sur Facebook \n Partager sur Twitter \n Partager par courriel"}