{"url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast.html", "content": "Understanding Guideline 1.4  | Understanding WCAG 2.0\n  \t\t\t\t Understanding WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  SC  1.3.3 [Sensory Characteristics] Next:  SC  1.4.1 [Use of Color] On this page: Intent Advisory Techniques Success Criteria -   Distinguishable : Understanding Guideline 1.4 Guideline 1.4:  \n            Make it easier for users to see and hear content including separating foreground from background.\n\t\t\tIntent of Guideline 1.4 While some guidelines are focused on making information available in a form that can be presented in alternate formats, this guideline is concerned with making the default presentation as easy to perceive as possible to people with disabilities. The primary focus is on making it easier for users to separate foreground information from the background. For visual presentations this involves making sure that information presented on top of a background contrasts sufficiently with the background. For audio presentations this involves making sure that foreground sounds are sufficiently louder than the background sounds. Individuals with visual and hearing disabilities have much greater difficulty separating foreground and background information.     \n\t\t\tAdvisory Techniques for Guideline 1.4 (not success criteria specific) Specific techniques for meeting each Success Criterion for this guideline are listed in the understanding sections for each Success Criterion (listed below). If there are techniques, however, for addressing this guideline that do not fall under any of the success criteria, they are listed here. These techniques are not required or sufficient for meeting any success criteria, but can make certain types of Web content more accessible to more people. Using readable fonts (future link) Making sure any text in images of text is at least 14 points and has good contrast (future link)\n             Providing a highly visible highlighting mechanism for links or controls when they receive keyboard focus (future link)\n             Success Criteria for this Guideline: \n\t\tUnderstanding Success Criterion 1.4.1  [Use of Color]\n\t\tUnderstanding Success Criterion 1.4.2  [Audio Control]\n\t\tUnderstanding Success Criterion 1.4.3  [Contrast (Minimum)]\n\t\tUnderstanding Success Criterion 1.4.4  [Resize text]\n\t\tUnderstanding Success Criterion 1.4.5  [Images of Text]\n\t\tUnderstanding Success Criterion 1.4.6  [Contrast (Enhanced)]\n\t\tUnderstanding Success Criterion 1.4.7  [Low or No Background Audio]\n\t\tUnderstanding Success Criterion 1.4.8  [Visual Presentation]\n\t\tUnderstanding Success Criterion 1.4.9  [Images of Text (No Exception)]\n\t Top Contents Intro Previous:  SC  1.3.3 [Sensory Characteristics] Next:  SC  1.4.1 [Use of Color] This Web page is part of  Understanding WCAG 2.0: A guide to understanding and implementing WCAG 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}