{"url": "https://www.amazon.com/Once-Upon-Time-Mexico-Blu-ray/dp/B0048LVDGM", "content": "Amazon.com: Once Upon a Time in Mexico [Blu-ray]: Eva Mendes, Danny Trejo, Marco Leonardi, Cheech Marin, Ruben Blades, Willem Dafoe, Antonio Banderas, Salma Hayek, Mickey Rourke, Johnny Depp, Enrique Iglesias, Robert Rodriguez, Carlos Gallardo, Elizabeth Avellán, Balls Out Productions Ltd.: Movies & TV \n Interesting Finds Updated Daily \n Amazon \n    Try Prime\n Movies & TV \n Select the department you want to search in \n All Departments \n Cyber Monday Deals Week \n Alexa Skills \n Amazon Devices \n Amazon Video \n Amazon Warehouse Deals \n Appliances \n Apps & Games \n Arts, Crafts & Sewing \n Automotive Parts & Accessories \n Baby \n Beauty & Personal Care \n Books \n CDs & Vinyl \n Cell Phones & Accessories \n Clothing, Shoes & Jewelry \n    Women \n    Men \n    Girls \n    Boys \n    Baby \n Collectibles & Fine Art \n Computers \n Courses \n Credit and Payment Cards \n Digital Music \n Electronics \n Garden & Outdoor \n Gift Cards \n Grocery & Gourmet Food \n Handmade \n Health, Household & Baby Care \n Home & Business Services \n Home & Kitchen \n Industrial & Scientific \n Kindle Store \n Luggage & Travel Gear \n Luxury Beauty \n Magazine Subscriptions \n Movies & TV \n Musical Instruments \n Office Products \n Pet Supplies \n Prime Exclusive Savings \n Prime Pantry \n Software \n Sports & Outdoors \n Tools & Home Improvement \n Toys & Games \n Vehicles \n Video Games \n Wine \n Go \n          Search\n Departments \n EN \n  \n Hello. Sign in Account & Lists Sign in Account & Lists Orders Try Prime Cart \n Your Amazon.com Cyber Monday Deals Week Gift Cards Registry Sell Help Disability Customer Support  \n Movies & TV   New Releases   Best Sellers   Deals   Blu-ray   TV Shows   Kids & Family   Anime   All Genres   Amazon Video   Prime Video   Your Video Library   Trade-In \n                Movies & TV\n             ›\n                Studio Specials\n             ›\n                Sony Pictures Home Entertainment\n             ›\n                 All Sony Pictures Titles\n Share \n Facebook \n Twitter \n Pinterest \n Buy New \n $14.99 \n Qty: \n 1\n 2\n 3\n 4\n 5\n 6\n 7\n 8\n 9\n 10\n 11\n 12\n 13\n 14\n 15\n 16\n 17\n 18\n 19\n 20\n 21\n 22\n 23\n 24\n 25\n 26\n 27\n 28\n 29\n 30\n Qty: 1 \n List Price:   $19.99 \n                    You Save: $5.00\n                     (25%)\n Free Shipping for Prime Members \n FREE Shipping \n   Get free shipping \n Free 5-8 business-day shipping  within the U.S. when you order $25 of eligible items sold or fulfilled by Amazon. \n Or get 4-5 business-day shipping on this item for $4.98. (Prices may vary for AK and HI.) \n Learn more about free shipping \n on orders over $25—or get  FREE Two-Day Shipping  with  Amazon Prime \n            In Stock.\n        Ships from and sold by Amazon.com.\n            Gift-wrap available.\n                    Once Upon a Time in Mexic...\r\n                    has been added to your Cart\r\n Add to Cart \n Turn on 1-Click ordering for this browser \n                    Ship to:\n                            Select a shipping address:\n                        To see addresses, please\n                        Sign in\n or \n                        Use this location:\n                                Update\n                                Please enter a valid US zip code.\n                            Please enter a valid US zip code.\n                            Shipping to a APO/FPO/DPO? Please add the address to your address book. Make sure you include the unit and box numbers (if assigned).\n or \n Buy Used \n $12.98 \n + $3.99 shipping \n      Used: Very Good\n  |  Details \n    Sold by\n         -importcds \n Condition: \n      Used: Very Good\n Comment:  Shrinkwrap may be renewed, no visible damage on disc or booklet. Jewel case may have cosmetic damage, online codes for possible online content are expired or missing. Shipping time 5-21 business days.\n Add to Cart \n Turn on 1-Click ordering for this browser \n         Trade in your item\n        Get up to a  $0.69 Gift Card.\n        Trade in\n            Learn More\n Have one to sell? \n            Sell on Amazon\n Image Unavailable \n                Image not available for Color:\n            Sorry, this item is not available in\n            Image not available\n        To view this video download \n            Flash Player\n                \n                        Once Upon a Time in Mexico\n               Blu-ray\n Eva Mendes \n (Actor),  \n Danny Trejo \n (Actor),  \n Robert Rodriguez \n (Director, Producer) \n & \n                  0 \n                 more \n Rated:  \n R \n 4.2 out of 5 stars \n 374 customer reviews \n Amazon Video   \n              $3.99 — $12.99\n Blu-ray   \n      $14.99\n DVD   \n      $9.99\n  Additional Blu-ray options \n            Edition\n            Discs\n                     Price\n              New from\n              Used from\n Blu-ray \n (Jan 04, 2011) \n \"Please retry\" \n                    —\n 1 \n $14.99  \n $12.99 \n $6.16 \n Blu-ray \n \"Please retry\" \n                    —\n                    —\n                                 —\n $20.99 \n                            —\n Blu-ray \n \"Please retry\" \n                    —\n 1 \n                                 —\n $34.95 \n                            —\n Blu-ray \n \"Please retry\" \n                    —\n 1 \n                                 —\n $37.99 \n                            —\n See More \n Watch Instantly with \n              Rent\n              Buy\n Once Upon A Time In Mexico \n $3.99 \n $12.99 \n Unlimited Streaming with Amazon Prime \nStart your 30-day free trial to stream thousands of movies & TV shows included with Prime.\n Start your free trial \n See all buying options \n        Once Upon a Time in Mexico\n        $14.99\n Free Shipping for Prime Members \n FREE Shipping \n   Get free shipping \n Free 5-8 business-day shipping  within the U.S. when you order $25 of eligible items sold or fulfilled by Amazon. \n Or get 4-5 business-day shipping on this item for $4.98. (Prices may vary for AK and HI.) \n Learn more about free shipping \n on orders over $25—or get  FREE Two-Day Shipping  with  Amazon Prime \n                In Stock.\n            Ships from and sold by Amazon.com.\n            Gift-wrap available.\n Frequently bought together \n + + \n Total price:  $38.27 \n Add all three to Cart \n Add all three to List \n Buy the selected items together This item: Once Upon a Time in Mexico [Blu-ray]  by Eva Mendes  Blu-ray   $14.99   In Stock. Ships from and sold by Amazon.com. FREE Shipping on orders over  $25 .  Details El Mariachi / Desperado (Double Feature) [Blu-ray]  Blu-ray   $13.59   In Stock. Ships from and sold by Amazon.com. FREE Shipping on orders over  $25 .  Details From Dusk Till Dawn  by Harvey Keitel  Blu-ray   $9.69   In Stock. Ships from and sold by Amazon.com. FREE Shipping on orders over  $25 .  Details \n Customers who bought this item also bought Page  1  of  1   Start over Page 1 of 1   \n This shopping feature will continue to load items. In order to navigate out of this carousel please use your heading shortcut key to navigate to the next or previous heading. \n Back \n            El Mariachi / Desperado (Double Feature) [Blu-ray]\n 4.4 out of 5 stars \n 52 \n Blu-ray $13.59   Prime \n            From Dusk Till Dawn\n Harvey Keitel \n 4.3 out of 5 stars \n 41 \n Blu-ray $9.69   Prime \n            Machete Blu-ray\n Danny Trejo \n 4.6 out of 5 stars \n 20 \n Blu-ray $5.96   Prime \n            Planet Terror (Two-Disc Special Edition) [Blu-ray]\n Rose McGowan \n 4.4 out of 5 stars \n 501 \n Blu-ray $9.39   Prime \n            Machete Kills (Blu-ray + DVD + Digital HD with UltraViolet)\n Danny Trejo \n 3.7 out of 5 stars \n 438 \n Blu-ray $9.97   Prime \n            Desperado, SteelBook [Blu-ray]\n Antonio Banderas \n 4.3 out of 5 stars \n 258 \n Blu-ray $29.43   Prime \n Next \n Special offers and product promotions \n Your cost could be $0.00 instead of $14.99 ! Get a  $50 Amazon.com Gift Card  instantly upon approval for the  Amazon Rewards Visa Card \n                Apply now\n                    Editorial Reviews\n Leaping back into action, gun-slinging, guitar-toting hero \"El Mariachi\" is back in town in  Once Upon a Time in Mexico , as director Robert Rodriguez delivers the epic final chapter of his pulp Western trilogy. Starring Antonio Banderas, Salma Hayek, Johnny Depp, Mickey Rourke, Eva Mendes, Enrique Iglesias and Willem Dafoe  Once Upon a Time in Mexico  is a full-frontal assault.\n Special features \n Deleted Scenes with Optional Commentary  Ten-Minute Flick School  Inside Troublemaker Studios  Ten-Minute COOKING School  Film is Dead: An Evening with Robert Rodriguez  The Anti-Hero's Journey  The Good, the Bad and the Bloody: Inside KNB FX  Robert Rodriguez Audio Commentary  MovieIQ  The Cutting Room \n Product details \n   Actors:   Eva Mendes ,  Danny Trejo ,  Marco Leonardi ,  Cheech Marin ,  Ruben Blades \n   Directors:   Robert Rodriguez \n   Producers:   Robert Rodriguez ,  Carlos Gallardo ,  Elizabeth Avellán \n   Format:  AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen \n Language:  English \n Subtitles:  French, Portuguese, English, Spanish \n Dubbed:  French, Portuguese, Spanish \n Subtitles for the Hearing Impaired:  English \n   Region:  All Regions \n   Aspect Ratio:  1.78:1 \n   Number of discs:  1 \n   Rated:    \n                R\n        Restricted  \n   Studio:  Sony Pictures Home Entertainment \n   DVD Release Date:  January 4, 2011 \n   Run Time:  102 minutes \n Average Customer Review: \n 4.2 out of 5 stars \n      374 customer reviews\n ASIN:  B0048LVDGM \n Amazon Best Sellers Rank:  \n#25,490 in Movies & TV ( See Top 100 in Movies & TV )\n #1998 \n in  Movies & TV  >  Blu-ray  >  Action & Adventure \nWould you like to  tell us about a lower price ? If you are a seller for this product, would you like to  suggest updates through seller support ? \n Customer reviews 4.2 out of 5 stars 374 4.2 out of 5 stars 5 star 39% 4 star 19% 3 star 16% 2 star 11% 1 star 15% Share your thoughts with other customers Write a customer review See all 374 customer reviews Top customer reviews There was a problem filtering reviews right now. Please try again later. 5.0 out of 5 stars A Masterpiece in every way shape and form. By Mark L. Rakocy on September 11, 2017 Format: Amazon Video | Verified Purchase A knock your socks off movie worth owning and reflecting upon.I especially like how the \"Johnny Depp\" Character was hidden in plain sight throughout the film. I.E.....he is a C.I.A. operator in Mexico wearing a C.I.A.-shirt, as well as a few other things he does. Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Five Stars By Anna Bates on March 17, 2017 Format: DVD | Verified Purchase Great present Read more 0 Comment | \n      One person found this helpful.\n  Was this review helpful to you? Yes No Report abuse 4.0 out of 5 stars Great movie but soundtrack lacking By Stephanie Donald on February 6, 2013 Format: MP3 Music | Verified Purchase This is perhaps the crown jewel in Robert Rodriguez's \"garage studio\" productions and while the script of the movie and the acting staff is wonderful, the majority of the soundtrack is where you see how he cut money. Most of the tracks were things he wrote in his garage and the wonderful, rich sound he accomplished that enriched the drama, comedy and romance of \"Desperado\" is so obviously missing from this movie with the exception of just a few places and while I say that Robert Rodriguez's own themes aren't bad, they simply don't compare with Dire Straits, Los Lobos, Tito & Tarantula and Link Wray so prominently featured in the Desperado soundtrack. But that doesn't mean it still isn't worth owning. The music still causes me to remember key parts of the movie such as Johnny Depp playing \"fast draw\" with two of Marguez's men with no eyes and using his ears alone. Not a bad trick for someone who was born blind let alone someone who just lost his sight! It's what I cal an above average soundtrack but not one you should stampede to buy like Desperado! Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 4.0 out of 5 stars ... Banderas and Johnny Depp are young and obviously had fun making this movie By Larry on August 11, 2017 Format: Amazon Video | Verified Purchase Antonio Banderas and Johnny Depp are young and obviously had fun making this movie. My son and I made the dish that Johnny Depp eats at the cafe and had it for movie night. It was a great recipe! Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Once Upon a Time in Mexico By Nathan Shepherd Enthusiast: Batman on August 10, 2009 Format: DVD | Verified Purchase I choose this rating because the movie is good. What I like about the movie is that leaping back into action, gun-slinging, guitar-toting hero “El Mariachi” is back in town in Once Upon A Time In Mexico, as director Robert Rodriguez delivers the epic final chapter of his pulp Western trilogy. Starring Antonio Banderas, Salma Hayek, Johnny Depp, Mickey Rourke, Eva Mendes, Enrique Iglesias and Willem Dafoe Once Upon A Time In Mexico is a full-frontal assault. What I dislike about the movie is that I wanted to see more of it. I would recommend this movie to other people. Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Great movie, entertaining with a great cast By rural.life.tn on September 16, 2017 Format: DVD | Verified Purchase Great movie that has a great cast of so many great actors/actresses.  Very comical Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars it's that good.. By GregoryMB on June 26, 2017 Format: Audio CD | Verified Purchase Buy it... it's that good... just buy it! Read more 0 Comment | Was this review helpful to you? Yes No Report abuse 5.0 out of 5 stars Great Movie - Campy Fun Action Flick By wbesack on March 30, 2017 Format: Amazon Video | Verified Purchase Great movie. I love the series. Read more 0 Comment | Was this review helpful to you? Yes No Report abuse See all 374 reviews Write a customer review \n Most recent customer reviews 5.0 out of 5 stars Five Stars Another great shoot-em-up and lots of action. And, some humor to boot. Just a great movie! \n Published 20 days ago by Don Lovelace 4.0 out of 5 stars Four Stars GOOD SEQUEL \n Published 20 days ago by tracie 4.0 out of 5 stars Great movie Great movie \n Published 27 days ago by Firebucket 1.0 out of 5 stars BEWARE: NOT CANON A complete misuse of the cartoonish Johnny Depp and befuddled Willem Dafoe. It is worse than Ewoks, so much worse than Godfather III, worse even than putting forth Richard Pryor... Read more \n Published 29 days ago by Generic Man 5.0 out of 5 stars Good Movie Product as advertised \n Published 1 month ago by allenyk2000 2.0 out of 5 stars Two Stars Added a few new celebrities and stole the script meant for the bugs bunny animated cartoon version of desperado. \n Published 2 months ago by Pete 5.0 out of 5 stars Five Stars Very good movie \n Published 3 months ago by Ancuta 5.0 out of 5 stars Good movie It was action packed and good. \n Published 3 months ago by kim 5.0 out of 5 stars Five Stars perfect \n Published 3 months ago by Diana Search customer reviews Search \n Set up an Amazon Giveaway \n Amazon Giveaway allows you to run promotional giveaways in order to create buzz, reward your audience, and attract new followers and customers.  Learn more about Amazon Giveaway \n This item:  Once Upon a Time in Mexico [Blu-ray] \n Set up a giveaway \n What other items do customers buy after viewing this item? \n El Mariachi / Desperado (Double Feature) [Blu-ray] \n Blu-ray \n 4.4 out of 5 stars \n 52 \n $13.59   Prime \n Robert Rodriguez Mexico Trilogy (El Mariachi / Desperado / Once Upon A Time In Mexico) \n DVD \n Antonio Banderas \n 4.6 out of 5 stars \n 66 \n $22.99   Prime \n Desperado, SteelBook [Blu-ray] \n Blu-ray \n Antonio Banderas \n 4.3 out of 5 stars \n 258 \n $29.43   Prime \n From Dusk Till Dawn \n Blu-ray \n Harvey Keitel \n 4.3 out of 5 stars \n 41 \n $9.69   Prime \n Pages with related products. \n See and discover other items:  johnny depp movies ,  johnny test ,  marco leonardi ,  once upon a time ,  robert stack \n There's a problem loading this menu right now. \n Learn more about Amazon Prime. \n  Get fast, free shipping with Amazon Prime  \n  Prime members enjoy FREE Two-Day Shipping and exclusive access to music, movies, TV shows, original audio series, and Kindle books.  \n      >\n       Get started \n Back to top \n Get to Know Us Careers About Amazon Investor Relations Amazon Devices Make Money with Us Sell on Amazon Sell Your Services on Amazon Sell on Amazon Business Sell Your Apps on Amazon Become an Affiliate Advertise Your Products Self-Publish with Us Become an Amazon Vendor › See all Amazon Payment Products Amazon Rewards Visa Signature Cards Amazon.com Store Card Amazon.com Corporate Credit Line Shop with Points Credit Card Marketplace Reload Your Balance Amazon Currency Converter Let Us Help You Your Account Your Orders Shipping Rates & Policies Amazon Prime Returns & Replacements Manage Your Content and Devices Amazon Assistant Help \n English \n United States \n Amazon Music   Stream millions  of songs \n Amazon Drive   Cloud storage  from Amazon \n 6pm   Score deals  on fashion brands \n AbeBooks   Books, art  & collectibles \n ACX    Audiobook Publishing  Made Easy \n Alexa   Actionable Analytics  for the Web \n Amazon Business   Everything For  Your Business \n   \n AmazonFresh   Groceries & More  Right To Your Door \n AmazonGlobal   Ship Orders  Internationally \n Home Services   Handpicked Pros  Happiness Guarantee \n Amazon Inspire   Digital Educational   Resources \n Amazon Rapids   Fun stories for   kids on the go \n Amazon Restaurants   Food delivery from  local restaurants \n Amazon Video Direct   Video Distribution  Made Easy \n   \n Amazon Web Services   Scalable Cloud  Computing Services \n Audible   Download  Audio Books \n AudiobookStand   Discount Audiobooks  on Disc \n Book Depository   Books With Free  Delivery Worldwide \n Box Office Mojo   Find Movie  Box Office Data \n ComiXology   Thousands of  Digital Comics \n CreateSpace   Indie Print Publishing  Made Easy \n   \n DPReview   Digital  Photography \n East Dane   Designer Men's  Fashion \n Fabric   Sewing, Quilting  & Knitting \n Goodreads   Book reviews  & recommendations \n IMDb   Movies, TV  & Celebrities \n IMDbPro   Get Info Entertainment  Professionals Need \n Junglee.com   Shop Online  in India \n   \n Kindle Direct Publishing   Indie Digital Publishing  Made Easy\n Prime Now   FREE 2-Hour Delivery  on Everyday Items \n Prime Photos   Unlimited Photo Storage  Free With Prime \n Shopbop   Designer  Fashion Brands \n TenMarks.com   Math Activities  for Kids & Schools \n Warehouse Deals   Open-Box  Discounts \n Whispercast   Discover & Distribute  Digital Content\n   \n Whole Foods Market   America’s Healthiest  Grocery Store \n Withoutabox   Submit to  Film Festivals \n Woot!   Deals and   Shenanigans \n Zappos   Shoes &  Clothing \n Souq.com   Shop Online in  the Middle East \n Subscribe with Amazon   Discover & try  subscription services \n   \n Conditions of Use Privacy Notice Interest-Based Ads © 1996-2017, Amazon.com, Inc. or its affiliates"}