{"url": "https://m.wikihow.com/Fix-if-You-Can%27t-Access-a-Particular-Website", "content": "How to Fix if You Can't Access a Particular Website \n Home Random Browse Articles Notifications Add to This Page Add Tip Easy Ways to Help Approve Questions Review Tech Feedback Fix Spelling More Things to Try...   \n Log in / Sign up   \n Desktop Site   \n Talk How to Fix if You Can't Access a Particular Website   \n If you're trying to visit a website and it won't load, but others do, there could be a variety of causes. If the site itself is down, there's not much you can do but wait. If you can load the site on other computers or devices, there may be an issue with your computer or network. There are some quick fixes that will solve most problems, but you may have to get your hands a little dirty. Fixing an issue that prevents you from accessing a particular website may require an antivirus or malware scan, and you may also need to check your browser settings or change your DNS settings if these scans do not remedy the problem. \n Steps Edit \n Part One of Five: Basic Troubleshooting Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/76\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-1-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-1-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/76\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-1-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Try loading the site on a different device or network if possible you can try your mobile network.  Try loading the website on your phone or on another computer. If the website loads on the other device, the problem lies with your computer. If the website doesn't load on another device, the problem is either with the network or the website itself.\n If you can, try to load the website on another device connected to your network, and a device that's not connected to your network. The easiest way to do this is to load the website on your phone while connected to the same network as your computer, and then disconnect from the wireless network and load the page using your cellular data. This can help you determine if the problem is with your network or with the website. \n If the website won't load on any device regardless of what network it is connected to, the website itself is most likely down. You can double-check by looking up the site on a monitoring service like \"Is It Down Right Now?\" ( iidrn.com ). \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/18\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-2-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-2-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/18\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-2-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Restart your computer.  Oftentimes, a simple reboot will fix the problem you're having. Reboot your computer and test the website again.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/ab\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-3-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-3-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/ab\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-3-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Try loading the site in a different browser.  There may be some settings configured incorrectly on your browser. Try a different web browser to see if you can load the website.\n If you are using the default browser and don't have any others installed, you can quickly download and install another free browser like  Firefox ,  Chrome , or  Opera . \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/77\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-4-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-4-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/77\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-4-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Temporarily disable your antivirus program.  Your antivirus software may be interfering with your ability to load certain websites. Try disabling the software and then loading the site again.\n Right-click on the antivirus icon in your System Tray and select \"Disable\" or \"Turn Off.\" You may be warned that this isn't safe. \n Make sure to re-enable the antivirus after you're done testing. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/28\\/1885102-5.jpg\\/v4-460px-1885102-5.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/28\\/1885102-5.jpg\\/v4-760px-1885102-5.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Reset your modem and router.  Traffic to or from a certain website may be getting tripped up by your modem or router. Resetting these devices may allow you to access the website again.\n Unplug the power cables for the modem and the router (if you have a separate one), and wait about a minute. \n Plug your modem back in and wait for it to completely light up. \n Plug your router back in and wait for it to completely light up. \n Try visiting the website again. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/15\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-6-Version-2.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-6-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/15\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-6-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Check your computer's date and time settings.  If your date or time is set incorrectly, you may not be able to connect to secure ( https:// ) websites. Check your computer or mobile device's clock to make sure that it is set to the correct time and date. [1] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/1d\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-7-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-7-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/1d\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-7-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 7 \n Ensure that there are no parental controls enabled.  If you have parental control software enabled, it may be blocking access to certain websites. If you have access to it, disable the parental control software and try accessing the website again. The process for this varies depending on the parental control program being used.\n Advertisement \n Part Two of Five: Checking Antivirus Software Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/26\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-8-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-8-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/2\\/26\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-8-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Uninstall Norton or McAfee.  These two antivirus programs have been known to cause the most problems with browsing websites. If you have one of these antivirus programs installed, consider removing it and replacing it with a lightweight, unintrusive antivirus.\n See  Uninstall Norton Internet Security  for instructions on completely removing Norton software, which can be tricky. \n See  Uninstall McAfee Security Center  for a guide on removing McAfee Security Center, another difficult program to get rid of. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4e\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-9-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-9-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/4\\/4e\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-9-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Install a lightweight antivirus to replace your old one.  After removing the old antivirus, you'll want to make sure that you have a new program installed to protect your computer. See  Install an Antivirus  for general instructions on installing a new antivirus. The following free antivirus programs are highly-rated by security professionals and should not get in the way of loading websites:\n Avast! \n BitDefender \n AntiVir \n Microsoft Windows Defender \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/07\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-10-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-10-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-10-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Ensure you only have one antivirus program installed.  Having multiple antivirus programs installed at the same time can cause problems. Conflicting protection could lead to some websites not loading. Keep the antivirus program that you like best and get rid of the rest.\n See  Uninstall a Program  for general instructions on removing programs. You can also find uninstallation guides for most popular antivirus programs on wikiHow. \n Advertisement \n Part Three of Five: Checking Browser Settings Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/17\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-11-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-11-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/17\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-11-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Ensure that JavaScript is enabled.  If JavaScript has been disabled, you'll encounter difficulties loading a lot of popular sites. Check your browser settings to ensure that it is enabled:\n Internet Explorer - Click the Tools menu or Gear button and select \"Internet options.\" Click the \"Security\" tab and then click the \"Custom level\" button. Scroll down to the \"Scripting\" section and set \"Active scripting\" to \"Enable.\" \n Chrome - Click the Chrome Menu button and select \"Settings.\" Click the \"Show advanced settings\" link at the bottom, then click the \"Content settings\" button in the \"Privacy\" section. Ensure that \"Allow all sites to run JavaScript content\" is selected. \n Firefox - Enter \"about:config\" into the address bar and confirm that you want to proceed. Type \"javascript.enabled\" into the search field. Ensure that the \"Value\" for \"javascript.enabled\" is set to \"true.\" \n Safari - Click the Safari or Edit menu and select \"Preferences.\" Click the \"Security\" tab and check the \"Enable JavaScript\" box. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/82\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-12-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-12-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/8\\/82\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-12-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Remove extensions that you don't recognize.  An extension may be causing problems with your browser. Disabling or removing extension you don't recognize or don't need may help. Your browser doesn't require extensions to run, so you can safely disable any extension you come across.\n Internet Explorer - Click the Tools menu or Gear button and select \"Manage add-ons.\" Select extensions from the list and click \"Disable\" to turn them off. \n Chrome - Click the Chrome menu button and select \"More tools\" → \"Extensions.\" Uncheck the \"enabled\" box for each extension you want turn off. \n Firefox - Click the Firefox menu button and select \"Add-ons.\" Click the \"Extensions\" option in the left menu. Click the \"Disable\" button next to each extension. \n Safari - Click the Safari or Edit menu and select \"Preferences.\" Click the \"Extensions\" tab and then uncheck the \"Enable\" box for each extension you want to turn off. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6c\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-13-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-13-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/6c\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-13-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Check the browser's connection settings.  If your browser was set to connect through a proxy, you may be experiencing connection issues. Check your connection settings and disable the proxy server to see if the issue is resolved. [2] \n Internet Explorer - Click the Tools menu or Gear button and select \"Internet options.\" Click the \"Connections\" tab and then click the \"LAN settings\" button. Check the \"Automatically detect settings\" box and uncheck \"Use a proxy server for your LAN.\" \n Chrome - Click the Chrome Menu button and select \"Settings.\" Click the \"Show advanced settings\" link at the bottom of the list. Scroll down and click the \"Change proxy settings\" button. Click the \"LAN settings\" button. Check the \"Automatically detect settings\" box and uncheck \"Use a proxy server for your LAN.\" \n Firefox - Click the Firefox menu button and select \"Options.\" Select the \"Advanced\" menu option and then click the \"Network\" tab. Click the \"Settings\" button and then select \"No proxy\" or \"Use system proxy settings.\" \n Safari - Click the Safari or Edit menu and select \"Preferences.\" Click the \"Advanced\" tab and then click the \"Change Settings\" button. Uncheck any active proxy settings. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fe\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-14-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-14-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/f\\/fe\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-14-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Reset your browser.  If you still can't connect, you can try resetting your browser's settings. This will remove all of your data from the browser and revert it to its default settings. [3] \n Internet Explorer - Click the Tools menu or Gear button and select \"Internet options.\" Click the \"Advanced\" tab and then click \"Reset.\" Check the \"Delete personal settings\" box and click \"Reset\" again. \n Chrome - Click the Chrome Menu button and select \"Settings.\" Click the \"Show advanced settings\" link. Scroll to the bottom of the page and click \"Reset settings.\" Click \"Reset\" to confirm. \n Firefox - Click the Firefox menu button and select \"?\" at the bottom of the menu. Click the \"Troubleshooting Information\" option. Click \"Refresh Firefox\" and then \"Refresh Firefox\" again to confirm. \n Safari - Force-quit Safari by pressing  ⌘  Command + ⌥  Option + Esc  and selecting Safari from the list. Once Safari quits, hold  ⇧  Shift  and launch Safari again from the Dock or Applications folder. Turn Wi-Fi off and try to visit a website. Once the site loads and says that you have no connection, turn Wi-Fi back on. [4] \n Advertisement \n Part Four of Five: Scanning for Malware Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/43\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-15-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-15-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/4\\/43\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-15-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Download AdwCleaner.  This is a free adware scanner that will find most common adware and malware infections. You can download it for free from  toolslib.net/downloads/viewdownload/1-adwcleaner/ .\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4d\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-16-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-16-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/4\\/4d\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-16-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Run AdwCleaner after downloading it.  After confirming that you want to run the program, it will begin downloading additional files necessary for scanning. This should only take a few moments.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6c\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-17-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-17-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/6c\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-17-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Click the \"Scan\" button to begin scanning.  AdwCleaner will begin scanning your computer, which will usually take about 15-20 minutes.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/86\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-18-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-18-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/8\\/86\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-18-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Click the \"Clean\" button after the scan is complete.  AdwCleaner will remove all of the malicious files found during the scan.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e0\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-19-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-19-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/e\\/e0\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-19-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Download and install the free version of Malwarebytes Anti-Malware.  The free version contains a fully functional scanner and cleaner for home use. You can download it from  malwarebytes.org/ .\n Run the installer after downloading Anti-Malware to install it. Select the free license if prompted. \n There is a Mac version as well, which is the current version of AdwareMedic, one of the more powerful anti-malware programs for Mac. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e7\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-20-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-20-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/e\\/e7\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-20-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Launch Anti-Malware and click  \"Update Now. \"  This will download any available updates, which can help Anti-Malware find more bad files.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fe\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-21-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-21-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/f\\/fe\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-21-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 7 \n Click \"Scan Now\" to begin scanning your computer.  This scan will usually take a little longer than the AdwCleaner scan.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/21\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-22-Version-2.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-22-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/2\\/21\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-22-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 8 \n Click \"Quarantine All\" after the scan is complete.  This will remove any of the files found during the scan.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/cd\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-23-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-23-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/c\\/cd\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-23-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 9 \n Reboot your computer and test the website.  If adware was preventing you from visiting certain sites, you should be able to visit them now.\n Advertisement \n Part Five of Five: Changing Your DNS Settings Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b6\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-24-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-24-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/b\\/b6\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-24-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Flush your DNS settings.  The DNS (Domain Name System) is the service that translates web domain names into IP addresses so that you can connect to websites. If your local DNS files have been corrupted, you may not be able to load certain websites. Flushing your DNS will clear out your local DNS information and load a fresh copy. [5] \n Windows - Press  ⊞  Win + R  and type  cmd  to open the Command Prompt. Type  ipconfig /flushdns  and press  ↵  Enter . You will receive a message that the DNS cache has been flushed, and you can close the Command Prompt. \n Mac - Open the Terminal from the Utilities folder. Type  dscacheutil -flushcache  and press  ⏎  Return . Then type  sudo killall -HUP mDNSResponder  and press  ⏎  Return  to restart the DNS service. You'll be prompted for your admin password. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/19\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-25-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-25-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/19\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-25-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Find a new DNS to connect to.  Typically you'll connect to the DNS provided by your internet service provider, but there are many more options. Some may even result in faster browsing. Perform a web search for \"free DNS list\" to find up-to-date listings of free DNS providers. You can typically find speed comparisons as well.\n There will typically be two addresses: the Primary and the Secondary. You'll need both in a moment. \n Note that not all public DNSs allow access to the same content. It's recommended that you use Google or OpenDNS for the most accessibility. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/66\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-26-Version-3.jpg\\/v4-460px-Fix-if-You-Can%27t-Access-a-Particular-Website-Step-26-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/66\\/Fix-if-You-Can%27t-Access-a-Particular-Website-Step-26-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Connect to a new DNS.  Once you've found the server you want to connect to, you'll need to point your computer to it.\n Windows - Press  ⊞  Win + R  and type  ncpa.cpl . This will open the Network Connections window. Right-click on your network adapter and select \"Properties.\" Highlight \"Internet Protocol Version 4\" in the list and click the \"Properties\" button. Select \"Use the following DNS server addresses\" and enter in the addresses you want to use. \n Mac - Open the Apple menu and select \"System Preferences.\" Click the \"Network\" option and then select your active network. Click the \"Advanced\" button and then the \"DNS\" tab. Enter the servers that you want to connect to. \n Advertisement \n Community Q&A \n Search \n Add New Question \n What does it mean when I get the error message \"The connection to the server was reset while the page was loading. The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.\"? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Whether it took too much time for the browser to get a response from the website you wished to access. Or, that said website you wished to access was detected by your firewall as not safe and could harm your computer. \n Thanks! \n 16 \n 6 \n What does it mean when I get an error stating \" Safari can't connect to the server\"? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n You either have put in the wrong address or you have no WIFI connection. If you are at work, the website you are trying to access may be blocked. \n Thanks! \n 10 \n 8 \n What if a particular page won't open? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Assuming you just need to read the page and not interact with it (logging in, uploading things, etc.), you could try wayback.archive.org. Just enter the page's URL to see whether they have any archived versions of it. If they do, you'll get a calendar with links. If you do need to interact, check if the problem is on your end by testing the page on a different computer or network. If it still won't load, then the issue is on their end and there's nothing you can do. \n Thanks! \n 16 \n 16 \n If I can't connect to a certain website no matter what device I use, does that mean the site is blocked or down? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Go to iidrn.com. They can check if the website itself is down, or if it's something with your connection. Just type in the website in the white bar and click enter. It will tell you automatically! If the website is up and running correctly, then the problem might be with your internet. \n Thanks! \n 2 \n 1 \n Why can't I access certain websites? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n It depends on where you are and how old you are. Some countries block access to certain websites for everyone. If you're a child or teenager, your parents might have set up parental controls to prevent you from accessing inappropriate content. Otherwise, your antivirus program could be blocking the site because it is a threat somehow. \n Thanks! \n 0 \n 2 \n No matter what I do, it still won't load. I checked iidrn.com and it said it was up and running. It says 'can't connect to mice.tf.' It's been happening for 3 days? \n Answer \n What can cause you not to be able to reach certain hotel sites?  \n Answer \n How can I troubleshoot my website? \n Answer \n How do I access a webpage on my iPad when I get an access denied to this device message? \n Answer \n What do I do if a specific page won't load on any devices in my house and it says \"[website] didn't send any data\", and \"ERR_EMPTY_RESPONSE\"? \n Answer \n Show more unanswered questions \n Ask a Question \n 200 characters left \n Submit \n Related wikiHows Edit \n How to  Restrict Web Browsing Using Internet Explorer \n How to  Block a Website in Internet Explorer 7 \n How to  Clear Your Browser's Cookies \n How to  Remove a Website From the Restricted Site List in Internet Explorer \n How to  Fix DNS Server Not Responding Problem \n How to  Increase Internet Speed \n How to  Activate Incognito Mode \n How to  Get a Free Internet Connection \n How to  Find if a Website Is Legitimate \n How to  Connect to the Internet On Your Laptop Through Your Cell Phone \n Advertisement \n About This Article \n How helpful is this? \n\t\t\t\tCo-authors:   22 \n Updated:  \n\t\t\t\tViews:  1,508,793 \n\t\t\t\tCategories:  Internet  |  System Maintenance and Repair \n Sources and Attribution \n Is this article up to date? \n Yes \n No \n\t\t\t\tNo\n\t\t\t\t\t\t{{questionText}}\n\t\t\t\t\t\t{{currentMethod}}\n\t\t\t\t\t{{cheerText}}\n\t\t\t\t\t{{oopsText}}\n\t\t\t\tYes\n Share \n Basic Troubleshooting Checking Antivirus Software Checking Browser Settings Scanning for Malware Changing Your DNS Settings Community Q&A Related wikiHows \n Surprise Me! \n 263"}