{"url": "https://en.wikipedia.org/wiki/Adolescent_sexuality_in_the_United_States", "content": "Adolescent sexuality in the United States - Wikipedia \n Adolescent sexuality in the United States   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \nA young couple kissing \n According to the US  Centers for Disease Control and Prevention  (CDC), in the year 2007, 35% of US high school students were currently sexually active and 47.8% of US high school students reported having had  sexual intercourse . [1]  This percentage has decreased slightly since 1991. [2]  According to a 1994 study, every year an estimated one in four sexually active teens contracts a  sexually transmitted infection  (STI). [3]   Teenage pregnancy  is four times as prevalent in the United States as in the European Union. [4]  However, US teen pregnancy rates have been steadily declining for decades, according to the Centers for Disease Control and were at a \"record low\" as of 2012. [5] \n In 1999, a  Kaiser Family Foundation  study found that 95% of public secondary schools offered  sex education  programs. More than half of the schools in the study followed a comprehensive approach that included information about both abstinence and contraception, while approximately one third of schools provided students with  abstinence-only sex education . [6]  In 2002, most Americans favored the  comprehensive approach . [6]  A 2000 study found that almost all schools included information about  HIV , the virus that causes AIDS, in their curricula. [6]  There have been efforts among social conservatives in the US government to limit  sex education  in public schools to  abstinence-only sex education  curricula. [6]  The effectiveness of abstinence-only programs has been an issue of controversy. [7] [8] \n Contents \n 1   Sexual practices \n 1.1   Sexual abstinence \n 1.2   Definitions of virginity \n 2   Physical effects \n 2.1   Pregnancy \n 2.2   Sexually transmitted infections \n 3   Psychological effects \n 3.1   Benefits and negative effects \n 3.2   Effects on relationships \n 4   Dating violence and sexual assault \n 5   Legal issues \n 5.1   Sexting \n 5.2   Age of consent \n 6   Social and cultural influences \n 6.1   Media \n 6.2   Peers \n 7   Sexual education given to teens \n 7.1   Comprehensive \n 7.2   Abstinence-only \n 7.3   From parents \n 7.3.1   Father-daughter communication \n 8   Correlations \n 9   Sexual minorities \n 10   See also \n 11   Notes \n 12   References \n 13   Further reading \n 14   External links \n Sexual practices [ edit ] \nU.S. sexual practices in April 2015 \n Self-report surveys suggest that half of all 15- to 19-year-olds have had  oral sex . That percentage rises to 70% by the time they turn 19, and equal numbers of boys and girls participate. [9]  Research indicating that oral sex is less risky to teens' emotional and physical well being than vaginal sex has been advanced; [10]  researchers at the University of California do not believe this conclusion is warranted. [11]  They found that oral sex, as well as vaginal sex, was associated with negative consequences. [11]  Of adolescents engaging in oral sex only, girls were twice as likely as boys to report feeling bad about themselves and nearly three times as likely to feel used. [12]  Despite their behaviors, 90% of adolescents \"agree that most young people have sex before they are really ready.\" [13] \n The average age of first sexual intercourse in the United States is around 18 for males and around 17 for females, [14] [15]  and this has been rising in recent years. [16]  For those teens who have had sex, 70% of girls and 56% of boys said that their first sexual experience was with a steady partner, while 16% of girls and 28% of boys report losing their virginity to someone they had just met or who was just a friend. [16] \n Teens are using  birth control  (contraceptives) more today when they lose their virginity than they did in the past, and this is in part due to the  AIDS epidemic . [16]  Of sexually experienced adolescents, 78% of girls and 85% of males used at least one contraceptive when they lost their virginity. [16]  A detailed qualitative study of girls' loss of virginity found that their experiences \"were almost all quite negative (and, in some cases, horrific).\" [17]  Before age 15, \"a majority of first intercourse experiences among females are reported to be non-voluntary.\" [18] \n Adolescents who are better students generally initiate sexual activity later than those who are poor students. In addition, among those seventh and eighth graders, those with personal and perceived peer norms that encourage adolescents to refrain from sex are less likely to engage in it. [19] \n The percentage of teenagers who report they are currently sexually active has been dropping since 1991. [20]  By 2005, the overall percentage of teenagers reporting that they were currently sexually active was down to 33.9%. [1]  A lower number of sexually active teens are \"quite positive in terms of their health and their well-being.\" [21] \n The  condom  is the most popular form of  contraception  used by teenagers. [22]  Among sexually active 15- to 19-year-olds, from 2002 to 2010 more than 80% of females and more than 90% of males reported using at least one method of birth control during their last intercourse. [16] [23]  In 1995, only 71% of girls and 82% of boys reported using contraception the last time they had sex. [16]  In 2006–2010, one in five sexually active female teens (20%) and one-third of sexually active male teens (34%) reported having used both the condom and a hormonal method the last time they had sex. [16]  Less than 20% of girls at risk for unintended pregnancy were not using any contraceptive method the last time they had sex. [16]  Calendar abstinence, or the  rhythm method , was used by 17% of female teens in 2006-2008. [22] \n Sexual abstinence [ edit ] \n Main articles:  Sexual abstinence ,  Chastity , and  Abstinence pledge \n Sexual abstinence is the practice of refraining from some or all aspects of sexual activity for medical, psychological, legal, social, financial, philosophical, moral or religious reasons. For the last twenty years, abstinence rates among American adolescents have risen. The percentage of high school students in the US who reported that they have ever had sexual intercourse dropped from 54.1% in 1991 to 47.8% in 2007 [1]  and to 43% in 2011. [24]  A cross-sectional survey in 1998 found that fear of pregnancy was the most commonly cited reason for choosing abstinence, especially among girls, as well as boys who had caused a pregnancy in the past. Other reasons included a fear of sexually transmitted infections, a lack of desire, being afraid of getting caught, and the belief that sex was not appropriate for someone of their age. [25] \n Epidemiologists at the Center for Disease Control emphasize that for sex education to be effective, it should take place before teens become sexually active. [26] \n Most common reasons virgins cite for remaining abstinent [27] \n Reason \n Percent of 9th grade males \n Percent of 12th grade males \n Percent of 9th grade females \n Percent of 12th grade females \n Fear of pregnancy \n 82% \n 77% \n Fear of STDs \n 57% \n 46% \n 75% \n 61% \n Decision to wait until marriage \n 43% \n 47% \n 56% \n 58% \n Belief that sex was not right for a person their age \n 50% \n 33% \n 70% \n 51% \n Parents would object \n 56% \n 43% \n Both adolescents who have never had sex and those who have chosen to become abstinent after engaging in sexual behaviors cite the negative consequences of sex as reasons why they choose not to have sex. [25]  Girls of all ages and experience levels were more likely than boys to cite the fear of pregnancy and sexually transmitted diseases. [25]  Virgin boys were more likely than girls to say they believed most students did not have sex. [25] \n Boys who caused a pregnancy in the past were more than twice as likely to become abstinent after this episode than boys who had not. However, for girls, a past pregnancy had little correlation with secondary abstinence. [25]  Fear of pregnancy, wanting to wait until marriage, and not wanting to have sex were cited more often by virgins in the 12th grade than they were by 9th graders. [25]  Of the sexually experienced who are now practicing abstinence, girls were more likely than boys to say a lack of desire, fear of STDs, being afraid of getting caught, the belief that sex was not appropriate for someone their age, and that their parents had taught them the advantages of waiting as reasons why they made their decision. [25] \n Definitions of virginity [ edit ] \n Among young people engaging in some form of sexual activity, definitions of  virginity  differ. Virginity is usually defined as the state of a person who has never engaged in sexual intercourse, although there are some gray areas. For example, teenagers that engage in oral sex but not penile-vaginal sex may still identify themselves as virgins; this is sometimes termed  technical virginity.  Of those polled, 70% of adolescents aged 11–16 believed oral sex did not disqualify someone from virginity, and 30% believed they were still abstinent. [28] [29] \n Of adolescents age 11–16, 83% believe a person is still a virgin after engaging in genital touching, and 70% said they believed one retained their virginity after having oral sex. Additionally, 16% considered themselves virgins after anal sex. However, 44% believed that one was abstinent after genital touching and 33% believed one could have oral sex and still remain abstinent. Of anal and vaginal sex, 14% believed one could engage in the former and 12% said one could participate in the latter while still remaining abstinent. \n Among those 15–19 years old, those who remain a \"technical virgin\" are motivated more by the fear of pregnancy or STIs and less by religion and morality. [29] \n Physical effects [ edit ] \n The  American Academy of Pediatrics  has identified the sexual behaviors of American adolescents as a major public health problem. [30]  The Academy is concerned about the prevalence of sexually transmitted diseases in sexually active teenagers and about the very high rate of teenage pregnancy in the United States compared to other developed countries. \n Research into adolescents' sexual behavior in situations outside traditional dating situations, commonly referred to as \"hooking up\", shows that adolescents underestimate the risk involved in such situations. [31] [32]  With all the issues and problems relating to adolescent sex, \"ideally, they won’t be having sex.\" [33] \n Pregnancy [ edit ] \n Main articles:  Teenage pregnancy in the United States  and  Teen pregnancy \n Teen pregnancies—defined as pregnancies in women under the age of 20, regardless of marital status—in the United States decreased 28% between 1990 and 2000, from 117 pregnancies per every 1,000 teens to 84 per 1,000. [3]  The 2008 rate was a record low and represented a 42% decline from the peak rate of 117 per 1,000, which occurred in 1990. [16]  From 2009 to 2010, the teen pregnancy rate dropped 9%, the biggest one year drop since the 1940s. [34] \n Each year, almost 750,000 girls aged 15–19 become pregnant. Two-thirds of all teen pregnancies occur among the oldest teens (18–21-year-olds). [16]  Of them, 82% are unplanned, accounting for about 20% of all unintended pregnancies annually. [16]  Of pregnancies among 15–19-year-olds girls in 2008, 59% ended in birth, 26% in abortion, and the rest in miscarriage. [16]  Overall, 68 pregnancies occurred per 1,000 girls aged 15–19 in 2008. Nearly 7% of 15–19-year-old girls become pregnant each year. Pregnancies are much less common among girls younger than 15. In 2008, 6.6 pregnancies occurred per 1,000 teens aged 14 or younger. In other words, fewer than 1% of teens younger than 15 become pregnant each year. [16]  Stillborn and newborn deaths are 50% higher for teen moms than women aged 20–29, and are more likely to have a low birth weight. [35] \n Teenage  birth rates , as opposed to pregnancies, peaked in 1991, when there were 61.8 births per 1,000 teens, and the rate dropped in 17 of the 19 years that followed. [34]  One in four American women who had sex during their teenage years will have a baby before they are married, compared to only one in ten who wait until they are older. [36]  Even more will experience a pregnancy. Of women who have sex in their teens, nearly 30% will conceive a child before they are married. Conversely, only 15% of women who don't have sex in their teens will become pregnant before they are married. [36]  Of all women, 16% will be teen mothers. [37] \n According to a study, girls who participate in girls-only activities are far less likely to experience a teenage pregnancy and less likely to be sexually active in general. [38]  Participating in competitive sports has also shown to have an effect for girls. A study published in 1999 found that female adolescents who participated in sports were less likely than their non-athletic peers to engage in sexual activity and/or report a pregnancy. [39]  Males interested in arts are also less likely to be involved in a pregnancy situation. It is unclear whether these correlations are causal or the reflection of the underlying bias of the considered population. The study that reported these findings did not take into account the sexual orientation of the subjects. [39] \n A survey by the National Campaign to Prevent Teen Pregnancy found that \"7% of youth used alcohol the first time they had sex, and 6% used alcohol the most recent time they had sex.\" [40]  In another study, teens aged 15–19 accounted for 15.5% of  abortions  in 2009, and patients aged 20–24 made up 32.7%. Together adolescents aged 15–24 made up just under half (48.2%) of the 784,000 abortions reported to the CDC that year. [41] \n According to one study, laws that require parental notification or consent before a minor can obtain an abortion \"raise the cost of risky sex for teenagers.\" [42]  The study found that states which have enacted such laws have seen lower  gonorrhea  rates among teens than states that do not have such laws. The researchers of the study believe these laws lower the gonorrhea rate because teens reduce the amount of sexual activity they have and are more fastidious in their use of birth control. [42]  On the contrary, statistics released from the  World Health Organization  (WHO) indicate that more restrictive laws on abortions do not necessarily mean fewer abortions; the abortion rate one year for Latin America (where, broadly speaking, abortions are generally made illegal) was 32 per 1000 people, whereas the abortion rate for Western Europe (where overall the laws are more relaxed) was 12 in 1000. [43] \n Sexually transmitted infections [ edit ] \n Main articles:  Sexually transmitted disease  and  Safe sex \n Each year, between 8 and 10 million American teens contract a sexually transmitted infection (STI/STD), [note 1]  almost half of the 19 million STIs reported for all age groups in the United States. [16] [44] \n Lloyd Kolbe, director of the  Center for Disease Control 's Adolescent and School Health program, called the STI problem \"a serious epidemic.\" [45]  The younger an adolescent is when they first have any type of sexual relations, including oral sex, the more likely they are to get an STI. [46] [47] \n HPV ( Human papillomavirus ) is the most common STI among teens (as well as adults). [48]  In a CDC study, 18% of teen girls were infected with HPV. [49]  Another study found that HPV infections account for about half of STIs detected among 15- to 24-year-olds each year. [16] [50]  While HPV infections may not cause any disease and is often  asymptomatic , it can cause  genital warts  and even cancer. \n After HPV,  trichomoniasis  and  chlamydia  are the most common STI diagnoses among 15- to 24-year-olds; combined, they account for slightly more than one third of diagnoses each year. [16]   Genital herpes  and  gonorrhea  together account for about 12% of diagnoses.  HIV ,  syphilis  and  hepatitis B  account for less than 1% of diagnoses, [16]  however young people aged 13–24 accounted for about 21% of all new HIV diagnoses in the United States in 2011. [16] \n Researchers from the CDC have noted that teenagers often do not understand the risks associated with sexual activity. \"Research suggests that adolescents perceive fewer health-related risks for oral sex compared with vaginal intercourse. However, young people, particularly those who have oral sex before their first vaginal intercourse, may still be placing themselves at risk of STIs or HIV before they are ever at risk of pregnancy.\" [47]  \"Several studies have documented that oral sex can transmit certain STIs, including chlamydia, genital herpes, gonorrhea and syphilis. Teenagers and young adults engaging in sexual activity are at increased risk of STIs or HIV.\" [47] \n A 2008 study by the CDC found that one in four teen girls, or an estimated 3 million girls, has an STI. [49]  The study of 838 girls who participated in a 2003–04 government health survey found the highest overall prevalence among black girls; nearly half in the study were infected. This is compared with 20% among both whites and Mexican-American teens. [51]  The same study found that, among those who were infected, 15% had more than one STI, and 20% of those who said they had only one sexual partner were infected. [49] \n In a 2011 study by the CDC, 7.1% of females and 2.1% of males aged 15–24 were infected with  chlamydia , [52] : 65  historically the most prevalent of all STIs in the general population (after HPV). \n Psychological effects [ edit ] \n Benefits and negative effects [ edit ] \n Benefits to teen sex do exist, by extension of data on the benefits of sex: It can relieve pain, burn calories, relieve stress, help the immune system, stimulate the mind and mellow one's mood. Other health benefits have been observed in older men—decreased risk of stroke and heart attack—but the same benefits have not been confirmed in teenage patients. [53] \n The  earlier onset of puberty  can produce sexual drives at a time when teens are not yet fully socialized to understand the potential social and emotional consequences of sexual activities. [54] [55] [56] [57] [58]  Some scholars claim that the risk for depression is \"clearly elevated\" for the sexually active of either gender. [59] \n \"We tend to focus on the health consequences of having sex, like pregnancy and STIs, but we also need to talk to [teens] about all the emotional consequences,\" some experts say. [12] \n Some research suggests that two-thirds of sexually active girls wish they had waited longer before having sex. [60]  Of seniors in high school, 74% of girls regret sexual experiences they have had. [61] \n For girls, even modest involvement in sexual experimentation elevates depression risk. [62]  Sexually active teenage girls are more than twice as likely to suffer depression compared to those who are not sexually active. [63] \n Sex therapists have found that the roots of sexual issues facing adults often date back to regretful teenage experiences. [12]  Research has also found that being abstinent in the teen years was associated with better mental health at age 29. [64]  Girls who were virgins at age 18 were also less likely to have a mental illness at age 40. [65] \n Girls are \"at particular risk for experiencing negative social and emotional consequences of having any type of sex,\" including oral sex. [11]  Girls are more than twice as likely as boys to say they felt bad about themselves and more than three times as likely to say they felt used as a result of engaging in sex [12]  or hookups. [12] [66] \n In a study of casual sex among adolescents, many girls believed they could have a purely sexual experience with no emotional ties, and they believed it was sexist to assume otherwise. However, the study found that both the girls and the boys who were hooking up often were depressed and didn't feel very good about themselves. [67] \n Effects on relationships [ edit ] \n When engaging in sexual acts the body produces  oxytocin , a chemical produced in the brain to promote feelings of connection and love. Production of oxytocin increases during the adolescent years. It has a larger effect on girls, suggesting it may make them care more about relationships and feel connections with others more intensely than boys. [53] [68] \n Dating violence and sexual assault [ edit ] \n Main articles:  Teen dating violence ,  Sexual assault ,  Domestic violence , and  Date rape \n Teen dating violence is defined as the physical, sexual, psychological or emotional violence within a dating relationship, as well as stalking. [69]  This includes electronic forms (e.g., threatening text messages, excessive yelling or cursing at someone in a phone message) as well as face-to-face forms. [69] \n Girls who have engaged in sexual intercourse are five times more likely than their virgin peers to be the victim of dating violence. [70]  Girls who were intentionally hurt by a date in the past 12 months are at a \"significantly elevated risk for a broad range of sexual health concerns and for pregnancy.\" [70]  Girls who have been victims are also twice as likely to report high levels of multiple sexual partners. [70] \n Sexual assault is any involuntary sexual act in which a person is threatened, coerced, or forced to engage against their will, or any sexual touching of a person who has not consented. This includes but is not limited to  rape  (forcible  sexual penetration ),  groping , forced kissing, or the torture of the victim in a sexual manner. [71] [72]  In legal terms, sexual assault is a statutory offense in the United States, varying widely state-to-state. \n Outside of law, the term  rape  has a less distinguished meaning and is often used interchangeably with sexual assault. [73] [74] \n Most rape victims are in their teens or young twenties: according to a study by the CDC and Department of Justice, 83% of rape victims interviewed were under the age of 25, and 54% were under the age of 18. 1 in 6 women had been raped in the study, and 1 in 33 men. [75]  1 in 5 women and 1 in 7 men who have experienced sexual violence first experienced this through dating violence as a teen. [76] \n Teen sexual violence does not always equate with  date rape , as the term might suggest; the term  date rape  may describe  drug facilitated sexual assault  (using drugs and/or alcohol), or a case of  acquaintance rape  (usually sexual assault by someone the victim doesn't know well, or just met). [77] [78] [79] \n Legal issues [ edit ] \n Sexting [ edit ] \n Main article:  Sexting \n Sexting , the sending of sexually explicit messages and/or photographs, has become increasingly popular with adolescents. However, according to some studies, sexting can \"glamorize and normalize sex in a way that might cause some teenagers to start having sex earlier, or in unhealthy ways.\" [80] \n More than one fifth of teens have sent sexually suggestive text messages or nude photographs of themselves online. [81]  Teens who photograph or film themselves or receive photos of others, known as sexting, can be charged with child pornography. [82]  Others who post the photos online could also be charged with child pornography and face prison time. [83]  Sexting can be considered sexual harassment. [80] \n Sexting is linked to psychological distress among teens. Those involved in sexting are more likely to report a suicide attempt, and have twice the odds of reporting depressive symptoms as students who aren't involved in sexting. \"For girls who send the sexts ... there is a disillusionment and a sense of betrayal when it's posted everywhere. When it gets forwarded to multiple boys at multiple schools and also other girls ... a girl starts getting called names and her reputation is ruined.\" [84] \n Boys who are victims of sexually predatory teenage girls can also be devastated. Sexually predatory girls will ask a boy, particularly a sexually naive boy, for photos, and \"he's sort of flattered and he feels like a big guy and then she sends them around.\" [84]  Unbeknownst to them at the time, their compliance can cause lasting harm. \n Often girls who take racy photos of themselves \"want to be admired, want someone to want them. A lot of them are lonely and starved for attention. A lot of girls believe they have no choice but to pose in this way. There are also the thrill seekers who do it because it's 'edgy and cool.'\" [83] \n Experts say that sexting poses a serious problem, partly because teens do not understand that the images are permanent and can be spread quickly. \"It does not click that what they’re doing is destructive, let alone illegal.\" [85]  \"Once they are out there, it spreads like a virus,\" police say. [86] \n Age of consent [ edit ] \n Main articles:  Ages of consent in the United States  and  Statutory rape \n For a comprehensive list of ages state-by-state, see  Ages of consent in the United States § State laws . \n Each state has its own  age of consent . Currently, state laws designate the age of consent as 16, 17, or 18, with more than half of the states designating 16 as the age limit. However, the five most populous states all have a higher age of consent (California: 18, Texas: 17, Florida: 18, New York: 17 and Illinois: 17). \n In some common law jurisdictions, statutory rape is sexual activity in which one person is below the age required to legally consent to the behavior. [87]  Although it usually refers to adults engaging in sex with minors under the age of consent, [87]  it is a generic term, and very few jurisdictions use the actual term \"statutory rape\" in the language of statutes. [88] \n In statutory rape, overt force or threat need not be present. The laws presume coercion, because a minor or mentally challenged adult is legally incapable of giving consent to the act. Statutory rape laws are based on the premise that until a person reaches a certain age, he or she is legally incapable of consenting to sexual intercourse. Thus, even if a minor engages in sexual intercourse willingly, the intercourse is not consensual. [89] \n Often, teenage couples engage in sexual conduct as part of an intimate relationship. This may occur before either participant has reached the age of consent, or after one has but the other has not. In the latter case, in most jurisdictions, the person who has reached the age of consent is guilty of statutory rape. In some jurisdictions (such as California), if two minors have sex with each other, they are both guilty of engaging in unlawful sex with the other person. [90] [91]  The act itself is  prima facie  evidence of guilt when one participant is incapable of legally consenting. \n Some jurisdictions have passed so-called \" Romeo and Juliet laws ,\" which serve to reduce or eliminate the penalty of the crime in cases where the couple's age difference is minor and the sexual contact would not have been rape if both partners were legally able to give consent. \n Social and cultural influences [ edit ] \n Media [ edit ] \n Main article:  Media and American adolescent sexuality \n The  American Academy of Pediatrics  has argued that media representations of sexuality may influence teen sexual behavior; [30]  this view is supported by various scholars, [92] [93]  while other scholars disagree. [94] \n Research indicates that sexual messages contained in film, television, and music are becoming more explicit in dialog, lyrics, and behavior. In television programming aimed at teens, more than 90% of episodes had at least one sexual reference in it with an average of 7.9 references per hour. [95]  Researchers have found a correlation between the amount of television with high sexual content that teenagers watch and an increased likelihood of them becoming pregnant or fathering a child out of wedlock, and believe that reducing the amount of sexual content adolescents watch on television could substantially reduce the teen pregnancy rate. [96]  By contrast, other scholars have argued that such claims have been premature; Steinberg and Monahan found that media effects diminished once other factors were controlled. [94] \n Scholarly studies suggest that approximately 15% of youth intentionally seek  pornography  in a given year. [97]  Donna Freitas, author of  The End of Sex: How Hookup Culture is Leaving a Generation Unhappy, Sexually Unfulfilled, and Confused About Intimacy , has this to say about porn: [29] \n Many boys learn to assume that the things women do in porn—how they dress and act around men—is also how women are supposed to act in real life. These same boys are learning to expect girls their own age to act like the women in porn videos, too ... Social media and Internet porn are influencing junior-high and high-school girls' understanding of sexiness. Girls are learning to use porn and porn archetypes to impress boys as early as middle school. \n Peers [ edit ] \n Both boys and girls feel pressure from their friends to have sex. The perception adolescents have of their best friends' sexual behavior has a significant association with their own sex behavior. [98]  Sexually active peers have a negative effect on adolescent sexual delay; however, responsive parent-adolescent sex discussions can buffer these effects. [99] \n In a 2003 study, 89% of girls reported feeling pressured by boys to have sex, while 49% of boys reported feeling pressured by girls to have sex. In contrast, 67% of boys felt pressured by other boys, while 53% of girls felt pressured by other girls. [13] \n Adolescents who reported sexual activity had high levels of reputation-based popularity, but not likeability among peers; however, sex with more partners was associated with lower levels of popularity. [98] \n Sexual education given to teens [ edit ] \n Main article:  Sex education in the United States \n Two main forms of sex education are taught in American schools: comprehensive and  abstinence-only . Comprehensive sex education covers abstinence as a positive choice, but also teaches about contraception use and the avoidance of STIs if the teen becomes sexually active. A 2002 study conducted by the  Kaiser Family Foundation  found that 58% of secondary school principals describe their sex education curriculum as comprehensive. [6]  The difference between these two approaches, and their impact on teen behavior, remains a controversial subject in the United States. \n There have been numerous studies on the effectiveness of both approaches, and conflicting data on American public opinion. Public opinion polls conducted over the years have found that the majority of Americans favor broader sex education programs over those that teach only abstinence, although abstinence educators recently published poll data with the totally opposite conclusion. [100] [101] [102]  The poll sponsored by the National Abstinence Education Association and conducted by  Zogby International  found that: [103] \n When parents become aware of what abstinence education vs. comprehensive sex education actually teaches, support for abstinence programs jumps from 40% to 60%, while support for comprehensive programs drops from 50% to 30%. This sharp increase in support of abstinence education is seen across all political and economic groups. The majority of parents reject the so-called \"comprehensive\" sex education approach, which focuses on promoting and demonstrating contraceptive use. Sixty-six percent of parents think that the importance of the \"wait to have sex\" message ends up being lost when programs demonstrate and encourage the use of contraception. \n Experts also encourage sex educators to include oral sex and emotional concerns as part of their curriculum. Their findings also support earlier studies that conclude: [11] \n ...sexual risk-taking should be considered from a dynamic relationship perspective, rather than solely from a traditional disease-model perspective. Prevention programs rarely discuss adolescents’ social and emotional concerns regarding sex.... Discussion about potential negative consequences, such as experiencing guilt or feeling used by one's partner, may lead some adolescents to delay the onset of sexual behavior until they feel more sure of the strength of their relationship with a partner and more comfortable with the idea of becoming sexually active. Identification of common negative social and emotional consequences of having sex may also be useful in screening for adolescents at risk of experiencing more-serious adverse outcomes after having sex. \n Comprehensive [ edit ] \n The  National Association of School Psychologists , [104]  the  American Academy of Pediatrics , [105]  the  American Public Health Association , [106]  the Society for Adolescent Medicine [107]  and the American College Health Association, [107]  have all stated official support for comprehensive sex education. Comprehensive sex education curricula are intended to reduce sexually transmitted infections and out-of-wedlock or teenage pregnancies. \n Proponents of this approach argue that sexual behavior after puberty is a given, and it is therefore crucial to provide information about the risks and how they can be minimized. They hold that abstinence-only sex ed and  conservative  moralizing will only alienate students and thus weaken the message. \n A report issued by the  Department of Health and Human Services  has found the \"most consistent and clear finding is that sex education does not cause adolescents to initiate sex when they would not otherwise have done so.\" The same report also found that: [18] \n Family life or sex education in the public schools, which traditionally has consisted largely of providing factual information at the secondary school level, is the most general or pervasive approach to preventing pregnancy among adolescents.... Adolescents who begin having sexual intercourse need to understand the importance of using an effective contraceptive every time they have sex. This requires convincing sexually active teens who have never used contraception to do so. In addition, sexually active teens who sometimes use contraceptives need to use them more consistently (every time they have sex) and use them correctly. \n Abstinence-only [ edit ] \n Main article:  Abstinence-only sex education \n Abstinence-only sex education tells teenagers that they should be sexually abstinent until marriage and does not provide information about contraception. In the Kaiser study, 34% of high-school principals said their school's main message was abstinence-only. Some Christian organizations advocate abstinence-only sex education because it is the only approach they find acceptable and in accordance with their churches' teachings. \n Some organizations promote what they consider to be \"sexual purity\", which encompasses abstaining from not only intercourse before marriage, but also from sexual thoughts, sexual touching, pornography, and actions that are known to lead to sexual arousal. Advocates of abstinence-only sex education object to comprehensive curricula which fail to teach moral behavior; they maintain that curricula should promote conventional (or conservative) morality as healthy and constructive, and that value-free knowledge of the body may lead to immoral, unhealthy and harmful practices. \n A comprehensive review of 115 program evaluations published in November 2007 by the National Campaign to Prevent Teen and Unplanned Pregnancy found that two-thirds of sex education programs focusing on both abstinence and contraception had a positive effect on teen sexual behavior. The same study found no strong evidence that programs that stress abstinence as the only acceptable behavior for unmarried teens delayed the initiation of sex, hastened the return to abstinence, or reduced the number of sexual partners. [108]  According to the study author: \n Even though there does not exist strong evidence that any particular abstinence program is effective at delaying sex or reducing sexual behavior, one should not conclude that all abstinence programs are ineffective. After all, programs are diverse, fewer than 10 rigorous studies of these programs have been carried out, and studies of two programs have provided modestly encouraging results. In sum, studies of abstinence programs have not produced sufficient evidence to justify their widespread dissemination. \n From parents [ edit ] \n Most teens (70%) say they have gotten some or a lot of information about sex and sexual relationships from their parents. Other sources of information include friends at 53%, school, also at 53%, TV and movies at 51% and magazines at 34%. School and magazines were sources of information for more girls than boys, and teens \"who were sexually active were much more likely to say they got information about sex from their friends and partners.\" [109]  Less than half of parents with daughters under 18 talk to their girls about how to say no to boys, and about half talk to them about contraception. [2] \n Adolescents whose parents talked to them at a young age felt more comfortable as they grew and were more likely to make personal decisions about sexual behavior that reflects the parental values and morals. [110] \n Some scholars argue that parents have a large influence on how teen sexuality is viewed in the United States, as well as how teens view their own sexuality. [111]  Parents' views of adolescent sexuality vary greatly between different countries. In the United States, teen sexuality is generally viewed under the framework of \"adversarial individualism\". [111]  This means that on a broader, societal level, there is little communication among individuals as compared to other countries such as the Netherlands where there is more emphasis on \"interdependent individualism\". [111]  Scholars argue that in the United States, there is greater emphasis on individual success rather than success of the majority. [111]  This paradigm plays into adolescent sexuality in the way that there is less communication about oftentimes sensitive topics such as adolescent sexuality. [111]  Scholars argue that this mentality has several consequences. [111]  The negative consequences of adversarial individualism can present themselves as impulse-driven teenagers that ultimately require more supervision than teenagers living in an interdependent individualistic society. In interdependent individualism, teenagers are ultimately more responsible because they are able to have open discussions with their guardians. [111] \n Father-daughter communication [ edit ] \n Studies have suggested that fathers generally tend to avoid sexual conversations with their children. [112]  Many fathers have uncertainties on how to start to the conversation. Other times they simply put the initiative on their daughters to come to them with questions or issues. [113]  Even when the conversation is launched fathers tend to be judgmental or only talk about abstinence. Fathers are more likely to forbid daughters from having sex when they are talking. Wilson et al. (2010) found that some fathers felt that talking about the potential consequences of sex was easier than talking about sex itself. [114]  Fathers overall tend to apply more orders when talking to their daughters than giving them unbiased information or simply listening and trying to give them their best advice. \n Hutchinson and Cederbaum (2011) studied father-daughter communication and found that increased father-daughter communication delayed sexual debut and decreased the frequency of engagement in sexual intercourse. [115]  They also found that responsible sexual behavior among adolescent females was associated with positive father-daughter communication regarding men, dating, sex, and marriage. On the other hand, fathers who were absent had been linked to higher rates of sexual activity and teen pregnancy among female adolescents. [115]  Fathers have a greater impact on daughters than they think, but fail to recognize it because they don’t believe they should be discussing sex with their daughters or simply leave it to the mothers. \n Correlations [ edit ] \n See also:  Religion and adolescent sexuality \n Girls who participate in athletics, artistic, or academic extracurricular activities are less likely to be sexually active than girls who don't participate in any. Female athletes have \"significantly fewer sex partners, engaged in less frequent intercourse ... and began having sex at a later age.\" For boys, those who participate in sports are slightly more likely to be sexually active, and those who are in artistic activities are considerably less likely. [116] \n Religious adolescents lose their virginity three years later than the average American. On average, those with strong religious backgrounds become sexually active at age 21. [117] \n Studies have shown stressed teens and teens without sufficient familial involvement tend to have more sex. [118] [119] \n Sexual minorities [ edit ] \n According to a study based on a sampling of teenagers in Massachusetts, sexual minority youth—that is, those who identify as gay, lesbian, or bisexual or had any same-sex sexual contact in their lifetimes—were significantly more likely than other students to report lifetime sexual intercourse (72% vs. 44%). [120]  The same study found that sexual minority youth were more likely to report sexual intercourse before age 13 (18% vs. 4%), sexual intercourse with four or more partners in their lifetimes (32% vs. 11%), and recent sexual intercourse (55% vs. 33%). Among students in the Massachusetts study who ever had sexual intercourse in their lifetimes, sexual minority youth were significantly more likely than other students to report \"having been or gotten someone pregnant (15% vs. 4%) and having been diagnosed with  HIV  or another STI (10% vs. 5%).\" [120] [121] \n See also [ edit ] \n United States portal \n Sexuality portal \n Adolescent sexuality \n Adolescent sexuality in Canada \n Ages of consent in the United States \n Comprehensive sex education \n Rates of teenage pregnancy \n Teenage pregnancy \n Teenage pregnancy and sexual health in the United Kingdom \n Notes [ edit ] \n ^   Although  STD  has been the term used the longest (for sexually transmitted disease), the preferred term now is  STI , for sexually transmitted infection, reflecting the fact that it is possible to become infected but not display any symptoms \n References [ edit ] \n ^  a   b   c   \"Trends in the Prevalence of Sexual Behaviors\"   (PDF) .  The National Youth Risk Behavior Survey (YRBS) 1991–2007 . US Centers for Disease Control and Prevention. 2007. Archived from  the original   (PDF)  on October 5, 2011 . Retrieved  March 1,  2011 .   \n ^  a   b   Doyle, Rodger (January 2007).  \"By the Numbers: Teen Sex in America\" . Scientific American: 30.   \n ^  a   b   \"U.S. Teen Sexual Activity\"   (PDF) . Kaiser Family Foundation. January 2005. Archived from  the original   (PDF)  on March 17, 2007 . Retrieved  March 11,  2007 .   \n ^   UNICEF (2001).  \"Teenage Births in Rich Nations\"   (PDF) . Retrieved  October 9,  2012 .   \n ^   \"About Teen Pregnancy, 2014\" . Retrieved  June 30,  2014 .   \n ^  a   b   c   d   e   \"Sex Education in the U.S.: Policy and Politics\"   (PDF) .  Issue Update . Kaiser Family Foundation. October 2002 . Retrieved  May 23,  2007 .   \n ^   Ott, MA; Santelli, JS (October 2007). \"Abstinence and abstinence-only education\".  Current Opinion in Obstetrics and Gynecology .  19  (5): 446–52.  doi : 10.1097/GCO.0b013e3282efdc0b .  PMID   17885460 .   \n ^   Kirby, D. (2007).  \"Emerging Answers 2007: Research Findings on Programs to Reduce Teen Pregnancy and Sexually Transmitted Diseases\" . National Campaign to Prevent Teen Pregnancy.     [1] \n ^   Laura Sessions Stepp (September 16, 2005).  \"Study: Half of All Teens Have Had Oral Sex\" .  Washington Post . Retrieved  April 28,  2008 .   \n ^   Teens believe oral sex is safer, more acceptable to peers , Medical News Today, April 4, 2005 \n ^  a   b   c   d   Sonya S. Brady; Bonnie L. Halpern-Felsher (2007). \"Adolescents' Reported Consequences of Having Oral Sex Versus Vaginal Sex\".  Pediatrics .  119  (2): 229–236.  doi : 10.1542/peds.2006-1727 .  PMID   17272611 .   \n ^  a   b   c   d   e   Lelchuk, Ilene (February 15, 2007).  \"UCSF explores teens' post-sex emotions\" . San Francisco Chronicle.  Archived  from the original on November 16, 2007 . Retrieved  December 8,  2007 .   \n ^  a   b   \"Gender Roles Summary\"   (PDF) . Kaiser Family Foundation. Archived from  the original   (PDF)  on March 8, 2006 . Retrieved  April 13,  2007 .   \n ^   \"Seventeen Is the Average Age at First Sexual Intercourse\"   (PDF) .  American Sexual Behavior . newstrategist.com. Archived from  the original   (PDF)  on November 20, 2006 . Retrieved  March 7,  2012 .   \n ^   \"Frequently Asked Sexuality Questions to the Kinsey Institute\" . Kinsey Institute . Retrieved  May 27,  2013 .   \n ^  a   b   c   d   e   f   g   h   i   j   k   l   m   n   o   p   q   r   \"American Teens' Sexual and Reproductive Health\"   (pdf) .  Guttmacher Institute . June 2013 . Retrieved  August 14,  2013 .   \n ^   Garcia, Justin R.; Reiber, Chris; Massey, Sean G.; Merriwether, Ann M. (2012),  \"Sexual Hookup Culture: A Review\"   (PDF) ,  Review of General Psychology ,  16  (2): 161–176,  doi : 10.1037/a0027911 ,  PMC   3613286   ,  PMID   23559846 , retrieved  June 25,  2013   \n ^  a   b   \"Beginning Too Soon: Adolescent Sexual Behavior, Pregnancy And Parenthood\" . U.S. Department of Health and Human Services. 2001.  Archived  from the original on March 29, 2007 . Retrieved  March 11,  2007 .   \n ^   R. MacLean (2004).  \"Norms That Encourage Young Adolescents Not to Have Sex Tied to Reduced Odds of Becoming Sexually Active\" .  Perspectives on Sexual and Reproductive Health .  36  (4): 170–176.  doi : 10.1111/j.1931-2393.2004.tb00019.x .   \n ^   Renee E. Sieving; Jennifer A. Oliphant; Robert Wm. Blum (2002).  \"Adolescent Sexual Behavior and Sexual Health\" .  Pediatrics in Review .  23  (12): 407–416 . Retrieved  October 9,  2012 .   \n ^   Teen birth rate falls, as does percentage of high schoolers having sex, Associated Press, July 13, 2007 \n ^  a   b   Abma, J. C.; Martinez, G. M.; Copen, C. E. (2010). \"Teenagers in the United States: Sexual activity, contraceptive use, and childbearing, national survey of family growth 2006-2008\".  Vital and health statistics. Series 23, Data from the National Survey of Family Growth  (30): 1–47.  PMID   21548441 .   \n ^   \"Sexual Health Statistics for Teenagers and Young Adults in the United States\"   (PDF) . Kaiser Family Foundation. September 2006 . Retrieved  July 2,  2008 .   \n ^   Nicholas Bakalar (November 14, 2011).  \"Teenagers Having Sex Are a Minority\" . New York Times . Retrieved  March 7,  2012 .   \n ^  a   b   c   d   e   f   g   T. Tamkins.  \"Teenagers Who Abstain from Sex Cite Similar Reasons Regardless of Whether They Have Ever Had Intercourse\" .  Perspectives on Sexual and Reproductive Health .  36  (4): 174–175.  doi : 10.1111/j.1931-2393.2004.tb00019.x .   \n ^   Gray, Joe (December 30, 2007).  \"DISCOVERIES\" .  HealthDay  News . Chicago Tribune. Archived from  the original  on February 16, 2008 . Retrieved  January 5,  2008 .   \n ^   Loewenson PR, Ireland M, Resnick MD (2004). \"Primary and secondary sexual abstinence in high school students\".  Journal of Adolescent Health .  34  (3): 209–215.  doi : 10.1016/j.jadohealth.2003.05.002 .  PMID   14967344 .   \n ^   Bersamin M.M.; Fisher D.A.; Walker S.; Hill D.L.; Grube J.W. (2007). \"Defining virginity and abstinence: Adolescents' interpretations of sexual behaviors\".  Journal of Adolescent Health .  41 : 182–188.  doi : 10.1016/j.jadohealth.2007.03.011 .   \n ^  a   b   c   Freitas, Donna (2013).  The End of Sex: How Hookup Culture is Leaving a Generation Unhappy, Sexually Unfulfilled, and Confused About Intimacy . New York: Basic Books.   \n ^  a   b   American Academy Of Pediatrics. Committee On Public Education. American Academy of Child and Adolescent Psychiatry (January 2001).  \"Sexuality, Contraception, and the Media\" .  Pediatrics .  107  (1): 191–1994.  doi : 10.1542/peds.107.1.191 .  PMID   11134460 . Archived from  the original  on January 24, 2007.   CS1 maint: Uses authors parameter ( link ) \n ^   Wendy D. Manning; Peggy C. Giordano; Monica A. Longmore (2006).  \"Hooking Up: The Relationship Contexts of \"Nonrelationship\" Sex\" .  Journal of Adolescent Research .  21  (5): 459–483.  doi : 10.1177/0743558406291692 .   \n ^   Lescano CM; et al. (2006). \"Condom use with \"casual\" and \"main\" partners: what's in a name?\".  J Adolesc Health .  39  (3): e1–e7.  doi : 10.1016/j.jadohealth.2006.01.003 .   \n ^   \"Close Parental Relationships Could Delay Adolescent Sex\" . Medical College of Wisconsin. Archived from  the original  on October 9, 2007 . Retrieved  March 8,  2012 .   \n ^  a   b   Timothy W. Martin (2011).  \"Birth Rate Continues to Slide Among Teens\" . Wall Street Journal . Retrieved  March 7,  2012 .   \n ^   \"WHO - Adolescent Pregnancy\" . World Health Organization. May 2012 . Retrieved  October 28,  2013 .   \n ^  a   b   Anthony Paik (2011). \"Adolescent Sexuality and the Risk of Marital Dissolution\".  Journal of Marriage and Family .  73  (2): 472–485.  doi : 10.1111/j.1741-3737.2010.00819.x .   \n ^   \"Policy Brief: Racial and Ethnic Disparities in Teen Pregnancy\"   (PDF) . The National Campaign to Prevent Teen and Unplanned Pregnancy. July 2008. Archived from  the original   (PDF)  on October 29, 2008 . Retrieved  October 13,  2008 .   \n ^   Whitbeck, Les ; et al. (1999).  \"Early adolescent sexual activity : A developmental study\" .  Journal of marriage and the family .  61  (4): 934.  doi : 10.2307/354014 .  JSTOR   354014 .   \n ^  a   b   Sabo, Donald; et al. (1999). \"High school athletic participation, sexual behavior and adolescent pregnancy: a regional study\".  Journal of Adolescent Health .  25  (3): 207–16.  doi : 10.1016/S1054-139X(99)00070-1 .  PMID   10475497 .   \n ^   \"National Campaign to Prevent Teen Pregnancy, 14 and Younger: The Sexual Behavior of Adolescents, 2003\"   (PDF) . Archived from  the original   (PDF)  on April 7, 2005 . Retrieved  May 11,  2005 .   \n ^   \"Abortion Surveillance - United States, 2009\" . CDC . Retrieved  October 28,  2013 .   \n ^  a   b   Jonathan Klick; Thomas Stratmann (October 5, 2005). \"Abortion Access and Risky Sex Among Teens: Parental Involvement Laws and Sexually Transmitted Diseases\".  FSU College of Law, Public Law Research Paper No. 175 .  SSRN   819304   .   \n ^   \"InBrief Facts_Induced Abortion WW\"   (PDF) . World Health Organization . Retrieved  October 28,  2013 .   \n ^   \"Sexually Transmitted Diseases Surveillance, 2006\" . Archived from  the original  on November 17, 2007 . Retrieved  December 5,  2007 .   \n ^   Anna Mulrine.  \"Risky Business\" .  U.S. News & World Report  (May 27, 2002). Archived from  the original  on January 13, 2007.   \n ^   Christine E. Kaestle; Carolyn T. Halpern; William C. Miller; Carol A. Ford (2005). \"Young Age at First Sexual Intercourse and Sexually Transmitted Infections in Adolescents and Young Adults\".  American Journal of Epidemiology .  161  (8): 774–780.  doi : 10.1093/aje/kwi095 .  PMID   15800270 .   \n ^  a   b   c   Maggie Fox (August 16, 2012).  \"Fewer teen girls having oral sex, study shows\" . NBC News . Retrieved  January 13,  2013 .   \n ^   Dunne EF, Unger ER, Sternberg M, et al. (2007). \"Prevalence of HPV infection among females in the United States\".  JAMA .  297  (8): 813–9.  doi : 10.1001/jama.297.8.813 .  PMID   17327523 .   \n ^  a   b   c   Stephanie Desmon (March 12, 2008).  \"1 in 4 U.S. teen girls infected with STD\" .  Baltimore Sun . Archived from  the original  on May 11, 2008 . Retrieved  March 12,  2008 .   \n ^   Weinstock H; et al. (2004). \"Sexually transmitted diseases among American youth: incidence and prevalence estimates, 2000\".  Perspectives on Sexual and Reproductive Health .  36  (1): 6–10.  doi : 10.1363/3600604 .  PMID   14982671 .   \n ^   Tanner, Lindsey (March 11, 2008).  \"Nearly 1 in 4 Teen Girls Has STD, CDC Says\" . ABC News . Retrieved  April 15,  2008 .   \n ^   \"Sexually Transmitted Disease Surveillance 2011 (pdf)\"   (PDF) . CDC . Retrieved  October 29,  2013 .   \n ^  a   b   Nicole Blades (June 24, 2008).  \"56 Reasons to Have Sex\" . HealthNewsDigest.com. Archived from  the original  on July 11, 2011 . Retrieved  June 30,  2008 .   \n ^   Jayson, Sharon (October 19, 2005).  \"Teens define sex in new ways\" . USA Today . Retrieved  December 8,  2007 .   \n ^   Ponton, Lynn (2000).  The Sex Lives of Teenagers . New York: Dutton. p. 3.  ISBN   978-0-452-28260-5 .   \n ^   Garn, SM. Physical growth and development. In: Friedman SB, Fisher M, Schonberg SK., editors. Comprehensive Adolescent Health Care. St Louis: Quality Medical Publishing; 1992. Retrieved on February 20, 2009 \n ^   (Caspi et al.1993: Lanza and Collins, 2002) [ full citation needed ] \n ^   (Stattin & Magnussion, 1990). [ full citation needed ] \n ^   Denise D. Hallfors; Martha W. Waller; Carol A. Ford; Carolyn T. Halpern; Paul H. Brodish; Bonita Iritani (2004). \"Adolescent Depression and Suicide Risk: Association with Sex and Drug Behavior\".  American Journal of Preventive Medicine .  27  (3): 224–231.  doi : 10.1016/j.amepre.2004.06.001 .  PMID   15450635 .   \n ^   Carrie Lukas; Director of Policy; Independent Women's Forum (2005).  \"Friends with Benefits\"   (Windows Media) . National Public Radio . Retrieved  April 15,  2008 .   \n ^   Anderson, Kristen (2001).  The Truth about Sex by High School Senior Girls . Kristen Anderson.  ISBN   978-0-9708831-0-0 .   \n ^   Denise D. Hallfors; Martha W. Waller; Daniel Bauer; Carol A. Ford; Carolyn T. Halpern (2005).  \"Which Comes First in Adolescence—Sex and Drugs or Depression?\"   (PDF) .  American Journal of Preventive Medicine .  29  (3): 163–170.  doi : 10.1016/j.amepre.2005.06.002 .  PMID   16168864 .   ( registration required ) \n ^   Joseph J. Sabiaa; Daniel I. Rees (2008). \"The effect of adolescent virginity status on psychological well-being\".  Journal of Health Economics .  27  (5): 1368–1381.  doi : 10.1016/j.jhealeco.2008.05.008 .  PMID   18635278 .   \n ^   Bogart, Laura M., Collins, Rebecca L., Ellickson, Phyllis L., Klein, David J., (2007). \"Association of Sexual Abstinence in Adolescence with Mental Health in Adulthood\".  Journal of Sex Research .  44  (3): 290–8.  doi : 10.1080/00224490701444005 .  PMID   17879172 .   CS1 maint: Uses authors parameter ( link ) \n ^   Finger, R., Thelen, T., Vessey, J. T., Mohm, J. K., & Mann, J. R. (2004). \"Association of virginity at age 18 with educational, economic, social, and health outcomes in middle adulthood\".  Adolescent & Family Health .  3 : 164–170.   CS1 maint: Uses authors parameter ( link ) \n ^   Sax, Leonard (2005).  Why Gender Matters .  Doubleday .  ISBN   978-0-385-51073-8 .   \n ^   Benoit Denizet-Lewis (2005).  \"Friends with Benefits\"   (Windows Media) . National Public Radio . Retrieved  April 15,  2008 .   \n ^   Jerry Large (June 8, 2009).  \"Shedding light on the teen brain\" . Seattle Times. Archived from  the original  on June 12, 2009 . Retrieved  June 15,  2009 .   \n ^  a   b   \"CDC - Teen Dating Violence - Intimate Partner Violence - Violence Prevention - Injury\" . CDC . Retrieved  October 29,  2013 .   \n ^  a   b   c   Jay G. Silverman; Anita Raj; Karen Clements (2004). \"Dating Violence and Associated Sexual Risk and Pregnancy Among Adolescent Girls in the United States\".  Pediatrics .  114  (2): 220–225.  doi : 10.1542/peds.114.2.e220 .  PMID   15286260 .   \n ^   \"Sexual Assault - FAQs\" . Womenshealth.gov. January 2005. Archived from  the original  on October 24, 2008.   \n ^   \"Archived copy\"   (PDF) . Archived from  the original   (PDF)  on April 18, 2014 . Retrieved  2013-11-24 .   \n ^   Roberts, Albert R.; Ann Wolbert Bergess; CHERYL REGEHR (2009).  Victimology: Theories and Applications . Sudbury, Mass: Jones & Bartlett Publishers. p. 228.  ISBN   978-0-7637-7210-9 .   \n ^   Krantz G, Garcia-Moreno C (October 2005).  \"Violence against women\" .  J Epidemiol Community Health .  59  (10): 818–21.  doi : 10.1136/jech.2004.022756 .  PMC   1732916   .  PMID   16166351 .   \n ^   \"Statistics - Rape Treatment Center\" . Rape Treatment Center, Santa Monica, UCLA Medical Center. Archived from  the original  on September 17, 2013 . Retrieved  October 28,  2013 .   \n ^   \"February Director's Message - Teen Dating Violence Awareness & Prevention Month\" . US Department of Justice. Archived from  the original  on October 29, 2013 . Retrieved  October 28,  2013 .   \n ^   Date Rape Drugs   Archived  February 23, 2014, at the  Wayback Machine .. U.S. Department of Health and Human Services, Office of Women's Health \n ^   Date Rape Drugs . Men Against Sexual Assault. University of Rochester \n ^   \"Perspectives on Acquantaince Rape\" . American Academy of Experts in Traumatic Stress . Retrieved  November 7,  2013 .   \n ^  a   b   Claire McCarthy (February 20, 2013).  \"Why Snapchat is dangerous (it's not just because of sexting)\" . Boston.com . Retrieved  May 27,  2013 .   \n ^   \"Editorial: 'Sexting' overkill\" . philly.com. April 6, 2009. Archived from  the original  on April 9, 2009 . Retrieved  April 7,  2009 .   \n ^   \"A.H., a child, Appellant, v. STATE OF FLORIDA, Appellee\" . politechbot.com. 2007.  Archived  from the original on December 23, 2008 . Retrieved  December 28,  2008 .   \n ^  a   b   SUSAN DONALDSON JAMES (May 28, 2008).  \"Child Porn Charge for MySpace Revenge Pics\" . ABC News . Retrieved  February 22,  2010 .   \n ^  a   b   \"Teen Sexting Linked to Psychological Distress\" . firstcoastnews.com. 2011. Archived from  the original  on January 23, 2013 . Retrieved  March 7,  2012 .   \n ^   Kaitlin Keane (2009).  \"Experts warn teens, parents to take sexting dangers seriously\" . Archived from  the original  on November 7, 2012 . Retrieved  April 7,  2009 .   \n ^   Maureen Boyle (April 6, 2009).  \" ' Sexting' can ruin teens' lives\" . Retrieved  April 7,  2009 .   \n ^  a   b   \"Statutory Rape Known to Law Enforcement\"   (PDF) . U.S. Department of Justice - Office of Juvenile Justice and Delinquency Prevention . Retrieved  March 24,  2008 .   \n ^   \"State Legislators' Handbook for Statutory Rape Issues\"   (PDF) . U.S Department of Justice - Office for Victims of Crime . Retrieved  March 24,  2008 .   \n ^   \"Can Statutory Rape Laws Be Effective in Preventing Adolescent Pregnancy?\" . Guttmacher Institute . Retrieved  March 24,  2008 .   \n ^   http://codes.lp.findlaw.com/cacode/PEN/3/1/9/1/s261.5 \n ^   Manson, Pamela (December 6, 2006).  \"Girl, 13, charged as sex offender and victim\" .  Denver Post .   \n ^   \"Media Literacy\" . University of Washington . Retrieved  March 7,  2012 .   \n ^   Victor C. Strasburger (2005). \"Adolescents, Sex, and the Media: Ooooo, Baby, Baby – a Q & A\".  Adolesc Med .  16  (2): 269–288.  doi : 10.1016/j.admecli.2005.02.009 .  PMID   16111618 .   \n ^  a   b   Steinberg, L., & Monahan, K. 2010. Developmental Psychology. \n ^   Jennifer Stevens Aubrey (2004). \"Sex and Punishment: An Examination of Sexual Consequences and the Sexual Double Standard in Teen Programming\".  Sex Roles .  50  (7–8): 505–514.  doi : 10.1023/B:SERS.0000023070.87195.07 .   \n ^   Anita Chandra, DrPH, Steven C. Martino, Rebecca L. Collins, Marc N. Elliott, Sandra H. Berry, David E. Kanouse and Angela Miu (November 2008).  \"Does Watching Sex on Television Predict Teen Pregnancy? Findings From a National Longitudinal Survey of Youth\" .  Pediatrics .  122  (5): 1047–1054.  doi : 10.1542/peds.2007-3066 .  PMID   18977986 .   CS1 maint: Uses authors parameter ( link )   ( registration required ) \n ^   Michele Ybarra; Kimberly Mitchell (2005).  \"Exposure to Internet Pornography among Children and Adolescents\"   (PDF) .  Cyber Psychology .  8  (5): 473–486.  doi : 10.1089/cpb.2005.8.473 .   \n ^  a   b   Prinstein, Mitchell J.; Meade, Christina S.; Cohen, Geoffrey L. (June 2003). \"Adolescent Oral Sex, Peer Popularity, and Perceptions of Best Friends' Sexual Behavior\".  Journal of Pediatric Psychology .  28  (4): 243–249.  doi : 10.1093/jpepsy/jsg012 .  PMID   12730281 .   \n ^   Amy M. Fasula; Kim Miller (2006). \"African-American and Hispanic adolescents' intentions to delay first intercourse: parental communication as a buffer for sexually active peers\".  Journal of Adolescent Health .  38  (3): 193–200.  doi : 10.1016/j.jadohealth.2004.12.009 .  PMID   16488815 .   \n ^   Dailard, Cynthia (February 2001).  \"Sex Education: Politicians, Parents, Teachers and Teens\" .  The Guttmacher Report on Public Policy . Guttmacher Institute.  Archived  from the original on May 24, 2007 . Retrieved  May 23,  2007 .   \n ^   \"On Our Side: Public Support for Comprehensive Sexuality Education\"   (PDF) .  SIECUS . Archived from  the original   (PDF)  on July 15, 2007 . Retrieved  May 23,  2007 .   \n ^   \"NAEA Executive Summary of Key Findings\" .  National Abstinence Education Association . May 3, 2007.  Archived  from the original on May 17, 2007 . Retrieved  May 24,  2007 .   \n ^   Parents Prefer Abstinence Education 2 to 1 , National Abstinence Education Association \n ^   \"Position Statement on Sexuality Education\" . NASP. 2003. Archived from  the original  on November 9, 2007 . Retrieved  March 7,  2012 .   \n ^   Committee on Psychosocial Aspects of Child and Family Health and Committee on Adolescence (2001).  \"Sexuality Education for Children and Adolescents\" .  Pediatrics .  108  (2): 498–502.  doi : 10.1542/peds.108.2.498 .   CS1 maint: Uses authors parameter ( link ) \n ^   \"Abstinence and U.S. Abstinence-Only Education Policies: Ethical and Human Rights Concerns\" . American Public Health Association. 2006. Archived from  the original  on February 6, 2012 . Retrieved  March 7,  2012 .   \n ^  a   b   \"Abstinence-only education policies and programs\"   (PDF) . Journal of Adolescent Health. 2006. Archived from  the original   (PDF)  on April 6, 2008 . Retrieved  March 31,  2008 .   \n ^   \"Emerging Answers 2007\" . The National Campaign to Prevent Teen and Unplanned Pregnancy. 2007. Archived from  the original  on February 15, 2012 . Retrieved  March 7,  2012 .   \n ^   Katie Couric (2005).  \"Nearly 3 in 10 young teens 'sexually active ' \" . MSNBC.  Archived  from the original on January 20, 2007 . Retrieved  January 21,  2007 .   \n ^   Geasler M. J.; Dannison L. L.; Edlund C. J. (1995). \"Sexuality education of young children: parental concerns\".  Family Relations .  44  (2): 184–188.  doi : 10.2307/584807 .   \n ^  a   b   c   d   e   f   g   Schalet, Amy,  Not Under My Roof: Parents, Teens, and the Culture of Sex , Chicago: University of Chicago Press   \n ^   Heisler J. M. (2005). \"Family communication about sex: parents and college-aged offspring recall discussion topics, satisfaction, and parental involvement\".  The Journal of Family Communication .  5  (4): 295–312.  doi : 10.1207/s15327698jfc0504_4 .   \n ^   Wilson E. K.; Dalberth B. T.; Koo H.P.; Gard J. C. (2010). \"Parents' perspectives on talking to preteenage children about sex\".  Perspectives on Sexual and Reproductive Health .  42  (1): 56–63.  doi : 10.1363/4205610 .   \n ^   Wilson E. K.; Dalberth B. T.; Koo H. P. (2010). \"We're the heroes!\": fathers' perspectives on their role in protecting their preteenage children from sexual risk\".  Perspectives on Sexual and Reproductive Health .  42  (2): 117–124.  doi : 10.1363/4211710 .   \n ^  a   b   Hitchinson K. M.; Cederbaum J. A. (2011). \"Talking to daddy's little girl about sex: daughters' reports of sexual communication and support from fathers\".  Journal of Family Issues .  32  (4): 550–572.  doi : 10.1177/0192513x10384222 .   \n ^   Yiannakis, Andrew; Merrill J. Melnick (2001).  Contemporary Issues in Sociology of Sport . Human Kinetics. pp. 109–123.  ISBN   978-0-7360-3710-5 .   \n ^   \"Study: Religious Teens More Likely to Abstain from Sex\" . FoxNews. January 2, 2009.  Archived  from the original on January 5, 2009 . Retrieved  April 25,  2014 .   \n ^   Rebekah Levine Coley; Bethany L. Medeiros; Holly S. Schindler (2008). \"Using Sibling Differences to Estimate Effects of Parenting on Adolescent Sexual Risk Behaviors\".  Journal of Adolescent Health .  43  (2): 133–140.  doi : 10.1016/j.jadohealth.2007.12.012 .  PMID   18639786 .   \n ^   Sally Law (May 15, 2009).  \"Involved Dads Lower Their Kids' Sex Risks\" . US News.  Archived  from the original on May 18, 2009 . Retrieved  May 17,  2009 .   \n ^  a   b   Massachusetts Department of Education (June 2006).  \"2005 Youth Risk Behavior Survey\" .  Massachusetts Department of Education Website .   \n ^   Ethan Jacobs (June 21, 2007).  \"Surprising results from health risk survey for LGB youth\" .  Bay Windows .   \n Further reading [ edit ] \n \"Sexual and Reproductive Health of Persons Aged 10-24 Years, United States, 2002-2007 (full document, PDF)\"   (PDF) . Center for Disease Control . Retrieved  October 28,  2013 .   \n \"National Health Statistics Reports, Number 60 October 18, 2012\"   (PDF) . CDC . Retrieved  October 28,  2013 .   \n External links [ edit ] \n \" The International Encyclopedia of Sexuality: United States of America \" (sections 4B, 5B, and 6A cover adolescent sexuality). \n Birth Control: MedlinePlus   Gives directions on how to use various birth control methods, for teens \n v \n t \n e \n United States  articles \n History \n By event \n Timeline of U.S. history \n Pre-Columbian era \n Colonial era \n Thirteen Colonies \n military history \n Continental Congress \n American Revolution \n War \n American frontier \n Drafting and ratification of Constitution \n Federalist Era \n War of 1812 \n Territorial acquisitions \n Territorial evolution \n Mexican–American War \n Civil War \n Reconstruction Era \n Indian Wars \n Gilded Age \n Progressive Era \n African-American Civil Rights Movement 1865–1895  /  1896–1954 \n Spanish–American War \n Imperialism \n World War I \n Roaring Twenties \n Great Depression \n World War II \n home front \n Nazism in the United States \n American Century \n Cold War \n Korean War \n Space Race \n Civil Rights Movement \n Feminist Movement \n Vietnam War \n Post-Cold War (1991–2008) \n Collapse of the Soviet Union \n War on Terror \n War in Afghanistan \n Iraq War \n Recent events (2008–present) \n By topic \n Outline of U.S. history \n Demographic \n Discoveries \n Economic \n debt ceiling \n Inventions \n before 1890 \n 1890–1945 \n 1946–91 \n after 1991 \n Military \n Postal \n Technological and industrial \n Geography \n Territory \n states \n territories \n counties \n cities, towns, and villages \n Earthquakes \n Extreme points \n Islands \n Mountains \n peaks \n ranges \n Appalachian \n Rocky \n National Park Service \n National Parks \n Regions \n East Coast \n West Coast \n Great Plains \n Gulf \n Mid-Atlantic \n Midwestern \n New England \n Pacific \n Central \n Eastern \n Northern \n Northeastern \n Northwestern \n Southern \n Southeastern \n Southwestern \n Western \n Rivers \n Colorado \n Columbia \n Mississippi \n Missouri \n Ohio \n Rio Grande \n Yukon \n Time \n Water supply and sanitation \n Politics \n Federal \n Executive \n President \n Executive Office \n Cabinet  /  Executive departments \n Civil service \n Independent agencies \n Law enforcement \n Public policy \n Legislature \n Congress \n Senate \n Vice President \n President pro tempore \n House of Representatives \n Speaker \n Judiciary \n Federal judiciary \n Supreme Court \n Courts of appeals \n District courts \n Law \n Constitution \n federalism \n preemption \n separation of powers \n Bill of Rights \n civil liberties \n Code of Federal Regulations \n Federal Reporter \n United States Code \n United States Reports \n Intelligence \n Central Intelligence Agency \n Defense Intelligence Agency \n Federal Bureau of Investigation \n National Geospatial-Intelligence Agency \n National Reconnaissance Office \n National Security Agency \n Office of the Director of National Intelligence \n Uniformed \n Armed Forces \n Army \n Marine Corps \n Navy \n Air Force \n Coast Guard \n National Guard \n NOAA Corps \n Public Health Service Corps \n Political \ndivisions \n List of states and territories of the United States \n States \n Territories \n Federal district \n Native American autonomous administrative divisions \n United States Minor Outlying Islands \n Associated states \n Local government in the United States \n Federal enclave \n Elections \n Electoral College \n Foreign relations \n Foreign policy \n Vetos in the UN Security Council \n Ideologies \n Anti-Americanism \n Exceptionalism \n Nationalism \n Parties \n Democratic \n Republican \n Third parties \n 51st state \n political status of Puerto Rico \n District of Columbia statehood movement \n Red states and blue states \n Purple America \n Scandals \n State governments \n governor \n state legislature \n state court \n Uncle Sam \n Economy \n By sector \n Agriculture \n Banking \n Wall Street \n Communications \n Energy \n Insurance \n Manufacturing \n Mining \n Tourism \n Trade \n Transportation \n Companies \n by state \n Currency \n Exports \n Federal budget \n Federal Reserve System \n Financial position \n Labor unions \n Public debt \n Social welfare programs \n Taxation \n Unemployment \n Society \n Culture \n Americana \n Architecture \n Cinema \n Cuisine \n Dance \n Demography \n Education \n Family structure \n Fashion \n Flag \n Folklore \n Languages \n American English \n Indigenous languages \n ASL \n Black American Sign Language \n HSL \n Plains Sign Talk \n Arabic \n Chinese \n French \n German \n Italian \n Russian \n Spanish \n Literature \n Media \n Journalism \n Internet \n Newspapers \n Radio \n Television \n Music \n Names \n People \n Philosophy \n Public holidays \n Religion \n Sexuality \n Sports \n Theater \n Visual art \n Social class \n Affluence \n American Dream \n Educational attainment \n Homelessness \n Home-ownership \n Household income \n Income inequality \n Middle class \n Personal income \n Poverty \n Professional and working class conflict \n Standard of living \n Wealth \n Issues \n Ages of consent \n Capital punishment \n Crime \n Incarceration \n Criticism of government \n Discrimination \n Affirmative action \n Intersex rights \n Islamophobia \n LGBT rights \n Racism \n Same-sex marriage \n Drug policy \n Energy policy \n Environmental movement \n Gun politics \n Health care \n Health insurance \n Health care reform \n Abortion \n Hunger \n Obesity \n Smoking \n Human rights \n Immigration \n illegal \n International rankings \n National security \n Mass surveillance \n Terrorism \n Separation of church and state \n Outline \n Index \n Book \n Category \n Portal \n v \n t \n e \n Human sexuality  and  sexology \n Sexual relationship \nphenomena \n Asexuality \n Gray asexuality \n Bisexuality \n Casual relationship \n Casual sex \n Celibacy \n Celibacy syndrome \n Committed relationship \n Free love \n Herbivore men \n Heterosexuality \n Homosexuality \n Hypersexuality \n Marriage \n One-night stand \n Polyamory \n Promiscuity \n Female \n Romantic love \n Romantic orientation \n Flirting \n Sex life \n Sexual abstinence \n Sexual partner \n Single person \n Swinging \n Sexual dynamics \n Hypergamy \n Intersex \n Physical attractiveness \n Sexual attraction \n Sexual ethics \n See also \n Sexual addiction \n Sex Addicts Anonymous \n Sexual surrogate \n v \n t \n e \n Sexuality by country \n General \n Sexuality in the United States \n Sexuality in Africa \n Sexuality in China \n Sexuality in Nigeria \n Sexuality in Germany \n Sexuality in France \n Sexuality in South Korea \n Adolescent sexuality in the United States \n Adolescent sexuality in Canada \n Adolescent sexuality in the United Kingdom \n Sexuality in Japan \n Sexuality in the Philippines \n Sexuality in Ancient Rome \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Adolescent_sexuality_in_the_United_States&oldid=809750492 \"\t\t\t\t\t \n Categories :  Adolescent sexuality in the United States Youth in the United States Sexuality in the United States Hidden categories:  Articles needing more detailed references CS1 maint: Uses authors parameter Pages with login required references or sources Webarchive template wayback links Use American English from July 2015 All Wikipedia articles written in American English Use mdy dates from April 2017   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n فارسی   \n Edit links   \n  This page was last edited on 11 November 2017, at 04:31. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}