{"url": "https://en.wikipedia.org/wiki/Geisha", "content": "Geisha - Wikipedia \n Geisha   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n \"Geiko\" redirects here. For the insurance company, see  GEICO . For other uses, see  Geisha (disambiguation) . \nProfile of geisha Kimiha from  Miyagawacho , wearing a formal black  kimono  ( tomesode ) and a  Shimada -styled  nihongami  wig. Her  obi  is tied in the \"taiko\" ( drum ) style. All these are details which clearly distinguish her from a  maiko  (an apprentice). \nGeiko Tsunemomo of Gion Higashi \n Geisha   ( 芸者 )  ( / ˈ ɡ eɪ ʃ ə / ;  Japanese:  [ɡe̞ːɕa̠] ),  geiko   ( 芸子/芸妓 ) , or  geigi   ( 芸妓 )  are traditional Japanese female entertainers who act as hostesses. Their skills include performing various arts such as  classical music , dance, games, and conversation, traditionally to entertain male customers, but also female customers today. \n Contents \n 1   Terms \n 2   History \n 2.1   Origins \n 2.2   18th-century emergence of the geisha \n 2.3   Rise of the geisha \n 3   Ranking \n 4   Stages of training \n 5   Female dominance in geisha society \n 5.1   Relationships with male guests \n 5.2   Geisha as a women-centered society \n 6   Modern geisha \n 6.1   Non-Japanese geisha \n 6.2   Public performances \n 7   Arts \n 8   Geisha and prostitution \n 8.1   Personal relationships and danna \n 8.2   \"Geisha girls\" \n 8.3   Mizuage \n 9   Appearance \n 9.1   Makeup \n 9.2   Dress \n 9.3   Hair \n 9.4   In popular culture \n 9.4.1   In books \n 9.4.2   In geisha photography \n 9.4.3   In films \n 9.4.4   In music \n 10   See also \n 11   References \n 12   Further reading \n 13   External links \n Terms [ edit ] \nTypical  nape   make-up  on a  maiko  (Note the red collar) \n Maiko  Tomitsuyu playing the game \"konpira fune fune\" with a female patron \n Geisha  ( / ˈ ɡ eɪ ʃ ə / ;  Japanese:  [ɡe̞ːɕa̠] ), [1] [2]  like all Japanese nouns, has no distinct singular or plural variants. The word consists of two  kanji ,  芸  ( gei ) meaning \" art \" and  者  ( sha ) meaning \"person\" or \"doer\". The most literal translation of geisha into English would be \"artist\", \"performing artist\", or \"artisan\". Another name for geisha is  geiko  ( 芸子 ), which is usually used to refer to geisha from western Japan, which includes Kyoto and Kanazawa. \n Apprentice geisha are called  maiko  ( 舞妓 ), literally \"dance child\", or  hangyoku  (半玉), \"half-jewel\" (meaning that they were paid half of the wage of a full geisha), [3]  or by the more generic term  o-shaku  ( 御酌 ), literally \"one who pours (alcohol)\". The white make-up and elaborate  kimono  and hair of a maiko is the popular image held of geisha. A woman entering the geisha community does not have to begin as a maiko, having the opportunity to begin her career as a full geisha. Either way, however, usually a year's training is involved before debuting either as a maiko or as a geisha. A woman above 21 is considered too old to be a maiko and becomes a full geisha upon her initiation into the geisha community. \n On average, Tokyo apprentices (who typically begin at 18) are slightly older than their Kyoto counterparts (who usually start at 15). [4]  Historically, geisha often began the earliest stages of their training at a very young age, sometimes as early as at 3 or 5 years. The early  shikomi  (in-training) and  minarai  (learns by watching) stages of geisha training lasted years, which is significantly longer than in contemporary times. \n It is still said that geisha inhabit a separate reality which they call the  karyūkai  or \"the flower and willow world\". Before  they disappeared , the  courtesans  were the colourful \"flowers\" and the geisha the \" willows \" because of their subtlety, strength, and grace. [5] \n History [ edit ] \n Origins [ edit ] \n In the early stages of Japanese history, there were female entertainers:  saburuko  (serving girls) were mostly wandering girls whose families were displaced from struggles in the late 600s. Some of these  saburuko  girls sold sexual services, while others with a better education made a living by entertaining at high-class social gatherings. After the imperial court moved the capital to  Heian-kyō  (Kyoto) in  794  the conditions that would form geisha culture began to emerge, as it became the home of a  beauty-obsessed elite . [6]  Skilled female performers, such as  Shirabyōshi  dancers, thrived. \n Traditional Japan embraced sexual delights (it is not a  Shinto  taboo) and men were not constrained to be faithful to their wives. [7]  The ideal wife was a modest mother and manager of the home; by  Confucian custom  love had secondary importance. For sexual enjoyment and romantic attachment, men did not go to their wives, but to  courtesans . Walled-in pleasure quarters known as  yūkaku   ( 遊廓、遊郭 )  were built in the 16th century, [8]  and in 1617 the  shogunate  designated \"pleasure quarters\", outside of which prostitution would be illegal, [9]  and within which  yūjo  (\"play women\") would be  classified and licensed . The highest  yūjo  class was the geisha's predecessor, called  tayuu , a combination of  actress  and prostitute, originally playing on stages set in the dry  Kamo  riverbed in Kyoto. They performed erotic dances and skits, and this new art was dubbed  kabuku , meaning \"to be wild and outrageous\". The dances were called \"kabuki\", and this was the  beginning of kabuki theater . [9] \n 18th-century emergence of the geisha [ edit ] \nUkiyoe depicting a Gion geisha, from between 1800 and 1833 \nUkiyoe print by Yamaguchi Soken of a Kyoto geisha \n These pleasure quarters quickly became glamorous entertainment centers, offering more than sex. The highly accomplished courtesans of these districts entertained their clients by dancing, singing, and playing music. Some were renowned poets and  calligraphers . Gradually, they all became specialized and the new profession, purely of entertainment, arose. It was near the turn of the eighteenth century that the first entertainers of the pleasure quarters, called  geisha , appeared. The first geishas were men, entertaining customers waiting to see the most popular and gifted courtesans ( oiran ). [9] \n The forerunners of the female geisha were the teenage  odoriko  (\"dancing girls\"): [10]  expensively trained as chaste  dancers -for-hire. In the 1680s, they were popular paid entertainers in the private homes of upper-class samurai, [11]  though many had turned to prostitution by the early 18th century. Those who were no longer teenagers (and could no longer style themselves  odoriko [12] ) adopted other names—one being  \"geisha\" , after the male entertainers. The first woman known to have called herself  geisha  was a  Fukagawa  prostitute, in about 1750. [13]  She was a skilled singer and  shamisen  player named Kikuya who was an immediate success, making female geisha extremely popular in 1750s Fukagawa. [14]  As they became more widespread throughout the 1760s and 1770s, many began working only as entertainers (rather than prostitutes), often in the same establishments as male geisha. [15] \n Rise of the geisha [ edit ] \nTokyo  geisha  with  shamisen , circa 1870s \n The geisha who worked within the pleasure quarters were essentially imprisoned and strictly forbidden to sell sex in order to protect the business of the  oiran . While licensed courtesans existed to meet men's sexual needs,  machi geisha  carved out a separate niche as artists and erudite female companions. \n By 1800, being a geisha was considered a female occupation (though there are still a handful of male geisha working today). Eventually, the gaudy Oiran began to fall out of fashion, becoming less popular than the chic (\" iki \") and modern geisha. [9]  By the 1830s, the evolving geisha style was emulated by fashionable women throughout society. [16]  There were many different classifications and ranks of geisha. Some women would have sex with their male customers, whereas others would entertain strictly with their art forms. [17]  Prostitution was legal up until the 1900s (decade), so it was practiced in many quarters throughout Japan. \n World War II  brought a huge decline in the geisha arts because most women had to go to factories or other places to work for Japan. The geisha name also lost some status during this time because prostitutes began referring to themselves as \"geisha girls\" to American military men. [18]  In 1944, the geisha world, including the teahouses, bars and geisha houses, was forced to close, and all employees were put to work in factories. About a year later, they were allowed to reopen. The few women who returned to the geisha areas decided to reject Western influence and revert to traditional ways of entertainment and life. \"The image of the geisha was formed during Japan's feudal past, and this is now the image they must keep in order to remain geisha.\" [18]  It was up to these returning geisha to bring back traditional standards in the profession, though with increased rights for the geisha: \n After Japan lost the war, geisha dispersed and the profession was in shambles. When they regrouped during the Occupation and began to flourish in the 1960s during Japan's postwar economic boom, the geisha world changed. In modern Japan, girls are not sold into indentured service. Nowadays, a geisha's sex life is her private affair. \n —  Liza Dalby , Do They or Don't They? [19] \n There were many rumors that stated before the war, a maiko's virginity would be auctioned (the original \" mizuage \"). [20] [21]  But this was confused with the girls who were apprentices to yujo and courtesans. This practice was completely outlawed in 1959. [22]  Compulsory education laws passed in the 1960s made traditional geisha apprenticeships difficult, leading to a decline in women entering the field. [23] \n In her book  Geisha, a Life ,  Mineko Iwasaki  said: \"I lived in the karyukai during the 1960s and 1970s, a time when Japan was undergoing the radical transformation from a post-feudal to a modern society. But I existed in a world apart, a special realm whose mission and identity depended on preserving the time-honored traditions of the past.\" [24] \n Ranking [ edit ] \n At the pinnacle of the complex geisha ranking system are the  grand dowagers  of Kyoto. The  gokagai  of Kyoto are its five geisha districts, [25]  also known as  hanamachi  (\"flower towns\").  Gion Kōbu ,  Ponto-chō  and  Kamishichiken  have the highest status; [26]  they are very expensive and are frequented by powerful businessmen and  politicians [9]  (Gion Kobu is sometimes seen as having the very highest ranking). As reported by Dalby (1983) from her impressions in 1975 [27]  Geiko from the other two  hanamachi  (Gion Higashi and  Miyagawa-chō ) have high prestige but are considered to be one rank lower. \n Stages of training [ edit ] \nA  geiko ,  minarai  and  shikomi  from Odamoto \n Traditionally, Geisha began their training at a young age. Some girls were bonded to geisha houses ( okiya ) as children. Daughters of geisha were often brought up as geisha themselves, usually as the successor (atotori, meaning \"heir\" or \"heiress\" in this particular situation) or daughter-role (musume-bun) to the okiya. \n A maiko is an apprentice and is therefore bonded under a contract to her okiya. The okiya supplies her with food, board, kimono,  obi , and other tools of her trade. Her training is very expensive and her debt must be repaid to the okiya with the earnings she makes. This repayment may continue after the maiko becomes a full-fledged geisha and only when her debts are settled is she permitted to move out to live and work independently. [6] \n A maiko will start her formal training on the job as a  minarai , which literally means \"learning by watching\" at an ozashiki (お座敷, a banquet in any  traditional Japanese building  with  tatami ), to sit and observe as the other maiko and geiko interact with customers. This is a way in which she will gain insights of the job, and seek out potential clients. Although minarai attend  ozashiki , they do not participate at an advanced level. Their  kimono , more elaborate than a geiko's, are intended to do the talking for them. Minarai can be hired for parties but are usually uninvited (yet welcomed) guests at parties that their  onee-san  attends. They only charge a third of the usual fee. Minarai generally work with a particular tea house ( minarai-jaya ) learning from the  okaa-san  (literally \"mother\", the proprietress of the house). From her, they would learn techniques such as conversation and gaming, which would not be taught to them in school. This stage lasts only about a month or so. [28] \nTwo senior  maiko  performing a dance. \n After a short period the final stage of training begins, and the students are now called \"maiko\", rather than minarai. Maiko (literally \"dance girl\") are apprentice geisha, and this stage can last for up to 5 years. Maiko learn from their senior maiko and geiko mentors. The  onee-san  and  imouto-san  (senior/junior, literally \"older sister/younger sister\") relationship is important. The  onee-san , any maiko or geiko who is senior to a girl, teaches her maiko everything about working in the  hanamachi . The onee-san will teach her proper ways of serving tea, playing  shamisen , dancing, casual conversation and more. \nSenior  maiko  Suzuha wearing  sakkou , two weeks before her  erikae . \n There are three major elements of a maiko's training. The first is the formal arts training. This takes place in special geisha schools which are found in every  hanamachi . The second element is the entertainment training which the maiko learns at various tea houses and parties by observing her  onee-san . The third is the social skill of navigating the complex social web of the  hanamachi . This is done on the streets. Formal greetings, gifts, and visits are key parts of any social structure in Japan and for a maiko, they are crucial for her to build the support network she needs to survive as a geisha. \n Maiko are considered one of the great sights of Japanese tourism, and look very different from fully qualified geisha. They are at the peak of traditional Japanese femininity. The scarlet-fringed collar of a maiko's kimono hangs very loosely in the back to accentuate the nape of the neck, which is considered a primary erotic area in Japanese sexuality. She wears the same white makeup for her face on her nape, leaving two or sometimes three stripes of bare skin exposed. Her kimono is bright and colourful with an elaborately tied  obi  hanging down to her ankles. She takes very small steps and wears traditional wooden shoes called  okobo  which stand nearly ten centimeters high. [6]  There are five different  hairstyles  that a maiko wears, that mark the different stages of her apprenticeship. The \" Nihongami \" hairstyle with  \"kanzashi\"  hair-ornamentation strips is most closely associated with maiko, [29]  who spend hours each week at the hairdresser and sleep on holed-pillows to preserve the elaborate styling. [30]  Maiko can develop a  bald spot on their crown  caused by rubbing from Kanzashi strips and tugging in hairdressing. \n Around the age of 20–21, the maiko is promoted to a full-fledged geisha in a ceremony called  erikae  (turning of the collar). [20] [31]  This could happen after three to five years of her life as a  maiko  or  hangyoku , depending on at what age she debuted. Geisha remain as such until they retire. \n Female dominance in geisha society [ edit ] \n The biggest industry in Japan is not shipbuilding, producing cultured pearls, or manufacturing transistor radios or cameras. It is entertainment. \n —  Boye De Mente,  Some Prefer Geisha [32] \n The term geisha literally translates to \"entertainer\". Some prostitutes refer to themselves as \"geisha\", but they are not. A geisha's sex and love life is usually distinct from her professional life. A successful geisha can entertain her male customers with music, dance, and conversation. \n Geishas are not submissive and subservient, but in fact they are some of the most financially and emotionally successful and strongest women in Japan, and traditionally have been so. \n —  Iwasaki Mineko,  Geisha, A Life [24] \n Geisha learn the traditional skills of dance and instruments and hold high  social status . Geisha are single women, though they may have lovers or boyfriends whom they have personally picked, who support them financially. \n There is currently no western equivalent for a geisha—they are truly the most impeccable form of Japanese art. \n —  Kenneth Champeon,  The Floating World [33] \n Relationships with male guests [ edit ] \nA geisha entertaining a foreign guest \n The appeal of a high-ranking geisha to her typical male guest has historically been very different from that of his wife. The ideal geisha showed her skill, while the ideal wife was modest. The ideal geisha seemed carefree, the ideal wife somber and responsible. Historically, geisha did sometimes marry their clients, but marriage necessitated retirement, as there were never married geisha. \n Geisha may gracefully flirt with their guests, but they will always remain in control of the hospitality. Over their years of apprenticeship they learn to adapt to different situations and personalities, mastering the art of the hostess. [34] \n Geisha as a women-centered society [ edit ] \n Women in the geisha society are some of the most successful businesswomen in Japan. In the geisha society, women run everything. Without the impeccable business skills of the female tea house owners, the world of geisha would cease to exist. The tea house owners are entrepreneurs, whose service to the geisha is highly necessary for the society to run smoothly. Infrequently, men take contingent positions such as hair stylists, [35]  dressers (dressing a maiko requires considerable strength) and accountants, [18]  but men have a limited role in geisha society. \n The geisha system was founded, actually, to promote the independence and economic self-sufficiency of women. And that was its stated purpose, and it actually accomplished that quite admirably in Japanese society, where there were very few routes for women to achieve that sort of independence. \n —  Mineko Iwasaki  in interview,  Boston Phoenix [36] \n The majority of women were wives who did not work outside of their familial duties. Becoming a geisha was a way for women to support themselves without becoming a wife. Thus, some argue that geisha women live in a women-centered society. [ citation needed ]  Women run the geisha houses, they are teachers, they run the tea houses, they recruit aspiring geisha, and they keep track of a geisha's finances. [ citation needed ]  The only major role men play in geisha society is that of guest, though women sometimes take that role as well. [35] \n Historically,  Japanese feminists  have seen geisha as exploited women, but some modern geisha see themselves as liberated feminists: [37]  \"We find our own way, without doing family responsibilities. Isn't that what feminists are?\" [18] \n Modern geisha [ edit ] \n Modern geisha still live in traditional geisha houses called  okiya  in areas called  hanamachi  ( 花街  \"flower streets\"), particularly during their apprenticeship. Many experienced geisha are successful enough to choose to live independently. The elegant, high-culture world that geisha are a part of is called  karyūkai  ( 花柳界  \"the flower and willow world\"). \n Before the twentieth century, geisha training began when a girl was around the age of four. Now, girls must go to school until they are 15 years old and have graduated from middle school and then make the personal decision to train to become a geisha. Young women who wish to become geisha now most often begin their training after high school or even college. Many more women begin their careers in adulthood. [38] \n Geisha still study traditional instruments: the  shamisen ,  shakuhachi , and drums, as well as learn games, [39]  traditional songs,  calligraphy , [40]  Japanese traditional dances (in the  nihonbuyō  style),  tea ceremony , literature, and  poetry . [41] [42] \n By watching other geisha, and with the assistance of the owner of the geisha house, apprentices also become skilled dealing with clients and in the complex traditions surrounding selecting and wearing  kimono , a floor length silk robe embroidered with intricate designs which is held together by a sash at the waist which is called an obi. [43] [44] \n The geisha in Kyoto's districts, as well as in other parts of western Japan, are known as  geiko . The Tokyo  hanamachi  of Shimbashi,  Asakusa  and  Kagurazaka  are also well known. \n In modern Japan, geisha and maiko are now a rare sight outside  hanamachi  or  chayagai   ( 茶屋街 , literally \"tea house district\", often referred to as \"entertainment district\") . In the 1920s, there were over 80,000 geisha in Japan, [45] [46]  but today, there are far fewer. Most common are sightings of tourists who pay a fee to be dressed up as a maiko. [47] \n A sluggish economy, declining interest in the traditional arts, the exclusive nature of the flower and willow world, and the expense of being entertained by geisha have all contributed to the tradition's decline. [48]  However, the flower and willow world has seen a resurgence in new members over the last 10 years [ citation needed ]  due to the accessibility that the internet has provided for young girls wanting to know more about the profession and not needing a formal introduction to an okiya. [ citation needed ] \nEntrance to  Ichiriki Chaya , one of the most famous tea houses where  geisha  entertain in Gion \n Geisha are often hired to attend parties and gatherings, traditionally at  ochaya   ( お茶屋 , literally \"tea houses\")  or at traditional Japanese restaurants (ryōtei). [44]  The charge for a geisha's time used to be determined by ( measured by burning incense stick ) is called  senkōdai  ( 線香代 , \"incense stick fee\") or gyokudai ( 玉代  \"jewel fee\"). Now they are flat fees charged by the hour. In Kyoto, the terms  ohana  ( お花 ) and  hanadai  ( 花代 ), meaning \"flower fees\", are preferred. The okasan makes arrangements through the geisha union office ( 検番   kenban ), which keeps each geisha's schedule and makes her appointments both for entertaining and for training. \n This section's  factual accuracy is  disputed .  Relevant discussion may be found on  Talk:Geisha . Please help to ensure that disputed statements are  reliably sourced .   (May 2017)   ( Learn how and when to remove this template message ) \n Non-Japanese geisha [ edit ] \n In recent times, non-Japanese women have also become geisha.  Liza Dalby  worked briefly with geisha as part of her doctorate research in the 1970s, although she did not formally debut. [49] [50] \n Other foreign nationals who have worked as geisha in Japan include Ibu, a geiko of Ukrainian ancestry still working in Anjo, [51]  Juri, a Peruvian geisha currently working in the resort town of Yugawara, [52]  and Fukutarō (Isabella Onou), a Romanian national worked in the Izu-Nagaoka district of Shizuoka. She has already left the geisha world. [53] [54] \n Australian national  Fiona Graham  debuted in December 2007 under the name Sayuki in the Asakusa district of Tokyo. [55] [56]  and this led to her to being the first legal non-Japanese geisha ever in Japan. [57]  A clear stipulation in Japan is that to work as a geisha and to formally debut as a geisha, Japanese Permanent Residency is a requirement. [57]  Sayuki also needed the agreement of all 45 geisha in the Asakusa Geisha House which she attained. After being in Asakusa Geisha House for four years, Sayuki applied for permission to have her own geisha house as her geisha mother was retiring from illness. That led to Sayuki opening her own independent geisha house in Tokyo. Since 2012 Sayuki has had nine trainees [57]  and continues to grow her geisha house as well as support the geisha traditions in Tokyo by currently helping the Fukagawa geisha revive their district. [58] \n As of October 2015, Sydney Stephens, an American from St. Louis, tried to train as a geisha in the Oimachi district of Shinagawa, Tokyo. But she did not formally debuted because as an interpreter she was not allowed to work as a geisha. She has now left the geisha world.  [59] \n Public performances [ edit ] \n While traditionally geisha have led a cloistered existence, in recent years they have become more publicly visible, and entertainment is available without requiring the traditional introduction and connections. \n The most visible form of this are public dances, or  odori  (generally written in  traditional kana spelling  as をどり, rather than modern おどり), featuring both maiko and geisha. All the Kyoto hanamachi hold these annually (mostly in spring, with one exclusively in autumn), dating to the  Kyoto exhibition  of 1872, [60]  and there are many performances, with tickets being inexpensive, ranging from around 1500 yen to 4500 yen – top-price tickets also include an optional  tea ceremony  (tea and  wagashi  served by maiko) before the performance; [61]  see  Kyoto hanamachi  and  Kanazawa hanamachi  for a detailed listing. Other hanamachi also hold public dances, including some in Tokyo, but have fewer performances. [61] \nA  maiko  from the  Kamishichiken  district serving tea at the plum blossom festival at  Kitano Tenman-gū . \n Another notable event is that the geisha (including maiko) of the  Kamishichiken  district in northwest Kyoto serve tea to 3,000 guests on February 25 in an annual open-air tea ceremony (野点,  nodate ) at the plum-blossom festival (梅花祭,  baikasai ) at  Kitano Tenman-gū  shrine. [62] [63]  As of 2010 [update] , these geisha also serve beer in a  beer garden  at Kamishichiken Kaburenjo Theatre during summer months (July to early September); [64] [65] [66]  another geisha beer garden is available at the Gion Shinmonso  ryokan  in the Gion district. [64]  These beer gardens also feature traditional dances by the geisha in the evenings. \n Arts [ edit ] \n Geisha  are skilled artists, trained in and performing music and dance. \n Geisha  Komomo and Mameyoshi from Gion Kobu playing  shamisen \n Geisha begin their study of music and dance when they are very young and continue it throughout their lives. Geisha can work into their eighties and nineties, [67]  and are expected to train every day even after seventy years of experience. [68] \n The dance of the geisha has evolved from the dance performed on the noh and kabuki stages. The \"wild and outrageous\" dances transformed into a more subtle, stylized, and controlled form of dance. It is extremely disciplined, similar to  t'ai chi . Every dance uses gestures to tell a story and only a connoisseur can understand the subdued symbolism. For example, a tiny hand gesture represents reading a love letter, holding the corner of a handkerchief in the mouth represents coquetry and the long sleeves of the elaborate kimono are often used to symbolize dabbing tears. [9] \n The dances are accompanied by traditional Japanese music. The primary instrument is the  shamisen . The shamisen was introduced to the geisha culture in 1750 and has been mastered by female Japanese artists for years. [69]  This shamisen, originating in Okinawa, is a banjo-like three-stringed instrument that is played with a  plectrum . It has a very distinct, melancholy sound that is often accompanied by flute. The instrument is described as \"melancholy\" because traditional shamisen music uses only  minor thirds  and sixths. [69]  All geisha must learn shamisen-playing, though it takes years to master. Along with the shamisen and the flute, geisha also learned to play a  ko-tsuzumi , a small,  hourglass-shaped  shoulder drum, and a large floor  taiko  (drum). Some geisha would not only dance and play music, but would write beautiful, melancholy poems. Others painted pictures or composed music. [9] \n Geisha and prostitution [ edit ] \n Sheridan Prasso wrote that Americans had \"an incorrect impression of the real geisha world ... geisha means 'arts person' trained in music and dance, not in the art of sexual pleasure\". [70]  K. G. Henshall wrote that the geisha's purpose was \"to entertain their customer, be it by dancing, reciting verse, playing musical instruments, or engaging in light conversation. Geisha engagements may include flirting with men and playful  innuendos ; however, clients know that nothing more can be expected. In a social style that is common in Japan, men are amused by the illusion of that which is never to be.\" [71] \n In 1872, shortly after the  Meiji Restoration , the new government passed a law liberating \"prostitutes (shōgi) and geisha (geigi)\". The wording of this statute was the subject of controversy. Some officials thought that prostitutes and geisha worked at different ends of the same profession—selling sex— and that all prostitutes should henceforth be called \"geisha\". In the end, the government decided to maintain a line between the two groups, arguing that geisha were more refined and should not be soiled by association with prostitutes. [72] \n Also, geisha working in  onsen  towns such as  Atami  are dubbed  onsen geisha . Onsen geisha have been given a bad reputation due to the prevalence of prostitutes in such towns who market themselves as \"geisha\", as well as sordid rumors of dance routines like Shallow River (which involves the \"dancers\" lifting the skirts of their  kimono  higher and higher). In contrast to these \"one-night geisha\", the true onsen geisha are in fact competent dancers and musicians. However, the  autobiography of Sayo Masuda , an onsen geisha who worked in Nagano Prefecture in the 1930s, reveals that in the past, such women were often under intense pressure to sell sex. [3] \n Personal relationships and danna [ edit ] \n Geisha are portrayed as unattached. Formerly those who chose to marry had to retire from the profession, though today, some geisha are allowed to marry. It was traditional in the past for established geisha to take a  danna , or patron. A  danna  was typically a wealthy man, sometimes married, who had the means to support the very large expenses related to a geisha's traditional training and other costs. This sometimes occurs today as well, but very rarely. A geisha and her danna may or may not be in love, but intimacy is never viewed as a reward for the danna's financial support. While it is true that a geisha is free to pursue personal relationships with men she meets through her work, such relationships are carefully chosen and unlikely to be casual. A hanamachi tends to be a very tight-knit community and a geisha's good reputation is not taken lightly. [ citation needed ] \n \"Geisha girls\" [ edit ] \n During the period of  the Allied occupation of Japan , local women called \"Geisha girls\" worked as prostitutes. They almost exclusively serviced  American GIs  stationed in the country, who actually referred to them as \"Geesha girls\" (a mispronunciation). [73] [74]  These women dressed in  kimono  and imitated the look of geisha. Many Americans unfamiliar with the Japanese culture could not tell the difference between legitimate geisha and these costumed performers. [73]  Shortly after their arrival in 1945, some occupying American GIs are said to have congregated in  Ginza  and shouted, \"We want geesha girls!\" [75] \n Eventually, the English term \"geisha girl\" became a general word for any female Japanese prostitute or worker in the  mizu shōbai  and included  bar hostesses  and  streetwalkers . [73] \n Geisha girls are speculated by  researchers  to be largely responsible for the continuing misconception in  the West  that all geisha are engaged in prostitution. [73] \n Mizuage [ edit ] \n Main article:  Mizuage \n Mizuage  ( 水揚げ ) was a ceremony undergone by a maiko where a man paid money for the privilege of having sex with the apprentice. Prostitutes posing as geisha often used this term to refer to their acts with customers. Such prostitutes often called themselves \"geisha\" in the company of foreign soldiers and even Japanese customers, thus leading to the confusion between the roles of the two. [76] \n Mizuage literally means \"raising the waters\" and originally meant unloading a ship's cargo of fish. [77]  Over time, the word came to represent money earned in the entertainment business. [6] \n During the  Edo period , maikos undergoing mizuage were sponsored by a patron who had the right of taking their  virginity . [78]  This practice became illegal in 1959. [31]  Once the mizuage patron's function was served (of deflowering the young courtesan) he was to have no further relations with the girl. [79] \n The money acquired for an apprentice's mizuage was a great sum and it was used to promote her debut as a full-fledged geisha. [80]  The ceremonial deflowering of the young girl was not only a commercial transaction, but was a  rite of passage : [6]  The idea that maiko underwent mizuage can be attributed to both confusion between true geisha and courtesan, as well as the idea that a fully fledged geisha is a sophisticated \"professional woman\" expected to have worldly knowledge of the opposite sex. [77] \n Appearance [ edit ] \nMature  geisha  (center) ordinarily wear subdued clothing, makeup, and hair, contrasting with the more colourful clothing, heavy makeup, and elaborate hair of maiko (apprentices; left and right). \nThe  maiko  Mamechiho in the Gion district. Notice the green pin on the mid-left called  tsunagi-dango : this identifies her as a maiko of Gion kobu under 18. \n A geisha's appearance changes throughout her career, from the girlish, heavily made-up maiko, to the more somber appearance of an older established geisha. Different hairstyles and hairpins signify different stages of a girl's development and even a detail as minute as the length of one's eyebrows is significant. Short eyebrows are for the young and long eyebrows display maturity. [73] \n Makeup [ edit ] \n In modern times the traditional  makeup  of apprentice geisha is one of their most recognizable characteristics, though established geisha generally only wear full white face makeup characteristic of maiko during special performances. \n The traditional makeup of an apprentice geisha features a thick white base with red  lipstick  and red and black accents around the eyes and eyebrows. Originally, the white base mask was made with lead; after the discovery that it poisoned the skin and caused terrible skin and back problems for the older geisha towards the end of the  Meiji Era , it was replaced with rice powder. \n The application of makeup is hard to perfect and is time-consuming. Makeup is applied before dressing to avoid dirtying the kimono. First, a wax or oil substance called  bintsuke-abura  is applied to the skin. Next, white powder is mixed with water into a paste and applied with a bamboo brush starting from the neck and working upwards. The white makeup covers the face, neck, and chest, with two or three unwhitened areas (forming a  W  or  V  shape, usually a traditional  W  shape) left on the  nape , to accentuate this traditionally erotic area, and a line of bare skin around the hairline, which creates the illusion of a mask. \n After the foundation layer is applied, a sponge is patted all over the face, throat, chest, the nape and neck to remove excess moisture and to blend the foundation. Next the eyes and eyebrows are drawn in. Traditionally, charcoal was used, but today, modern cosmetics are used. The eyebrows and edges of the eyes are coloured black with a thin charcoal; a maiko also applies red around her eyes. \n The lips are filled in using a small brush. The colour comes in a small stick, which is melted in water. Crystallized sugar is then added to give the lips luster. Rarely will a geisha colour in both lips fully in the Western style, as white creates optical illusions and colouring the lips fully would make them appear overly large. The lower lip is coloured in partially and the upper lip left white for maiko in her first year, after which the upper lip is coloured. Newly full-fledged geisha will colour in only the top lip fully. Most geisha wear the top lip coloured in fully or stylized, and the bottom lip in a curved stripe that does not follow the shape of the lip. Geisha round the bottom lips to create the illusion of a flower bud. \n Maiko who are in their last stage of training sometimes  colour their teeth black  for a brief period. This practice used to be common among married women in Japan and, earlier, at the imperial court, but survives only in some districts. It is done partly because uncoloured teeth seem very yellow in contrast to white face makeup; colouring the teeth black means that they seem to \"disappear\" in the darkness of the open mouth. This illusion is of course more pronounced at a distance. \n For the first year, a maiko wears this heavy makeup almost constantly. During her initiation, the maiko is helped with her makeup either by her  onee-san , or \"older sister\" (an experienced geisha who is her mentor), or by the  okaa-san , or \"mother\" of her geisha house. After this, she applies the makeup herself. \n After a maiko has been working for three years, she changes her make-up to a more subdued style. The reason for this is that she has now become mature, and the simpler style shows her own natural beauty. For formal occasions, the mature geisha will still apply white make-up. For geisha over thirty, the heavy white make-up is only worn during those special dances that require it. \n Further information:  History of cosmetics \n Dress [ edit ] \nA senior  maiko  (left) with  darari obi  and  geisha  with  taiko-musubi \nNiigata  geisha  performing dance, dressed in  kimono  and  taiko musubi \n Geisha always wear  kimono . Apprentice geisha wear highly colourful kimono with extravagant  obi . The obi is brighter than the kimono she is wearing to give a certain exotic balance. Maiko of Kyoto wear the obi tied in a style called \"darari\" (dangling obi), while Tokyo \"hangyoku\" wear it tied in various ways, including taiko musubi. Older geisha of Kyoto wear more subdued patterns and styles (most notably the obi tied in a simpler knot used by married women known as the \"taiko musubi\" ( 太鼓結び ), or \"drum knot\"). Tokyo and Kanazawa geisha wear \"yanagi musubi\"  ( 柳結び ,  willow style ) , taiko musubi and \"tsunodashi musubi\"  ( 角出結び ) . \n The colour, pattern, and style of  kimono  is dependent on the season and the event the geisha is attending. A  kimono  can take from two to three years to complete, due to painting and embroidering. \n Geiko wear red or pink  nagajuban , or under-kimono. A maiko wears red with white printed patterns. The junior maiko's collar is predominantly red with white, silver, or gold embroidery. Two to three years into her apprenticeship, the red collar will be entirely embroidered in white (when viewed from the front) to show her seniority. When she becomes a fully fledged geisha her collar will turn from red to solid white. \n Geisha wear raised wooden sandals, called  geta  while maiko wear a special wooden sandal known as  okobo  and wear only  tabi  (white split-toed socks) indoors. Geisha and apprentices wear the flat-soled sandal  zōri  outdoors during inclement weather. \n Hair [ edit ] \nMamechiho as a  geiko . \n The hairstyles of geisha have varied through history. In the past, it has been common for women to wear their hair down in some periods and up in others. During the 17th century, women began putting all their hair up again, and it is during this time that the traditional  shimada hairstyle , a type of  chignon  worn by most established geisha, developed. \n There are four major types of the shimada: the  taka shimada , a high chignon usually worn by young, single women; the  tsubushi shimada , a more flattened chignon generally worn by older women; the  yuiwata , a chignon that is usually bound up with a piece of coloured cotton  crepe . Additional hairstyles are Ofuku, Katsuyama, Yakko-shimada, and  Sakko . Maiko of Pontochō will wear an additional six hairstyles leading up to the Sakko, including Umemodoki, Oshidori no Hina, Kikugasane, and Osafune. \n These hairstyles are decorated with elaborate hair-combs and hairpins ( kanzashi ). In the seventeenth century and after the  Meiji Restoration  period, hair-combs were large and conspicuous, generally more ornate for higher-class women. Following the Meiji Restoration and into the modern era, smaller and less conspicuous hair-combs became more popular. \n Maiko sleep with their necks on small supports (takamakura), instead of pillows, so they keep their hairstyle perfect. [35]  Even if there are no accidents, a maiko will need her hair styled every week. Many modern geisha use  wigs  in their professional lives, while maiko use their natural hair. [81]  Either must be regularly tended by highly skilled artisans. Traditional hairstyling is a slowly dying art. Over time, the hairstyle can cause balding on the top of the head. \n In popular culture [ edit ] \n A growing number of geisha have complained to the authorities about being pursued down the street and tugged on the sleeves of their kimonos by groups of tourists keen to take their photograph. As a result, residents and local businesses have joined forces to protect the geisha by launching patrols of the streets of Kyoto's Gion entertainment district in order to prevent tourists from pestering them. [82] \n In books [ edit ] \n Masuda, Sayo (1957).  Autobiography of a Geisha  (芸者,苦闘の半生涯  Geisha, kutō no hanshōgai , lit.  Geisha, Half a Lifetime of Pain and Struggle ).  ISBN   0-231-12951-3 .   \n Dalby, Liza  (1983).  Geisha .  University of California Press .  ISBN   0-520-04742-7 .   \n Dalby, Liza (1993).  Kimono: Fashioning Culture .  Yale University Press .  ISBN   0-300-05639-7 .   \n Dalby, Liza (2000).  The Tale of Murasaki .  First Anchor Books .  ISBN   0-385-49795-4 .   \n Dalby, Liza (2007).  East Wind Melts the Ice . University of California Press.  ISBN   0-520-25053-2 .   \n Dalby, Liza (2009).  Hidden Buddhas .  Stone Bridge Press .   \n Mineko, Iwasaki  &  Brown, Rande Gail  (2002).  Geisha of Gion . Atria.   CS1 maint: Multiple names: authors list ( link ) \n Shikibu, Murasaki  (c. 1021).  The Tale of Genji  (源氏物語  Genji Monogatari ).   \n In geisha photography [ edit ] \n Ogino, Naoyuki (2007).  A Girl Inherited Maiko (Apprentice Geisha) Life . Japan: Canon Gallery. \n Ogino, Naoyuki (photographs) & Komomo (text) (2008).  A Geisha's Journey . Kodansha International.  ISBN   978-4-7700-3067-2 .   CS1 maint: Uses authors parameter ( link ) \n Perkins, P.D. (text) & Haar, Francis (photographs) (1954).  Geisha of Pontocho . Tokyo News Service. \n In films [ edit ] \n Sisters of the Gion  (1936)—Dir.  Kenji Mizoguchi \n The Life of Oharu  ( 西鶴一代女   Saikaku Ichidai Onna ) (1952)—Dir.  Kenji Mizoguchi \n A Geisha  ( 祇園囃子 ,  Gion bayashi ) (1953)—Dir.  Kenji Mizoguchi \n The Teahouse of the August Moon  (1956)—Dir.  Daniel Mann \n The Barbarian and the Geisha  (1958)—Dir.  John Huston \n The Geisha Boy  (1958)—Dir.  Frank Tashlin \n Late Chrysanthemums  (Bangiku) (1958)—Dir.  Mikio Naruse \n Cry for Happy  (1961)—George Marshall comedy \n My Geisha  (1962)—Dir.  Jack Cardiff \n The Wolves  (1971)—Dir.  Hideo Gosha \n The World of Geisha  (1973)—Dir.  Tatsumi Kumashiro \n In the Realm of the Senses  (1976)—Dir.  Nagisa Oshima \n Ihara Saikaku Koshoku Ichidai Otoko  (1991)—Dir.  Yukio Abe \n The Geisha House  (1999)—Dir.  Kinji Fukasaku \n The Sea is Watching  (2002)—Dir.  Kei Kumai \n Zatoichi  (2003)—Dir.  Takeshi Kitano \n Fighter in the Wind  (2004)—Dir.  Yang Yun-ho \n Memoirs of a Geisha  (2005)—Dir.  Rob Marshall \n Wakeful Nights  (2005)—Dir.  Masahiko Tsugawa \n Maiko Haaaan!!!  (2007)—Dir.  Nobuo Mizuta \n Lady Maiko  (2014)—Dir.  Masayuki Suo \n In music [ edit ] \n \"Geisha Girl\" on  Foreign Love — Hank Locklin  (#4 in US Country in 1957) \n \"Lost to a Geisha Girl\" on  Blueberry Hill — Skeeter Davis  (#15 in US Country in 1958, answer to the previous) \n See also [ edit ] \n Ca trù , a similar profession in Vietnam \n Hanayo \n Kanhopatra \n Kisaeng , a similar profession in Korea \n Taikomochi \n Yiji , a similar profession in China \n References [ edit ] \n ^   'Geisha' pronounced in Japanese , Forvo, the pronunciation dictionary \n ^   Geisha translations , EZ Glot \n ^  a   b   Masuda, Sayo, 2003, Autobiography of a Geisha, trans. G.G. Rowley, Columbia University Press, New York  ISBN   0-231-12951-3 \n ^   Prasso (May 2006).  \"The Real Memoirs of Geisha\" .  The Asian Mystique: Dragon Ladies, Geisha Girls, and Our Fantasies of the Exotic Orient . p. 218.  ISBN   978-1-58648-394-4 .   \n ^   Downer, L. (February 2004) [2003]. \"In Search of Sadayakko\".  Madame  Sadayakko  The Geisha Who Bewitched the West . Gotham. pp. 5–6.  ISBN   978-1-59240-050-8 .   \n ^  a   b   c   d   e   Gallagher, John. Geisha:  A Unique World of Tradition, Elegance, and Art . London: PRC, 2003.  ISBN   1-85648-697-4 \n ^   \"The rise of the Geisha-photos from 19th & 20th century show the Japanese entertainers\" .  The Vintage News . 2016-05-16 . Retrieved  2017-11-06 .   \n ^   \"History of geisha\" . Retrieved  2010-06-18 .   \n ^  a   b   c   d   e   f   g   Lesley Downer, \" The City Geisha and Their Role in Modern Japan: Anomaly or artistes \", in Martha Feldman and Bonnie Gordon, eds,  The Courtesan's Arts: Cross-Cultural Perspectives  (New York: Oxford University Press, 2006;  ISBN   0-19-517028-8 ), pp. 223–242. [ vague ] \n ^   Fujimoto, Taizo (1917).  The Story of the Geisha Girl . p. 18.  ISBN   978-1-4086-9684-2 .   \n ^   Seigle, C. S. (March 1993) [1931]. \"Rise of the Geisha\".  Yoshiwara: the glittering world of the Japanese courtesan  (illustrated ed.). University of Hawaii Press. p. 171.  ISBN   978-0-8248-1488-5 .   \n ^   Fiorillo, J.  \"Osaka Prints: Glossary\" .  geiko : \"Arts child\", originally dancing girls who were too young to be called geisha but too old (more than twenty years of age) to be called odoriko. Geiko was the pronunciation used in the Kamigata region. Some geiko operated as illegal prostitutes. By the nineteenth century the term became synonymous with geisha.   \n ^   Tiefenbrun, S (2003). \"Copyright Infringement, Sex Trafficking, and the Fictional Life of a Geisha\".  Michigan Journal of Gender & Law .  10 : 32.  doi : 10.2139/ssrn.460747 .  SSRN   460747   .   \n ^   Gallagher, J. (October 2003). \"Appendix II a timeline of geisha and related history\".  Geisha: a unique world of tradition, elegance, and art . PRC Publishing. p. 252.  ISBN   978-1-85648-697-2 .   —Gallagher says that \"Kiku\" from Fukugawa district founded the profession in 1750, and that by 1753 one hundred  odoriko  were consigned to  Yoshiwara , which licensed (female) Geisha in 1761. \n ^   Seigle (1931)   Archived  2011-06-13 at the  Wayback Machine . p. 172-174 \n ^   Dalby, L. C. \"The paradox of modernity\".  geisha . p. 74.  OCLC   260152400 .   \n ^   Ohnuki-Tierney, E. (October 2002).  Kamikaze, Cherry Blossoms, and Nationalisms: The Militarization of Aesthetics in Japanese History . University Of Chicago Press. p. 347.  ISBN   978-0-226-62091-6 .  [Before 1796]  kuruwa geisha  referred to the geisha in the geisha quarters who entertained their clients with the skills and performing arts and also offered their bodies. The term  yūjo  and  jorō  were used to distinguish them from  machi geisha , who were exclusively entertainers ... some of the latter too engaged in sexual services   \n ^  a   b   c   d   Dalby, Liza (1998).  Geisha . Berkeley: University of California.   \n ^   Dalby, Liza.  \"Do They or Don't They\" . Retrieved  12 January  2010 .  The question always comes up...just how 'available' is a geisha? ... There is no simple answer.   \n ^  a   b   Melissa Hope Ditmore (2006).  Encyclopedia of prostitution and sex work . Westport, Conn: Greenwood Press.  ISBN   0-313-32969-9 .   , page 184  [1] \n ^   Japan encyclopedia . Belknap Pr of Harvard U. 2005.  ISBN   0-674-01753-6 .   page 234 \n ^   Reynolds, Wayne; Gallagher, John (2003).  Geisha: A Unique World of Tradition, Elegance and Art . PRC Publishing. p.  135 .  ISBN   1-85648-697-4 .   \n ^   Taubman, Howard.  \"Geisha Tradition Is Bowing Out in Japan; Geishas Fighting Losing Battle Against New Trends in Japan\" ,  The New York Times . June 12, 1968. Page 49. Retrieved March 16, 2011. \n ^  a   b   Mineko, Iwasaki; Rande Brown (2003).  Geisha, A Life . New York: Washington Square.   \n ^   \"Kyoto Gokagai\" . Kyoto Traditional Musical Art Foundation.    The total number of Kyoto geisha had declined to 196 by 2007 (and 77 maiko); see:  \"Preface \"Geisha in the 21st Century\" in the 25th anniversary edition of  Geisha \" . 2008.   \n ^   Dalby — Geisha  2008 p. 17–18 \n ^   Geisha  2008 p.18,77,148 \n ^   Iwasaki, Mineko ;  Brown Ouchi, Rande  (October 2002).  Geisha: A Life  (first ed.). Atria. p. 132.  ISBN   978-0-7434-4432-3 .   \n ^   Tetsuo, I.  Nihongami no sekai  [ The World of traditional hairstyles and hair ornaments ]. Nihongami Shiryōkan.  ISBN   4-9902186-1-2 .   \n ^   Layton, J.  \"Dressing as a Geisha\" .   \n ^  a   b   Reynolds, Wayne; Gallagher, John (2003).  Geisha: A Unique World of Tradition, Elegance and Art . PRC Publishing.  ISBN   1-85648-697-4 .     page 159 \n ^   De Mente, Boye (1966).  Some Prefer Geisha . Rutland, VT: Charles E. Tuttle Company.   \n ^   Champeon, Kenneth (3 November 2002).  \"The Floating World\" . Things Asian . Retrieved  12 January  2010 .   \n ^   Apps, Amino.  \"What Is A Geisha?\" .  Anime | aminoapps.com . Retrieved  2017-11-06 .   \n ^  a   b   c   McCurry, J. (2005-12-11).  \"Career geisha outgrow the stereotype\" .  The Age . Melbourne. p. 3 . Retrieved  2010-06-21 .   \n ^   Wieder, Tamara (17 October 2002).  \"Remaking a memoir\" . Boston Phoenix. Archived from  the original  on 6 January 2010 . Retrieved  12 January  2010 .   \n ^   Collins, Sarah (24 December 2007).  \"Japanese Feminism\" . Serendip's Exchange . Retrieved  12 January  2010 .   \n ^   Jones, N. (2007-04-20). \"Japan's geisha hit by poor economy\".  The Washington Times .  now more [university] students are interested in becoming geisha   \n ^   Kalman, B. (2008).  Japan the Culture . p. 29.  ISBN   978-0-7787-9298-7 .   \n ^   McCurry, J. (2005-12-11).  \"Career geisha outgrow the stereotype, page 2\" . Melbourne:  The Age . Retrieved  2010-06-21 .   \n ^   Coutsoukis, Photius (2004-11-10).  \"Japan Performing Arts\" . Retrieved  2009-06-02 .    Originally from The Library of Congress Country Studies; CIA World Factbook. \n ^   Coutsoukis, Photius (2004-11-10).  \"Japan Dance\" . Retrieved  2009-06-02 .    Originally from The Library of Congress Country Studies; CIA World Factbook. \n ^   Tames, Richard (September 1993).  A Traveller's History of Japan .  Brooklyn, New York : Interlink Books.  ISBN   1-56656-138-8 .   \n ^  a   b   Kalman, Bobbie (March 1989).  Japan the Culture .  Stevens Point, Wisconsin : Crabtree Publishing Company.  ISBN   0-86505-206-9 .   \n ^   Dougill, John (2006).  Kyoto: a cultural history . Oxford University Press. p. 182.  ISBN   0-19-530137-4 .   \n ^   Merriam-Webster, Inc (2000).  Merriam-Webster's collegiate encyclopedia . Merriam-Webster, Inc. p. 639.  ISBN   0-87779-017-5 .   \n ^   Lies, Elaine (2008-04-23).  \"Modern-day geisha triumphs in closed, traditional world\" .  Reuters . Retrieved  2009-06-02 .   \n ^   \"Near extinction\" . Reuters. December 2007.  An economic downturn in the 1990s forced businessmen to cut back on entertainment expenses, while high-profile scandals in recent years have made politicians eschew excessive spending. A dinner can cost around 80,000 yen (US$1,058) per head, depending on the venue and the number of geishas present. But even before the 90s, men were steadily giving up on late-night parties at 'ryotei\", restaurants with traditional straw-mat tatami rooms where geishas entertain, in favour of the modern comforts of hostess bars and karaoke rooms.   \n ^   Hyslop, Leah (4 October 2010).  \"Liza Dalby, the blue-eyed geisha\" .  The Telegraph . London . Retrieved  18 July  2011 .   \n ^   Liza, Dalby (1983).  Geisha . London: Vintage U.K. pp. 106–109.  ISBN   9780099286387 .   \n ^   \"Chunichi Shimbun, 1 October 2011, 3rd opening\" .   \n ^   \"湯河原温泉ふきや　若女将のブログ : 「新花」の「樹里」さん\" .  blog.livedoor.jp .   \n ^   Gilhooly, Rob (2011-07-23).  \"Romanian woman thrives as geisha\" . Tokyo: The Japan Times . Retrieved  2014-10-26 .   \n ^   \"Life inside the Flower and Willow World - Wattention\" .  Wattention  (in Japanese) . Retrieved  2015-10-23 .   \n ^   \"Turning Japanese: the first foreign geisha\" . London:  The Independent . 2008-01-24 . Retrieved  2009-06-02 .   \n ^   Ryall, Julian (2008-01-09).  \"Westerner inducted into mysteries of geisha\" . London:  The Daily Telegraph . Retrieved  2009-06-02 .   \n ^  a   b   c   Romero, Tim (November 2016).  \"Will Japanese Geisha Survive the digital Age?\" .  Disrupting Japan .   \n ^   Bunny, Bissoux (October 2017). \"A day in the life of geisha\".  Tokyo Weekender Magazine : 24, 25.   \n ^   Sasaki, Sayo (2017-01-18).  \"American aspires to fulfill childhood dream as geisha in Japan\" .  The Japan Times Online .  ISSN   0447-5763 . Retrieved  2017-11-23 .   \n ^   \"Maiko Dance\" .   \n ^  a   b   \"Geisha dances\" . Archived from  the original  on 2013-01-02.   \n ^   Baika-sai (Plum Festival)   Archived  2011-01-20 at the  Wayback Machine ., Kyoto Travel Guide \n ^   Open-Air Tea Ceremony with the Scent of Plum Blossoms: Plum Blossom Festival at Kitano Tenman-gu Shrine , Kyoto Shimbun, 2007.2.25 \n ^  a   b   Demetriou, Danielle (2010-07-16).  \"Geishas serve beer instead of tea and conversation as downturn hits Japan\" .  Telegraph.co.uk .   \n ^   \"Geisha beer garden opens in Kyoto\" .  Sydney Morning Herald . 2010-07-09.   \n ^   Geisha gardens in Kyoto , 12 Jul 2010 – contact information \n ^   \"World's oldest geisha looks to future to preserve past\" . 2007-12-03.  Girls in the past could become apprentice geishas from the age of 13, but it is now illegal to become an apprentice before 18 except in Kyoto where a girl can be an apprentice at 15.   \n ^   Jones, N. (2007-04-20). \"Japan's geisha hit by poor economy\".  The Washington Times .  Even the older sisters who became geisha as teenagers, they are [now] over 80 but still train every day   \n ^  a   b   Maske, Andrew L. \"Geisha Beyond the Painted Smile.\" Peabody:Peabody Essex Museum, 2004:104 \n ^   Asian Mystique , page 52 \n ^   Henshall, K. G., 1999, A History of Japan, Macmillan Press LTD, London,  ISBN   0-333-74940-5 , page 61 \n ^   Matsugu, Miho, 2006, \"In the Service of the Nation: Geisha and Kawabata Yasunari's 'Snow Country ' \", in Martha Feldman and Bonnie Gordon, ed. The Courtesan's Arts, Oxford University Press, London,  ISBN   0-19-517028-8 , page 244 \n ^  a   b   c   d   e   Prasso, Sheridan. \"The Asian Mystique.\" New York: Public Affairs, 2005:206 \n ^   Ozeki, R. (2005).  Inside and other short fiction: Japanese women by Japanese women . Kodansha International.  ISBN   4-7700-3006-1 .   \n ^   Alan Booth,  Looking for the Lost: Journeys Through a Vanishing Japan  Kodansha Globe Series, 1995.  ISBN   1-56836-148-3 \n ^   \"World War II and the American Occupation\" .  geishaofjapan.com .   \n ^  a   b   Dalby, L.  (February 2009). \"waters dry up\".  East Wind Melts the Ice: A Memoir through the Seasons by Liza Dalby . University of California Press. pp. 190–191.  ISBN   978-0-520-25991-1 .  the resulting official line that geisha live by art alone is unrealistically  prudish   \n ^   Seigle, Cecilia Segawa (1993).  Yoshiwara: the glittering world of the Japanese courtesan . [Honolulu]: University of Hawaii Press.  ISBN   0-8248-1488-6 .     page 179 . \n ^   Liza Crihfield Dalby. Geisha. (Berkeley: University of California Press, 1998) \n ^   Lesley Downer. Geisha: The Secret History of a Vanishing World. (London: Headline Book Publishing, 2000) Pages 256–266. \n ^   \"A Week in the Life of: Koaki, Apprentice Geisha – Schooled in the arts of pleasure\" . London:  The Independent . 1998-08-08.   \n ^   Tokyo, By Danielle Demetriou in.  \"Tourists warned to stop 'harassing' Kyoto's geisha\" .   \n Further reading [ edit ] \n Aihara, Kyoko.  Geisha: A Living Tradition . London: Carlton Books, 2000.  ISBN   1-85868-937-6 ,  ISBN   1-85868-970-8 . \n Ariyoshi Sawako,  The Twilight Years . Translated by Mildred Tahara. New York: Kodansha America, 1987. \n Burns, Stanley B., and Elizabeth A. Burns.  Geisha: A Photographic History, 1872–1912 . Brooklyn, N.Y.: powerHouse Books, 2006.  ISBN   1-57687-336-6 . \n Downer, Lesley.  Women of the Pleasure Quarters: The Secret History of the Geisha . New York: Broadway Books, 2001.  ISBN   0-7679-0489-3 ,  ISBN   0-7679-0490-7 . \n Foreman, Kelly. \"The Gei of Geisha. Music, Identity, and Meaning.\" London: Ashgate Press, 2008. \n Ishihara, Tetsuo. Peter MacIntosh, trans.  Nihongami no Sekai: Maiko no kamigata (The World of Traditional Japanese Hairstyles: Hairstyles of the Maiko) . Kyōtō: Dōhōsha Shuppan, 1993.  ISBN   4-8104-1294-6 . \n Iwasaki, Mineko , with Rande Brown.  Geisha, A Life  (also known as  Geisha of Gion ). New York: Atria Books, 2002.  ISBN   0-7434-4432-9 ,  ISBN   0-7567-8161-2 ;  ISBN   0-7434-3059-X . \n Scott, A.C.  The Flower and Willow World; The Story of the Geisha . New York: Orion Press, 1960. \n External links [ edit ] \n Look up  芸者  or  geisha  in Wiktionary, the free dictionary. \n  Media related to  Geisha  at Wikimedia Commons \n Authority control \n NDL :  00562287 \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Geisha&oldid=811680481 \"\t\t\t\t\t \n Categories :  Performing arts in Japan Geisha Japanese culture Japanese musicians Japanese society Japanese words and phrases Entertainment occupations Hidden categories:  All Wikipedia articles needing clarification Wikipedia articles needing clarification from January 2010 Webarchive template wayback links CS1 Japanese-language sources (ja) Articles containing Japanese-language text All articles with unsourced statements Articles with unsourced statements from April 2015 Articles with unsourced statements from September 2017 Accuracy disputes from May 2017 All accuracy disputes Articles containing potentially dated statements from 2010 All articles containing potentially dated statements CS1 maint: Multiple names: authors list CS1 maint: Uses authors parameter   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons   \n Languages \n العربية Azərbaycanca Беларуская Беларуская (тарашкевіца)‎ Български Brezhoneg Català Čeština Chavacano de Zamboanga Cymraeg Dansk Deutsch Eesti Ελληνικά Español Esperanto Euskara فارسی Français Gaeilge Galego 한국어 Հայերեն हिन्दी Hrvatski Bahasa Indonesia Italiano עברית Basa Jawa ಕನ್ನಡ ქართული Latina Latviešu Lietuvių Magyar Македонски Bahasa Melayu မြန်မာဘာသာ Nederlands Nedersaksies 日本語 Norsk ਪੰਜਾਬੀ پنجابی Polski Português Română Русский Саха тыла Scots Sicilianu Simple English Slovenčina Slovenščina Српски / srpski Srpskohrvatski / српскохрватски Basa Sunda Suomi Svenska Tagalog ไทย Türkçe Українська اردو Tiếng Việt 中文   \n Edit links   \n  This page was last edited on 23 November 2017, at 05:59. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}