{"url": "https://m.wikihow.com/Protect-Yourself-from-Sony-DRM-Rootkit-Malware", "content": "How to Protect Yourself from Sony DRM Rootkit Malware: 5 Steps \n Home Random Browse Articles Add to This Page Add Tip Easy Ways to Help Approve Questions Review Tech Feedback Fix Spelling More Things to Try...   \n Log in / Sign up   \n Desktop Site   \n Talk How to Protect Yourself from Sony DRM Rootkit Malware   \n Sony began experimenting in November 2005 with new  Digital  Rights Management (DRM) software on their music CDs. While created to prevent pirating of the music they sell, the software appears to have unintended negative consequences for those whose computers it is installed in. Sony installs a system-level  application  that effectively hides all file names from the user with specific filenames. These files are still present on the system and can be run normally, however any mention of their presence on the system is hidden from the user. This could allow authors of malicious software to use Sony's DRM software to hide their trojan horses on your computer. \n Steps Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/20\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-1.jpg\\/v4-460px-Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/2\\/20\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-1.jpg\",\"smallWidth\":460,\"smallHeight\":376.15384615385,\"bigWidth\":760,\"bigHeight\":621.47157190635} \n 1 \n Disable Autorun on your Windows PC.  This way the software cannot be automatically loaded onto your computer when you insert a Sony DRM enabled audio disc or application.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/00\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/00\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-2.jpg\",\"smallWidth\":460,\"smallHeight\":222.87610619469,\"bigWidth\":760,\"bigHeight\":368.23008849558} \n 2 \n When you insert a Sony  CD  into your computer, do not accept the Sony End User License Agreement (EULA).  Accepting this long document in legalese effectively means you give permission for Sony to install software on your computer. Don't.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/41\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-3.jpg\\/v4-460px-Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/41\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-3.jpg\\/v4-760px-Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-3.jpg\",\"smallWidth\":460,\"smallHeight\":137.74725274725,\"bigWidth\":760,\"bigHeight\":227.58241758242} \n 3 \n Copy the music tracks to your computer if you so desire.  Since these discs are designed to intentionally hide files from Windows, you may need specialized ripping software. Ripping programs such as Exact Audio Copy (see external links) can read these files if you have turned off autorun and disabled the spyware install.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b4\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-4.jpg\\/v4-460px-Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-4.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/b\\/b4\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-4.jpg\",\"smallWidth\":460,\"smallHeight\":134.58791208791,\"bigWidth\":760,\"bigHeight\":222.36263736264} \n 4 If you're already experiencing problems, read  How to Remove Cloaked Malicious Programs Associated with Sony DRM \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/71\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-5.jpg\\/v4-460px-Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-5.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/71\\/Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-5.jpg\\/v4-759px-Protect-Yourself-from-Sony-DRM-Rootkit-Malware-Step-5.jpg\",\"smallWidth\":460,\"smallHeight\":121.31868131868,\"bigWidth\":760,\"bigHeight\":200.43956043956} \n 5 \n Sony has released a patch in response to criticism.  In theory, the patch removes the cloaking-rootkit aspects of their software, though leaves the DRM (which prevents copying the music) in place but now unhidden. See Warnings for concerns regarding the patch, and External Links (below) to download it if you choose.\n Advertisement \n Community Q&A \n Search \n Add New Question \n Ask a Question \n 200 characters left \n Submit \n Tips Edit \n Create a file with the name $sys$ on your computer, if the file disappears you are most likely already infected with the Rootkit. \n 0 \n Helpful? \n   0 \n Technical novices can ensure safety by not placing any new CDs distributed by Sony or BMG into your PC until this issue is resolved. \n 0 \n Helpful? \n   0 \n Discs with Sony's DRM cannot be officially called Compact Discs, as they violate the original \"Red Book\" standard devised by Sony and Philips in June 1980. They can be easily spotted as the cases will not feature the familiar 'Compact Disc' logo. \n 0 \n Helpful? \n   0 \n Microsoft is also coming out with a Rootkit fix in their Microsoft Antispyware Beta (Windows Defender). You can also download this program to fix this issue. (Ref:  http://blogs.technet.com/antimalware/archive/2005/11/12/414299.aspx  ). \n 0 \n Helpful? \n   0 \n Add \n Warnings Edit \n Extensive concerns have been voiced about the patch Sony has released in response to criticism of their DRM. While it does remove the cloaking and theoretically reduces the risk of trojan horses hiding on your PC, it does not remove the DRM, and some believe it installs other new files on your PC. Ideally avoid getting the DRM software installed on your PC in the first place, however, if you already have it, you will have to decide whether it is worth the risk of installing  more  bad Sony software. Read  How to Remove Cloaked Malicious Programs Associated with Sony DRM  for more info. \n 0 \n Helpful? \n   0 \n Since this article was written, Sony has announced that they will be recalling CDs with the XCP software. Details on this recall have not yet been announced. \n 0 \n Helpful? \n   0 \n Related wikiHows Edit \n How to  Convert Protected Audio Into a Plain MP3 \n How to  Remove Cloaked Malicious Programs Associated with Sony DRM \n How to  Back Up a DVD Onto a VCD \n How to  Create a Virus \n How to  Remove a Virus \n How to  Remove Adware Manually \n How to  Locate Viruses Using the Attrib Command \n How to  Stop Redirects \n How to  Get Rid of Trojan Horses \n How to  Make an Easy Worm Virus With Two Lines of Code \n Advertisement \n About This Article \n How helpful is this? \n\t\t\t\tCo-authors:   18 \n Updated:  \n\t\t\t\tViews:  53,745 \n\t\t\t\tCategories:  Featured Articles  |  Spyware and Virus Protection \n Sources and Attribution \n Is this article up to date? \n Yes \n No \n\t\t\t\tNo\n\t\t\t\t\t\t{{questionText}}\n\t\t\t\t\t\t{{currentMethod}}\n\t\t\t\t\t{{cheerText}}\n\t\t\t\t\t{{oopsText}}\n\t\t\t\tYes\n Rootkit info from Wikipedia Exact Audio Copy Wired.com on Boycotting Sony Warning about DRM Removal Patch DRM Removal Patch (See Warning!) Muzzy's research about Sony's XCP DRM system Microsoft Antispyware Beta Wired.com Article: Sony Recalls XCP DRM Discs \n Share \n Steps Community Q&A Tips Warnings Related wikiHows \n Surprise Me! \n 205"}