{"url": "https://www.snap.com/en-US/supplier-responsibility/conflict-minerals/", "content": "Supplier Responsibility – Conflict Minerals – Snap Inc. \n Snap Inc. Jobs News Investors Supplier Responsibility Supplier Code of Conduct Anti-Slavery Conflict Minerals Conflict Minerals \n It is Snap Inc.’s policy to fully comply with laws and guidance, in the United States and abroad, regarding conflict minerals. \n The term “conflict minerals” refers to four metals -- tantalum, tin, tungsten, and gold -- that may be sourced from mines in the Democratic Republic of Congo (DRC). Illegal armed groups control some mines and transit routes in the DRC and surrounding areas, and may use proceeds from those mines or transit routes to fund their violent operations. \n In the United States, the Dodd-Frank Act requires certain companies to file annual reports with the Securities and Exchange Commission indicating if they are using conflict minerals from the DRC or adjoining countries. Other countries have adopted or are considering similar regulations. And the Organisation for Economic Co-operation and Development offers companies guidance for how to avoid using conflict minerals from the DRC and surrounding areas. \n Snap Inc. is committed to complying with these rules and guidelines, regardless of whether they technically apply to our operations. \n Snap Inc. requires its suppliers to agree to a Code of Business Conduct that sets forth detailed conflict-minerals standards. Those standards provide, among other things, that the suppliers must source only from certified conflict-free smelters, must adhere to the OECD Due Diligence Guidance, must exercise diligence on the source and chain of custody of minerals used in their products, and must provide details of their diligence measures on request.  \n Snap Inc. has also adopted a standardized reporting template for conflict-minerals due diligence. And we have engaged a supply chain data-management company to facilitate supply-chain tracking. Our aim is to go above and beyond to ensure no product we make plays any role in financing armed conflict. \n © 2017 Snap Inc. Privacy Policy Terms of Service Other Terms & Policies Impressum Dansk Deutsch English (US) English (UK) Español Français Italiano 日本語 Nederlands Norsk Polish Português (Brasil) Suomi Svenska"}