{"url": "https://www.topuniversities.com/events/qs-world-grad-school-tour/india/bangalore", "content": "QS World Grad School Tour Bangalore | Top Universities \n You are here Home  >  Events  >  QS World Grad School Tour  >  India  >  Bangalore \n MENU \n Join Now / Login \n Rankings Rankings overview \n More \n University rankings   \n View our university rankings by region, subject and more.   \n Discover our rankings   \n QS World University Rankings \n More \n World University Rankings   \n Discover the top universities in the world in 2018.   \n Explore the results now   \n QS World University Rankings by Subject \n More \n World Rankings by Subject   \n Find the world’s top universities in your subject – 46 subjects now featured!   \n Explore the results now   \n QS Graduate Employability Rankings \n More \n Employability Rankings   \n Find out which universities offer the best employment prospects for graduates.   \n Explore the results now   \n QS University Rankings by Region \n More \n Rankings by Region   \n Compare the top universities in your world region.   \n View the latest results   \n QS Best Student Cities \n More \n QS Best Student Cities   \n Where are the world’s best cities to be a student?   \n View the latest results   \n QS Top 50 Under 50 \n More \n QS Top 50 Under 50   \n Discover the top universities in the world that are under 50 years old.   \n Explore the results now   \n QS System Strength Rankings \n More \n System Strength Rankings   \n Where the world’s strongest higher education systems?   \n Find out now   \n QS Stars Rating System \n More \n QS Stars   \n QS Stars is an in-depth rating system for universities.   \n Find out more   \n Related articles \n More \n Related articles   \n What’s new this year, and what do the rankings mean for you?   \n Read the latest articles   \n Discover University search \n More \n University search   \n Compare universities around the world with our interactive university search tool.   \n Find your perfect match   \n Subject guides \n More \n Subject guides   \n Find your ideal course with our subject guides, covering specializations and career options.   \n View the guides   \n Study destination guides \n More \n Find your perfect study destination   \n Get all the information you need with our country guides.   \n Explore our guides   \n Scholarship advice \n More \n Scholarship advice   \n Advice on finding and applying for scholarships.   \n Find out more   \n Events Events overview \n More \n Meet universities   \n Meet university admissions directors from around the world, at a QS event near you.   \n Find your nearest event   \n QS World Grad School Tour \n More \n Grad School Tour   \n Thinking of studying a master’s or PhD? Meet admissions directors from top grad schools.   \n Find an event near you   \n QS World University Tour \n More \n World University Tour   \n Want to study an undergraduate degree? Explore your options with one of our events.   \n Find your nearest event   \n QS MBA Events \n More \n QS MBA Events   \n Considering an MBA? Meet with admissions directors from top business schools.   \n Find an event near you   \n Prepare Free test preparation (QS-LEAP) \n More \n QS-LEAP \n Get expert test prep \n advice with QS-LEAP, the \n world's first social and \n free test-prep platform. \n SAT GRE ENEM GMAT LSAT    CAT \n Join for free now  \n Choosing a university \n More \n Choosing a university   \n Still deciding where to study? Read our advice on how to choose the right university for you.   \n Get the latest advice   \n Student finance \n More \n Student finance   \n Get advice on a range of funding options and how to manage your finances.   \n Plan your finances   \n Preparing to study abroad \n More \n Ready to study abroad?   \n Find out all you need to know to prepare for your study abroad adventure.   \n Make sure you’re all set   \n QS student guides \n More \n QS student guides   \n Get detailed advice on applications, funding, careers and more with our free student guides!   \n Discover our guides   \n Apply University profiles \n More \n University profiles   \n Find out more about your chosen university with our university profiles.   \n Browse the profiles   \n Admissions advice \n More \n Admissions advice   \n Ready to apply? Get advice on how to impress admissions officers, on paper and at interview!   \n Read the latest tips   \n QS Scholarships \n More \n QS Scholarships   \n Discover our range of QS scholarships, with funding worth US$1.7 million on offer!   \n Find out more   \n Careers Careers advice \n More \n Your next steps   \n Find out where your degree could take you, how to nail job interviews and more!   \n Read our careers advice    \n Community Community overview \n More \n Join our community   \n Check out the latest posts from our bloggers, watch videos and ask a question in our forum!   \n Explore the community   \n Q&A forum \n More \n Student forum   \n Get advice from other students around the world in our international student forum.   \n Join the discussion   \n Blog \n More \n Student blog   \n Explore the latest posts from our bloggers on everything from student life to jobs and travel!   \n View our student blog   \n University news \n More \n University news   \n Get the latest news about international higher education.   \n Read the latest updates   \n Videos \n More \n Videos   \n Watch our latest videos about top universities, student life and more!   \n Explore our videos    \n Quick Links \n Undergraduate Studies  \n Postgraduate Studies  \n Find us \n Log in using social media \n how you  \n How are you feeling today? \n Forgot password? * Required fields   \nNot registered?  Click here to join. \n Join us free \n Speed up registration - sign-in using \n First name*  * \n how you  \n How are you feeling today? \n Last name*  * \n Email*  * \n Use at least 6 characters and one numeral \n Source  \n I confirm that I am over 16 years old and I am happy to receive newsletters and up-to-date information about Top Universities, Top MBA and QS Leap. I understand that my data will be held for as long as I am registered with the site and I will continue to receive such communications until I amend my user profile.*  * \n Yes  \n No  \n User Agreement  |  Privacy Policy  |  Cookie Policy * Required fields \n Leave this field blank  \nAlready registered?  Click here to log in! \n University search:   X \n Study Level  \n Study Level All study levels Undergraduate Postgraduate \n   X \n Subject of interest  \n Accounting and Finance Agriculture & Forestry Anatomy & Physiology Anthropology Archaeology Architecture Area Studies Art & Design Astronomy Biological Sciences Built Environment Business & Management Studies Chemistry Classics & Ancient History Communication and Media Studies Computer Science and Information Systems Dentistry Development Studies Earth and Marine Sciences Economics and Econometrics Education and Training Engineering - Aeronautical Engineering - Chemical Engineering - Civil and Structural Engineering - Electrical and Electronic Engineering - General Engineering - Manufacturing & Production Engineering - Mechanical Engineering - Mineral & Mining Engineering Management English Language and Literature Environmental Studies Ethnicity, Gender and Diversity Finance Geography Hospitality & Leisure Management Human Resources Management International Relations/Studies/Affairs Journalism Law and Legal Studies Library & Information Management Linguistics Logistics / Supply Chain Management Marketing Materials Sciences Mathematics Medicine Medicine Related Studies Modern Languages Nursing Performing Arts Pharmacology Pharmacy & Pharmacology Philosophy Physics & Astronomy Politics Psychology Public Policy Sociology Sports-related Courses Statistics and Operational Research Theology, Divinity & Religious Studies Urban Planning Veterinary Science Zoology \n X \n Study destination  \n Afghanistan Albania Algeria Argentina Armenia Australia Austria Azerbaijan Bahrain Bangladesh Barbados Belarus Belgium Belize Bolivia Bosnia and Herzegovina Botswana Brazil Brunei Bulgaria Cambodia Cameroon Canada Chile China Colombia Costa Rica Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominican Republic Ecuador Egypt El Salvador Estonia Ethiopia Finland France French Polynesia Georgia Germany Ghana Greece Grenada Guatemala Guyana Haiti Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Israel Italy Jamaica Japan Jordan Kazakhstan Kenya Kosovo Kuwait Kyrgyzstan Latvia Lebanon Libya Liechtenstein Lithuania Luxembourg Macao S.A.R., China Malaysia Malta Mauritania Mauritius Mexico Monaco Mongolia Morocco Mozambique Namibia Netherlands New Caledonia New Zealand Nicaragua Nigeria Norway Oman Pakistan Palestinian Territory, Occupied Panama Paraguay Peru Philippines Poland Portugal Puerto Rico Qatar Romania Russia Saint Pierre and Miquelon Saudi Arabia Senegal Serbia Singapore Slovakia Slovenia Somalia South Africa South Korea Spain Sri Lanka Sudan Suriname Sweden Switzerland Taiwan Thailand Trinidad and Tobago Tunisia Turkey Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Venezuela Vietnam Yemen Zimbabwe \n Site Search  \nhttps://www.topuniversities.com/sites/default/files/events/lead-bg-images/proof_v3_25620.jpg  \nQS World Grad School Tour  \n Bangalore \n Saturday, 2nd Dec 2017\n 12:30  -  18:00 \n Saturday, 2nd December 2017\n 12:30pm  -  06:00pm \n  Vivanta by Taj, M G Road  \n Map   \n Fast-track registration   \nRegister now  \n The  QS World Grad School Tour Bangalore  is a comprehensive day, designed to help you find your preferred postgraduate program and study destination. Meet the world's top universities under one roof and attend informative seminars and a GRE workshop. \n   \n As an attendee of the fair, you will also have the opportunity to apply for exclusive scholarships worth US $7 million.   \n Why Attend? \n50+ Top Universities  \nFind the right Masters program & speak directly with admissions directors from world's leading universities  \nFace-to-face  \nPanels & Seminars  \nPre-fair schools info sessions & seminars about application procedures and scholarships applications  \nSeminars  \nExpert Guidance  \nSpeak with educational institutes and tests preps to get the experts advice in preparing for your application  \nFace-to-face  \nFinancial Support  \nAttendees are eligible for exclusive scholarships worth $7 Million offered by QS and partners universities  \nScholarships  \nGrad School Guide  \nFree copy of the QS Top Grad School Guide, offering you insights about rankings, study destinations and more  \nOffers  \nApplication Fee Waivers*  \nReceive application fee waivers from select Schools that can speed things up with your application.  \nOffers  \n    Event Agenda     \n 10:00  -  13:00 \nConnect Masters - Pre scheduled meetings with Business/ Engineering Schools and Universities. By invitation only  \n 12:30 \nRegistration Opens  \n 13:00  -  13:20 \nPresentation by Henley Business School  \n 13:25  -  13:45 \nPresentation by Technical University of Denmark (DTU)  \n 13:50  -  14:10 \nPresentation by University of California San Diego, Rady  \n 14:15  -  15:00 \nAdvancing your career with a STEM, Business, or other Graduate Degree  \n   Presenters:\nNYU Tandon School of Engineering, IE Business School, Concordia University and Politecnico di Torino  \n 15:00 \nStart of the fair  \n 15:00  -  15:30 \nUnderstanding and Preparing for the GMAT exam  \n   Presenters:\nGMAC - official GMAT exam  \n 16:00  -  16:30 \nGRE Workshop  \n   Presenters:\nLeading Test Prep  \n 18:00 \nFair Closes  \n FAQ \n1. Do I need to register beforehand or can I turn up at the Master's fair without registering?   \nRegistration for th fair is FREE. We would recommend you register online so you could receive important information from QS and the participating universities.   \n2. What is the best time to attend the Master's fair?   \nWe would suggest that you come early to attend exclusive university presentations and to get a complimentary copy of the QS Top Grad School Guide, however you can come at any point from 12:30pm - 06:00pm.   \n3. How to dress for the QS World Grad School Tour?   \nThere is no specific dress code for the QS World Grad School Tour. The fair does provide you with a relaxed atmosphere to meet with directors – but consider your appearance as it could make all the difference. Smart casuals are preferred rather than a t-shirt and flip flops.   \n Quick Links \n  Why attend?  \n  Event agenda  \n  FAQs \n  Institutions Attending the Event \nin Bangalore:  \n   United States   \n Embry-Riddle Aeronautical University George Washington University Georgia State University - J. Mack Robinson New York University : NYU Center for Urban Science & Progress New York University – Tandon School of Engineering Pepperdine University - Graziadio School of Business Rensselaer Polytechnic Institute, The Lally School of Management Southern Methodist University St. John's University: New York City University of Buffalo, School of Engineering and Applied Sciences University of California San Diego, Rady School of Management University of Minnesota - Carlson School of Management University of San Francisco University of South Florida Worcester Polytechnic Institute - Foisie Business School   \n   United Kingdom   \n Henley Business School Imperial College London King's College London Loughborough University Business School Newcastle University Business School Nottingham Business School Salford Business School Salford University Business School Swansea University Teesside University University College London University of Essex University of Exeter Business School University of Kent WMG University of Warwick   \n   Sweden   \n InnoEnergy Master’s School Jönköping University   \n   Spain   \n EADA IE Business School UPC Barcelona Tech   \n   Singapore   \n Singapore Management University (SMU)   \n   Norway   \n BI Norwegian Business School   \n    WORLDWIDE CAMPUSES   \n ESCP Europe - Paris Hult International Business School   \n   Monaco   \n IUM   \n   Italy   \n Bocconi University Politecnico di Torino   \n   Ireland   \n University College Dublin   \n   India   \n BSE Institute   \n   France   \n Burgundy School of Business-BSB EDHEC Business School ESSEC Business School KEDGE Business School Leonard de Vinci Group Neoma Business School   \n   Denmark   \n Technical University of Denmark (DTU)   \n   China   \n Duke Kunshan University   \n   Canada   \n Concordia University   \n Media Partners \n  ISIC India    \n Rankings Rankings Overview \n QS World University Rankings \n QS World University Rankings by Subject \n QS Graduate Employability Rankings \n QS University Rankings by Region \n QS Best Student Cities \n QS Top 50 Under 50 \n QS System Strength Rankings \n QS Stars Rating System \n Related articles \n Discover University search \n Subject guides \n Study destination guides \n Scholarship advice \n Events Events overview \n QS World Grad School Tour \n QS World University Tour \n QS World MBA Tour \n QS TopMBA Connect 1-2-1 \n Prepare Free test preparation (QS-LEAP) \n Choosing a university \n Student finance \n Preparing to study abroad \n QS student guides \n Apply University profiles \n Admissions advice \n QS Scholarships \n Careers Careers advice \n Community Community overview \n Q&A forum \n Blog \n University news \n Videos \n About   Contact   Privacy   Users   Cookies   \n ©  QS Quacquarelli Symonds Limited 1994 - 2017. All rights reserved.   \n Succeed  with our top tips on  admissions, jobs and student life \n   Join us free \n No thanks \n Main menu \n Rankings Rankings overview QS World University Rankings QS World University Rankings by Subject QS Graduate Employability Rankings QS University Rankings by Region QS Best Student Cities QS Top 50 Under 50 QS System Strength Rankings QS Stars Rating System Related articles Discover University search Subject guides Study destination guides Scholarship advice Events Events overview QS World Grad School Tour QS World University Tour QS MBA Events Prepare Free test preparation (QS-LEAP) Choosing a university Student finance Preparing to study abroad QS student guides Apply University profiles Admissions advice QS Scholarships Careers Careers advice Community Community overview Q&A forum Blog University news Videos"}