{"url": "https://en.wikipedia.org/wiki/Shaped_Compact_Disc", "content": "Shaped Compact Disc - Wikipedia \n Shaped Compact Disc   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article  needs additional citations for  verification .  Please help  improve this article  by  adding citations to reliable sources . Unsourced material may be challenged and removed.   (November 2009)   ( Learn how and when to remove this template message ) \nPicture of the back of a shaped CD. This CD was produced as a round disc and automatically cut to shape using a computer aided machine with a rotary tool. It's easy to distinguish that the data track of the disc is smaller compared to a full 72 minute disc; it ends before it reaches the outside border of the disc to allow the unused media on the outside to be cut away. \n A  shaped Compact Disc  is a non-circular  compact disc . Examples include  business card CDs , CDs in the shape of a star, a map of a country,  interview material  and more. These disks are usually made for marketing purposes and are properly read by most CD-ROM drives (and audio CD players, although custom-shaped CDs tend to contain less data). There are many companies that sell CDs with custom shapes. \n Unlike  Mini CDs , which are smaller, but still circular versions of normal CDs, custom CDs can be any number of shapes, even more complicated shapes like gears with dozens of teeth, but are generally smooth and with rounded edges, such as ovals or rounded rectangles. A logo can be printed on a shaped CD, in the same way common audio CDs and CD-ROMs are labeled. \n Shaped CDs are produced in one of two ways. A special mold can be made and used to \"stamp\" CDs (or DVDs) as part of the precision injection molding process that is used to make CDs and DVDs. Because of the initial cost involved in setting up this process, it is usually used for mass production. For the same reason, this is generally restricted to the production of read only CDs and DVDs (CD-rom or DVD-rom). Recordable CDs and DVDs (CD-r or DVD-r or DVD+r) are not generally available except in standard shapes including rectangular. The second method to produce a shaped CD or DVD is to produce a normal CD-rom or DVD-rom and cut it to the desired shape. This method works only for CD-rom. It will not work for CD-r because the plastic used to produce CD-r tends to splinter when cut. It is important that two criteria be met for shaped disk to function properly. First, the shape must be balanced to avoid problems when it begins to spin. Second, at least three points of the outer edge must touch either the outer 12 cm diameter rim of the players tray where standard size discs fit or the inner rim where 8 cm diameter mini discs fit. \n Data can only be recorded on sections of a Shaped CD that form uninterrupted circular tracks. Other parts of the shape are purely decorative - but are still often finished to the same appearance as a CD. They appear silver and reflective on the data side of the CD, even though they contain no actual valid bytes and cannot be read. \n Contents \n 1   History \n 2   Compatibility \n 3   Asymmetric discs \n 4   Legal/patent \n 5   See also \n 6   References \n History [ edit ] \n The Flaming Lips  released a CD single entitled \" This Here Giraffe \" on the world's first ever star-shaped CD. It was in the shape of an 8-pointed  star . [1]  Another shaped CD includes the North American release of the soundtrack to the Nintendo 64 game Yoshi's Story, named Music to Pound the Ground To, was shaped to outline the print on the disc, Yoshi's face and a few things (like fruit) in the background. The North American soundtrack of Diddy Kong Racing also has a similarly-shaped CD, being shaped to outline Diddy Kong's head. \n An additional example is the live  EP   Alive in Torment  released by  symphonic black metal  band  Dimmu Borgir . The disc is shaped like a skull. \nOne shape of business-card CD. \n Compatibility [ edit ] \n Shaped CDs are not compatible with all CD players. They work with most machines where the disc is inserted by manually clipping it onto a spindle (the mechanism in virtually all portable CD players), but may not work in drives that load the disc from a tray and they are not compatible with any slot loading drives. They can even get stuck in these players or be rejected if the tray loading mechanism has optical sensors to detect the disc position. \n Business card CDs or shaped CDs can hold any type of data and can usually store anywhere from 40MB to 100MB of information. These CDs may be used for promotional pieces for business, music or many other uses. \n Asymmetric discs [ edit ] \n Irregularly shaped, non- rotationally-symmetric  discs with an offset  center of mass  may also cause damaging vibration if played in computer CD drives, which can operate at a much higher  rotational velocity  than stand-alone audio CD players. Some irregularly shaped discs work with tray loading CD drives if they include a circular ridge on their underside that centers them on the part of the tray designed to hold 80 mm CDs, if the tray has such a feature. \n Legal/patent [ edit ] \n A patent exists on all the production of all non-round CDs. [2]  Often referred to as the \"Rose Patent,\" the holder of this patent has litigated to collect royalties on the production or sale of any non-round disc. Other manufacturers of non-round discs have litigated to dispute the validity of this patent and have produced examples of non-round discs that predate the patent. The matter is currently [ when? ]  in litigation. \n See also [ edit ] \n Bootable business card \n Unusual types of gramophone records#Unusually shaped discs \n References [ edit ] \n ^   The Flaming Lips, This Here Giraffe  — Star-shaped CD label \n ^   Google Patent Database — Patent US 5844757 \n v \n t \n e \n Compact disc \n Discs \n CD \n CD-DA \n Red Book \n CD-R \n Orange Book \n CD-ROM \n Yellow Book \n CD-RW \n CD-MRW \n CD-MO \n CD-i \n Green Book \n CD-Text \n CD+ \n Blue Book \n CD+EG \n CD+G  (Karaoke) \n Gold CD \n MiniCD \n Mixed Mode CD \n Photo CD \n Beige Book \n PMCD \n shaped CD \n business card CD \n SVCD \n VCD \n White Book \n Technology \n Rainbow Books \n CD authoring \n CD burning \n CD copy protection \n CD emulation \n CD manufacturing \n CD ripping \n CD rot \n CD bronzing \n CD subcode \n C2 error \n CD-i Ready \n 4ch CD-DA \n El Torito \n ISO 9660 \n Joliet \n Romeo \n Rock Ridge \n ISO 13490 \n UDF \n XRCD \n Hardware/Software/Content \n CD Case \n CD drive \n CD player \n Portable CD player \n CD recorder \n CD ripper \n CD single \n Mini CD single \n Court cases \n Orange-Book-Standard \n Lists \n CD copy protection schemes \n CD player manufacturers \n Optical disc authoring software \n Variants based on CD \n 5.1 Music Disc \n Black Book \n CD Video \n Video Single Disc \n cDVD \n CDVU+ \n DD-CD \n Purple Book \n DSD-CD \n DualDisc \n HDCD \n Hybrid DVD-Audio \n Hybrid SACD \n Scarlet Book \n MovieCD \n MP3 CD \n Picture CD \n VinylDisc \n See also \n Blu-ray \n DVD \n HD DVD \n LaserDisc \n MiniDisc \n SACD \n UMD \n WORM \n   Category \n   Commons \n   Wiktionary \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Shaped_Compact_Disc&oldid=793784568 \"\t\t\t\t\t \n Categories :  Compact disc Hidden categories:  Articles needing additional references from November 2009 All articles needing additional references All articles with vague or ambiguous time Vague or ambiguous time from November 2009   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Deutsch   \n Edit links   \n  This page was last edited on 3 August 2017, at 22:54. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}