{"url": "https://www.wikihow.com/Disable-Popup-Blockers", "content": "5 Ways to Disable Popup Blockers - wikiHow \n MESSAGES \n LOG IN \n Log in \n Facebook \n Google \n Civic \n wikiHow Account \n\t\tNo account yet?\t\t Create an account \n EXPLORE \n Community Dashboard Random Article About Us Categories Recent Changes   \n HELP US \n Write an Article Request a New Article Answer a Request More Ideas...   \n EDIT \n Edit this Article   \n Home »  Categories    »  Computers and Electronics  »  Internet  »  Internet Security   \n Article Edit Discuss \n Reader Approved wiki How to Disable Popup Blockers \n Five Methods: Google Chrome Mozilla Firefox Microsoft Edge Microsoft Internet Explorer Safari Community Q&A \n This wikiHow teaches you how to change the settings in Google Chrome, Mozilla Firefox, Microsoft Edge, Internet Explorer, and Safari to allow pop-up ads and dialog boxes as you browse the Web. \n Steps \n Method   1 \n Google Chrome \n 1 \n Open Google Chrome. \n 2 \n Click  ⋮  in the upper-right corner of the window. \n 3 \n Click  Settings . \n 4 \n Scroll to the bottom of the page and click  Advanced . \n 5 \n Scroll down and click  Content settings .  It's near the bottom of the \"Privacy and security\" section.\n 6 \n Scroll down and click  Popups . \n 7 \n Slide the  Blocked  slider to the \"On\" position\n.  You will now see pop-up windows whenever you encounter them in Chrome.\n You can block pop-ups from individual sites by clicking  Add  under the \"Blocked\" section of the menu and entering the URL of the site from which you wish to block the content. \n Method   2 \n Mozilla Firefox \n 1 \n Open Mozilla Firefox. \n 2 \n Click  ☰  in the upper-right corner of the window. \n 3 \n Click\nPreferences. \n 4 \n Click  Content  in the left pane of the window. \n 5 \n Uncheck  \"Block pop-up windows. \"  You will now see pop-up windows whenever you encounter them in Firefox.\n If you have blocking on, you can allow pop-ups from individual sites by clicking  Exceptions...  to the right of the checkbox. Enter the URL of the site from which you wish to see the content, click  Allow  and then  Save Changes . \n Method   3 \n Microsoft Edge \n 1 \n Open Edge. \n 2 \n Click  …  in the upper-right part of the screen. \n 3 \n Click  Settings . \n 4 \n Scroll down and click  View advanced settings . \n 5 \n Slide \"Block pop-ups\" to the \"Off\" position\n.  You will now see pop-up windows whenever you encounter them in Edge.\n Method   4 \n Microsoft Internet Explorer \n 1 \n Open Internet Explorer. \n 2 \n Click\nTools. \n 3 \n Click  Internet options . \n 4 \n Click the  Privacy  tab. \n 5 \n Uncheck Turn on Pop-up Blocker. \n 6 \n Click  OK .  You will now see pop-up windows whenever you encounter them in Internet Explorer.\n If you have pop-up blocker  on , you can allow pop-ups from individual sites instead, as exceptions. To do this, click  Settings  next to the checkbox and enter the URL of the site from which you want to see the content. Then click  Add  and  Close . \n Method   5 \n Safari \n 1 \n Open Safari. \n 2 \n Click  Safari  in the menu bar. \n 3 \n Click  Preferences… . \n 4 \n Click on the  Security  tab. \n 5 \n Uncheck \"Block pop-up windows\" in the \"Web content\" section.  You will now see pop-up windows whenever you encounter them in Safari.\n You can't block pop-ups from individual sites in Safari. \n Community Q&A \n Search \n Add New Question \n How can I disable pop-ups on Chrome? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Download the \"Adblock\" extension. \n Thanks! \n Yes \n No \n Not Helpful  8 \n Helpful  23 \n How can I disable popups on the Safari browser? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n 1.\tOpen a Safari browser and click on the Safari drop-down menu.\n2.\tFrom the dropdown menu, select \"Preferences.\"\n3.\tOnce in Preferences, go to the Security tab.\n4.\tUncheck the option \"Block pop-up windows\" to disable the functionality.\n5.\tYou cannot manage exceptions in Safari. You either block all websites from displaying popups or none at all. \n Thanks! \n Yes \n No \n Not Helpful  9 \n Helpful  15 \n How do I enable popups on an Android tablet? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Select the \"apps\" button from the home screen on Android. Click on \"Browser\" to open the standard Android browser. Hit the menu button after the browser opens. Then, select \"Settings\" when the menu appears.Select \"Advanced\" from the Settings menu. Click the box labelled \"Block pop-ups.\" \n Thanks! \n Yes \n No \n Not Helpful  3 \n Helpful  7 \n How do I disable popups for the Amazon silk tablet? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Open the Quick Settings menu. Tap on More. Go to Applications > Amazon Applications. Tap on Silk. Tap on Block Pop-up Windows and select Always.   \n Thanks! \n Yes \n No \n Not Helpful  8 \n Helpful  13 \n How do I disable popup blocker in Windows 10 with no tools menu? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n To disable pop-up blocker in Internet Explorer: Click the Internet Explorer icon on the desktop to open the program. Click the Tools button in the toolbar at the top of the browser window. Select Internet Options from the Tools menu. Click the Privacy tab in the Internet Options pop-up window. \n Thanks! \n Yes \n No \n Not Helpful  7 \n Helpful  8 \n How can I turn off the pop-up blocker on a Lenovo tablet? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Go in the app drawer and start the web browser. Tap the menu button, then tap settings. Tap on \n\"Advanced.\" Scroll down to find \"block pop-ups.\" Tap on it.  \n Thanks! \n Yes \n No \n Not Helpful  4 \n Helpful  5 \n How do I turn off the pop up blocker on Microsoft Edge? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Open Edge. Click … in the upper-right part of the screen. Click Settings. Scroll down and click View Advanced Settings. Slide \"Block pop-ups\" to the \"off\" position. \n Thanks! \n Yes \n No \n Not Helpful  2 \n Helpful  2 \n How do I disable popups on an Android tablet? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Open the Browser or Internet App. This will open the stock internet browser for your Android device. Tap the \"⋮\" or \"More\" button. You'll find this in the upper-right corner. Tap \"Settings.\" Tap \"Advanced.\"\nSlide the \"Block pop-ups\" button to the \"on\" position. \n Thanks! \n Yes \n No \n Not Helpful  8 \n Helpful  2 \n How can I disable popups from my iPad? \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Go to Settings, select Safari and uncheck Block Popups.   \n Thanks! \n Yes \n No \n Not Helpful  0 \n Helpful  0 \n Unanswered Questions \n Can I reset the pop-up ad blocker later? \n Answer this question \n Flag as... \n Flag as... \n My \"block pop-us\" is already unchecked, yet I still detect pop up blocking. How do I handle this? \n Answer this question \n Flag as... \n Flag as... \n How do I turn off pop up blockers on my iPhone? \n Answer this question \n Flag as... \n Flag as... \n MSM is my main page on Internet Explorer - how do I access tools? \n Answer this question \n Flag as... \n Flag as... \n How do I turn off the pop up blocker on an iPhone 6s? \n Answer this question \n Flag as... \n Flag as... \n Show more unanswered questions \n Ask a Question \n 200 characters left \n Submit \n Already answered \n Not a question \n Bad question \n Other \n Video \n Tips \n Turn off any popup blocker software you may have downloaded or purchased. Blocking software (popular for weeding out adware or malware) can supersede your browser's blocking functions. Check if any software you own is keeping you from viewing popups. \n Edit Related wikiHows \n How to  Block Pop Ups With Internet Explorer 6 \n How to  Get Rid of Pop Ups \n How to  Close an Internet Pop Up \n How to  Get Rid of Delta Search Engine on Google Chrome \n How to  Clear Your Browser's Cache \n How to  Download Any Video from Any Website for Free \n How to  Enable Cookies in Your Internet Web Browser \n How to  Search for a Word on a Webpage \n How to  Clear Cache and Cookies \n How to  Get the Android Browser to Block Popups \n Article Info \n  Categories:  Internet Browsers  |  Internet Security \n In other languages: \n Italiano:  Disattivare il Blocco dei Popup , Español:  deshabilitar los bloqueadores de elementos emergentes , Português:  Desabilitar Bloqueadores de Popup , Français:  désactiver les bloqueurs de popups , Русский:  разрешить всплывающие окна , 中文:  禁用弹出窗口阻止程序 , Deutsch:  Pop Up Blocker ausschalten , Nederlands:  Pop upblockers uitschakelen , Bahasa Indonesia:  Menonaktifkan Pemblokir Pop‐up , हिन्दी:  पॉपअप ब्लॉकर्स (Popup Blockers) को डिसेबल करें , العربية:  تعطيل أدوات حجب النوافذ المنبثقة , ไทย:  ปิด Popup Blocker , Tiếng Việt:  Vô hiệu hóa trình chặn popup , 日本語:  ポップアップブロックを無効にする , 한국어:  팝업 차단 해제하는 방법   \n Discuss \n Print \n Email \n Edit \n Send fan mail to authors \n Thanks to all authors for creating a page that has been read 1,768,560 times. \n Is this article up to date? \n Yes \n No \n   \n Cookies make wikiHow better. By continuing to use our site, you agree to our  cookie policy . \n About This Article \n How helpful is this? \n\t\t\t\tCo-authors:   25 \n Updated:  \n\t\t\t\tViews:  1,768,560 \n\t\t\t\t\tAK\n Ashish Khatri \n 3 days ago \n\t\t\t\t\"The instructions were clear. I am not using Mac, though, so I cannot tell for Mac.\"\n\t\t\t\t\tA\n Anonymous \n Aug 23, 2016 \n\t\t\t\t\"Going into the settings immediately and with only a few clicks you could have your pop up blockers turned on for  all websites.\" ...\"  more \n\t\t\t\t\tGY\n Georges Yempe \n Oct 23 \n\t\t\t\t\"I appreciate the different steps with the screenshots that give more explanation and bring easy understanding.\"\n\t\t\t\t\tA\n Anonymous \n Nov 6 \n\t\t\t\t\"This was a refresher course on the operating of the computer system. It's always great to get refreshers.\"\n\t\t\t\t\tA\n Anonymous \n Aug 20 \n\t\t\t\t\"This article is very useful and helped me achieve all steps in a short period.\"\n\t\t\t\t\tA\n Anonymous \n Jul 22, 2016 \n\t\t\t\t\"Simply explained with both pictures and text. Good for seniors. Thank you.\"\n\t\t\t\t\tSN\n Sihabdeen Nijamudeen \n Oct 1, 2016 \n\t\t\t\t\"Step by step procedures help me a lot to deal with the popup blockers.\"\n\t\t\t\t\tSN\n Silvester Nusa \n Feb 2 \n\t\t\t\t\"The article is a good method, and helped me when I needed information.\"\n\t\t\t\t\tA\n Anonymous \n Aug 22, 2016 \n\t\t\t\t\"The step-by-step directions were just what I needed. Thank you!\"\n\t\t\t\t\tMO\n Mike Orth \n Aug 28 \n\t\t\t\t\"It provides advice on all browser types and is easy to follow.\"\n Rated this article:  \n\t\t\t\t\tA\n Anonymous \n Dec 11, 2016 \n\t\t\t\t\"I was able to disable pop up blocker for my desired website.\"\n\t\t\t\t\tA\n Anonymous \n Mar 1 \n\t\t\t\t\"Just reviewing and making sure I understood the process.\"\n\t\t\t\t\tA\n Anonymous \n Aug 15, 2016 \n\t\t\t\t\"The steps that were given before the video helped a lot.\"\n\t\t\t\t\tA\n Anonymous \n May 25 \n\t\t\t\t\"Interesting and knowledgeable material to learn from!\"\n Anyieth Nyang \n Oct 2 \n\t\t\t\t\"It helped me understand how to look on the internet.\"\n\t\t\t\t\tA\n Anonymous \n Feb 3 \n\t\t\t\t\"Step by step is helpful, but I haven't tried it yet.\"\n\t\t\t\t\tCJ\n Cordelia Joyce \n Jun 6, 2016 \n\t\t\t\t\"It all did help for me, because it's all new to me.\"\n\t\t\t\t\tA\n Anonymous \n Oct 23, 2016 \n\t\t\t\t\"Helped by showing me the specific buttons to push.\"\n\t\t\t\t\tA\n Anonymous \n Sep 26, 2016 \n\t\t\t\t\"It helped to get where I needed to go faster.\"\n\t\t\t\t\tA\n Anonymous \n Feb 23 \n\t\t\t\t\"Good info that is easy to follow. Thank you.\"\n\t\t\t\t\tA\n Anonymous \n Feb 16 \n\t\t\t\t\"This showed me how to use a tablet properly!\"\n\t\t\t\t\tAR\n Angela Rowe \n Aug 26 \n\t\t\t\t\"It taught me the basics of enabling popups.\"\n\t\t\t\t\tA\n Anonymous \n Aug 15, 2016 \n\t\t\t\t\"The step by step instructions were helpful.\"\n\t\t\t\t\tA\n Anonymous \n Sep 19 \n\t\t\t\t\"Useful to avoid all those annoying pop ups.\"\n\t\t\t\t\tA\n Anonymous \n May 18 \n\t\t\t\t\"It was very easy to follow and learn from.\"\n\t\t\t\t\tA\n Anonymous \n Jan 17 \n\t\t\t\t\"From one step to another, it's very clear.\"\n\t\t\t\t\tA\n Anonymous \n Feb 16 \n\t\t\t\t\"How to use a tablet properly was helpful. \"\n\t\t\t\t\tDB\n Daniel Bennett \n May 23 \n\t\t\t\t\"Explained how to disable pop up blockers.\"\n\t\t\t\t\tA\n Anonymous \n Feb 16 \n\t\t\t\t\"All helped me. I needed the information!\"\n\t\t\t\t\tAV\n Alexis V. \n Oct 1 \n\t\t\t\t\"I was able to unblock popups in Safari!\"\n Rated this article:  \n Share yours! \n More success stories \n All success stories \n Hide success stories \n Quick Tips \n Related Articles How to  Block Pop Ups With Internet Explorer 6 How to  Get Rid of Pop Ups How to  Close an Internet Pop Up How to  Get Rid of Delta Search Engine on Google Chrome   \n Home \n About wikiHow \n Jobs \n Terms of Use \n RSS \n Site map \n Log In \n Mobile view \n    All text shared under a  Creative Commons License .\n Powered by Mediawiki. \n Help answer questions \n Learn more \n 234"}