{"url": "https://en.wikipedia.org/wiki/Talk:List_of_Harry_Potter_cast_members", "content": "Talk:List of Harry Potter cast members - Wikipedia \n Talk:List of Harry Potter cast members   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This is the  talk page  for discussing improvements to the  List of Harry Potter cast members  article. \nThis is  not a forum  for general discussion of the article's subject. \n Put new text under old text.  Click here to start a new topic . \n Please sign and date your posts  by typing four tildes ( ~~~~ ). \n New to Wikipedia?  Welcome !  Ask questions, get answers . \n Be polite , and  welcoming to new users \n Assume good faith \n Avoid personal attacks \n For disputes,  seek dispute resolution \n Article policies \n No original research \n Neutral point of view \n Verifiability \n List of Harry Potter cast members  is a  featured list , which means it has been  identified  as one of the best  lists  produced by the  Wikipedia community . If you can update or improve it,  please do so . \n This article appeared on Wikipedia's Main Page as  Today's featured list  on November 19, 2012. \n Article milestones \n Date \n Process \n Result \n November 28, 2006 \n Articles for deletion \n Kept \n January 7, 2007 \n Featured list candidate \n Promoted \n Current status:  Featured list \n This article must adhere to the  biographies of living persons  ( BLP ) policy, even if it is not a biography, because it contains material about living persons. Contentious material about living persons that is unsourced or  poorly sourced   must be removed immediately  from the article and its talk page, especially if potentially  libellous . If such material is repeatedly inserted, or if you have other concerns, please report the issue to  this noticeboard .\nIf you are a subject of this article, or acting on behalf of one, and you need help, please see  this help page . \n            This article is of interest to the following  WikiProjects : \n WikiProject Novels  /  Harry Potter \n (Rated FL-class, Low-importance) \n Novels Wikipedia:WikiProject Novels Template:WikiProject Novels novel articles \n Novels portal \n v \n t \n e \nThis article is within the scope of  WikiProject Novels , an attempt to build a comprehensive and detailed guide to  novels ,  novellas ,  novelettes  and  short stories  on Wikipedia. If you would like to participate, you can edit one of the articles mentioned below, or visit the project page, where you can join the project and contribute to the  general Project discussion  to talk over new ideas and suggestions. \n   FL   \n This article has been rated as  FL-Class  on the project's  quality scale . \n   Low   \n This article has been rated as  Low-importance  on the project's  importance scale . \n Harry Potter portal \nThis article is supported by  Harry Potter task force  (marked as  Low-importance ). \n   \n WikiProject Film \n (Rated FL-class) \n Film Wikipedia:WikiProject Film Template:WikiProject Film film articles \n Film portal \n v \n t \n e \nThis article is within the scope of  WikiProject Film . If you would like to participate, please visit the project page, where you can  join the discussion  and see lists of  open tasks  and  regional and topical task forces . To use this banner, please refer to the  documentation . To improve this article, please refer to the  guidelines . \n   FL   \n This article has been rated as  FL-Class  on the project's  quality scale . \n This article is supported by  the American cinema task force . \n This article is supported by  the British cinema task force . \n   \n WikiProject Lists \n (Rated FL-class, Low-importance) \n Lists Wikipedia:WikiProject Lists Template:WikiProject Lists List articles \n Lists portal \n v \n t \n e \nThis article is within the scope of  WikiProject Lists , an attempt to structure and organize all  list pages on Wikipedia . If you wish to help, please visit the  project page , where you can join the project and/or contribute to the  discussion . \n   FL   \n This article has been rated as  FL-Class  on the project's  quality scale . \n   Low   \n This article has been rated as  Low-importance  on the project's  importance scale . \n   \n For those interested as to what this list would have looked like had it been around at the release of films one through six, there are six subpages to document this: After 1 ,  After 2 ,  After 3 ,  After 4 ,  After 5  and  After 6 . \n Contents \n 1   transferred \n 2   Barmy! \n 3   James & Lily \n 4   Isaacs confirmed? \n 5   Mess \n 6   Remus is/was Hogwarts teacher \n 7   Requested move \n 7.1   Survey \n 7.1.1   Survey - in support of the move \n 7.1.2   Survey - in opposition to the move \n 7.2   Discussion \n 8   Pomfrey \n 9   key \n 10   Susan Bones, Hannah Abbott sources \n 11   Deathly Hallows \n 12   Nigel \n 13   Do mentions of seeing people count as appearances? \n 14   Older versions of List \n 15   Person in 3rd movie \n 16   Characters who could appear in two or more headers \n 17   Slightly Creepy Boy = Michael Corner \n 18   Colin Creevey \n 19   Bellatrix in goblet of fire \n 20   Susie Shinner \n 21   Jessie Cave as Lavender Brown! \n 22   Tonks' Role as an Auror \n 23   Ralph Fiennes \n 24   Richard Griffiths, Fiona Shaw \n 25   Percy in HBP? \n 26   Colour for confirmed \"will not appear\" \n 27   colspan=\"1\" needed? \n 28   Somewhat Doubtful Boy \n 29   Cho Chang \n 30   Narcisa Malfoy \n 31   Professor Trelawney \n 32   Lily Potter (young), Order of the Phoenix \n 33   Suggestion \n 34   King's Cross railway station security guard, Deathly Hallows & Madam Rosmerta confusion & Weird Sisters \n 35   Grey Lady, Deathly Hallows \n 36   Wlinks in headers \n 37   Two columns for Deathly Hallows \n 37.1   Time to restore DH split? \n 38   Layout \n 39   Ralph Fiennes (f) in Half-Blood Prince \n 40   Tonks Parents? \n 41   Some Actors We Should Add At the Top \n 42   Flitwick vs Macnair \n 43   Young Snape \n 44   Cedric in Third Film \n 45   John Paul Castrianni \n 46   In the \"ghosts\" section it says that one of the ghosts is Rowena Ravenclaw. \n 47   In the \"ghosts\" section it says that one of the ghosts is Rowena Ravenclaw. \n 48   Unnamed Characters \n 49   Disguised Roles \n 50   Comma to be removed \n 51   Edit request from 128.63.16.82, 10 August 2011 \n 52   New way to list cast \n 53   Movie Title Wrong \n 54   Fix up \n 55   Congratulations! \n 56   Lily Evans / Potter \n 57   Daniel Radcliffe as Voldemort \n 58   Semi-protected edit request on 24 September 2015 \n 59   Wrong cell color for Sybill Trelawney \n 60   Frances De La Tour is not a foreign actor \n 61   External links modified \n 62   A \n transferred [ edit ] \n I've transferred all the names from the main  Harry Potter  article: I suspect there are some more scattered around, and almost certainly several that 't on Wikipedia at all yet. I'm undecided as to how to re-sort the entries. Should those characters which appear only in the first movie and not again be sorted to the top or the bottom? Suggestions please. -- Phil  |  Talk  14:45, Jul 2, 2004 (UTC) \n You might try to sort them by their overall importance in the whole series. \n Students/Teachers/Others ? -  Nunh-huh  23:20, 30 Aug 2004 (UTC)\n Order of appearance? This is usually how they're listed in the film credits at the end.  Her Pegship  15:20, 21 December 2005 (UTC) \n On another issue, should this be re-named \"Cast of Harry Potter films\"?  Her Pegship  15:20, 21 December 2005 (UTC) \n Barmy! [ edit ] \n I think that, with the exceptions of the trio, Dumbledore, Hagrid, McGonagall and Snape, all of the cast should be listed alphabetically... I'm surprised someone hasn't thought of this by now!!  — The preceding  unsigned  comment was added by   Foxearth  ( talk  •  contribs ) 10:53, January 31, 2006. \n Sorted by name of actor or character? — Phil  |  Talk  10:18, 7 February 2006 (UTC) \n James & Lily [ edit ] \n Did they actually appear in the third and fourth films? IMDb claims that they did, but I'm trying and failing to recall their appearances. HTH HAND — Phil  |  Talk  10:18, 7 February 2006 (UTC) \n near the end of the 4th.\n They appeared in a photograph on Harry's bedside table in 3, and in the Priori Incantatem in 4.  Squidward2602  16:34, 27 March 2006 (UTC) \n Isaacs confirmed? [ edit ] \n Jason Isaacs is confirmed to play Lucius Malfoy? I thought he was likely though not confimed to return.... ForestH2   ( discuss  |  contribs ) \n Mess [ edit ] \n This page is a complete mess. First of all, Saunders Triplets did not play Harry Potter in all 5 films. It's needs a lot of cleanup and I plan to do some after I switch some minor things.  Treebark  22:09, 1 July 2006 (UTC) \n While I know you weren't aware of it, I think that you need to take a look at the page  prior to  the major clean-up I performed on it on 7 June, and also  before  it had categories. Also, I suppose it was rather ambiguous with the Saunders Triplets occupying a cell that spanned five columns, but I don't feel \"Baby Harry Potter\" merits its own row as we have the attribute '(y)' for younger, so I compromised and went with the way I did Hagrid as younger. I anticipate the changes you're going to make eagerly, but I just thought you should know the drastic changes it's gone through in three weeks' time. -- Fbv 65 e del  /  ☑t  /  ☛c  || 02:53, 2 July 2006 (UTC)\n As far I am concerned it looked really bad having, Baby Harry Potter as Saunders Triplets have 5 columns. Have you fixed all the young verisons?  ForestH2  |  +  |  √+  |  √  |  √-  |  -  02:57, 2 July 2006 (UTC)\n you should probably note \"Saunders Triplets (Harry as a baby)\" because until I read this, I had no idea what that was a reference to.  —Preceding  unsigned  comment added by  208.100.207.122  ( talk ) 23:49, 19 September 2007 (UTC) \n Remus is/was Hogwarts teacher [ edit ] \n I'd categorize Remus as staff of Hogwarts not as a member of the OoP. His role in PoA was significantly greater than his better cameo in OoP. Also Firenze was part of Hogwarts staff for a time, which should qualify him for entry in that category. Whether Moody should be moved to the staff section also is open for discussion as he didn't actually teach himself. -- Mirage GSM  10:23, 1 February 2007 (UTC) \n Requested move [ edit ] \n The following discussion is an archived discussion of the proposal.  Please do not modify it.  Subsequent comments should be made in a new section on the talk page. No further edits should be made to this section. \n List of Harry Potter films cast members  →  List of Harry Potter films' cast members  — Gramatical error, alternatively  List of cast members in the Harry Potter films . More wordy but easier to read  Simply south  23:18, 3 April 2007 (UTC) \n Survey [ edit ] \n Add   # '''Support'''   or   # '''Oppose'''   on a new line in the appropriate section followed by a brief explanation, then sign your opinion using ~~~~. Please remember that this survey is  not a vote , and please provide an explanation for your recommendation. \n Survey - in support of the move [ edit ] \n Survey - in opposition to the move [ edit ] \n Oppose  The article name is fine as is. \"Harry Potter films\" is an adjectival phrase and so doesn't need to be made possessive. If we were only talking about a single film, for example, I don't think anyone would object to \" Harry Potter and the Goblet of Fire  cast members\" and want to change it to \" Harry Potter and the Goblet of Fire  's cast members\". \"Harry Potter films cast members\" is the same as the first construction, but plural. -- Shelf Skewed   talk  21:36, 13 April 2007 (UTC) \n Oppose  I agree that there is no grammatical error here, and thus in opposition to  this  move. I have comments below about other moves. -- Fbv 65 e del  /  ☑t  /  ☛c  || 03:51, 14 April 2007 (UTC) \n Discussion [ edit ] \n Add any additional comments: \n See the convention in  Category:Actors by drama television series . I think  List of Harry Potter cast members  would be best and no one would confuse it for the novels. – Pomte  00:49, 4 April 2007 (UTC) \n That sounds clear to me, until there's a Broadway musical. I support removing \"films\".  Dekimasu よ!  13:51, 9 April 2007 (UTC)\n When I renamed this page from  Harry Potter cast  I just wanted to be absolutely clear. I thought that throwing in the \"films\" wasn't that annoying, and it certainly straightened up any sort of weird doubts one might have. But if there's consensus for just the  List of Harry Potter cast members , that's okay with me. -- Fbv 65 e del  /  ☑t  /  ☛c  || 03:51, 14 April 2007 (UTC) \n The above discussion is preserved as an archive of the proposal.  Please do not modify it.  Subsequent comments should be made in a new section on this talk page. No further edits should be made to this section. \n While the title \"List of Harry Potter cast members\" may be acceptable to most participants in this debate, there is no compelling reason to move to that title, since there is no problem with the existing title.   It was  requested  that this article be renamed but there was no consensus for it be moved.  -- Stemonitis  06:33, 15 April 2007 (UTC) \n Pomfrey [ edit ] \n I saw Pomfrey in the 1st and 3rd movie two she is in the background also I saw Kate Bell,Angelina Johnson Oliver Wood and Alica Spinnet in the 3rd movie at the Imfirmary and the match. and I think Lee Jordan was in the background of the 4th. I don't know where to put this but I saw the back half of Fang in the 3rd movie when Harrys telling Hagrid it will be alright and Trever the Frog in Longbottom's hands when the Fat lady is singing \n key [ edit ] \n The key indicates various things, but not what dark grey is.  70.55.86.129  07:34, 4 July 2007 (UTC) \n Susan Bones, Hannah Abbott sources [ edit ] \n Um, all of the Hogwarts school students or at least more of them are listed as \"Will not be casted\" with a reference to  this  which says nothing about cutting any characters except for Luicus Malfoy in the Ministry of Magic. If someone could point me to the real source we are trying to get or something I missed in the article, please let me know.  Hornberry  14:35, 9 July 2007 (UTC) \n Hmm, it's not the most reliable of sources anyway, regardless of the fact that you're right, it doesn't mention any students; I'll remove it. -- Fbv 65 e del  /  ☑t  /  ☛c  || 23:00, 9 July 2007 (UTC) \n Sorry, I see now where the error was. The note \"will not be cast\" does not apply to all the cells in the section; just to the one whose row it's in. So, Bletchley will not be cast because the source confirms Quidditch is cut. Same with Pucey and Hooch. In any case, though, I'll change the source to a more reliable one which also confirms there's no Quidditch. -- Fbv 65 e del  /  ☑t  /  ☛c  || 23:02, 9 July 2007 (UTC) \n Elanor Columbus was seen in a cameo role in the 4th film, can someone edit and add her in GoF 219.74.73.237  17:50, 5 August 2007 (UTC)ray \n Sorry, it needs a source. Can you find a  verifiable   citation  to prove so? -- Fbv 65 e del  /  ☑t  /  ☛c  || 21:33, 5 August 2007 (UTC) \n i can't find any internet source for the Eleanor Columbus cameo but I watched the film again today and she is indeed in it. After Harry has returned from the graveyard confrontation and Mr. Diggory is grieving over Cedric's body they show various shots of the crowd. One of them is a shot of Neville and next to him is indeed Eleanor Columbus. ( 84.196.130.213  ( talk ) 20:15, 31 October 2008 (UTC)) \n Deathly Hallows [ edit ] \n With the release of the seventh book, it is now possible to fill in the seventh column with dark/light grey cells, corresponding to which characters appear \"on-screen\" in the book. I'd be happy to make a start on this. Would this be appropriate?  Tesseran  05:18, 22 July 2007 (UTC) \n Personally I feel we shouldn't add a seventh column until all casting is confirmed for the sixth film. Then you could start to get confused with double darks for some characters, or a light and then a dark or a dark and then a light. Best to hold off, I'd say. -- Fbv 65 e del  /  ☑t  /  ☛c  || 21:34, 5 August 2007 (UTC) \n Nigel [ edit ] \n Why does Nigel have a dark grey cell? 68.6.83.188  01:16, 17 August 2007 (UTC) \n It's a light grey cell. He does not appear in the book. \n Do mentions of seeing people count as appearances? [ edit ] \n I would say no. If Harry sees somebody in passing, and that person has no other role (e.g. Cho in HBP), does that person \"appear\" in the book? Realistically, I think we can determine that the filmmakers aren't going to rehire Katie Leung just so that Harry can see her on the train, but in the Wikipedia way of thinking, what do other people think is the appropriate thing to do? -- Fbv 65 e del  /  ☑t  /  ☛c  || 02:58, 12 September 2007 (UTC) \n Well I think it is a book appearance... But I dont know if Cho will be in the film version (as we know they love to cut stuff out). We'll probably not see her on the train, but you never know. And the thing about \"seeing people count as appearances\" isnt that the whole deal? I mean, she is seen on the train and therefore appear in the book, she is mentioned in \"real time\", not like \"Oh I saw Cho 5 weeks ago\" right?  Chandler talk  14:59, 17 September 2007 (UTC)\n I don't have the book handy, but I believe it's something like Harry saw Cho in the distance on the train or something. The reason I bring it up is because the HP Lexicon doesn't count it as an appearance in their  Readers' Guide . -- Fbv 65 e del  /  ☑t  /  ☛c  || 16:53, 17 September 2007 (UTC)\n I have the book handy (though not english version), and it is something like: Everybody is trying to get a look at harry, except cho who runs into her compartment. Than harry goes past it and look in at cho to see that she is in a conversation with her friend.  Chandler talk  17:17, 17 September 2007 (UTC)\n \"The exception was Cho Chang, who darted into her compartment when she saw Harry coming.\" So it is entirely feasbile that she could be in the film, (although not very likely) just as Harry walks to to the Slug Club. But Harry does see her, the next sentence says Harry looked into her compartment. So she \"does\" appear in the book. But yeah, things like the many mentions of Stan Shunpike do not count as an appearance.  Gran 2  17:19, 17 September 2007 (UTC)\n Very well then. We'll count it as an appearance. -- Fbv 65 e del  /  ☑t  /  ☛c  || 00:57, 18 September 2007 (UTC) \n To clarify, all the people who I added as being seen at Dumbledore's funeral are not simply mentions like, \"Harry said, 'Oh, I saw Umbridge a couple hours ago.'\" It's the narration of the book saying that Umbridge, and all the other people who I added, are present in the scene but without dialogue. They are seen by the narrator, not the characters. -- Fbv 65 e del  /  ☑t  /  ☛c  || 14:38, 27 September 2007 (UTC)can someone make jessie caves profile shes been in loads of projects im surprised nobodys made one before \n Katie Leung will resume her role as Cho Chang for a brief role. I'd say she would have a line but I think she should be put down regardless.  —Preceding  unsigned  comment added by  213.202.174.150  ( talk ) 20:21, 2 June 2008 (UTC) \n Older versions of List [ edit ] \n For those interested as to what this list would have looked like had it been around at the release of films two through five, I have designed four subpages to document this. They can be found at  After 2 ,  After 3 ,  After 4  and  After 5 . At the release of the sixth film I will create another subpage. Please do not edit these pages with factual information; edits should only be made for spelling or formatting. Just something which had been interesting me for a while. It's pretty cool to go back and forth quickly between two pages (using apple+[ and apple+] for me) to show how things progressed between films. -- Fbv 65 e del  /  ☑t  /  ☛c  || 19:09, 23 September 2007 (UTC) \n Added some info on the first film as people would like to see what actors were cast at the time of the realease of film one, also wih the release of the sixth film I also updated that article as well.  pday2387  ( talk ) 11:05, 8 September 2009 (UTC) \n Person in 3rd movie [ edit ] \n There was a person in the 3rd movie.... he was the one that read to harry about \"the grim\"... i dont think he was in the book but he wasnt anyone from the other movies.... does any one know??  —Preceding  unsigned  comment added by  Agarden  ( talk  •  contribs ) 10:45, 22 January 2008 (UTC) \n I've read in a few places that his name is \"Bem\" and played by Ekow Quartey, but there's no source to confirm this, sorry. Ekow Quartey is in the IMDb credits for the film those he's credited as playing \"Boy #1\" I think. -- Fbv 65 e del  —  t  —  c  // 03:15, 27 January 2008 (UTC) \n Characters who could appear in two or more headers [ edit ] \n Based on a comment in the edit history, I've just been thinking about somebody like Quirrell who could appear under both the \"Hogwarts staff\" and \"Death Eaters\" headers -- what should we do with him? I mean, it would be nice to be complete under either of them, so should we list him twice? That might seem a little unprofessional though. I am still leaning towards Death Eaters but somebody who's only a film watcher would probably associate him more with Hogwarts staff. Any other thoughts? -- Fbv 65 e del  —  t  —  c  // 03:22, 27 January 2008 (UTC) \n No. Including them once is fine, just put them in the area that they are most associated with. As for Quirrell... I suppose he was a teacher for more of the film.  Gran 2  07:32, 27 January 2008 (UTC \n Slightly Creepy Boy = Michael Corner [ edit ] \n Though I don't have an \"official link\" or any source, Slightly creepy boy is in fact Michael Corner, the Ravenclaw guy that dated Ginny Weasley. He appears next to her in the Hog's Head part of the movie. Thought I should at least say it =/ \n Well, you think it's Michael Corner, and I think it's Michael Corner, but WB doesn't, and that's what makes him Slightly Creepy Boy. If we had a source, I'd change it in a heartbeat. But he's not called that (honestly, for all we know, he could just be John Smith who happens to have Corneresque traits), so we can't change it. Sorry! -- Fbv 65 e del  —  t  —  c  // 22:25, 2 February 2008 (UTC) \n If you've a source/citation, we'll be sure to put it up.  BlackPearl14 Pirate Lord-ess  23:19, 2 February 2008 (UTC) \n Colin Creevey [ edit ] \n You put a light grey header under colin creevey in \"Deathy Hallows\" but since colin hasn't appered in any movies after \"Chamber of secrets\" and the only time we see him in that book is when he's dead, it's very unlikely the actor will come back. they probably won't have a real person play colin's body, and it will probably be nigel that will die.  —Preceding  unsigned  comment added by  67.150.175.194  ( talk ) 16:30, 27 February 2008 (UTC) \n You never know, everyone doubted Katie Leung would come back to be cast in a scene were she darts into her compartment when she see's Harry but yet they've been proved wrong. So you never know, there's still a possibility. -- Jammy  ( talk ) 17:58, 27 February 2008 (UTC) \n Bellatrix in goblet of fire [ edit ] \n Is it possible that bellatrix was cast for goblet of fire, but her scene was cut, and not released on the dvd?  —Preceding  unsigned  comment added by  66.53.211.199  ( talk ) 16:38, 29 February 2008 (UTC) \n She was in Azkaban in the Goblet of Fire, so why would they add her in the movie? She first appears in Order of the Phoenix, and I wish you would stop asking questions about deleted scenes. -- Jammy  ( talk ) 20:30, 29 February 2008 (UTC) \n Editors shouldn't be answering questions like this one, just deleting them - they're off topic; the purpose of talkpages is to discuss improvements to the relevant articles. In future, just delete these types of 'In universe' questions or answer them on the editor's talkpage.  Anchoress   ·   Weigh Anchor   ·   Catacomb  23:16, 4 March 2008 (UTC) \n Susie Shinner [ edit ] \n Susie Shinner redirects here, listed as the actress playing Lily Potter as a young woman in the  Potter family  article, but she isn't listed here.  Anchoress   ·   Weigh Anchor   ·   Catacomb  23:14, 4 March 2008 (UTC) \n I'll update the  Potter family  article. She was originally cast, according to a UK newspaper (forgot which one at the moment) and a studio still was released of her with Harry in the background; however she did not appear in the film nor its credits, and was not in any deleted scenes either. Thus technically he is not in the movie in any form, and there is no source other than photographic evidence, which does not give a definitive statement, to say what happened to her, unlike with, say, Rik Mayall (Peeves), where there exists a source to say he filmed scenes but none were ever distributed. I strongly suspect, in my own personal opinion, that Shinner shot scenes but they just were cut when they trimmed down that scene she was in. However, we'll have to wait for a source to confirm this before we write anything. -- Fbv 65 e del  —  t  —  c  // 02:17, 5 March 2008 (UTC) \n Jessie Cave as Lavender Brown! [ edit ] \n We need a new page for the cute girl playing Lavender Brown in the sixth movie, Harry Potter and the Half-Blood Prince. I am a noob at creating new pages, so please help! We also need pictures of her in the page, \"List of Hogwarts students\". Agree with me, she is cute! -N0tverycreative 5:43 pm, April 12, 2008 \n Tonks' Role as an Auror [ edit ] \n Shouldn't Tonks be placed under \"Ministry Employees\" and not \"Other Order Members\"?  —Preceding  unsigned  comment added by  4.235.84.102  ( talk ) 06:44, 14 June 2008 (UTC) \n Ralph Fiennes [ edit ] \n Why is Ralph Fiennes not listed as in the chart as playing Voldemort for the new film?  greek lamb  ( talk ) 17:52, 14 August 2008 (UTC) \n Because he isn't in it.  Gran 2  18:00, 14 August 2008 (UTC) \n Richard Griffiths, Fiona Shaw [ edit ] \n The article linked to by the footnote (#52) does  not  say that Griffiths and Shaw will not be in  Deathly Hallows . It only says that a) they will not be in the sixth film; b) Griffiths asked J.K. Rowling to expand Vernon Dursley's role and she said 'No'.  eb  ( talk ) 11:26, 10 December 2008 (UTC) \n Percy in HBP? [ edit ] \n Okay, why is there still a light grey cell under Percy in HBP? He was comfirmed cut way back in 2007, so I find it shocking no one has updated this.  —Preceding  unsigned  comment added by  67.182.157.63  ( talk ) 16:37, 15 January 2009 (UTC) \n Colour for confirmed \"will not appear\" [ edit ] \n might it not be easier to use the same colour as in film 1-5 for film 6-7 for when it's confirmed that they won't appear in either 6 or 7, keep the notes and all that, but place them under lightgray. This would leave the darkgray to only unconfirmed roles that are in the books. thoughts? —  CHAN DLER #10  — 09:23, 16 February 2009 (UTC) \n Agreed, I think \"not yet confirmed\" and \"confirmed will not appear\" should be two different colors.  Mike R  ( talk ) 15:46, 26 February 2009 (UTC) \n colspan=\"1\" needed? [ edit ] \n I am not a web guru but it seems to me that in the table,  colspan=\"1\"  is not needed. Am I wrong?  Mike R  ( talk ) 15:46, 26 February 2009 (UTC) \n Somewhat Doubtful Boy [ edit ] \n I know that this character is listed in the credits as Somewhat Doubtful Boy, but I think there should at least be a note saying that he is Zacharias Smith, and his name should link to the page that includes that character in the books. Besides the fact that is character is virtually the same as Zacharias Smith in the books, the exact same character (same likeness and same voice actor) is called Zacharias Smith in the official video game. I think there should at least be a note saying that.  Christophee  ( talk ) 01:43, 1 April 2009 (UTC) \n Cho Chang [ edit ] \n In the article Katie Leung is listed as Cho Chang in  Goblet of Fire ,  Order of the Phoenix  and  Half-Blood Prince , but I haven't seen her in the latter one. Was she on the train or something? Maybe I didn't spot her. -- Exephyo  ( talk ) 10:03, 16 July 2009 (UTC) \n She certainly filmed scenes for the film, as evidenced by the reference next to her name. I stayed for the credits afterwards and I'm pretty sure she was there, near the end, and the credits were in appearance order, so it's possible she appeared in the scene following Dumbledore's death where everybody lifts their wands to the skies. Can't be sure though. I'll check it out next time I see it. -- Fbv 65 e del  —  t  —  c  // 20:19, 23 July 2009 (UTC) \n Narcisa Malfoy [ edit ] \n Narcisa is not a Death Eater, Rowling herself said it. She only symphathizes with theri ideology. She should be replacen in other section.-- Luke in spanish  ( talk ) 20:29, 11 August 2009 (UTC) \n Professor Trelawney [ edit ] \n Please tell me that they did not actually recast the role for the final film and that this is some kind of joke.  74.14.119.88  ( talk ) 05:07, 21 December 2009 (UTC) \n Lily Potter (young), Order of the Phoenix [ edit ] \n A young Lily Potter appeared in  Order of the Phoenix .  [1]  She was played by Susie Shinner but her scene was cut. As Peeves and his actor are added, Shinner should be.  Alex Douglas  ( talk ) 06:46, 7 April 2010 (UTC) \n Done.  Lizzie   Harrison  08:14, 7 April 2010 (UTC) \n Suggestion [ edit ] \n Could the list please be organised better. The sections are fine, but the placing of the characters in each sections lacks logic are all over the place. If you have a look at  Spider-Man_(film_series)#Cast_and_characters , the characters are staggered from order of first appearance, so it's like a medal table of sorts. First table is gold, second is silver, third is bronze, etc. It looks better, is logical, and would improve this article. A few film series used to be nice looking like this, but as more films came out, randoms added new characters and the whole thing just gets messy. Anyone else think it would be a good idea to rearrange the characters into something like this?  IAmTheCoinMan  ( talk ) 07:40, 15 May 2010 (UTC) \n King's Cross railway station security guard, Deathly Hallows & Madam Rosmerta confusion & Weird Sisters [ edit ] \n The King's Cross railway station security guard will appear in Deathly Hallows. Harry Taylor is to reprise his role. This should be added. ( http://www.the-leaky-cauldron.org/2010/5/24/first-photos-of-adult-harry-and-ginny-from-deathly-hallows-epilogue ) \n Also, Madam Rosmerta has a dark grey cell; indicating she appears in the DH book. Her name is not mentioned. The \"Battle of Hogwarts\" chapter mentions that \"several shopkeepers and owners of stores\" appear, yet the only one mentioned by name is Aberforth Dumbledore. I suggest her dark grey gell be changed to a light grey cell and still keep the \"will not appear\" text. Thanks!  Alex Douglas  ( talk ) 13:10, 26 May 2010 (UTC) \n Also, in  Goblet of Fire , the Weird Sisters appeared. Regardless, it must still be mentioned. Steve Mackey portrays Donaghan Tremlett, Phil Selway portrays Orsino Thruston, Jonny Greenwood portrays Kirley Duke and Steven Claydon portrays Gideon Crumb. Jarvis Cocker also portrayed Myron Wagtail, but this is already in the list. Thanks!  Alex Douglas  ( talk ) 13:17, 26 May 2010 (UTC) \n Grey Lady, Deathly Hallows [ edit ] \n Senior news editor for  The Leaky Cauldron (website)  and former  PotterCast  host Sue Upton has reported that  Kelly Macdonald  will play the Grey Lady in  Deathly hallows .  [2]   Alex Douglas  ( talk ) 05:29, 8 June 2010 (UTC) \n Wlinks in headers [ edit ] \n I  preserved  Wlinks an editor removed in the table's headers to the WPdia H/P \"characters\" and \"film series\" pages. Compare to the chart at \" List of Chronicles of Narnia cast members \" and elsewhere.-- 71.187.173.34  ( talk ) 06:07, 26 June 2010 (UTC) \n There is an edit war over these links. I will bring further deletion of these Wikilinks to  WP:ANI  unless the same is discussed here.-- 68.197.105.51  ( talk ) 22:16, 27 June 2010 (UTC) \n Two columns for Deathly Hallows [ edit ] \n I was thinking that, as we know when the two films will be split, and which characters appear in which parts, it may be useful to make two collums for the two Deatly Hallows films. I would be willing to make a start on this, but if anyone thinks we shouldn't please let me know, or I will begin soon. -- Joeworthy  ( talk ) 17:16, 17 March 2010 (UTC) \n I saw you have been  BOLD  and did it. I think it is a good idea, but you must keep in mind that this will have to be actualized when the full credit comes out with the movies. There might be scene that are cut, or unannounced cast member. Seams great for the moment in my opinion. -- Stroppolo talk  22:18, 19 March 2010 (UTC) \n I hope you like what I've done and I know that it will need to be kept more thoughrally updated now, but I think its worth it. I did this in a bit of a hurry and so there is probably many mistakes, and if anyone spots any, please change them. Thanks, and please no-one change it back to one collum because it took me ages. -- Joeworthy  ( talk ) 22:50, 19 March 2010 (UTC) \n If someone changes it because there is too many mistake, you can still get what you have done back with the history. I would recommend you to take your time so that everything is exempt of mistake. Also, please leave edit summary : so that people see what you are doing, and maybe a link to the talk page, here, so that they can join the discussion if they object or have question. Have a good day!-- Stroppolo talk  23:19, 19 March 2010 (UTC)\n Due to the fact that not all actors in Hallows part 1 will necessarily be seen in Hallows part 2 and vice versa, I have added an additional column for Hallows part 2. (And btw, the encyclopedia isn't going to incrementally improve if good-faith edits are to be reverted with missing or misleading rationales given.) \nAlso note that all additions of actors names to the chart should be accompanied by a published source.-- 71.187.173.34  ( talk ) 05:59, 26 June 2010 (UTC) \n W/regard to a contributor's recent, pointless reversion of the extensive coding work already discussed within this talkpage section, I would like to give hi/r an opportunity to explain hi/rself before I turn to  wp:ani . In violation of WP's ideals of welcoming constructive contributions and cooperating well with collaborators, s/he neither responded to the guideline cited nor the commentary here on the talkpage. I would request that this individual please consider rebutting the application of appropriate policy and also to achieve consensus before further reversion of this meticulous and painstaking coding work.-- 68.197.105.51  ( talk ) 22:01, 27 June 2010 (UTC) \n I am not in opposition to the inclusion of two columns for  Deathly Hallows  given the nature of the two-part film adaptation. At this point, however, there has been no announcement regarding which actors/actresses will appear in which adaptations, and yet all are listed (as of the current revision) in both columns with the curious exception of Mrs. Cole (portrayed by Amelda Brown). Furthermore, there are uncited claims of a few actors returning to their roles; without sources, these assumptions cannot be made, and for some reason, the actors who do not have a Wikipedia page are linked anyway, creating the dead red link. Is this necessary? I await a response. And for the record, I have explained the nature of my edits in all my edit summaries, thus omitting the uncanny idea of negligence or a lack of civility.  Never Mystic  ( t c ) 00:34, 28 June 2010 (UTC) \n IMO the issue turns on what is/is not to be thought of as precipitous editing. Contributors had noticed the need and stepped in to provide this coding, which it appears agreed by all will eventually be necessary. Is adding this coding  precipitous?  The reason I don't believe it is, is because such coding simply ain't  click, click, and we're done --it takes a good hour- plus  of clicks along with figuring out the whys and wheres of making them; thus, leaving the coding in allows whomever to be added and even assigned to one column or the other with no need to invest hours of research/time to figure out how to do so (this is why basic editing guidelines are written the way they are, especially at  WP:PRESERVE ); and, yet, note that at present, to all extents and purposes, only one column is  used. \n As for precipitous additions of Amelda Brown et al, the discussion of whether to use single-column or double-column has absolutely zero relation to such questions. Per basic editing guidelines, the proper response to such unsupported contributions is either fact tag, if the information seems likely to be true, or else simply to remove them.  And, in point of fact,  Amelda Brown  had already been removed  prior  to Never Mystic's ( precipitous? ) deletion of the complex and eventually-needed coding for the double column . \n Peace out. (Btw, note that there is one place on the chart which doesn't perhaps have sourcing and, indeed, I've just \"fact tagged\" it. :~) -- 71.187.173.34  ( talk ) 01:48, 28 June 2010 (UTC) \n --And fact-tagged \"Amelda Brown.\"-- 71.187.173.34  ( talk ) 01:54, 28 June 2010 (UTC)\n Never Mystic, I finally  get  your point that a column break implies a level of precision that at present we're lacking, hence I've put \"2010/2011\" together into a single column for the time being--nonetheless retaining the coding for an eventual 9th column, per the above commentary. Thanks and sorry.-- 71.187.173.34  ( talk ) 02:13, 28 June 2010 (UTC)\n It's fine. That's what these discussions are for and I see we've made good progress. In fact, the chart looks more organized, and, yes, is appropriate considering the lack of information released to the public pertaining to who is in which adaptation. The only concern of mine that remains is listing George Harris or Peter Perry among others because \"the information seems likely to be true\"—we still don't know if it's \"likely\", and shouldn't have the information included in the article if it's not fact, which is a basic guideline of Wikipedia. I propose to remove all speculative information unless it can be substantially justified (and with a source, not \"likeliness\").  Never Mystic  ( t c ) 02:29, 28 June 2010 (UTC) \n Per above, I've removed the red links and all  unsourced claims .  Never Mystic  ( t c ) 19:49, 29 June 2010 (UTC) \n Time to restore DH split? [ edit ] \n Since  Deathly Hallows, Part 1  has been released, we should be able to find a reliable source listing its cast and split the last column accordingly. (Is  Yahoo! Movies  a reliable source, or is it user-edited like IMDb? What about  IMDb , once the film has opened? How about  Fandango ?) I can't seem to get the film's official site to load at the moment, but perhaps there's a cast list there. At any rate, I think that it should be possible to get a cast list from a reliable source, and re-split the column. — Josiah Rowe   ( talk  •  contribs )  05:01, 28 November 2010 (UTC) \n Layout [ edit ] \n I am not sure why the layout had to be redone per film appearances (first through seventh/eighth), but doing so has made the list disorderly in that it was originally alphabetical. The way that  User:IAmTheCoinMan  edited it to me seems like a random preference of the material. Comments and/or concerns?  Never Mystic  ( t c ) 05:29, 10 July 2010 (UTC) \n I did it as all the the character section pages used to be like on multiple film series pages, it looks a lot better and is generally done by order of appearance/number of. See how  Pirates_of_the_Caribbean_(film_series)#Principal_cast  is done, the main characters are up the top as a result of this listing. same with  Spider-Man_(film_series)#Cast_and_characters . Don't you think it looks better and uses a more relevant way of listing characters, ie by the role of the characters rather then the order of letters in a alphabet. I know other stuff exists, and the same would go for the reverse of what I'm saying, but why should the character listing in a section be done on something as irrelevant as the orders of letters in an alphabet?  IAmTheCoinMan  ( talk ) 15:17, 11 July 2010 (UTC) \n Ralph Fiennes (f) in Half-Blood Prince [ edit ] \n At 1:51:06, Ralph Fiennes appears for a few frames, where footage from an earlier film was used.  Here's a screenshot!  This should be added to the article. Thanks!  Alex Douglas  ( talk ) 12:10, 21 July 2010 (UTC) \n Tonks Parents? [ edit ] \n Are they not going to appear? They played a pretty big part in the book.  —Preceding  unsigned  comment added by  Micahthemann  ( talk  •  contribs ) 02:04, 10 August 2010 (UTC) \n Some Actors We Should Add At the Top [ edit ] \n I know it says only do two-film actors, but one must admit that Julie Christie, Bill Nighy, and Kenneth Branagh are three extremely famous actors that, though only appearing in one film each (Nighy might actually be in both DH's) they should be included in a list of famous actors that appear in the Potter films. Also, Robert Hardy, Natalia Tena, Miriam Margoyles, Gemma Jones, David Bradley, and George Harris have all been in more than one film should we add them even though they are not that famous? I'm definitely adding John Cleese, as he is very famous and he appeared in the first two films.  Evil Genius77  ( talk ) 23:53, 16 August 2010 (UTC) \n I am of a new point on the matter after speaking with  Fae . I believe we should add Christie as well as Branagh, as both are Oscar and BAFTA nominees, but otherwise we should leave the list the same. I do not know if we should add Nighy, as he is a renowned actor, though has no such credentials as Christie and Branagh do.  Evil Genius77  ( talk ) 22:30, 18 August 2010 (UTC) \n Flitwick vs Macnair [ edit ] \n The reasoning behind not putting Warwick Davis's name in the Flitwick row in Prisoner of Azkaban was because he was credited as 'Wizard'. Why then is Peter Best in the Walden Macnair section in Prisoner if he was cast as 'Executioner'?    The Windler   talk    05:19, 18 August 2010 (UTC) \n I think both have been retconned seeing as the Executioner is Walden Macnair in the novels, and since Flitwick and the Choir Conductor have been retconned to be the same person (see the Half-Blood Prince line \"Emergency Choir Practice\" on the way to Hogsmeade) I agree with you.  Evil Genius77  ( talk ) 22:25, 18 August 2010 (UTC) \n Young Snape [ edit ] \n ...will be played by Benedict Clarke in DH part 2 - source is his twitter:  https://twitter.com/theyoungsnape  I found the link to his page via that of Will Dunn who plays James Sirius Potter. Can we take note of him?  —Preceding  unsigned  comment added by  86.179.167.27  ( talk ) 15:41, 24 December 2010 (UTC) \n Cedric in Third Film [ edit ] \n Addition of actor that played Cedric Diggory in the third film. I dont think they were actually creditted as Cedric but as Hufflepuff Seeker. (The one that gets electrocuted) That was Cedric...Not sure how to add to wikipedia yet or anything for that matter so just putting this out there. -- 121.217.210.16  ( talk ) 12:22, 15 February 2011 (UTC) \n John Paul Castrianni [ edit ] \n None of his involvement with the film franchise has been verifiable. All sources (Casting Call Pro, IMDB) can be edited by himself. Interviews with him are unsourced. Also so far as I am aware studios don't regularly let uncredited extra's give interviews with large fansites.. \n Furthermore he has been caught out vandalizing the wikipedia page of his school in order to include him as the \"Eighth Earl of Norbury\" (which he demonstrably is noe) and also an actor from the Harry Potter films. It is obvious that this guy is editing wikipedia/other places in order to enhance his image as a largely unheard of actor, but Wikipedia should not play a part in his vanity. Thus I have removed him from the article until a source is found which is not manufactured by him. \n It would not be acceptable if I made a page saying I had a position then created a vanity page, thus editing yourself into other things for vanity's sake should not be allowed. \n Discussion here which highlights many of the problems with Castrianni's \"involvement\" and proof he has been involved in past wikipedia vandalism.  http://harrypotter.wikia.com/wiki/Category_talk:Candidates_for_deletion#.22Lord.22_John_Paul_Castrianni   JamieHughes  ( talk ) 18:27, 10 May 2011 (UTC) \n In the \"ghosts\" section it says that one of the ghosts is Rowena Ravenclaw. [ edit ] \n This is false, and I beg someone to change it. Anyone who has paid attention to the last few chapters of Deathly Hallows knows that Rowena Ravenclaw is  not  a ghost. The Gray Lady is not Rowena but her daughter, Helena. \n In the \"ghosts\" section it says that one of the ghosts is Rowena Ravenclaw. [ edit ] \n This is false, and I beg someone to change it. Anyone who has paid attention to the last few chapters of Deathly Hallows knows that Rowena Ravenclaw is not a ghost. The Gray Lady is not Rowena but her daughter, Helena.  — Preceding  unsigned  comment added by  Darbygrl  ( talk  •  contribs ) 20:07, 7 July 2011 (UTC) \n Unnamed Characters [ edit ] \n I was wondering if unnamed characters should appear on this list? For there are many unnamed characters that appear in the movies and are credited, but only a few are listed here. (Slightly Creepy Boy, Lift Voice, Newspaper Vendor, King's Cross railway station security guard, TV Weatherman, Waitress, Karkaroff's aide, Daily Prophet reporter, Diagon Alley father, Food Trolley lady, Leaky Cauldron Maid, Goblin, Goblin Bank Teller and Shrunken Head) Why are only these characters listed here? Shouldn't they be removed from this page? -- JWHolland  ( talk ) 11:57, 10 July 2011 (UTC) — Preceding  unsigned  comment added by  JWHolland  ( talk  •  contribs ) 11:28, 10 July 2011 (UTC) \n Disguised Roles [ edit ] \n how about them? because of polyjuice potion other cast members play the roles of Harry, Hermione, Ron, Prof. Moody and more. shouldn't they be mentioned in the list?  — Preceding  unsigned  comment added by  194.153.217.248  ( talk ) 11:49, 10 August 2011 (UTC) \n Comma to be removed [ edit ] \n I found: \"Some well-known British actors who have not appeared in the series, are asked in jest why they have not been cast.\" The comma should be removed. \n Edit request from 128.63.16.82, 10 August 2011 [ edit ] \n This  edit request  has been answered. Set the  |answered=  or  |ans=  parameter to  no  to reactivate your request. \n 128.63.16.82  ( talk ) 17:41, 10 August 2011 (UTC) \n   Not done:  Submission is blank.  Topher385  ( talk ) 18:28, 10 August 2011 (UTC) \n New way to list cast [ edit ] \n I don't know if this contradicts any WP policies, this is just a more objective alternative to the current way of listing. I've devised a point system for the Harry Potter cast based on how they are billed in the CREDITS of the Harry Potter films. There are six levels: \n 6 points - Daniel Radcliffe, first billing. \n 5 points - Rupert Grint and Emma Watson, secondary (and alphabetical) billing. \n 4 points - cast members presented by themselves after the three principals in alphabetical order (for example, Alan Rickman, Ralph Fiennes, and Maggie Smith are listed in this section.) \n 3 points - cast members presented with one other cast member at a time after level three alphabetical order (for example, Tom Felton, Warwick Davis, and Mark Williams are listed in this section.) \n 2 points - cast members listed alphabetically after level four (this occurs only in Philosopher's Stone, when David Bradley and Tom Felton are listed after level 4, in Chamber of Secrets, when six adult cast members are listed after level 4, and in Goblet of Fire, when Stanislav Ianevski, Clémence Poésy, and Robert Pattinson are listed after level four.) \n 1 point - cast members credited only in the \"official\" credits used by IMDB, listed in order of appearance after the end of the \"fancy\" credits, if you will (for example, Matthew Lewis, Evanna Lynch, and Devon Murray are credited solely in this section.) \n I have gone through the official credits for all of the films and created a master-list of all of the actors credited in each film, assigning them points based on their billing. I have changed the names of the characters from their credited names (which also occasionally change from film to film) to those used as the titles of articles on the Harry Potter Wiki. This was done purely as part of my Harry Potter geekiness, and changing the names back would be simple. So, without further ado, here is the cast list for all those cast members who earned at least two points throughout the series (I can provide those who earned only one point as well, but we'd have a serious problem with notability): \n Daniel Radcliffe as Harry Potter – 48 \n Rupert Grint as Ron Weasley – 40 \n Emma Watson as Hermione Granger – 40 \n Robbie Coltrane as Rubeus Hagrid – 32 \n Alan Rickman as Severus Snape – 32 \n Maggie Smith as Minerva McGonagall – 28 \n Michael Gambon as Albus Dumbledore – 24 \n Warwick Davis as Filius Flitwick/Griphook /Gringotts Head Goblin – 23 \n Tom Felton as Draco Malfoy – 23 \n Julie Walters as Molly Weasley – 22 \n David Bradley as Argus Filch – 20 \n Richard Griffiths as Vernon Dursley – 20 \n Jason Isaacs as Lucius Malfoy – 20 \n Fiona Shaw as Petunia Dursley – 20 \n David Thewlis as Remus Lupin – 20 \n Mark Williams as Arthur Weasley – 20 \n Timothy Spall as Peter Pettigrew – 17 \n Helena Bonham Carter as Bellatrix Lestrange – 16 \n Ralph Fiennes as Voldemort – 16 \n Gary Oldman as Sirius Black – 16 \n Bonnie Wright as Ginny Weasley – 14 \n Brendan Gleeson as Mad-Eye Moody – 12 \n John Hurt as Garrick Ollivander – 12 \n Natalia Tena as Nymphadora Tonks – 12 \n Robert Hardy as Cornelius Fudge – 11 \n James Phelps as Fred Weasley – 10 \n Oliver Phelps as George Weasley – 10 \n Helen McCrory as Narcissa Malfoy – 9 \n Emma Thompson as Sybill Trelawney – 9 \n John Cleese as Nearly-Headless Nick – 8 \n Richard Harris as Albus Dumbledore – 8 \n Josh Herdman as Gregory Goyle – 8 \n Gemma Jones as Poppy Pomfrey – 8 \n Matthew Lewis as Neville Longbottom – 8 \n Devon Murray as Seamus Finnigan – 8 \n Clémence Poésy as Fleur Delecour – 8 \n Imelda Staunton as Dolores Umbridge – 8 \n Alfie Enoch as Dean Thomas – 7 \n Dave Legeno as Fenrir Greyback – 7 \n Geraldine Somerville as Lily Potter – 7 \n Nick Moran as Scabior – 6 \n Adrian Rawlins as James Potter – 6 \n Jamie Waylett as Vincent Crabbe – 6 \n Afshan Azad as Padma Patil – 5 \n Sean Biggerstaff as Oliver Wood – 5 \n Jim Broadbent as Horace Slughorn – 5 \n George Harris as Kingsley Shacklebolt – 5 \n Shirley Henderson as Moaning Myrtle – 5 \n Katie Leung as Cho Chang – 5 \n Miriam Margoyles as Pomona Sprout – 5 \n Harry Melling as Dudley Dursley – 5 \n William Melling as Nigel Wolpert – 5 \n Chris Rankin as Percy Weasley – 5 \n Miranda Richardson as Rita Skeeter – 5 \n Frances de la Tour as Olympe Maxime – 5 \n Kenneth Branagh as Gilderoy Lockhart – 4 \n Julie Christie as Rosmerta – 4 \n Ian Hart as Quirinus Quirrell/the voice of Lord Voldemort – 4 \n Rhys Ifans as Xenophilius Lovegood – 4 \n Toby Jones as the voice of Dobby – 4 \n Evanna Lynch as Luna Lovegood – 4 \n Kelly Macdonald as Helena Ravenclaw – 4 \n Bill Nighy as Rufus Scrimgeour – 4 \n Predrag Bjelac as Igor Karkaroff – 3 \n Scarlett Byrne as Pansy Parkinson – 3 \n Jessie Cave as Lavender Brown – 3 \n Shefali Chowdhury as Parvati Patil – 3 \n Louis Cordice as Blaise Zabini – 3 \n Abby Evans as Flora Carrow – 3 \n Ruby Evans as Hestia Carrow – 3 \n Pam Ferris as Marge Dursley – 3 \n Dawn French as the Fat Lady – 3 \n Ciarán Hinds as Aberforth Dumbledore – 3 \n Ralph Ineson as Amycus Carrow – 3 \n Isabella Laughland as Leanne – 3 \n Georgina Leonidas as Katie Bell – 3 \n Roger Lloyd-Pack as Barty Crouch Sr. – 3 \n Simon McBurney as the voice of Kreacher – 3 \n Peter Mullan as Yaxley – 3 \n David O’Hara as Albert Runcorn – 3 \n Robert Pattinson as Cedric Diggory – 3 \n Leslie Phillips as the voice of the Sorting Hat – 3 \n Anna Shaffer as Romilda Vane – 3 \n Freddie Stroma as Cormac McLaggen – 3 \n Danielle Tabor as Angelina Johnson – 3 \n Suzanne Toase as Alecto Carrow – 3 \n Zoë Wanamaker as Rolanda Hooch – 3 \n Arben Bajraktaraj as Antonin Dolohov – 2 \n Peter Best as Walden Macnair – 2 \n Ben Borowiecki as Angus – 2 \n Eleanor Columbus as Susan Bones – 2 \n Violet Columbus as Portrait of a Girl with Flowers – 2 \n Emily Dale as Katie Bell – 2 \n Louis Doyle as Ernie Macmillan – 2 \n Graham Duff as Squat, Wheezy Man – 2 \n Scot Fearn as Adrian Pucey – 2 \n Domhnall Gleeson as Bill Weasley – 2 \n Daisy Haggard as the voice of Ministry Lift – 2 \n Guy Henry as Pius Thicknesse – 2 \n David Holmes as Adrian Pucey and Slytherin Beater – 2 \n Emil Hostina as Male Death Eater – 2 \n Bob Yves Van Hellenberg Hubar as Death Eater – 2 \n Rod Hunt as Thorfinn Rowle – 2 \n Stanislav Ianevksi as Viktor Krum – 2 \n Tony Kirwood as Death Eater – 2 \n Penelope McGhie as Death Eater – 2 \n Ashley McGuire as Death Eater – 2 \n Peter G. Reed as Death Eater – 2 \n Granville Saxton as Death Eater – 2 \n Judith Sharp as Death Eater – 2 \n Charlotte Skeoch as Hannah Abbott – 2 \n Harry Taylor as King’s Cross Station Guard – 2 \n Luke Youngblood as Lee Jordan – 2 \n Feel free to check my math. This is simply an alternative, open for discussion. Thanks,  Evil Genius77  ( talk ) 01:02, 16 November 2011 (UTC) \n Movie Title Wrong [ edit ] \n At the top of the first column you have the title \"Philosopher's Stone\". The title of the first movie was \"Harry Potter and the Scorcerer's Stone.  — Preceding  unsigned  comment added by  66.190.233.132  ( talk ) 05:18, 5 December 2011 (UTC) \n The first film (and book) is called  Harry Potter and the Philosopher's Stone  in the UK, and  Harry Potter and the Sorcerer's Stone  in the U.S. As this is a British property, the UK titles are used. -- Rob Sinden  ( talk ) 12:00, 5 December 2011 (UTC) \n Fix up [ edit ] \n Now that the film series is over, I decided to clean up this article by removing the references since we already have the credits to reference. Since this article had many fan site refs, I made the article look even more like an FL. Cheers!  Guy546 ( Talk )  20:54, 1 January 2012 (UTC) \n Update: I just re-added a ref for Sean Biggerstaff because he isn't credited. If there are any other cast members like that, please tell me. Thanks.  Guy546 ( Talk )  21:15, 1 January 2012 (UTC) \n Congratulations! [ edit ] \n ..... on a wonderfully front page List! \n Amandajm  ( talk ) 01:00, 19 November 2012 (UTC) \n Lily Evans / Potter [ edit ] \n If someone could please edit. Add (Lily Evans) in brackets underneath Lily Potter. Otherwise the name doesn't link from the search page and it's hard to find it here. The page for  Darcey-Alden  should be linked. Thanks.  99.11.160.111  ( talk ) 10:59, 29 December 2012 (UTC) \n Daniel Radcliffe as Voldemort [ edit ] \n I'm not sure if this point has been raised or settled, but Daniel Radcliffe did portray Voldemort very briefly during that part of \"Order of the Phoenix\" when Voldemort invaded Harry Potter's mind. If that \"counts\" as an appearance, then the list should be updated.-- S trinitrotoluene  ( talk ) 23:47, 28 April 2014 (UTC) \n Semi-protected edit request on 24 September 2015 [ edit ] \n This  edit request  has been answered. Set the  |answered=  or  |ans=  parameter to  no  to reactivate your request. \n Can you please wikilink  \" William Melling \" ? (Section:  Hogwarts students ) \n Thank you.  12.180.133.18  ( talk ) 15:15, 24 September 2015 (UTC) \n   Done  Thanks for the suggestion -  Arjayay  ( talk ) 16:56, 24 September 2015 (UTC) \n Wrong cell color for Sybill Trelawney [ edit ] \n In the List row for Sybill Trelawney the column for Goblet of Fire hast to be grey... I would change it myself, but since the article is protected... I cannot :(  PiotrekJA  ( talk ) 23:02, 21 November 2015 (UTC) \n Oh, and as I recall Richard Bremmer did the normal footage of Voldemort, not of the young one as the \"(y)\" suggests, furthermore, I don't think, there was any scene with young Voldemort in the first part of the series... 78.52.130.243  ( talk ) 23:15, 21 November 2015 (UTC) \n Frances De La Tour is not a foreign actor [ edit ] \n The list of foreign witches / wizards is incorrect. \n Frances De La Tour is a British actress. \n See \n https://en.wikipedia.org/wiki/Frances_de_la_Tour \n This actress should be moved to the correct position in the list (the article is protected so this can't be done by any editor).  — Preceding  unsigned  comment added by  Hcollider1  ( talk  •  contribs ) 18:28, 2 January 2017 (UTC) \n External links modified [ edit ] \n Hello fellow Wikipedians, \n I have just modified one external link on  List of Harry Potter cast members . Please take a moment to review  my edit . If you have any questions, or need the bot to ignore the links, or the page altogether, please visit  this simple FaQ  for additional information. I made the following changes: \n Added archive  https://web.archive.org/web/20071011004320/http://moviesblog.mtv.com/2007/10/04/say-jude-lets-find-you-a-role-in-harry-potter/  to  http://moviesblog.mtv.com/2007/10/04/say-jude-lets-find-you-a-role-in-harry-potter/ \n When you have finished reviewing my changes, you may follow the instructions on the template below to fix any issues with the URLs. \n You may set the  |checked= , on this template, to  true  or  failed  to let other editors know you reviewed the change. If you find any errors, please use the tools below to fix them or call an editor by setting  |needhelp=  to your help request. \n If you have discovered URLs which were erroneously considered dead by the bot, you can report them with  this tool . \n If you found an error with any archives or the URLs themselves, you can fix them with  this tool . \n If you are unable to use these tools, you may set  |needhelp=<your help request>  on this template to request help from an experienced user. Please include details about your problem, to help other editors. \n Cheers.— InternetArchiveBot   ( Report bug )  06:42, 7 October 2017 (UTC) \n A [ edit ] \n \"A A indicates an appearance via archival recordings only.\" \n \"A Often, minor child parts—in this case, Harry as an infant—are played by twins or triplets to avoid overworking the children.[15][16] The given names of each of the Saunders triplets are unknown; they were credited in the film as \"Saunders triplets\".\" \n Which is it?---- 217.248.23.139  ( talk ) 23:00, 23 October 2017 (UTC) \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Talk:List_of_Harry_Potter_cast_members&oldid=810490276 \"\t\t\t\t\t \n Categories :  Wikipedia featured lists Featured lists that have appeared on the main page Featured lists that have appeared on the main page once Biography articles of living people FL-Class novel articles Low-importance novel articles FL-Class Harry Potter articles Low-importance Harry Potter articles Harry Potter task force articles FL-Class film articles FL-Class American cinema articles American cinema task force articles FL-Class British cinema articles British cinema task force articles WikiProject Film articles FL-Class List articles Low-importance List articles WikiProject Lists articles Hidden categories:  Noindexed pages Deletion to Quality Award candidates Film articles with two associated task forces   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit New section View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n  This page was last edited on 15 November 2017, at 15:56. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}