{"url": "http://www.boxofficemojo.com/reviews/?id=78&p=.htm", "content": "Movie Review: Lost in Translation \n Daily Box Office (Fri.)  |  Weekend Box Office (Nov. 17–19)  |  #1 Movie: 'Justice League'  |  Showtimes \n Updated 11/25/2017 8:41 A.M. Pacific Time \n Search Site \n Features \n News \n Release Sched. \n Showtimes at  \n Box Office \n Daily \n Weekend \n Weekly \n Monthly \n Quarterly \n Seasonal \n Yearly \n All Time \n International \n Indices \n Studios \n People \n Genres \n Franchises \n Showdowns \n Theater Counts \n > REVIEWS \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n LOST IN TRANSLATION \n U.S. Release Date: \n September 12, 2003 \n Distributor:  Focus Features \n Director:   Sofia Coppola Writer:   Sofia Coppola Producer:   Ross Katz Cast:   Bill Murray ,  Scarlett Johansson ,  Giovanni Ribisi ,  Anna Faris Running Time:  1 hour and 42 minutes MPAA Rating:  R (some sexual content) \n Sleepless in Tokyo \nby  C.A. Wolski   \nIf writer/director Sofia Coppola isn't careful she could become one of the best filmmakers working today. Her newest mini-masterpiece  Lost in Translation  mines the same territory as her stunning, albeit flawed debut  The Virgin Suicides —namely the price and burden of unconventional loneliness in the midst of a conventional society.  \n This time around she gives us two travelers Bob Harris (Bill Murray) and Charlotte (Scarlett Johansson) who are in Tokyo for two completely different reasons. Harris is a down and out American action star was has been lured to the Asian capital to shoot a series of advertisements for a Japanese whiskey company for a big payoff. Charlotte has accompanied her photographer husband John (Giovanni Ribisi) to Japan where he is to photograph a Japanese pop band, leaving her to while away the time in a country she doesn't understand at a time in her life when she has no direction.  \n And though age, experience and circumstances separate the two, Harris and Charlotte have two things in common—their shared loneliness and a bad case of insomnia. Virtual prisoners of their own making in a posh Tokyo hotel, the two eventually find each other, form an unlikely alliance and eventually fall in love.  \n Though marketed as a comedy—and there are tremendous comic possibilities mined by Coppola from the culture clash— Lost in Translation  is at root one of the sweetest and best love stories to hit the theatres in a long, long time. The reason it works is that its conceit is plausible, and Coppola's nicely structured screenplay does not force these two to become a couple. They literally fall in love in spite of themselves, understanding, though never speaking of the consequences of this relationship and its doomed nature (they're both married and only in town for a week).  \n Lovely moments of comedy abound—Murray's experiences with Japanese commercial directors and photographers are a hoot, and a scene in a hospital waiting room is a classic. As does romance—there's one of the best bedroom scenes in recent memory with the characters making love with words as their insomnia passes. More than that, though, the movie is gut wrenchingly poignant with a finale that will hit you about 10 minutes after the credits end. This makes Coppola a much different, and in some ways, more interesting filmmaker, than her father. You never know where she's going to take you or what the experience will be like and when it'll hit you.  \n That said, like  The Virgin Suicides , Coppola leaves much unsaid with motivations and back stories only sketched, never fully worked out. And like  The Virgin Suicides , the end isn't tidy—leaving a few too many loose ends for a romance.  \n And though the writing is crisp, what really makes  Lost in Translation  work is Johansson and Murray's chemistry. There is a spark between the two of them, which makes their May-December romance even more poignant. The movie is worth a look just for their performances.  \n Lost in Translation  isn't the best picture of the year. It's more than that. It's one of the most memorable.  \n REVIEWS OF SIMILAR MOVIES: The Life Aquatic A Comic Fish Tale Closer Attack of the Moans \n  PRINT  |   E-MAIL   \n NEWS & ANALYSIS FEATURES REVIEWS SITE Qs & News \n ADVERTISEMENT \n  \n Latest Updates \n Movie News \n Daily Chart \n Weekend Chart \n All Time Charts \n International Charts \n Indices \n People \n Genres \n Franchises \n Showdowns \n Other \n About This Site \n Advertising \n An   company \n ©  IMDb.com , Inc. or its affiliates. All rights reserved. Box Office Mojo and IMDb are trademarks or registered trademarks of IMDb.com, Inc. or its affiliates.  Terms of Use  and  Privacy Policy  under which this service is provided to you."}