{"url": "https://fi.wikipedia.org/wiki/Feeniksin_kilta", "content": "Feeniksin kilta – Wikipedia \n Feeniksin kilta   \n Kohteesta Wikipedia   \n\t\t\t\t\tLoikkaa:\t\t\t\t\t valikkoon , \t\t\t\t\t hakuun \n Sisällysluettelo \n 1   Historia \n 2   Jäsenet \n 2.1   Alkuperäisen Feeniksin killan jäsenet \n 2.2   Uudelleen perustetun Feeniksin killan tunnetut jäsenet \n 2.3   Dedalus Diggle \n 2.4   Elfias Doze \n 2.5   Arabella Figg \n 2.6   Hestia Jones \n 2.7   Alice Longbottom \n 2.8   Frank Longbottom \n 2.9   Sturgis Podmore \n 2.10   Edward Tonks \n 2.11   Nymfadora Tonks \n 2.12   Mundungus Fletcher \n 2.13   Sirius Musta \n 3   Lähteet \n 3.1   Viitteet \n Feeniksin kilta  ( engl.   Order of the Phoenix ) on kuvitteellinen salajärjestö  J. K. Rowlingin  kirjoittamissa  Harry Potter  -kirjoissa.  Albus Dumbledore  perusti järjestön vastustaakseen  lordi Voldemortia  ja tämän  kuolonsyöjiä . \n Varoitus:   Seuraava kirjoitus  paljastaa yksityiskohtia juonesta . \n Historia [ muokkaa  |  muokkaa wikitekstiä ] \n Feeniksin kilta on  Tylypahkan  velhokoulun  rehtorin   Albus Dumbledoren  perustama järjestö, jonka tehtävänä on vastustaa  lordi Voldemortia  ja  kuolonsyöjiä . Feeniksin killan päämajana on Kalmanhanaukio 12, Lontoo, joka on myös  Sirius Mustan  lapsuuden koti. Dumbledoren ohella killan alkuperäisiin jäseniin kuuluivat muun muassa  Harry Potterin  vanhemmat  James  ja  Lily Potter ,  Remus Lupin ,  Sirius Musta  ja  Alastor Vauhkomieli . Kilta hajosi, kun Voldemort katosi tapettuaan James ja Lily Potterin ja yritettyään tappaa heidän poikansa Harryn. Voldemortin uskottiin kuolleen, eikä häntä vastustavaa järjestöä katsottu enää tarpeelliseksi. \n Voldemortin palatessa kirjassa  Harry Potter ja liekehtivä pikari  Dumbledore perustaa Feeniksin killan uudelleen. \n Jäsenet [ muokkaa  |  muokkaa wikitekstiä ] \n Alkuperäisen Feeniksin killan jäsenet \n Edgar Bones \n Armas Dearborn \n Dedalus Diggle \n Elfias Doze \n Aberforth Dumbledore \n Albus Dumbledore \n Benjy Fenwick \n Rubeus Hagrid \n Alice Longbottom \n Frank Longbottom \n Remus Lupin \n Minerva McGarmiwa \n Marlene McKinnon \n Sirius Musta \n Tabita Niittu \n Dorcas Meadowes \n Peter Piskuilan \n Sturgis Podmore \n James Potter \n Lily Potter \n Fabian Prewett \n Gideon Prewett \n Emmeline Vance \n Alastor \"Villisilmä\" Vauhkomieli \n Uudelleen perustetun Feeniksin killan tunnetut jäsenet \n Dedalus Diggle \n Aberforth Dumbledore \n Albus Dumbledore \n Elfias Doze \n Arabella Figg \n Mundungus Fletcher \n Hermione Granger \n Rubeus Hagrid \n Hestia Jones \n Remus Lupin \n Olympe Maxime  (liittolainen) \n Minerva McGarmiwa \n Sirius Musta \n Sturgis Podmore \n Harry Potter \n Kingsley Kahlesalpa \n Severus Kalkaros \n Muriel Prewett  (liittolainen) \n Nymfadora Tonks \n Emmeline Vance \n Alastor \"Villisilmä\" Vauhkomieli \n Arthur Weasley \n Bill Weasley \n Charlie Weasley \n Fred Weasley \n George Weasley \n Molly Weasley \n Ron Weasley \n Dedalus Diggle [ muokkaa  |  muokkaa wikitekstiä ] \n Dedalus Diggle  on yksi Feeniksin killan alkuperäisistä jäsenistä.  Tylypahkan  opettaja  Professori McGarmiva  epäili häntä tähdenlentojen loihtimisesta Kentissä  Lordi Voldemortin  kukistuttua sinä yönä, kun Harry Potterin vanhemmat kuolivat. Harry tapaa Digglen  Viistokujalla   Vuotavassa noidankattilassa , kun Harry on ostamassa  Tylypahkaa  varten koulutarvikkeitaan, ja Dedalus ilahtuu, kun Harry sanoo nähneensä hänet ennenkin ( Petunia-täti  sai sätkyn, kun Dedalus kumarsi Harrylle ruokakaupassa). Viimeisessä kirjassa Dedalus Diggle ottaa  Hestia Jonesin  kanssa  Dursleyn  perheen huostaansa ja he pakenevat, jottei Voldemort saisi heitä. Kuolonsyöjät polttivat Digglen talon vallattuaan taikaministeriön, mutta Diggle ei ollut paikalla. \n Elfias Doze [ muokkaa  |  muokkaa wikitekstiä ] \n Elfias Doze  ( engl.   Elphias Doge ) on yksi Feeniksin killan alkuperäisistä jäsenistä. Hän on Albus Dumbledoren pitkäaikainen ystävä jo heidän Tylypahkan-opiskeluajoiltaan. Doze on siis suunnilleen yhtä vanha kuin Dumbledore. Tavallisesti hänet on mainittu vain ohimennen, mutta kirjassa  Harry Potter ja kuoleman varjelukset  Harry tapaa hänet Billin ja Fleurin häissä, ja Doze ja Harry keskustelevat Dumbledoresta, joka oli Elfiaksen hyvä ystävä. \n Arabella Figg [ muokkaa  |  muokkaa wikitekstiä ] \n Arabella Doreen Figg [1]  on hieman höperö vanha nainen, joka asuu neljän  kissansa  kanssa kaalinhajuisessa kodissaan Likusteritiellä.  Harry  on joutunut viettämään aikaa hänen luonaan, kun  Dursleyt  ovat halunneet hänet pois jaloista. Kirjassa  Harry Potter ja Feeniksin kilta  rouva Figg paljastaa olevansa  surkki , jonka tehtävänä on ollut pitää Harrya silmällä. \n Hestia Jones [ muokkaa  |  muokkaa wikitekstiä ] \n Hestia Jones  on Feeniksin killan jäsen. Jonesilla on musta tukka ja punaiset posket. Jones kohtasi Harryn ensimmäisen kerran, kun hän tuli hakemaan Harrya Dursleyilta Kalmanhanaukio 12:sta ja hän ihmetteli perunankuorimaveistä Dursleyiden keittiössä sanoen sen olevan hauska. Myöhemmin Jones yhdessä  Dedalus Digglen  kanssa evakuoivat Dursleyt turvaan, jotteivat kuolonsyöjät saisi heitä. Hestia piti pahana sitä etteivät Dursleyt välittäneet Harrysta ja etteivät tienneet minne Harry viedään. \n Alice Longbottom [ muokkaa  |  muokkaa wikitekstiä ] \n Alice Longbottom  on  Neville Longbottomin  äiti, joka työskenteli miehensä  Frank Longbottomin  kanssa  aurorina   Taikaministeriössä . Hän joutui kuitenkin loppuelämäkseen  sairaalaan   Bellatrix Lestrangen ,  Rodolphus Lestrangen ,  Rabastan Lestrangen  ja  Bartemius Kyyry nuoremman  häneen ja hänen mieheensä loihtiman  kidutuskirouksen  vuoksi. Toisin kuin miehensä hän on sen verran järjissään, että ojentaa Nevillelle joka tapaamisella yhden tai useita huolellisesti siistittyjä makeisten kääreitä – jotka poika tallettaa uskollisesti, vaikka isoäiti käskee heittää ne pois. \n Frank Longbottom [ muokkaa  |  muokkaa wikitekstiä ] \n Frank Longbottom  on Neville Longbottomin isä, joka oli menestyksekäs aurori. Hän on ollut pysyvästi vaimonsa kanssa  Pyhän Mungon taikatautien ja vammojen sairaalassa  sen jälkeen kun Bellatrix Lestrange, Rodolphus Lestrange, Rabastan Lestrange ja Bartemius Kyyry Jr. kiduttivat heidät lähes kuoliaaksi kidutuskirouksen avulla. Frank on niin pahoin vammautunut, ettei tunne edes poikaansa, joka käy uskollisesti katsomassa vanhempiaan. \n Sturgis Podmore [ muokkaa  |  muokkaa wikitekstiä ] \n Sturgis Podmore  on Feeniksin killan jäsen. Strugis joutuu Azkabaniin teoksessa  Harry Potter ja Feeniksin kilta , koska Lucius Malfoy yllättää hänet näkymättömyysviitan alta ministeriössä ja loitsii häneen komennuskirouksen. Kirouksen vuoksi Podmore yrittää murtautua Taikaministeriön Salaperäisyyksien osastoon. Hänet tuomitaan tästä hyvästä kuudeksi kuukaudeksi Azkabaniin. \n Edward Tonks [ muokkaa  |  muokkaa wikitekstiä ] \n Edward  Ted  Tonks  on Nymfadora Tonksin isä. Ted oli jästisyntyinen ja hänen vaimonsa oli  Andromeda Musta . Ted liittyi Feeniksin kiltaan yhdessä tyttärensä kanssa Voldemortin noustua uudelleen valtaan. Seitsemän Potterin taistelussa Ted tarjosi kotiaan turvataloksi muille. Harryn ja Hagridin saavuttua Ted paransi Harryn vammat. Kun kuolonsyöjät valtasivat taikaministeriön ja alkoivat vainota jästisyntyisiä Ted joutui pakenemaan, mutta Harmaaselän johtama ryhmä sai hänet kiinni ja Ted sai taistelussa surmansa. Lupin ja Nymfadora myöhemmin nimesivät poikansa Tediksi kunnioittaakseen hänen muistoaan. Tedin kuolemasta ilmoitettiin myöhmmin Pottervahdissa. \n Nymfadora Tonks [ muokkaa  |  muokkaa wikitekstiä ] \n Harry Potter  -hahmo \n Nymfadora Tonks \n Sukupuoli \n nainen \n Hiusten väri \n yleensä pinkit \n Silmien väri \n vihreät \n Tupa \n Puuskupuh \n Ammatti \n Aurori \n Lojaalius \n Feeniksin kilta \n Näyttelijä \n Natalia Tena \n Ensiesiintyminen \n Harry Potter ja Feeniksin kilta \n Nymfadora Tonks  ( engl.   Nymphadora Tonks ) ( 1973  —  2. toukokuuta   1998 ) [2]  työskenteli taikaministeriössä aurorina. Nymfadora oli myös  metamorfimaagi [3]  – hän pystyi siis muuttamaan ulkomuotoaan halutessaan. Tonks oli Sirius Mustan lempiserkun Andromedan tytär. [4] \n Nymfadora oli mukana taistelussa  kuolonsyöjiä  vastaan, kun kuolonsyöjät ja  lordi Voldemort  huijaavat Harryn ansaan. Sirius Musta saa surmansa samassa taistelussa. Tonks inhosi etunimeään ja pyysi usein että häntä kutsuttaisiin vain sukunimellä. [5]  Kirjassa  Harry Potter ja puoliverinen prinssi  Siriuksen kuoleman jälkeen Harry epäilee Tonksin olleen rakastunut Siriukseen, [6]  sillä Tonks ei enää muuttanut ulkonäköään, oli masentunut ja hänen  suojeliuksensa  oli muuttunut ihmissudeksi. [7]  Lopulta käy ilmi että Tonks oli rakastunut  Remus Lupiniin . [8] \n Kotikolossa  jouluaterian ääressä Harry epäilee, että rouva Weasley olisi mieluummin ottanut  Fleur Delacourin  sijasta Tonksin miniäkseen. Kyseessä oli kuitenkin Harryn väärinkäsitys. Tosiasiassa Molly yritti kannustaa Tonksia ja Lupinia yhteen. Teoksessa  Harry Potter ja puoliverinen prinssi  paljastuu, kuinka ihastunut Tonks Lupiniin lopulta oli. \n Kirjassa  Harry Potter ja kuoleman varjelukset  Nymfadora Tonks menee naimisiin Remus Lupinin kanssa. Heille syntyy poika, jonka he nimeävät Tonksin edesmenneen isän, Tedin, mukaan Teddy Remus Lupiniksi. Harrysta tulee Teddyn kummisetä. Kirjan lopussa käytävässä Tylypahkan taistelussa Nymfadora ja hänen aviomiehensä Lupin kuolevat kuolonsyöjien tekemään tappokiroukseen. Bellatrix tappoi Nymfadoran ja Dolohov Lupinin. \n Tonksia elokuvissa näyttelee  Natalia Tena . \n Mundungus Fletcher [ muokkaa  |  muokkaa wikitekstiä ] \n Mundungus ”Dung” Fletcher [9]  on varas – mutta hyväsydäminen velho. Hänet on määrätty vartioimaan  Harry Potteria  kirjassa  Harry Potter ja Feeniksin kilta , mutta kun hän sai kuulla eräästä halvasta noidankattilasta joka on ilmeisesti lumottu, hän lähti pois Likusteritieltä Surreysta. \n Tämä osoittautuu suureksi virheeksi, sillä heti sen jälkeen  ankeuttajat  hyökkäävät Harryn ja  Dudleyn  kimppuun Magnoliakaaren ja Visteriaväylän välisellä kujalla. [10]  Mundungus toimitti myös  Fred ja George Weasleylle  tarvikkeita pilapuotia varten. \n Albus Dumbledore  tietää Mundungusin epäluotettavuudesta mutta pitää tämän tarkoituksella mukana Feeniksin killassa: herkästi puolta vaihtavan roiston avulla on äärimmäisen yksinkertaista syöttää vääriä tietoja vastapuolelle siten, ettei kukaan aavistakaan asiaa. \n Mundungus osoittautuu tärkeäksi hahmoksi teoksessa  Harry Potter ja kuoleman varjelukset . Harry, Hermione ja Ron saavat tietää Mundungusilta, mihin on kadonnut siihen asti merkittävin  hirnyrkki  eli  Luihuisen medaljonki : Mundungus on vienyt sen Kalmanhanaukio 12:sta ja yrittänyt myydä  Viistokujalla  – jolloin  Dolores Pimento  oli takavarikoinut sen. \n Sirius Musta [ muokkaa  |  muokkaa wikitekstiä ] \n Sirius Musta  ( engl.   Sirius Black ) alias Anturajalka ( 1959 – 1996 ) [11]  on  J. K. Rowlingin  kirjoittamissa  Harry Potter  -kirjoissa esiintyvä henkilöhahmo. Hän on  Harry Potterin  kummisetä. Kirjoissa Siriusta kuvataan komeaksi ja nokkelaksi, ehkä jopa hieman ylimieliseksi keppostelijaksi. Mustaa kutsutaan kirjoissa myös lempinimellä Anturajalka. Sirius on rekisteröitymätön  animaagi ; hän osaa muuttua suureksi mustaksi  koiraksi . Sirius on yksi harvoista Harry Potter -kirjojen henkilöistä, joka ei pelkää lausua pimeyden lordi Voldemortin nimeä. Feeniksin kilta pitää Siriuksen taloa päämajanaan. \n Nimi \"Sirius\" viittaa tähteen, joka tunnetaan myös kansan suussa  Koirantähtenä , koska se kuuluu Suuren koiran tähtikuvioon. \n Elokuvissa  Siriusta näyttelee  Gary Oldman .  Feeniksin killassa  esiintyi myös teini-ikäinen Sirius, jota esitti  James Walters . \n Siriuksen nuoruus oli erityisen onnetonta; hän vihasi suurinta osaa sukulaisistaan, erityisesti äitiään. Hän ei noudattanut perheensä puhdasveristä elitismiä ja paneutumista pimeän voimiin. Koulussa Siriuksen parhaat ystävät  James Potter ,  Remus Lupin  ja  Peter Piskuilan  kutsuivat itseään  Kelmeiksi  ja tuottivat opettajille kepposillaan runsaasti harmaita hiuksia. He myös kiusasivat  Severus Kalkarosta , joka oli heidän kanssaan samalla vuosikurssilla mutta  Luihuisessa . Valmistuttuaan Tylypahkasta Sirius pysyi Jamesin hyvänä ystävänä ja oli jopa Jamesin bestman tämän mennessä naimisiin  Lilyn  kanssa. Kun parin poika Harry syntyi, Potterit kutsuivat Siriuksen kummisedäksi. Siriusta epäiltiin Pottereiden olinpaikan paljastajaksi ja lisäksi 12  jästin  ja Peter Piskuilanin murhaajaksi. Sirius vangittiin  Azkabanin  velhovankilaan. Toisin kuin muut Azkabanin vangit, jotka yleensä tulivat vankeudessa hulluiksi, Sirius pysyi selväjärkisenä, koska tiesi olevansa syytön. Sirius pystyi muuttumaan  animaagimuotoonsa  koiraksi tietäen, etteivät  ankeuttajat  voi vaistota hänen tunteitaan eläinmuodossa. Kaksitoista vuotta myöhemmin Sirius näki lehdessä kuvan Weasleyn perheestä, jossa Ronin olkapäällä istui rotta. Sirius tunnisti rotan välittömästi Peteriksi tämän animaagimuodossa. Tieto puhdisti hänen mielensä. Laihduttuaan useita kiloja vankilassa hän pystyi karkaamaan koiran hahmossa sellin kaltereiden välistä. \n Teoksessa  Harry Potter ja Feeniksin kilta  Sirius lahjoittaa sukunsa ikiaikaisen kodin  Kalmanhanaukio 12 :n Feeniksin kilta -organisaation päämajaksi, jolloin myös hän voi osallistua sen toimintaan. Sirius toimii ikään kuin Harryn veljenä koko kirjan ajan, mutta Rowlingin mukaan \"Harry kaipaa isähahmoa\". [12]  Hänen ja Harryn välille muodostuu myös suuri luottamusside.  Bellatrix Lestrangen  ja Siriuksen välisen kaksintaistelun aikana Bellatrix iskee Siriusta kirouksella, joka lennättää tämän mystisen mustan holvikaaren verhon lävitse kuolemaan (elokuvaversiossa holvikaaressa ei ole verhoa). [13] \n Kirjassa  Harry Potter ja puoliverinen prinssi  Sirius tunnustetaan syyttömäksi – mutta valitettavasti liian myöhään. Harry perii Siriuksen omaisuuden, mukaan lukien talon Kalmanhanaukiolla, kotitonttu Oljon ja Hiinokan. Kirjassa myös kerrotaan että Sirius Musta on Narcissa Malfoyn serkku. Seitsemännessä kirjassa Harry kutsui Siriuksen hengen luokseen elpymiskiven avulla lohduttamaan Harrya tämän matkalla tulevaan kuolemaan. Siriuksen henki kertoi Harrylle kuoleman olevan kivuton ja käyvän nopeammin kuin nukahtaminen. \n Lähteet [ muokkaa  |  muokkaa wikitekstiä ] \n Rowling, J. K.:  Harry Potter ja Feeniksin kilta . (Harry Potter and the Order of the Phoenix, 2003.) Suomentanut Jaana Kapari. Tammi, 2004. \n Rowling, J. K.:  Harry Potter ja puoliverinen prinssi . (Harry Potter and the Half-Blood Prince, 2005.) Suomentanut Jaana Kapari. Tammi, 2006. \n Rowling, J. K.:  Harry Potter ja kuoleman varjelukset . (Harry Potter and the Deathly Hallows, 2007.) Suomentanut Jaana Kapari-Jatta. Tammi, 2008. \n Viitteet [ muokkaa  |  muokkaa wikitekstiä ] \n ↑   Lisa Waite Bunker:  Arabella Doreen Figg   5.1.2008. The Harry Potter Lexicon. Viitattu 9.2.2008.  (englanniksi) \n ↑   Lisa Waite Bunker:  Nymphadora Tonks   10.1.2008. The Harry Potter Lexicon. Viitattu 9.2.2008.  (englanniksi) \n ↑   Rowling 2004, s. 68–69. \n ↑   Rowling 2004, s. 143. \n ↑   Rowling 2004, s. 65. \n ↑   Rowling 2006, s. 503. \n ↑   Rowling 2006, s. 170. \n ↑   Rowling 2006, s. 668–669. \n ↑   Lisa Waite Bunker:  Mundungus ”Dung” Fletcher   5.1.2008. The Harry Potter Lexicon. Viitattu 9.2.2008.  (englanniksi) \n ↑   Rowling 2004, s. 179. \n ↑   Lisa Waite Bunker:  Sirius Black   6.10.2007. The Harry Potter Lexicon. Viitattu 8.2.2008.  (englanniksi) \n ↑   The Leaky Cauldron and MuggleNet interview Joanne Kathleen Rowling: Part Two \n ↑   Rowling, J. K.:  Harry Potter ja Feeniksin kilta , s. 972. (Harry Potter and the Order of the Phoenix, 2003.). Tammi, 2004. \n\t\t\t\t\t\tNoudettu kohteesta  https://fi.wikipedia.org/w/index.php?title=Feeniksin_kilta&oldid=16779207   \n Luokat :  Harry Potter -käsitteet Harry Potter -hahmot Luettelot kirjallisuuden henkilöhahmoista   \n Navigointivalikko \n Henkilökohtaiset työkalut \n Et ole kirjautunut Keskustelu Muokkaukset Luo tunnus Kirjaudu sisään   \n Nimiavaruudet \n Artikkeli Keskustelu   \n Kirjoitusjärjestelmät \n Näkymät \n Lue Muokkaa Muokkaa wikitekstiä Näytä historia   \n Muut \n Haku \n Valikko \n Etusivu Tietoja Wikipediasta Kaikki sivut Satunnainen artikkeli   \n Osallistuminen \n Ohje Kahvihuone Ajankohtaista Tuoreet odottavat muutokset Tuoreet muutokset Lahjoitukset   \n Työkalut \n Tänne viittaavat sivut Linkitettyjen sivujen muutokset Toimintosivut Ikilinkki Sivun tiedot Wikidata-kohde Viitetiedot   \n Tulosta tai vie \n Luo kirja Lataa PDF-tiedostona Tulostettava versio   \n Muilla kielillä \n العربية Bahasa Indonesia Bahasa Melayu বাংলা Bosanski Brezhoneg Български Català Čeština Dansk Eesti English Español فارسی Français 한국어 Hrvatski Íslenska Italiano עברית ქართული Қазақша Latina Lietuvių Magyar Македонски Nederlands 日本語 Norsk Norsk nynorsk Polski Português Română Русский Slovenčina Српски / srpski Srpskohrvatski / српскохрватски Svenska ไทย Tiếng Việt Türkçe Українська 中文   \n Muokkaa linkkejä   \n  Sivua on viimeksi muutettu 21. syyskuuta 2017 kello 08.54. \n Teksti on saatavilla  Creative Commons Attribution/Share-Alike  -lisenssillä; lisäehtoja voi sisältyä.\nKatso  käyttöehdot . \nWikipedia® on  Wikimedia Foundationin  rekisteröimä tavaramerkki. \n Ongelma artikkelissa? \n Tietosuojakäytäntö \n Tietoja Wikipediasta \n Vastuuvapaus \n Kehittäjät \n Evästekäytäntö \n Mobiilinäkymä"}