{"url": "https://www.snap.com/en-US/brand-guidelines/", "content": "Brand Guidelines – Snap Inc. \n Snap Inc. Jobs News Investors Brand Guidelines We've prepared these brand guidelines so that you'll know exactly how you can–and cannot–display our Brand Assets Download Main Menu Ghost Logo Usage General Usage Guidelines Naming Apps and Products Merchandise Product Packaging Talking About Snapchat Snapcode Usage Guidelines Brand Guidelines FAQ By honoring these guidelines, you'll help yourself by getting to use the Brand Assets without having to negotiate legal agreements with us every time you want to use them. And you'll help us because we need to ensure that our Brand Assets follow a consistent style and use. Of course, if you would like to use Brand Assets in a way that is not covered by these guidelines, you'll need to raise that with us by contacting Snapchat's  Marketing Team . \n Keep in mind that Snapchat is constantly growing and evolving. So it's entirely possible we'll modify these guidelines from time to time. When we do, we will publish updated guidelines, but we may not provide you any individual notice about those new guidelines. It's important that you regularly check this site to ensure that you're correctly using our Brand Assets. \n Snapchat owns trademark rights in the United States and other countries. Some of Snapchat's trademarks include the Snapchat, Snapcash, Snapcode, and the Ghost and Snap logos: \n These Snapchat trademarks, along with any word, phrase, image, or other designation that identifies the source or origin of any of Snapchat's products or services are referred to as the Snapchat \"Brand Assets.\" \n Ghost Logo Usage \n Do: \n Use only the official Ghost logo available for  download here . \n Maintain proportions and preserve clear space around the Ghost logo. For specific guidance on maintaining appropriate proportions,  click here. \n Use the Ghost logo next to your Snapchat username. \n Use the Ghost logo in any of the following ways:\n If you want to direct others to your Snapchat account, feel free to display our Ghost logo side-by-side with other social media logos. If you include the Ghost logo next to other logos, please display it in the same size as other logos. \n With a clear call to action such as \"Add us on Snapchat\" (unless the Ghost logo is side-by-side with other social media logos). To refer to your presence on Snapchat. \n Don't: \n Modify the Ghost logo in any way, such as by changing colors or adding elements to the design. \n Display the Ghost logo larger than your own marks or branding. \n Use the Ghost logo to refer to any product or service other than Snapchat. \n Keep in mind: When the Ghost logo appears within your unique Snapcode, we make an exception to these rules and welcome your creativity in that narrow field. But please read the  Snapcode Usage Guidelines  to better understand those rules. \n Clear Space \n In order to preserve the integrity of the ghost mark, it is important that no other logos, type or other graphic elements infringe on its space. The minimum clearspace around the ghost mark is equivalent to 1/3 of the width of the ghost mark. \n Color \n The logotype should always contrast with the background. There are 3 versions of the logotype to ensure legibility and optimum reproduction quality in all printing processes and digital needs. \n Full Color – Yellow Background \n Hex: #FFFC00 \n       CMYK: 0/0/100/0 \n       RGB: 255/252/0 \n       PMS: Pantone Yellow U\n Monochrome – Black Background \n Pure White \n Monochrome – White Background \n Pure Black \n Minimum Size \n The minimum size the logomark may be used for print applications is .4\" (10mm) wide. For digital applications, the minimum size is 45 pixels wide. \n General Usage Guidelines \n Do: \n Make sure the Brand Assets are displayed clearly. \n Keep enough space around the Brand Assets so they appear clean and uncluttered. \n Follow all of Snapchat's current  Terms of Service ,  Community Guidelines , and  Privacy Policies . \n Don't: \n Use the Brand Assets in a way that suggests or implies partnership, sponsorship or endorsement by Snapchat. \n Modify or alter the Brand Assets, subject to two exceptions:\n As you'll read below, we encourage you to personalize your unique Snapcode. \n You may also scale the size of the Brand Assets to suit the context, so long as they comply with the terms of these Snapchat Brand Guidelines and are not the most distinctive or prominent feature. \n Incorporate the Brand Assets, or anything confusingly similar, into any other trademarks, names, domain names, usernames, or logos. \n Use any trademarks, names, domain names, usernames, logos or other content that imitate or could be confused with Snapchat. \n Copy the Snapchat look and feel. \n Feature the Brand Assets in connection with pornography, illegal activities, or other materials that violate the Snapchat  Terms of Service ,  Community Guidelines , or  Privacy Policies . \n Naming Apps and Products \n If you offer an app, website, or product that is compatible with or related to Snapchat, you can describe how your app, website, or product relates to Snapchat. But you can't combine any part of the Brand Assets as part of your own brand, or suggest that Snapchat sponsors or endorses your app, website, or product. \n Do: \n Name your app, website, or product something that is unique and original to you. \n Design your own original logo or app icon that represents your brand. \n Don't: \n Use \"Snapchat,\" \"Snap,\" or \"Chat\" in your app name, website name, domain name, or product name. \n Use any of Snapchat's trademarks or logos or other source-identifiers as part of your brand identity, which includes your app icon, logo, or product design. \n Merchandise \n While Snapchat allows you to use Snapcodes to promote your account, Snapchat does not allow users to create or sell merchandise (T-shirts, mugs, stickers, and the like) using its Brand Assets without a formal license to use the Brand Assets. If you would like a license, please contact Snapchat's  Marketing Team . \n Product Packaging \n Product packaging is a different story. Unlike with merchandise, you may promote your Snapchat account using the Brand Assets on your product packaging. The following guidelines explain how you can use the Brand Assets to promote your Snapchat account on your product packaging. \n Do: \n Use your Snapcode on product packaging so that people can find your Snapchat account. \n Use the Ghost Logo on your product packaging to represent Snapchat in one of three ways:\n With your username. \n Side-by-side with other social media logos. \n With a clear call to action such as \"Follow us on Snapchat\" (unless the Ghost logo is side-by-side with other social media logos). \n If used beside other social media logos, display the Ghost logo in the same size as your username or other social media logos and no larger or more prominent than your own brand. \n Don't: \n Use the Brand Assets on your packaging in a way that suggests or implies partnership, sponsorship, or endorsement by Snapchat. \n Talking About Snapchat \n Sometimes you may need to refer to Snapchat to discuss the Snapchat service, describe your presence on Snapchat, display your Snapchat username, or describe your products or services as they relate to Snapchat. \n Do: \n Use the full name \"Snapchat,\" without any modification. \n Capitalize the word \"Snapchat,\" except when you are referring to the Snapchat web address. \n Within the body of an article, title, or report, display the word \"Snapchat\" in the same font size and style as the content surrounding it. \n Don't: \n Modify the word \"Snapchat\" in any way, such as by capitalizing the \"c\" or separating it into two words (i.e., SnapChat, Snap chat, or Snap Chat). \n Use the Ghost logo in place of the word \"Snapchat.\" \n Pluralize the word \"Snapchat,\" use it as a verb, or abbreviate it. \n Snapcode Usage Guidelines \n Your Snapcode \n Snapcodes make it easy for Snapchatters to  add you as a friend  and follow your Story! Feel free to publicize your Snapcode on the web, social media, and print, but make sure to follow the guidelines below before doing so. You can download a copy of your Snapcode  here .  \n Create a Snapcode \n While your personal Snapcode is uniquely yours and can’t be changed, you can generate Snapcodes that unlock any website — it doesn’t even have to be yours! For example, if you want to make a Snapcode for your blog, you can generate a Snapcode that sends Snapchatters to your site. Go  here  to learn more. \n Snapcodes for Brands \n Every now and then, Snapchat generates Snapcodes for a brand as part of its advertising campaign. When Snapchatters scan a brand’s Snapcode, they’ll either unlock a Sponsored Geofilter or a Sponsored Lens. Unless the advertising campaign agreement specifies otherwise, all Snapchatters 13 years and older can unlock the Snapcode. As long as brands follow the guidelines below, they’re free to use their Snapcodes on packaging and marketing materials to promote their products and Snapchat advertising campaigns. \n Note: Snapchat reserves the right to redirect the “unlockable” content for any brand’s Snapcode. \n Do: \n Test your Snapcode before posting it! \n Personalize your Snapcode by adding an image inside the ghost logo — assuming that the image doesn’t violate our  Terms of Service ,  Community Guidelines ,  Privacy Policy , or any third-party rights. \n Use language alongside your Snapcode inviting others to add you or unlock the content. \n Place your Snapcode on product packaging, but make sure to test it before going into mass production! \n Share your personal Snapcode with new friends! If you’re going to print it or share it online, make sure to include your username so Snapchatters know who they’re going to follow. \n Note that the maximum ratio of Snapcode size to scan distance is 1:7. So, if you need your code to scan from up to seven feet away, make sure to have your Snapcode at least one foot tall and wide in size. \n If you’re including your Snapcode in a video, make sure to give Snapchatters enough time to scan! \n Don't: \n Use or distribute the Snapcodes of others. \n Modify your Snapcode, unless you’re simply adding your own images (or images you have the rights to) inside the ghost logo. \n Sell Snapcode merchandise (stickers, apparel, etc., that primarily feature a Snapcode) unless you’ve requested and received permission from Team Snapchat. \n Link to a URL that violates Snapchat’s policies. \n Print your Snapcode smaller than one inch tall by one inch wide. \n Delete or modify the proportions of the black rim around the Snapcode. If you do, it can interfere with the unlock function. \n Place the Snapcode near controversial subject matter, including subject matter that violates our Terms of Service or Ad Policies. \n Brand Guidelines \n You are free to mention your Snapchat account, display your Snapcode, or ask viewers to \"add us on Snapchat\" during your broadcast. Other than that, you need to obtain permission before you use any Brand Assets or Snapchat content in your broadcast. You can request permission by contacting Snapchat's  Marketing Team . \n What to include with your request: \n A description of the film, TV program, or other broadcast in which you would like to use the Brand Assets. \n A script of the segment that references the Brand Assets. \n A mock-up showing how any Brand Assets will be featured in your broadcast. \n Translations for any non-English requests. \n FAQ \n Why does Snapchat need rules about how to use its Brand Assets? \nTrademark law in the U.S. and other countries requires trademark owners to protect against improper or confusing uses of their marks. In some cases, trademark owners can even lose their trademarks if they don't protect them. Snapchat has developed rules around how others may use its Brand Assets to ensure that people won't mistakenly believe that unrelated products or services originate from Snapchat, or are sponsored or endorsed by Snapchat. \n These guidelines promote consistent use of the Brand Assets. This makes it easier for people to instantly recognize the Snapchat brand and prevents consumers from being confused. \n What does Snapchat do if people misuse its Brand Assets? \nSnapchat cares about the integrity of its Brand Assets, which is why it dedicates substantial resources to protecting its intellectual property. In addition to protecting its trademarks and logos, Snapchat enforces its rights against people who misuse its Brand Assets. \n Do I need permission for each use of the Brand Assets? \nIf you are following these Snapchat Brand Guidelines, you don't need to seek permission before using the Brand Assets, unless you want to display the Snapcode on merchandise or use the Brand Assets as part of your broadcast. If you are unsure or think your intended use might fall outside these guidelines, please contact Snapchat's  Marketing Team . \n May I combine Brand Assets with new terms or artwork to create my own marks and logos, or modify the color or design to fit with the style of my website, packaging, printed materials, or other content? \nNo. But you may scale the size of the Brand Assets to suit your needs, so long as they comply with the Snapchat Brand Guidelines and are not the most distinctive or prominent feature on your web page, packaging, printed material, or other content. \n May I use the Brand Assets in my play, film, or book? \nYou may use the word \"Snapchat\" in your play, film, or book to fairly and accurately describe the subject matter, so long as it's clear that Snapchat doesn't sponsor or endorse your project. Except for providing content attribution for photos and videos in accordance with the Snapchat Brand Guidelines, and/or inviting others to add you on Snapchat as permitted by the Brand Guidelines, you cannot use any Brand Assets in your book, film, or play without written permission from Snapchat's  Marketing Team . \n May I use Snapchat logos and images I found elsewhere on the web? \nNo. You may use only the official Brand Assets that are available on this website. \n My business is interested in collaborating with Snapchat. How can we work together? \nWe are always open to hearing from potential partners. Simply send an email to our  Business Development team  that details your company, the cause or event, and proposed partnership. Please note: due to the high volume of inquires, we will only respond individually if there is an opportunity to partner. \n © 2017 Snap Inc. Privacy Policy Terms of Service Other Terms & Policies Impressum Dansk Deutsch English (US) English (UK) Español Français Italiano 日本語 Nederlands Norsk Polish Português (Brasil) Suomi Svenska"}