{"url": "http://www.w3.org/TR/UNDERSTANDING-WCAG20/navigation-mechanisms-focus-visible.html", "content": "Understanding Success Criterion 2.4.7  | Understanding WCAG 2.0\n    \t\t\t\t Understanding WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  SC  2.4.6 [Headings and Labels] Next:  SC  2.4.8 [Location] On this page: Intent Examples Related Resources Techniques & Failures   -   Focus Visible : Understanding  SC  2.4.7 \n 2.4.7  Focus Visible:  Any keyboard operable user interface has a mode of operation where the keyboard focus indicator is visible. \n\t\t\t\t\t(Level AA)\n\t\t\t\tIntent of this Success Criterion\n\t\t\t The purpose of this success criterion is to help a person know which element has the keyboard focus. The purpose of this success criterion is to help a person know which element among multiple elements has the keyboard focus. If there is only one keyboard actionable control on the screen, the success criterion would be met because the visual design presents only one keyboard actionable item. Note that a keyboard focus indicator can take different forms. One common way is a caret within the text field to indicate that the text field has the keyboard focus. Another is a visual change to a button to indicate that that button has the keyboard focus. \n\t\t\t\tSpecific Benefits of Success Criterion 2.4.7:\n\t\t\t This Success Criterion helps anyone who relies on the keyboard to operate the page, by letting them visually determine the component on which keyboard operations will interact at any point in time. People with attention limitations, short term memory limitations, or limitations in executive processes benefit by being able to discover where the focus is located. \n\t\t\t\tExamples of Success Criterion 2.4.7 When text fields receive focus, a vertical bar is displayed in the field, indicating that the user can insert text, OR all of the text is highlighted, indicating that the user can type over the text. When a user interface control receives focus, a visible border is displayed around it. \n\t\t\t\tRelated Resources\n\t\t\t Resources are for information purposes only, no endorsement implied. \n Styling form controls with CSS, revisited \n\t\t\t\tTechniques and Failures for Success Criterion 2.4.7 - Focus Visible Each numbered item in this section represents a technique or combination of techniques that the  WCAG  Working Group deems sufficient for meeting this Success Criterion. However, it is not necessary to use these particular techniques. For information on using other techniques, see  Understanding Techniques for WCAG Success Criteria , particularly the \"Other Techniques\" section. \n\t\t\t\tSufficient Techniques  \n G149: Using user interface components that are highlighted by the user agent when they receive focus \n C15: Using CSS to change the presentation of a user interface component when it receives focus   (CSS)\n G165: Using the default focus indicator for the platform so that high visibility default focus indicators will carry over \n G195: Using an author-supplied, highly visible focus indicator \n SCR31: Using script to change the background color or border of the element with focus   (Scripting)\n FLASH20: Reskinning Flash components to provide highly visible focus indication  (Flash)\n SL2: Changing The Visual Focus Indicator in Silverlight  (Silverlight)\n SL7: Designing a Focused Visual State for Custom Silverlight Controls  (Silverlight)\n\t\t\t\t Additional Techniques (Advisory) for 2.4.7 Although not required for conformance, the following additional techniques should be considered in order to make content more accessible. Not all techniques can be used or would be effective in all situations. Highlighting a link or control when the mouse hovers over it (future link) Providing a highly visible highlighting mechanism for links or controls when they receive keyboard focus (future link)\n\t\t\t\t Common Failures for  SC  2.4.7 The following are common mistakes that are considered failures of Success Criterion 2.4.7 by the  WCAG  Working Group. \n F55: \n          Failure of Success Criteria 2.1.1, 2.4.7, and 3.2.1 due to using script to remove focus when focus is received \n F78: Failure of Success Criterion 2.4.7 due to styling element outlines and borders in a way that removes or renders non-visible the visual focus indicator \n Top Contents Intro Previous:  SC  2.4.6 [Headings and Labels] Next:  SC  2.4.8 [Location] This Web page is part of  Understanding WCAG 2.0: A guide to understanding and implementing WCAG 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}