{"url": "http://parcolympique.qc.ca/le-parc-olympique/comite-conseil-sur-lavenir-du-parc-olympique/", "content": "Comité-conseil sur l’avenir du Parc olympique |  Parc olympique de Montréal \n Notre organisme \n Comment se rendre \n FAQ \n English \n Menu Le Parc La Tour de Montréal L'Esplanade Financière Sun Life Le Stade Le Centre sportif Autres attraits  Close Nouvelles Activités Événements Parcours touristiques Organiser un événement \n Comité-conseil sur l’avenir du Parc olympique \n Communiqué de presse du comité-conseil \n Rapport final du Comité-conseil sur l’avenir du Parc olympique \n Mandat du comité \n Avant de prendre une décision dans le dossier de remplacement de la Toiture du Stade, la Régie des installations olympiques (RIO) a décidé d’amorcer une réflexion ouverte et globale sur l’avenir de ses installations, sur leur utilisation optimale de même que sur le Parc olympique dans son ensemble. Le conseil d’administration de la RIO a donc créé un Comité-conseil sur l’avenir du Parc olympique, lequel doit l’aider à évaluer les besoins véritables des clientèles actuelles et potentielles. Le mandat spécifique de ce comité est de conseiller la RIO dans :  \n Sa vision de développement du Parc olympique ainsi que dans l’établissement des orientations stratégiques de son plan d’affaires; \n le choix des priorités d’utilisation futures des équipements, dont le Stade lui-même, afin d’être en mesure de faire les choix d’investissements appropriés;  \n la détermination du type de toiture à retenir pour le Stade, celle-ci devant répondre aux besoins découlant des utilisations priorisées. \n Les membres \n Lise Bissonnette \nPrésidente du comité \n Michel Archambault, Ph. D. \nProfesseur associé à l’École des sciences de la gestion de l’Université du Québec à Montréal et président du Bureau des gouverneurs de la Chaire de tourisme Transat \n Vincenzo Ciampi, MBA \nVice-président, Marketing d’entreprise et Pratique nationale des communications, Aon Hewitt \n Michel Dallaire \nDesigner industriel, président de Michel Dallaire Design Industriel inc. \n Karine Lanoie-Brien \nConceptrice, directrice de création et productrice pour les créations de  Vous êtes ici \n Réal Ménard \nMaire de l’arrondissement Mercier–Hochelaga-Maisonneuve \n Chantal Petitclerc \nMédaillée paralympique spécialiste de la course en fauteuil roulant \n Matthieu Proulx \nChroniqueur sportif, ex-joueur des Alouettes de Montréal \n Paul Saint-Jacques \nAdministrateur de sociétés \n Pascale Ryan \nChargée de projets \n   Notre organisme \n Formulaire de demande de gratuité ou de commandite \n Message de la présidente \n Mission et vision \n Structure administrative \n Plans d’action \n Diffusion de l'information \n Travailler au Parc olympique \n Offres d'emploi \n Rapports annuels \n Données et statistiques \n Fiches d'information \n Politique de droits d’auteur \n Politique de confidentialité \n Politique concernant les commandites et les dons \n Bulletin Info-Travaux \n Règlement sur les normes de sécurité et de comportement au Parc olympique \n Montréal, ville olympique \n La construction \n Jeux olympiques de 1976 \n Médailles et autres données \n Comité-conseil sur l’avenir du Parc olympique \n Partenaires \n Le Stade \n La Tour de Montréal \n L'Esplanade \n Le Centre sportif \n Autres attraits \n Comment se rendre \n À propos \n Partenaires \n Bon voisinage \n Salle de presse \n Offres d'emploi \n Règlement   \n Contactez-nous \n\t\t\t\t\t4141, avenue Pierre-De Coubertin \r\n\t\t\t\t\tMontréal, Québec \r\n\t\t\t\t\tH1V 3N7\r\n\t\t\t\t\tTéléphone : 514 252-4141 ou 1 877 997-0919 \r\n\t\t\t\t\tTélécopieur : 514 252-0372 \r\n\t\t\t\t\tCourriel :  rio@rio.gouv.qc.ca"}