{"url": "http://www.carteopus.info/student?language=fr", "content": "Carte OPUS - Remplacer votre carte SANS FRAIS \n Accueil   |  \n Nous joindre   |  \n FAQ   |  \n English   \n Depuis le 1 er  septembre,   tous les étudiants à temps plein 1  ont droit au tarif étudiant 2  en vigueur pour la session d'automne 2017, peu importe leur âge. \n Afin de bénéficier de ce privilège à compter de la session d'automne 2017, faites la demande de votre carte OPUS avec photo. \n Pour obtenir votre carte OPUS avec photo:  \n  Votre établissement doit être reconnu par le  Ministère de l'Éducation et de l'Enseignement supérieur (MEES) \n  Consultez le site de votre organisme de transport en utilisant les liens ci-dessous, pour connaître les documents requis et les frais applicables à l'émission de la carte OPUS avec photo, ainsi que les titres disponibles au tarif étudiant 1 . \n  Trois façons de vous procurez votre carte OPUS avec photo\r\n- Les étudiants de l'Université Concordia, l'École de technologie supérieure (ÉTS), l'Université McGill et l'Université de Montréal peuvent demander leur carte en ligne à partir du portail étudiant de leur université. Si la demande est acceptée, la nouvelle carte OPUS sera envoyée par la poste au domicile de l'étudiant. Pour plus de détails, consultez  la page étudiante sur le site de la STM. \n- Présentez-vous au  Studio photo  de la STM,  dans une  billetterie métropolitaine  de l'ARTM ou un  centre de service  du RTM de la couronne nord ou sud.\r\n- Vous pouvez suivre nos tournées scolaires afin de pouvoir faire votre demande sur les lieux de votre établissement d\u0092enseignement :\r\n Tournée scolaire RTL \n Tournée scolaire STL \n Tournée scolaire STM \n Cette initiative vous est offerte par l'Autorité régionale de transport métropolitain en collaboration avec les organismes de transport de son territoire : RTL, RTM, STL et STM.  \n 1   Un étudiant à temps plein doit répondre aux critères de l'organisme de transport émetteur de la carte OPUS avec photo. Veuillez visiter le site Web de l'organisme. \n 2  «Tarif étudiant» fait référence à la réduction tarifaire pour les étudiants à temps plein admissibles offerte par les organismes de transport, nommé tarif réduit ou tarif étudiant selon l'organisme."}