{"url": "https://m.wikihow.com/Make-Your-Computer-Run-Faster", "content": "How to Make Your Computer Run Faster (with Pictures) - wikiHow \n Home Random Browse Articles Notifications Add to This Page Add Tip Add Photo Easy Ways to Help Approve Questions Review Tech Feedback Fix Spelling More Things to Try...   \n Log in / Sign up   \n Desktop Site   \n Reader Approved How to Make Your Computer Run Faster   \n Is your computer slowing down, whizzing and whirring as it tries to keep up with you? Before you spend hundreds or even thousands on a new computer, you may find it only takes a few simple steps to make your Windows or Mac computer run faster. \n Steps Edit \n Before You Begin Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/d9\\/Make-Your-Computer-Run-Faster-Step-1-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-1-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/d9\\/Make-Your-Computer-Run-Faster-Step-1-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-1-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Back up your computer .  Many of us have what feels like our entire lives stored on our computers--photos of cherished memories, the evolution of our musical taste, school work, tax returns and, more and more, everything we need to do our work . Before making any major changes, it is always a good idea to back up essential files. [1] \n Purchase an external hard drive that is larger than the hard drive you want to back up. [2]  Inserting the USB of the external hard drive should automatically prompt your computer to give you the option to use the drive for back up. If you need more help, read the wikiHow article about  how to back up a hard drive. \n If you are worried about losing or damaging an external hard drive, you can back up important files online. Subscribe to a secure back up service (like Carbonite or SOS Online Backup). You can set your computer to back up to the cloud on a schedule or even every time you make a change to a file. [3] \n You can always back up onto CDs or DVDs, but keep them in a safe place so they are not scratched, broken, or damaged. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/92\\/Make-Your-Computer-Run-Faster-Step-2-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-2-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/92\\/Make-Your-Computer-Run-Faster-Step-2-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-2-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Restart your computer .  This can temporarily speed up a slow computer by refreshing the memory. Restart, or completely shut down the computer, wait a few seconds, and then turn it back on. [4] \n Make sure you save any projects you are working on before turning off your computer! \n Advertisement \n Method One of Two: Windows Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/46\\/Make-Your-Computer-Run-Faster-Step-3-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-3-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/46\\/Make-Your-Computer-Run-Faster-Step-3-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-3-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Check your hard disk space first.  Go to My Computer, right-click Local Drive, then click Properties. There you'll see a pie chart of your free versus used space. If the disk is mostly full, you will need to remove programs and files; if there's still plenty of room, there may be something wrong with your operating system.\n As a rule, you want to keep at least 15% of the hard disk space free to keep the computer running smoothly. \n If you find you simply need more space, consider buying and installing a Solid State Drive (SSD) to complement or replace your hard disk. They are faster and much more secure than hard drives. \n Most laptops don't have the space to add an SSD. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/da\\/Make-Your-Computer-Run-Faster-Step-4-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-4-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/da\\/Make-Your-Computer-Run-Faster-Step-4-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-4-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Remove any programs  you do not use.  Go to Control Panel, then click Add or Remove Programs (or \"Uninstall a Program\", depending on your operating system) to find a master list of programs installed on your computer. Some things will strike you as useless immediately, in which case you can remove them right away. Others won’t look familiar to you and may require some research.\n It may help to see how often you use the program. If you right-click one of the column titles above your program list, you should be able to add additional characteristics by which to organize your programs. Check  Last Used On  and a column displaying the last time you used each program will appear. This will quickly show you which programs you use frequently and the ones you haven't used in years. \n Don't forget to empty your recycling bin. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4a\\/Make-Your-Computer-Run-Faster-Step-5-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-5-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4a\\/Make-Your-Computer-Run-Faster-Step-5-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-5-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Prevent unnecessary programs from starting when the computer boots up.  Some programs may start as soon as you turn on your computer, running in the background so they will load quickly when you open them. Open the Start Menu and run a search for \"msconfig\". Click on Startup to see a list of all the programs that run when you boot up your computer and uncheck anything unnecessary.\n You can also check the taskbar to see which programs are running on start up (be sure to click Show Hidden Icons so you don't miss any). \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f0\\/Make-Your-Computer-Run-Faster-Step-6-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-6-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f0\\/Make-Your-Computer-Run-Faster-Step-6-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-6-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Change the power plan of your desktop computer to High Performance.  Go to the Control Panel and select Power Options. You will find a list of power plans, usually Balanced, Power Saver, and High Performance. These settings control how your computer uses power--either by lowering performance to optimize battery life, maximizing performance with major power consumption, or a balance between the two. Selecting High Performance may increase the speed and overall performance of your computer. [5] \n This is only helpful if you have a desktop PC--using the High Performance setting on a laptop will drain your battery power. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Make-Your-Computer-Run-Faster-Step-7-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-7-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3e\\/Make-Your-Computer-Run-Faster-Step-7-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-7-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Remove any unnecessary entries from the Windows Context Menu.  The context menu is the menu that pops up when you right-click something. Sometimes programs will ask to be added to the menu, others will add themselves automatically. To remove programs, press  ⊞  Win + R  to open the Run box. Type in  regedit  and click OK. [6]  Click HKEY_CLASSES_ROOT →  *  → shellex → ContextMenuHandlers. From this list, delete the applications you don't want to be included in the context menu.\n Be extremely careful whenever editing something using the Registry, as using it incorrectly can damage your system. If you're not comfortable using regedit, try searching for freeware that will allow you to edit your Context Menu. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/49\\/Make-Your-Computer-Run-Faster-Step-8-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-8-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/49\\/Make-Your-Computer-Run-Faster-Step-8-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-8-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Install an  anti-virus program ,  spyware scanner , and an anti-malware.  The fewer bugs, viruses, and bits of adware your computer has to manage, the more time it will have to devote to other processes. [7] \n Keep Windows up-to-date. Not only will this keep Windows itself running smoothly, but some viruses ride in on Windows updates that are downloaded long after the update is available (and therefore are not monitored as closely). [8] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/66\\/Make-Your-Computer-Run-Faster-Step-9-Version-2.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-9-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/66\\/Make-Your-Computer-Run-Faster-Step-9-Version-2.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-9-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 7 \n Run a  Disk Cleanup .  This can clean up hundreds of megabytes by deleting temporary files, unnecessary system files, and emptying your recycling bin. [9]  Click My Computer, right-click Hard Drive, then click Properties. Click Disc Cleanup (within the General tab). A window will pop up asking which files you'd like to remove. Check those you wish to delete and run the cleanup. [10] \n You'll want to keep any game files (unless you want to delete your saved games) and setup files. \n If you have multiple drives or a partition, you must select the one you want to be cleaned. [11] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8e\\/Make-Your-Computer-Run-Faster-Step-10-Version-2.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-10-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8e\\/Make-Your-Computer-Run-Faster-Step-10-Version-2.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-10-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 8 \n Run a  Disk Defragment .  When data is fragmented, your computer must search for the fragments of files that could be spread all over your hard drive. Defragmenting will organize your data and free up space so your computer can access data faster. [12]  Click My Computer, then right-click Hard Drive. After you have right-clicked, click Properties, Tools, then click Defragment Now.\n Fragmented data can be on your hard disk or removable drives, like USB and flash drives. [13] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4a\\/Make-Your-Computer-Run-Faster-Step-11-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-11-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/4\\/4a\\/Make-Your-Computer-Run-Faster-Step-11-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-11-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 9 \n Disable visual effects.  There are 20 visual effects you can turn off or on. To turn off all effects and maximize performance, click Control Panel, System, then click Advanced System Settings. Select the bullet which says \"Adjust for best performance\". [14] \n If you don't want to sacrifice all the visual flair, try selecting the option which says,  Let windows choose what's best for my computer . [15] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/98\\/Make-Your-Computer-Run-Faster-Step-12-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-12-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/98\\/Make-Your-Computer-Run-Faster-Step-12-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-12-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 10 \n Add RAM to your computer.  To see if you need more RAM, initialize the Windows Task Manager by pressing  Ctrl + Alt + Del . Under the Performance tab, find the area devoted to Physical Memory (MB). If the number next to \"Available\" is less than 25% of the Total MB, you may need to add RAM. [16] \n Adding more memory may not necessarily make your computer run faster. If your computer is slow to switch between windows or tasks, or if you often have many browser tabs open at once, additional RAM may help. [17] \n You can take your computer to an expert to add RAM, like the Geek Squad at Best Buy, or you may decide to  add more RAM yourself . Just be sure to do your research before attempting to do it on your own. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b0\\/Make-Your-Computer-Run-Faster-Step-13-Version-3.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-13-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b0\\/Make-Your-Computer-Run-Faster-Step-13-Version-3.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-13-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 11 \n Remove gadgets you don't use.  Right-click on the desktop and click Gadgets. Right-click on the gadget you wish to delete and click Uninstall. [18] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Make-Your-Computer-Run-Faster-Step-14-Version-2.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-14-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/97\\/Make-Your-Computer-Run-Faster-Step-14-Version-2.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-14-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 12 \n Clear temporary files on your computer.  Your computer generates a lot of temporary files each time you boot up and/or use applications. This takes up a considerable amount of space, further slowing down your system. You should clean it whenever you think your PC is slowing down more than usual. To do this, press  ⊞  Win + R  and then type \"%temp%\" (without the quotes). Permanently delete ( ⇧  Shift + Delete ) all the files present in the folder. Just skip the files that the system says it was unable to delete.\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/19\\/Make-Your-Computer-Run-Faster-Step-15.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-15.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/19\\/Make-Your-Computer-Run-Faster-Step-15.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-15.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 13 \n Consider upgrading your computer's hardware.  It could be that your computer is running slow because of the old hardware that is running the newer software. When a computer was released the hardware was designed to run a specific OS or software versions. When newer versions of the software was released it was supported by the older hardware but just. The reason your computer may be running slow or freezing is because the older hardware is struggling to keep up with the newer software. Try replacing parts and this may speed your computer up\n Advertisement \n Method Two of Two: Macintosh Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6e\\/Make-Your-Computer-Run-Faster-Step-16.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-16.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6e\\/Make-Your-Computer-Run-Faster-Step-16.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-16.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Check your hard disk space .  Go to the Apple menu (the Apple icon in the upper left corner of your screen), then click About This Mac, More Info, then Storage. This will show you how much free space you have on your hard disk and will also break down your current usage, showing you how much space is used by your movie, music, photo, and app files. [19] \n Learning what type of files are taking up the most space will give you a starting point for what you should remove (either by deleting or moving to external storage). If you find that your massive music collection is taking up almost all of your space, you can solve your problem quickly by  transferring your iTunes library  onto an external drive. \n Try to keep at least 15% of your drive free so that your computer can run general maintenance. [20] \n If you never seem to have enough space on your hard disk, consider buying and installing a  Solid-State Drive  (SSD). They are generally sturdier and run much faster than hard drives, so your computer will zip along like new. [21] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/96\\/Make-Your-Computer-Run-Faster-Step-17.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-17.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/96\\/Make-Your-Computer-Run-Faster-Step-17.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-17.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Use your Activity Monitor to find out which applications are using the most memory.  Go to Library, Applications, then click Utilities. Launch the Activity Monitor by clicking it from the list. Select the  % CPU  column and see which programs are at the top. If it is using anything over 50%, running that program may be slowing everything down. [22] \n If you discover that one particular application is slowing down your Central Processing Unit (CPU), you can speed things up by deleting that application and using a faster alternative, or closing all other programs every time you use that application. \n Safari is often at the top of the list for CPU. Consider switching to a different browser, like Firefox or Chrome. [23] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/23\\/Make-Your-Computer-Run-Faster-Step-18.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-18.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/23\\/Make-Your-Computer-Run-Faster-Step-18.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-18.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Uninstall unnecessary programs.  You can either  uninstall them manually  by dragging apps into the trash or  by downloading a program to help you sort and delete them . [24]  iMovie, Garage Band and iPhoto are large programs that many people don't use, and are a good place to start.\n When in doubt, don't remove anything you don’t recognize: it may be critical to the function of your computer or another application. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Make-Your-Computer-Run-Faster-Step-19.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-19.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/ef\\/Make-Your-Computer-Run-Faster-Step-19.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-19.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Delete, compress, or remove large and unnecessary files.  You can search for large files by opening Finder and pressing  ⌘  Command + F  to search. Click on the Kind button and select Other. Scroll down to where it says Size and check the box to include it \"In Menu\" and click OK. Once that is done, you can search for large files--try \"files greater than 200 MB to begin with\". Delete, compress, or move any files you want to save to your back up drive.\n To compress something, click the item while holding down the  Ctrl  button and choose Compress. Double-clicking the zip file will decompress the item. \n Open the Downloads folder. Make sure you are viewing files as a list and then click on the Size header so that your largest files are on top. Get rid of anything you don't need. [25] \n Movies are generally the largest files--they can be between 1-2GB. Consider removing anything you are not watching or plan to watch soon. [26] \n Remember to empty your trash bin. If you delete photos in iPhoto or Aperture, you must empty the trash bin that exists in that program, or else the files will not be deleted. [27] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c1\\/Make-Your-Computer-Run-Faster-Step-20.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-20.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c1\\/Make-Your-Computer-Run-Faster-Step-20.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-20.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Prevent unnecessary programs from starting when the Mac boots.  The more programs trying to start up while your computer initializes, the slower everything will be. From the Apple Menu, go to System Preferences, Accounts, then click Login Items. Select any items you don’t need and click the minus ( - ) sign to remove them.\n Clearing your desktop of icons will also speed up the process, as the computer must load these items when starting up. Move the files on your desktop into folders or delete icons, and try not to download things directly to your desktop.  [28] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/05\\/Make-Your-Computer-Run-Faster-Step-21.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-21.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/05\\/Make-Your-Computer-Run-Faster-Step-21.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-21.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Repair disk permissions.  Go to Applications, Utilities, then click Run Disk Utility and select your startup disk. Then select First Aid and click Repair Disk Permissions. In running this procedure, your computer will search the permission settings on your hard drive to make sure files are accessible only to the users and applications that have permission to do so. [29]  Always restart your computer after running disk repair.\n If your disk permissions are not properly set, you may have trouble with some of the basic operations on your computer, such as printing, logging in, or opening programs. [30] \n It is suggested you run this procedure every few months to catch any potential issues before they interfere with your computer usage. [31] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/59\\/Make-Your-Computer-Run-Faster-Step-22.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-22.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/59\\/Make-Your-Computer-Run-Faster-Step-22.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-22.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 7 \n Remove unnecessary dashboard widgets.  Even if you don’t have the dashboard activated, these widgets can eat up RAM by running background updates while you try to do other things.\n If you have OS X 10.4.2 or later, use the Widget Manager: go to the Dashboard and open the Widget Bar by clicking the plus ( + ) sign in the corner. Click Manage Widgets and then either deselect widgets to disable them or, if they’re third-party widgets, remove them completely by pressing the red delete button, which is a circle with a line through it. Click OK to confirm. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fc\\/Make-Your-Computer-Run-Faster-Step-23.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-23.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/fc\\/Make-Your-Computer-Run-Faster-Step-23.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-23.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 8 \n Remove unused languages.  If you use Mac OS X, download a free program called Monolingual. With OS X, much of your computer’s hard disk is devoted to virtual memory and gets eaten up by language-availability software. Monolingual will allow you to remove languages you don’t use in order to free up space.\n No matter which language you use, never delete the English language files. Doing so may cause OS X to malfunction. [32] \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a2\\/Make-Your-Computer-Run-Faster-Step-24.jpg\\/v4-460px-Make-Your-Computer-Run-Faster-Step-24.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a2\\/Make-Your-Computer-Run-Faster-Step-24.jpg\\/v4-760px-Make-Your-Computer-Run-Faster-Step-24.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 9 \n Add more RAM to your computer.  This may be especially helpful if your computer is slow when opening applications or switching between running programs. [33]  To see if you need more RAM, open the Activity Monitor (Library → Applications → Utilities) and click System Memory. Look at the colors of the pie chart: if it's mostly green and blue, your RAM is fine. If the pie chart is mostly red and yellow, you should consider installing more RAM. [34] \n To see what kind of RAM your Mac uses, go to the Apple menu, then click About This Mac, then More Info. Under Memory in the Hardware tab, you can find the memory, size and type of RAM your computer uses. [35] \n If you choose to install the RAM yourself, search for \"RAM\" and your computer type on the Apple support page. Apple provides instructions for installing RAM on many of its computers.  [36] \n Advertisement \n Community Q&A \n Search \n Add New Question \n How can I speed up my web browser? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Delete any unnecessary cookies, and make sure that you are close to your wifi router. If you are using a laptop, try to connect to the router directly instead of going wireless.  \n Thanks! \n 13 \n 4 \n What do I do if It takes too long to delete all the stuff? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n If your computer takes a long time to delete files, you may have a virus. Install an anti-virus software and run a check. \n Thanks! \n 9 \n 3 \n Why has my computer gotten so slow? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n The more you use your computer, the more it becomes slow. Maybe it was infected by a malware or virus, or some processes that may slow down the computer, or you need to upgrade your hardware components. There are so many causes. Try checking the causes in the guide above. \n Thanks! \n 12 \n 5 \n How do I improve the performance of Windows 7? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Switch your OS (operating system) to an SSD for boot and an HDD for storage. Doing this will improve the speed. Also, add ram memory . \n Thanks! \n 15 \n 8 \n I have an i3 processor with a 4gb ram.  Why does my computer get stuck when I am playing games? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n The computer is too low end. Try getting a computer that has at least 8gb of RAM. If you have an integrated graphics card, try to replace it with a dedicated graphics card. This will help your game run more smoothly.  \n Thanks! \n 15 \n 15 \n I have a 3G network but YouTube is very slow. How can I speed it up? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Remove any apps that you do not need so see if that helps.  \n Thanks! \n 3 \n 2 \n Without Wi-Fi hardware in a desktop, how can we access Wi-Fi in desktop-only software? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Buy a cheap USB Wi-Fi adapter from a local electronics store or online.   \n Thanks! \n 4 \n 4 \n Will changing the resolution make it faster? \n Answer \n What sign do I look for that tells me my usb has performed and completed its task? \n Answer \n Show more unanswered questions \n Ask a Question \n 200 characters left \n Submit \n Video Edit \n Tips Edit \n It is best to  create a System Restore point  before you uninstall any programs or make any changes, so you can revert your computer back to a safe point if anything goes wrong. \n 10 \n Helpful? \n   1 \n As a general rule, it is best not to fiddle with anything you are not sure about. Try reading through several guides on the web to understand what you are doing before you attempt anything. \n 8 \n Helpful? \n   2 \n A clean install of the operating system will make your PC run much faster, but will erase all your files. \n 1 \n Helpful? \n   5 \n Add \n Warnings Edit \n Never delete system32 files on Windows . These are critical to running the operating system correctly and you will be unable to use your computer. \n 1 \n Helpful? \n   1 \n Related wikiHows Edit \n How to  Keep Your PC Running Fast and Smooth \n How to  Accept That Your Computer Is Slow \n How to  Make a Windows Computer Start up Faster \n How to  Set a Computer to Display Contents of the System Folder \n How to  Delete a Printer from a Macintosh Computer \n How to  Do Common Tasks Faster in Windows 7 \n How to  Speed Up WordPress \n How to  Optimize Your PC Performance \n How to  Fix if You Can't Access a Particular Website \n How to  Reset Your BIOS \n Advertisement \n Made Recently \n 3 years ago \n 3 years ago \n 3 years ago \n 3 years ago \n 3 years ago \n 3 years ago \n 3 years ago \n Loading... \n\t\t\t\t\tAdd a photo\t\t\t\t\t  Upload error \n Awesome picture! Tell us more about it?  Click here to share your story. \n View more \n About This Article \n How helpful is this? \n\t\t\t\tCo-authors:   99 \n Updated:  \n\t\t\t\tViews:  2,868,852 \n\t\t\t\tCategories:  System Maintenance and Repair \n Sources and Attribution \n Reader Success Stories \n\t\t\t\t\t\tMB\n Melissa Blackburn \n Jul 31, 2016 \n\t\t\t\t\"This review was very helpful. I did a few of the things that I could understand and or find and I noticed an  improvement in the speed of my laptop. Thanks so much!\" ...\"  more \n RobRoid \n Jul 13 \n\t\t\t\t\"Thank You wikiHow. My Computer is running faster now. I can't solve this without you. \"\n Rated this article:  \n\t\t\t\t\t\tJW\n John Wright \n Jun 6, 2016 \n\t\t\t\t\"Super helpful. I went from 28 GB free to 112 GB free, so I am very grateful.\"\n\t\t\t\t\t\tA\n Anonymous \n Jun 4 \n\t\t\t\t\"This article is very helpful, thank you. I'm very happy, and it's very good.\"\n Rated this article:  \n\t\t\t\t\t\tVN\n Vineethkrishnan Nair \n Jun 26 \n\t\t\t\t\"It helped me figure out as to what made my pc lag. Thanks a lot to wikiHow!\"\n\t\t\t\t\t\tSP\n Siphiwe Phakathi \n May 24 \n\t\t\t\t\"Thanks for the help, my computer is faster now. Great work, keep it up. \"\n\t\t\t\t\t\tA\n Anonymous \n Jun 7 \n\t\t\t\t\"Increased productivity and minimized frustration due to slow computer.\"\n Rated this article:  \n\t\t\t\t\t\tTM\n Trinity McDaniel \n Jul 6, 2016 \n\t\t\t\t\"Helped me a lot, also got to learn new techniques to teach others. :)\"\n\t\t\t\t\t\tKJ\n Khaled Jerraga \n Apr 9 \n\t\t\t\t\"My computer was so slow, and it did it better than any app I tried.\"\n Rated this article:  \n\t\t\t\t\t\tAC\n Anastasia Civil \n May 26 \n\t\t\t\t\"It was really helpful. I almost feel like I got a new computer.\"\n Rated this article:  \n\t\t\t\t\t\tMM\n Manan Mongia \n Jun 15, 2016 \n\t\t\t\t\"This article really helped make my PC faster. Thanks a lot!\"\n\t\t\t\t\t\tJC\n Julie Castro \n Sep 19 \n\t\t\t\t\"It is an old article. It tells me to go to control panel.\"\n\t\t\t\t\t\tMG\n Melissa Gutknecht \n Mar 13 \n\t\t\t\t\"The whole article is going to help me, I love this app!\"\n\t\t\t\t\t\tFZ\n Faiyaz Zaman \n Jun 6, 2016 \n\t\t\t\t\"I love this method, it's the best I've come across yet!\"\n Lamar \n Jun 2 \n\t\t\t\t\"It helped me very much. I needed this, thank you.\"\n Rated this article:  \n\t\t\t\t\t\tCM\n Colton Mazey \n Mar 6 \n\t\t\t\t\"This is a cool way to build myself a computer.\"\n\t\t\t\t\t\tAP\n Atharva P. \n Jun 19 \n\t\t\t\t\"It helped me a lot! Perfect solution. \"\n Rated this article:  \n\t\t\t\t\t\tA\n Anonymous \n Jun 28, 2016 \n\t\t\t\t\"It helped. Laptop runs faster now :)\"\n\t\t\t\t\t\tMK\n Meingandai Kamei \n Jan 31 \n\t\t\t\t\"This was really helpful, thank you.\"\n\t\t\t\t\t\tA\n Anonymous \n Jun 20, 2016 \n\t\t\t\t\"Thanks, this article helped me out!\"\n\t\t\t\t\t\tJB\n James Baxter \n Aug 14 \n\t\t\t\t\"My computer runs twice as fast now!\"\n Rated this article:  \n\t\t\t\t\t\tJ\n Joseph \n Jun 14 \n\t\t\t\t\"It contains lots of information.\"\n Rated this article:  \n\t\t\t\t\t\tA\n Anonymous \n Aug 15 \n\t\t\t\t\"Made my computer faster.\"\n Rated this article:  \n\t\t\t\t\t\tA\n Anonymous \n Jun 24, 2016 \n\t\t\t\t\"This was a bit helpful.\"\n More reader stories \n All reader stories \n Hide reader stories \n Share your story \n Is this article up to date? \n Yes \n No \n\t\t\t\tNo\n\t\t\t\t\t\t{{questionText}}\n\t\t\t\t\t\t{{currentMethod}}\n\t\t\t\t\t{{cheerText}}\n\t\t\t\t\t{{oopsText}}\n\t\t\t\tYes\n Share \n Steps Windows Macintosh Community Q&A Video Tips Warnings Related wikiHows Reader Pictures \n Surprise Me! \n 332"}