{"url": "https://en.wikipedia.org/wiki/Nudity", "content": "Nudity - Wikipedia \n Nudity   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n \"Clothes free\" redirects here. For the preference for nudity in non-sexualized social settings, see  Naturism . \n \"Birthday suit\" redirects here. For other uses, see  Birthday suit (disambiguation) . \n \"Nude\" and \"Naked\" redirect here. For other uses, see  Nude (disambiguation)  and  Naked (disambiguation) . \n Nude woman (at a Nude Ban Protest in  San Francisco ) \n Nude man (at the  World Naked Bike Ride  in  San Francisco ) \n Nudity , or  nakedness , is the state of wearing no  clothing . [1]  The wearing of clothing is a predominantly human characteristic arising from functional needs such as protection from the elements and from cold temperatures, after the loss of body hair, and migration to colder regions. [2]  The amount of clothing worn depends on functional considerations, such as a need for warmth, as well as social circumstances. In some situations, a minimum amount of clothing or none at all may be considered socially acceptable, while in others much more clothing may be expected. Social considerations involve cultural issues of  modesty , subjective  decency  and  social norms , besides other considerations, and these may depend on the context. There may also be  legal considerations . \n Contents \n 1   Terminology \n 2   History \n 3   Public nudity \n 3.1   Public social nude events \n 3.2   Means of attracting attention \n 3.3   Performance \n 4   Private nudity \n 4.1   Personal nudity \n 4.2   Sexual nudity \n 4.3   Personal privacy issues \n 4.4   Children \n 4.5   Children seeing nudity \n 4.6   Communal showering \n 4.7   Children and naturism \n 5   Depictions of nudity \n 5.1   Nudity in film \n 5.2   Visual media \n 5.3   Child nudity \n 6   Uses of nudity \n 6.1   Full body scanner \n 6.2   Imposed nudity \n 7   Western culture \n 7.1   Functional nudity \n 7.2   Toplessness and \"topfreedom\" \n 7.3   Naturism \n 7.4   Water activities \n 8   Non-Western attitudes \n 8.1   Africa \n 8.1.1   The curse of nakedness \n 8.1.2   Clothing and nudity \n 8.1.3   Liberia \n 8.2   Brazil \n 8.3   Asia \n 9   See also \n 10   References \n 11   Further reading \n 12   External links \n Terminology \n Full nudity  refers to complete nudity, while  partial nudity  refers to less than full nudity, with parts of the body covered in some manner. The term \"partial nudity\" is sometimes used to refer to exposure of skin beyond what the person using the expression considers to be within the limits of  modesty . If the exposure is within the standards of modesty of a given culture and setting (e.g. wearing a  bikini  at a non-nude beach), terms such as nudity, partial or otherwise, are not normally used. If however, the degree of exposure exceeds the cultural norms of the setting, or if the activity or setting includes nudity as an understood part of its function, such as a  nude beach , terminology relating to nudity and degrees thereof are typically used.  Toplessness  is regarded by most people as partial nudity. \n Full frontal nudity  describes a state of full nudity with the subject facing towards the viewer, with the whole front of the body exposed, including  intimate parts  such as a man's  penis  or woman's  vulva .  Partial frontal nudity  typically only refers to the exposure of the  breasts .  Non-frontal nudity  describes nudity where the whole back side of the body, including the  buttocks , is exposed, or a side-view from any other direction. \n History \n Main article:  History of nudity \n Hair probably evolved in mammals before about 220 million years ago. The closest genetic relatives of humans, apes and especially  chimpanzees , possess an almost complete covering of fur. \n Humans are today the only naked primate in nature, that is, most of the body is not naturally covered by fur. Reliable information on the development of nudity and the passage of time are not yet possible because hair does not fossilize. \n Researchers at the University of Utah in 2004 found that human skin contains photoreceptors like those in the retina, allowing it to mount an immediate defence against damaging ultraviolet radiations. They suspect that the protein that protects the skin from sunlight evolved following the loss of protective hair, which happened about 1.2 million years ago. [3] \n Public nudity \n Main article:  Public nudity \nNude woman posing on a street in  Budapest \nA group of  naturists  on a beach \n People have a variety of views on nudity, both of their own as well as those of others. This would depend on their level of  inhibition , cultural background and upbringing, as well as on context. A society's attitude to public nudity varies depending on the culture, time, location and context of an activity. There are many exceptions and particular circumstances in which nudity is tolerated, accepted or even encouraged in  public spaces . Such examples would include a  nude beach , within some  intentional communities  (such as  naturist  resorts or clubs) and at special events. \n In general and across cultures, public indications of  sexual arousal  are commonly regarded as  embarrassing , both to the person aroused and the onlooker, and for this reason those parts of the human body that would indicate arousal are normally covered. Arousal is most evidently indicated by the  sex organs  and women's  breasts , which are routinely covered, even when other parts of the body may be freely uncovered. Yet the nudity taboo may have meanings deeper than the immediate possibility of sexual arousal, for example, in the cumulative weight of tradition and  habit . Clothing also expresses and symbolizes authority, and more general norms and values besides those of a sexual nature. \n While some European countries, such as Germany, are rather tolerant of public nudity, [4]  in many countries public nudity may meet social disapproval or even constitute a misdemeanor of  indecent exposure . In 2012, the city council of  San Francisco  proposed a ban on public nudity in the inner city area. This was met by harsh resistance since the city is usually known for its liberal culture. [5] [6]  Similarly,  park rangers  began filing tickets against nudists at  San Onofre State Beach  in 2010, also a place with long tradition of public nudity. [7] \n Public social nude events \nNude people mixing with clothed people at the  Przystanek Woodstock  festival in Poland \n Some people take part in non-sexual public nude events. These may be in a  naturist  resort or club or at a  nude beach . Outdoor  nude recreation  can take place in private or rural areas, though generally limited to warm weather. \n Others practice casual public nudity. Topfree sunbathing is considered acceptable by many on the beaches of Finland, France, Spain, Italy and most of the rest of Europe (and even in some outdoor swimming pools); however, exposure of the genitals is restricted to nudist areas in most regions. In the United States, topfree sunbathing and wearing  thongs  are not common in many areas, but are limited to nude beaches in various locations. It is normally acceptable for men in the U.S. to be  barechested  or shirtless when engaged in outdoor recreational activities. \n World Naked Bike Ride  in  London , 2012 \n Where the social acceptability of nudity in certain places may be well understood, the legal position is often less clear cut. In England, for example, the law does not actually prohibit simple public nudity, but does forbid indecent exposure [ citation needed ] . In practice, this means that successful prosecution hangs on whether there is a demonstrable intention to shock others, rather than simply a desire to be nude in a public place. Specifically, using nudity to \"harass, alarm or distress\" others is an offence against the Public Order Act of 1986. Occasional attempts to prove this point by walking naked around the country therefore often result in periods of arrest, followed by release without charge, and inconsistencies in the approach between different police jurisdictions. Differences in the law between England and  Scotland  appear to make the position harder for naked ramblers once they reach Scotland. \n Photography of  installations  of massed nude people in public places, as made repeatedly around the world by  Spencer Tunick , claim artistic merit. \n Means of attracting attention \n Main article:  Nudity and protest \n Nudity is at times used to draw attention to a cause, with the participants desiring to remain anonymous. Public nude events are at times staged as a forum for usually unrelated messages, such as  clothing-optional bike rides . At times, the cause is merely a personal justification for taking part in a nude event, which are popular in their own right. Many  nude calendars  are produced each year featuring naked men or women. Some of these are produced to raise money for charities or other causes. Nudity, like sexuality, is also used to draw attention for a commercial purpose, such as for  promotion or advertising . \n Performance \n Nudity may be used as a part of artistic or erotic performance, such as in  Nude Performance art , nude  Body painting ,  Sex show ,  Striptease ,  Adult entertainment convention , and in adult-only events like  Folsom Street Fair ,  Nudes-A-Poppin' , etc. \n Private nudity \n The examples and perspective in this section  may not represent a  worldwide view  of the subject .  You may  improve this article , discuss the issue on the  talk page , or  create a new article , as appropriate.   (July 2011)   ( Learn how and when to remove this template message ) \n Personal nudity \n In the privacy of their own homes, people are more casual in relation to clothing, though what each considers appropriate varies considerably. What and how much clothing a person removes depends on a number of considerations, including the cultural background and on whether the person is alone in the privacy of their own homes. The removal of overclothing, such as coats, hats, gloves, scarves and the like, is the norm in virtually all households. It is also common for people to remove outdoor shoes when entering one's home and at times guests may also be expected to do the same. It is also common to change out of work clothes (such as a suit and tie, overalls etc.) into something lighter, looser and more comfortable, and perhaps for a woman to remove her bra or stockings. Beyond that, how much more is removed depends on personal taste, habits, circumstance and relationships of the people inside the household at a particular time. \n A person's cultural background as well as their religious teachings will affect the way they view their own nudity or state of dress, alone or in the presence of others, as well as how they view the nudity of others. Some cultures deprecate nudity even in a private context. \n Another factor is the level of privacy to which a person can be assured - for example, some parts of a home may be seen from the outside or there may be a possibility of others walking in. The expectation of privacy may be confined to the home and sometimes the backyard. Inside the home, it may be restricted to the bedroom or just the bathroom. If a person is not alone, their comfort in removing clothing in front of another person will generally depend on the nature of a relationship of those who jointly occupy the same private space, as well as the attitudes of others to nudity. Besides the nature of a relationship, attitudes and incidences of nudity will also depend on the level of  inhibition  that each person has, as well as the level of privacy to which that they can be assured. Sometimes a person may unintentionally intrude on a person who is in the nude, which may lead to embarrassment of one or both of the people. The nude person may seek to quickly cover their private parts, while the clothed person may turn away, but this also depends on cultural differences and the relationship of the people. \n In the case of nudity in front of those who do not normally occupy the same private space, that will usually depend on whether the outsider is comfortable with the nudity and whether the nudity is reciprocated, as in the case of  social nudism . Social nudism may take place in any private social context, such as at one's home with friends or with acquaintances at a nudist facility or event, such as a naturist club, community center, resort or other facility. To generate an atmosphere of fun at a social gathering and lighten the social atmosphere, or to heighten the  sexual atmosphere  and ease those present into some state of nudity, organisers of a social gathering may organise  party games , which may involve some level of nudity, such as  strip games , for example  strip poker , which can be played by single-sex groups or by mixed groups. \n A 1999 survey by the  Federation of Canadian Naturists  found, besides other things, that 39% of Canadians \"have walked or would walk around their house nude\"; that  naturists  tend to have above average incomes; that urban dwellers are more likely to be naturists than country dwellers; and that people under the age of 25 are the most likely to be naturists. [8]  According to a 2004 United States survey, 31% of men and 14% of women report sleeping in the nude, [9]  while a 1996  BBC  survey revealed that in the UK 47% of men and 17% of women do. [10] \n Sexual nudity \n Main article:  Nudity and sexuality \nA nude couple in bed \n Nudity in front of a  sexual partner  is widely accepted, but not in all cases. For example, some partners insist on nudity only at the time and place of  sex , or with subdued lighting; during bathing with the partner or afterward; covered by a sheet or blanket, or while sleeping. \n Personal privacy issues \n The invention of photography and more recently the  video camera  has opened the art of capturing images of people and scenes at a relatively low cost to the true amateur. A person can now capture images in both public and private situations. A feature of most private photographs and videos is that they are not intended for viewing outside of a very limited range of people, and seldom if ever by the general public.  Amateur photography , which includes nude photography, which has previously been produced for personal enjoyment, is increasingly being more widely disseminated through the internet, at times without the knowledge and consent of the subject of the photograph, and to their subsequent embarrassment. Also, the use of  secret photography  to capture images of an unsuspecting person (undressed or not, and whether for personal use, or intended for posting on the Internet) creates additional personal  privacy  issues. \n Some people are made anxious by being nude or being in the presence of nude people; if this begins to interfere with their well-being, the  phobia  is called gymnophobia. [11] \n Children \n  There are differences of opinion as to whether, and if so to what extent, parents should appear naked in front of their children. Gordon and Schroeder report that parental nudity varies considerably from family to family. [12]  They say that \"there is nothing inherently wrong with bathing with children or otherwise appearing naked in front of them\", noting that doing so may provide an opportunity for parents to provide important information. They note that by ages five to six, children begin to develop a sense of modesty, and recommend to parents who wish to be sensitive to their children's wishes that they limit such activities from that age onwards. Bonner recommends against nudity in the home if children exhibit sexual play of a type that is considered problematic. [13] \n A U.S. study by  Alfred Kinsey  found that 75% of the participants stated that there was never nudity in the home when they were growing up, 5% of the participants said that there was \"seldom\" nudity in the home, 3% said \"often\", and 17% said that it was \"usual\". The study found that there was no significant difference between what was reported by men and by women with respect to frequency of nudity in the home. [14] \n In a 1995 review of the literature, Paul Okami concluded that there was no reliable evidence linking exposure to parental nudity to any negative effect. [15]  Three years later, his team finished an 18-year longitudinal study that showed that, if anything, such exposure was associated with slight beneficial effects, particularly for boys. [16] \n Children seeing nudity \nTwo children bathing in a small metal  bathtub \n Attitudes toward children seeing nude people vary substantially, depending on the child's culture, age and the context of the nudity (see also the section  Home  above). \n Television and radio regulations in many countries require broadcasters to avoid transmitting images or language considered inappropriate for children from 5:30 am to 9 pm (the so-called \" watershed \"). In the United Kingdom, the Broadcasting Code states, \"Nudity before the watershed must be justified by the context.\" [17]  In the U.S., the  safe harbor  rule forbids depictions of nudity between the hours of 6 am and 10 pm. Violators may be subject to civil legal action and sanctions if the  Federal Communications Commission  (FCC) determines the broadcaster did not meet its standards of \"decency\". \"Material is indecent if, in context, it depicts or describes sexual or excretory organs or activities in terms patently offensive as measured by contemporary community standards for the broadcast medium.\" [18] \n Attitudes to nudity vary substantially throughout Europe. Male and female nudity in  Scandinavia  is not uncommon. The region has a very open attitude about nudity, although it strictly prohibits children's access to pornography. [19] \n Communal showering \n Main article:  Communal shower \n Another issue has been the nudity of children in front of other children. \n In  continental Europe , students tend to shower communally after  physical education  classes, separated by gender. Fathers taking their young daughters or mothers taking their young sons into the gender-separated changing rooms is mostly viewed as non-controversial, although some public baths have introduced family changing rooms. Some private gymnasiums have instituted rules specifically banning family members of opposite genders taking their children into single-sex locker rooms. [ citation needed ] \n In the U.S. and some of the English-speaking majority of Canada, students at  public schools  have historically been required to shower communally with classmates of the same sex after physical education classes. In the U.S., public objections and the threat of lawsuits have resulted in a number of school districts in recent years changing policy to make showers optional. Private  boarding schools  and  military academies  in the U.S. often have communal showers, since the focus there is on 24-hours-a-day education and rooming, rather than just acting as day schools. Students in these establishments need places to clean themselves daily. [20]  A court case in  Colorado  noted that students have a reduced expectation of personal privacy in regards to \"communal undress\" while showering after physical education classes. [21]  According to an interview with a  middle school   principal , most objections to showering at school that he had heard were actually from the students' parents rather than from the students. [22] \n Children and naturism \nA naturist family at  Senftenberg lake  in the 1980s \n Children who are within a  naturist  home will usually also be naked, together with their family, and may see and be seen by non-family members in the nude. They may also be taken to naturist venues and events where they, their families and others would also generally be nude. \n Depictions of nudity \n Nudity in film \n Main article:  Nudity in film \n Nudity in film has, since the development of the medium, been somewhat controversial, though there was no defined censorship, especially of nudity, in the early years of Hollywood, until the  Hays Code  of the 1930s. Under present-day guidelines, most nude scenes in films have had to be justified as being part of the story, in the concept of \"artistically justifiable nudity\". In some cases nudity is itself the object of a film or is used in the development of the character of the subject. There are film scenes where nudity, in routine and non-sexual situations, such as mixed shower scenes, has been used to emphasize gender equality in the future. [23] [24] [25] \n In some cases, nudity has been criticized as \"superfluous\" or \"gratuitous\" to the plot, and some film producers have been accused of including nudity in a film to appeal to audiences. Many actors and actresses have appeared nude, or exposing parts of their bodies or dressed in ways considered provocative by contemporary standards at some point in their careers. \n Erotic films  usually contain nudity, and nudity in a sexual context is common in  pornographic films . A film on naturism, or about people for whom nudity is common, for example, many societies and people who live in hot climates, or films set in times such as the 1960s or 1970s era of liberation, may contain non-sexual nudity, and many non-pornographic films contain nude scenes. \n Visual media \n Main article:  Nudity in art \n Nudity in art: chalk drawing (left) and photography (right) \n Mainstream art generally reflects – with some exceptions – social standards of  aesthetics  and  morality  of a society at various periods of time. Beyond mainstream standards, artistic expression may be merely tolerated, or be considered as fringe. Since prehistoric time, humans, both male and female, have been depicted in all states of dress, including all states of undress. Nudity in all styles has been and continues to be found in art. Nudity is also a subject of many literary works and in film. All professionally produced works of art use stylised  compositions  to depict the nude body. This also applies to cinema, where even nude scenes are staged and rehearsed. \n The erotic aspect of nudity in the arts has been an important factor in its attraction, and has come to be associated with certain states and emotions, such as innocence, playfulness, vulnerability, etc. Pornography does not necessarily involve a naked person, but it involves sexualized scenes, and usually it does not claim to have any artistic merit. \n The visual arts were at times the only means available to the general public to view a nude body. Today, the opportunities available for the viewing of the nude body are very wide, and these include magazines, television, films, and the Internet. \n Child nudity \nCarlo Cignani's  Triumph of Cupid \n Depictions of child nudity  or children with nude adults appear in  works of art  in various cultures and historical periods. These attitudes have changed over time and have become increasingly frowned upon particularly in recent years, [26]  especially in the case of photography. In recent years, there have been a few incidents in which snapshots taken by parents of their infant or toddler children bathing or otherwise naked were challenged as  child pornography . [27] \n In May 2008, police in Sydney, Australia, raided an exhibition by the photographer  Bill Henson  featuring images of naked children on allegations of child pornography. [28] [29]  Comparable artworks by Henson had been exhibited without incident since 1975, perhaps indicating that this sensitivity has heightened in recent years. \n In June 2008, it was reported in  The Age  that police would have no basis to prosecute Henson over his photographs of naked teenagers, after they were declared \"mild and justified\" and given a PG rating by the  Australian Classification Board , suggesting viewing by children under the age of 16 is suitable with parental guidance. [30]  Out of protest, the  Art Monthly Australia  magazine published an image of the 6-year-old  Olympia Nelson  taken by her mother,  Polixeni Papapetrou . According to the then-11-year-old Olympia, she did not believe the photograph amounted to abuse and was upset with Prime Minister  Kevin Rudd 's remark that he hated it. Olympia's father, art critic Professor  Robert Nelson , defended it, saying: \"It has nothing to do with  pedophilia . The connection between artistic pictures and pedophilia cannot be made and there is no evidence for it.\" [31] [32] \n Uses of nudity \n Full body scanner \n Main article:  Full body scanner \n A full-body scanner is a device that creates an image of a person's nude body through their clothing to look for hidden objects without physically removing their clothes or making physical contact. They are increasingly being deployed at airports and train stations in many countries. \n One technology used under the name \"full-body scanner\" is the  millimeter wave scanner , the active form of which reflects  extremely high frequency   radio waves  off the body to make an image on which one can see some types of objects hidden under the clothes. Passive millimeter wave screening devices rely on only the raw energy that is naturally emitted from the human body or objects concealed on the body; passive devices do not transmit millimeter waves. [33] [34]  Another technology in use is the  backscatter X-ray . \n Imposed nudity \n Prisoner abuse at the Abu Ghraib prison  in  Baghdad  ( Iraq ), including forced nudity and  humiliation  by  U.S. soldiers , was widely condemned. \n In some situations, nudity is imposed on a person. For example, imposed nudity (full or partial) can be part of a  corporal punishment  or as  humiliation , especially when administered in public. In fact,  torture  manuals have distinguished between the male and female psychological aversion to self-exposure versus being disrobed. \n Nazis  used forced nudity to attempt to humiliate inmates in  concentration camps . This was depicted in the film  Schindler's List . [35] \n In 2003,  Abu Ghraib prison  in  Baghdad  ( Iraq ) gained international notoriety for accounts of  torture and abuses  by members of the  United States Army Reserve  during the  post-invasion period . Photographic images were circulated that exposed the posing of prisoners naked, sometimes bound, and being intimidated and otherwise humiliated, resulting in widespread condemnation of the abuse. \n Western culture \n Functional nudity \n Functional nudity for a short time, such as when changing clothes on a beach, is sometimes acceptable, while staying nude on the beach generally is not nor is it legal in some jurisdictions. On designated  nude beaches , it is acceptable and legal to be nude. \n Breastfeeding in public  is forbidden in some  jurisdictions , not legislated for in others, and a legal right in public and the workplace in yet others. Where it is a legal right, some mothers may be reluctant to  breastfeed , [36] [37]  and some people may object to the practice. [38] \n Toplessness and \"topfreedom\" \n Main articles:  Toplessness  and  Topfreedom \nA woman sunbathing  topless \n In some cultures,  toplessness  is regarded as partial nudity, and the exposure of breasts or  nipples  may be regarded as indecent exposure. However, in many western societies and in appropriate settings, such as while suntanning, toplessness is not, of itself, normally regarded as indecent. [ citation needed ]  In the United States, however, exposure of female nipples is a criminal offense in many states and not usually allowed in public (see  indecent exposure ), while in the United Kingdom, nudity may not be used to \"harass, alarm or distress\" according to the Public Order Act of 1986. [39]  Different standards apply to art, with one example being the dome of the  US Capitol  featuring  a fresco  depicting goddesses with their breasts exposed. \n Prosecution of cases has given rise to a movement advocating \" topfreedom \", promoting equal rights for women to have no clothing above the waist, on the same basis that would apply to men in the same circumstances. The term  topfree  rather than  topless  is advocated to avoid the latter term's perceived sexual connotations. \n Naturism \n Main article:  Naturism \nA group of  naturists  at  Haulover Park  beach, USA \n Naturism (or nudism) is a  cultural  and political movement practising, advocating and defending private and  public nudity . It is also a lifestyle based on personal, family and/or social preference. [40] [41] \n Naturists reject contemporary standards of  modesty , which discourage personal, family and social nudity. They instead seek to create a social environment where individuals feel comfortable in the company of nude people, and being seen nude, either just by other naturists, or also by the general public. [40] [41] \n Water activities \n Main articles:  Nude swimming  and  Sauna \nNude swimmers at a beach in  Brighton , United Kingdom \n The trend in some European countries (for instance Germany, Finland and the  Netherlands ) is to allow both genders to bathe together naked. Many German spas allow mixed nude bathing. For example, the Friedrichsbad in  Baden-Baden  has designated times when mixed nude bathing is permitted. Most German (not to mention French, Spanish and Greek) beaches and swimming pools offer  FKK  (clothing-optional) areas. In general, continental Europeans have a more relaxed attitude about nudity than is seen in the British-influenced world. Some have attributed this difference to the influence of  Queen Victoria 's husband  Albert , who was raised in a very restricting religious sect (see  Victorian morality ). \n The  sauna , originating from  Finland , is attended nude in its source country [42]  as well as in most Scandinavian and in the German-speaking countries of Europe. [43]  This is true even when a swimsuit must be worn in the swimming pool area of the same complex. [42]  Saunas are very common in modern  Finland , where there is one sauna for every three people [44]  and became very popular in the remainder of Europe in recent decades. German soldiers had got to know the Finnish saunas during their fight against the  Soviet Union  in the  Continuation War , where Germany and Finland fought on the same side. Finnish hygiene depended so exclusively on saunas, that they had built saunas not only in mobile tents but even in bunkers. [43] . After the war, the German soldiers brought the habit back to Germany and Austria, where it became popular in the second half of the 20th century. [43]  The German sauna culture also became popular in neighbouring contries such as Switzerland, Belgium, the Netherlands and Luxemburg. [45]  In contrast to Scandinavia, public sauna facilities in these countries commonly do not seggregate genders while still keeping the rule of general nudity. [46] [45] \nIn  Russia , public  banyas  are also attended nude, however, they are always segregated by gender, either by having separate sections, or by days of the week. Shared areas (such as swimming pools), if present, can only be attended in bathing suits. \n Non-Western attitudes \nNude indigenous woman in  German East Africa , early 20th century \n Attitudes in  Western cultures  are not all the same as explained above, and likewise attitudes in non-Western cultures are many and variant. In almost all cultures, acceptability of nudity depends on the situation. \n Cultural and/or religious traditions usually dictate what is proper and what is not socially acceptable. Many non-Western cultures allow women to breastfeed in public, while some have very strict laws about showing any bare skin. \n Africa \n The curse of nakedness \n Main article:  Anasyrma \n In Africa, women have used stripping naked on purpose as a curse, both historically, and in modern times. The idea is that women give life and they can take it away. The curse initiates an extreme form of  ostracism , which anthropologist Terisa Turner has likened to \"social execution\". The curse extends to foreign men as well, and is believed to cause impotence, madness or other similar harm. [47]  The threat has been used successfully in mass protests against the  petroleum industry  in Nigeria, [48]  by  Leymah Gbowee  during the  Second Liberian Civil War , [49]  and against President  Laurent Gbagbo  of the  Ivory Coast . [50] \n Clothing and nudity \n Different traditions exist among, for example,  sub-Saharan Africans , partly persisting in the  post-colonial  era. Whereas it is the norm among some ethnic and family groups including some Burkinabese and Nilo-Saharan (e.g.  Nuba  and  Surma people ) in daily life or on particular occasions not to wear any clothes or without any covering below the waist – for example, at highly attended stick-fighting tournaments well-exposed young men use the occasion to catch the eye of a prospective bride. \n Liberia \n In modern  Liberia , soldiers under  General \"Butt Naked\" Joshua Blahyi  fought naked in order to terrorize their opponents. [51]  Nude except for lace-up leather shoes and a gun, the general led his fierce  Butt Naked  Battalion into battle on behalf of the warlord  Roosevelt Johnson , who hired the unclothed warriors for their fearlessness and fighting skills. \n Brazil \n In  Brazil , the  Yawalapiti , an indigenous  Xingu tribe  in the  Amazon Basin , practice a funeral ritual known as  Quarup , to celebrate life, death and rebirth, and also involves the presentation of all young girls who have begun menstruating since the last Quarup and whose time has come to choose a partner. \n Asia \n Kuroda Seiki : Wisdom Impression Sentiment, Kuroda Memorial Hall, Tokyo \n In Japan, public baths are very common. Bathing nude with family members or friends in public bath houses, saunas, or natural hot springs ( Onsen ) is popular. \n In  Korea , public baths ( Jjimjilbang ) are widespread and communal nude bathing is normal, although nudity is not permitted in unisex areas. \n Nudity is considered shamelessness in the conservative society of  India , although nude beaches can be found in  Goa  and nude saints like those of the  Digambara  sect of  Jainism  and  Hindu   Sadhus  are respected and worshipped. \n In many  Muslim countries , public nudity is illegal. \n See also \n Sexuality portal \n History of nudity \n Nude (art) \n Model (art) \n Academy figure \n Figure drawing \n Depictions of nudity \n The Naked Ape  (book by Desmond Morris) \n Nude photography \n Nudity in film \n Burlesque \n Heroic nudity \n Nudity in combat \n Nudity in religion \n Nudity in sport \n Streaking \n Clothed female, naked male \n Clothed male, naked female \n References \n ^   \"nudity – Definitions from Dictionary.com\" . Dictionary.reference.com . Retrieved  17 October  2009 .   \n ^   Toups, M. A.; Kitchen, A; Light, J. E.; Reed, D. L. (2011).  \"Origin of clothing lice indicates early clothing use by anatomically modern humans in Africa\" .  Molecular Biology and Evolution .  28  (1): 29–32.  doi : 10.1093/molbev/msq234 .  PMC   3002236   .  PMID   20823373 .   \n ^   \"Skin 'sees' the light to protect against sunshine\" .  New Scientist . 2014-11-04 . Retrieved  2016-02-13 .   \n ^   \"Baring It All: Get Naked with the Germans\" .  SPIEGEL ONLINE . 10 May 2006 . Retrieved  13 September  2016 .   \n ^   Taub, Gypsy (23 November 2012).  \"The naked truth about San Francisco's nudity ban\" .  the Guardian . Retrieved  13 September  2016 .   \n ^   Reynolds, Eoin (20 November 2012).  \"San Francisco nudists warn of backlash if anti-naked law passes\" .  the Guardian . Retrieved  13 September  2016 .   \n ^   \"SAN ONOFRE: State begins citing nudists at beach\" .  The San Diego Union-Tribune . 23 March 2010 . Retrieved  13 September  2016 .   \n ^   \"1999 National Survey on Canadian Attitudes Towards Nudity - Survey Conclusions\" .  Federation of Canadian Naturists . Ontario, Canada: Federation of Canadian Naturists. 1999. Archived from  the original  on 2013-12-05 . Retrieved  20 September  2011 .   \n ^   \"American Sex Survey\"   (PDF) . abcnews. 2004. p. 26 . Retrieved  2009-09-04 .    Short Analysis  here \n ^   The Clothes Show Magazine , May 1996, BBC Magazines \n ^   Bullough, Vern L.; Bullough, Bonnie (2014).  Human Sexuality: An Encyclopedia . Routledge. p. 449.  ISBN   9781135825096 .   \n ^   Betty N. Gordon and Carolyn S. Schroeder (1995).  Sexuality: A Developmental Approach to Problems . Springer. p. 16.  ISBN   0-306-45040-2 .   \n ^   Barbara L. Bonner (1999). \"When does sexual play suggest a problem?\". In Howard Dubowitz and Diane Depanfilis.  Handbook for Child Protection Practice . Sage Publications. p. 211.  ISBN   0-7619-1371-8 .   \n ^   John Bancroft (2003).  Sexual Development in Childhood . Indiana University Press. pp. 146–147.  ISBN   0-253-34243-0 .   \n ^   Okami. P. (1995) .\" Childhood exposure to parental nudity‚ parent-child co-sleeping‚ and 'primal scenes': A review of clinical opinion and empirical evidence,\"  Journal of Sex Research , 32: 51–64. \n ^   Okami, P., Olmstead, R., Abramson, P. & Pendleton, L. (1998).  “Early childhood exposure to parental nudity and scenes of parental sexuality (‘primal scenes’): An 18-year longitudinal study of outcome,”   Archives of Sexual Behavior , 27(4), 361–384. \n ^   \"The Ofcom Broadcasting Code\" . Ofcom (Office of Communications, UK). 25 July 2005. Archived from  the original  on 11 December 2007 . Retrieved  1 January  2008 .   \n ^   \"Frequently asked questions about Obscenity, Indecency and Profanity\" . Federal Communications Commission . Retrieved  25 March  2010 .   \n ^   Mapes, Terri.  \"Sexuality in Scandinavia: How Scandinavia Looks at Sexuality\" . Retrieved  17 October  2007 .   \n ^   ACLU of Washington.  \"ACLU-WA's Work for Student Rights\" . Archived from  the original  on 3 April 2007 . Retrieved  28 April  2007 .   \n ^   \"TRINIDAD SCHOOL DISTRICT NO. 1 v. CARLOS R. LOPEZ\" . Archived from  the original  on 27 September 2007 . Retrieved  28 April  2007 .   \n ^   \"Interview with John Pleacher 2/16/87\" . Archived from  the original  on 17 March 2005 . Retrieved  28 April  2007 .   \n ^   \"Starship Troopers 29':12 \" .   \n ^   \"Gender Neutral Bathrooms\" .   \n ^   \"Starship Troopers-Trivia\" .  The base that houses the Fleet Academy is named \"Tereshkova\" after Russian cosmonaut Valentina Tereshkova, the first woman in space. There are many more examples in the movie of the future being gender-neutral (meaning there is no bigotry based on gender), such as the mixed-shower scene and the female captain.   \n ^   Higonnet, Anne (1998).  Pictures of Innocence – The History and Crissi of Ideal Childhood . London: Thames & Hudson.  ISBN   0-500-28048-7 .   \n ^   Kincaid, James R.  \"Is this child pornography?\" . Retrieved  28 April  2007 .   \n ^   Paul Bibby (23 May 2008).  \"Henson exhibition shut down\" .  The Age . Australia . Retrieved  2 September  2008 .   \n ^   See also  Jock Sturges  and  Julia Somerville . \n ^   \"No charges for Henson\" .  The Age . 6 June 2008.   \n ^   AAP (7 July 2008).  \"Photo girl defends naked cover shot\" .  The Age . Australia.   \n ^   Photograph of  Olympia Nelson depicting Lewis Carroll's   Beatrice Hatch  before White Cliffs, 2003 from Polixeni Papapetrou's website. \n ^   Mitchel Laskey (17 March 2010).  \"An Assessment of Checkpoint Security: Are Our Airports Keeping Passengers Safe?\"   (PDF) .  House Homeland Security Subcommittee on Transportation Security & Infrastructure Protection . Archived from  the original   (PDF)  on 5 December 2010.   \n ^   Matthew Harwood (3 May 2010).  \"Companies Seek Full-Body Scans That Ease Health, Privacy Concerns\" .  Security Management . Archived from  the original  on 6 October 2014.   \n ^   Substantive and Procedural Aspects of International Criminal Law: The Experience of International and National Courts ; by Gabrielle Kirk McDonald, Olivia Swaak-Goldman; Published by Brill, 2000; pp. 280–283 \n ^   Wolf, JH (2008).  \"Got milk? Not in public!\" .  International breastfeeding journal .  3  (1): 11.  doi : 10.1186/1746-4358-3-11 .  PMC   2518137   .  PMID   18680578 .   \n ^   \"Breastfeeding Legislation in the United States: A General Overview and Implications for Helping Mothers\" .  LEAVEN .  41  (3): 51–4. 2005.   \n ^   Jordan, Tim; Pile, Steve, eds. (23 May 2003).  Social Change (Sociology and Society) . Blackwell. p. 233.  ISBN   9780631233121 .   \n ^   \"What is the Law Covering Nudity in the UK? Is Nudity Lawful on Unofficial Nude Beaches?\" . Gouk.about.com. 8 October 2009 . Retrieved  17 October  2009 .   \n ^  a   b   See 2002–2003 World Naturist Handbook, pub International Naturist Federation INF-FNI, Sint Hubertusstraat, B-2600 Berchem(Antwerpen)  ISBN   90-5583-833-0  The Agde definition. The INF is made up of representative of the Naturist Organisations in 32 countries, with 7 more having correspondent status. The current edition is *  Naturisme, The INF World Handbook  (2006)  [1]   ISBN   90-5062-080-9   Archived  29 September 2007 at the  Wayback Machine . \n ^  a   b   \"International Naturist Federation\" . Inf-fni.org . Retrieved  10 December  2011 .   \n ^  a   b   Nakedness and the Finnish Sauna . Corz.org. Retrieved on 7 October 2011. \n ^  a   b   c   Scheuch, Manfred (2004).  Nackt; Kulturgeschichte eines Tabus im 20. Jahrhundert  (in German). Wien: Christian Brandstätter Verlag. pp. 156ff.  ISBN   3-85498-289-5 .   \n ^   Weaver, Fran. (2010-10-08)  thisisFINLAND – Seeking the real Finnish Sauna . Finland.fi. Retrieved on 7 October 2011. \n ^  a   b   \"Saunakultur und Bekleidungsfrage\" . die Zeit. 2014-11-18 . Retrieved  2017-05-21 .  Dass Männer und Frauen zusammen splitternackt schwitzen, ist eine deutsche Spezialität, für die sich nur noch Urlauber aus den Benelux-Staaten, aus Österreich und der Schweiz erwärmen können, vielleicht auch noch Osteuropäer.   \n ^   Manfred Scheuch:  Nackt; Kulturgeschichte eines Tabus im 20. Jahrhundert ; Christian Brandstätter Verlag; Wien 2004;  ISBN   3-85498-289-5  page 158. Quote:  In den Fitnesszentren und Kuranstalten wurde das finnische Bad, oft großzügig ausgestaltet zu ganzen Saunalandschaften, zum selbstverständlichen Angebot. Bemerkenswert ist, dass dort heute zumeist auf getrennte Badezeiten für Männer und Frauen verzichtet wird. Nacktheit von Mann und Frau in der Sauna wird hier längst akzeptiert und das hat ein positives soziales Gesamtklima erzeugt, das selbstregulierend – die seltenen Ausnahmen bestätigen die Regel – das Verhalten der Badegäste bestimmt. Verpöhnt ist [...] der Versuch, sich in Badekleidung [...] unter die Nackten zu mischen. \n ^   The Curse of Nakedness . Imow.org. Retrieved on 22 April 2015. \n ^   Naked Ploy Is Latest Threat in Oil Wars   Archived  11 July 2012 at the  Wayback Machine .. Commondreams.org (2002-07-31). Retrieved on 7 October 2011. \n ^   Leymah Gbowee and Abigail Disney Shoot for Peace in Liberia . Oprah.com. Retrieved on 7 October 2011. \n ^   \"The Ivory Coast Effect\"   (article) .  The New Yorker . 22 March 2011 . Retrieved  22 March  2011 .   \n ^   How to Fight, How to Kill: Child Soldiers in Liberia: Roles and Responsibilities of Child Soldiers . Hrw.org. Retrieved on 7 October 2011. \n Further reading \n Brandom, Robert, \"Critical Notice of Blind and Worried\",  Theoria  70:2–3, 2005. \n Etymology OnLine- various lemmate  &  \"Online Etymology Dictionary\" . Etymonline.com. 1 July 1929 . Retrieved  17 October  2009 .   \n Rouche, Michel, \"Private life conquers state and society,\" in  A History of Private Life  vol I, Paul Veyne, editor, Harvard University Press 1987  ISBN   0-674-39974-9 \n Storey, Mark   Social Nudity, Sexual Attraction, and Respect   Nude & Natural  magazine, 24.3 Spring 2005. \n Storey, Mark  Children, Social Nudity and Academic Research   Nude & Natural  magazine, 23.4 Summer 2004. \n Dennis Craig Smith,  The Naked Child: The Long-Range Effects of Family and Social Nudity   Palo Alto : R & E Research Associates (1981)  ISBN   978-0-86548-056-8 \n Dennis Craig Smith,  Growing Up Without Shame , Elysium Growth Press, book, 1986 \n Smith, Dennis Craig,  Naked Fear , Ultraviolet Press, 2010 \n External links \n Wikimedia Commons  has media related to:\n Nudity  ( category ) \n  Quotations related to  Nudity  at Wikiquote \n 20th century nude in the \"History of Art\" \n Nudity in Ancient to Modern  Cultures by Aileen Goodson  (This chapter excerpt is from Aileen Goodson's Therapy, Nudity & Joy) \n v \n t \n e \n Nudity ,  modesty  and related topics \n Naturism \n International Naturist Federation \n Public nudity \n Christian naturism \n Gay naturism \n Naturist magazines \n Naturist resorts \n Anarchist naturism \n Nude recreation \n Nude beach \n Naked restaurant \n Nudity in sport \n Clothing-optional bike ride \n Naked hiking \n Massage \n Hot tubbing \n Bathing \n Banya \n Sauna \n Turkish bath \n Strip game \n Nude beaches \n Naked restaurants \n Depictions of nudity \n Nude (art) \n Body painting \n Naked News \n Model (art) \n Nude Model \n Nudity in film \n Nude photography \n Nude photography (art) \n Nudity in American television \n Nudity in science fiction \n Nudity in music videos \n Nudity in advertising \n Nude calendar \n Nudity and sexuality \n Exhibitionism \n Voyeurism \n Anasyrma \n Mooning \n Striptease \n Stripper \n feminist stripper \n Softcore pornography \n Erotic photography \n Sexual objectification \n Issues in social nudity \n Indecent exposure \n Obscenity \n Topfreedom \n Nudity and protest \n Sex segregation \n Breastfeeding in public \n Dress code \n Clothing laws by country \n Awrah \n Nudity in religion \n Strip search \n By location \n Africa \n Asia \n Europe \n North America \n Oceania \n South America \n Historical figures \n Kurt Barthel \n Lee Baxandall \n Paul Bindrim \n Ilsley Boone \n Lady Godiva \n Henry S. Huntington \n Heinrich Pudor \n Elton Raymond Shaw \n Richard Ungewitter \n See also \n American Nudist Research Library \n Society for Indecency to Naked Animals \n American Gymnosophical Association \n History of nudity \n Timeline of non-sexual social nudity \n List of social nudity organizations \n Nudity in combat \n Nudity clause \n Imagery of nude celebrities \n Clothing-optional events \n Social nudity advocates \n Toplessness \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Nudity&oldid=809965103 \"\t\t\t\t\t \n Categories :  Nudity Nude art Nude beaches Public nudity Hidden categories:  Webarchive template wayback links CS1 German-language sources (de) Wikipedia indefinitely semi-protected pages Wikipedia indefinitely move-protected pages Use dmy dates from April 2012 All articles with unsourced statements Articles with unsourced statements from July 2009 Articles with limited geographic scope from July 2011 Articles with unsourced statements from April 2009 Articles with unsourced statements from December 2016   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read View source View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n In other projects \n Wikimedia Commons Wikiquote   \n Languages \n Afrikaans العربية বাংলা Български Brezhoneg Català Čeština ChiShona Dansk Deutsch Eesti Español Esperanto Euskara فارسی Français Galego 한국어 हिन्दी Hrvatski Ilokano Bahasa Indonesia Italiano עברית Қазақша Kreyòl ayisyen Magyar مصرى Bahasa Melayu Nederlands 日本語 Norsk Polski Português Ripoarisch Română Русский Scots සිංහල Simple English Slovenčina Српски / srpski Srpskohrvatski / српскохрватски Suomi Svenska Tagalog தமிழ் తెలుగు ไทย Türkçe Українська Tiếng Việt ייִדיש 中文   \n Edit links   \n  This page was last edited on 12 November 2017, at 16:46. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}