{"url": "https://www.gerezmieuxvotreargent.ca/politique-daccessibilite-pour-les-services-la-clientele/", "content": "Politique d’accessibilité pour les services à la clientèle | GetSmarterAboutMoney.ca \n Passer au contenu \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n A \n Utiliser une police de taille normale \n A \n Utiliser une police de grande taille \n  Contraste\t\t\t \n English \n     Menu \n A \n Utiliser une police de taille normale \n A \n Utiliser une police de grande taille \n  Contraste\t\t\t \n English \n Recherche pour: \n Search \n Investir \n Notions de base sur les placements \n Faites vos premiers pas \n Introduction multilingue \n Comprendre le risque \n Conseils financiers \n Préparer un plan \n Suivi de votre progression \n Produits d’investissement \n Rentes \n Obligations \n Placements complexes \n Fonds négociés en bourse \n Titres dispensés de prospectus \n Fonds communs de placement et fonds distincts \n Immobilier \n Obligations d’épargne \n Actions \n Régimes d’épargne et de retraite au travail \n Régimes d’epargne \n Régimes enregistrés d’épargne-études \n Régimes enregistrés d’épargne-retraite \n Fonds enregistrés de revenu de retraite \n Régimes enregistrés d’épargne-invalidité \n Comptes d’épargne libre d’impôt \n Planifier et gérer \n Notions de base sur la planification \n Comptes bancaires \n Budget \n Planification financière \n Assurance de personnes \n Comprendre l’impôt \n Gérer ses dettes \n Épargner \n Testaments et planification d’une succession \n Les vérités universelles \n Retraite \n Planification de la retraite \n Vivre votre retraite \n Régimes enregistrés d’épargne-retraite \n Fonds enregistrés de revenu de retraite \n Rentes \n Régimes d’épargne et de retraite au travail \n Conseils financiers \n Faire affaire avec un conseiller \n Trouver un conseiller \n Verification de l’inscription \n Porter plainte \n Le rendement des placements et le coût des conseils \n Événements de la vie \n Planifier votre avenir \n Acheter une maison \n Mourir \n Éducation \n Se divorcer \n Se marier \n Avoir un bébé \n Hériter de l’argent \n Planification de la retraite \n Élever une famille \n Protéger votre argent \n Avertissements à l’intention des investisseurs \n Fraude \n Se protéger contre la fraude \n Signaler une escroquerie \n Verification de l’inscription \n Protection des investisseurs \n Réglementation au Canada \n Verification de l’inscription \n Porter plainte \n Introduction du financement participatif en capital \n Le rendement des placements et le coût des conseils \n Calculatrices et outils \n Calculatrices \n Intérêts composés \n Récupérer la valeur d’un placement \n Frais associés aux fonds communs de placement \n Valeur nette \n Rembourser des dettes ou investir \n Rembourser des cartes de crédit et d’autres dettes \n Rendement d’un portefeuille par rapport à des indices de référence \n Épargne REEE \n Épargne REER \n CELI \n Outils \n Le Match monétaire mental \n Aperçu du fonds : exemple interactif \n Questionnaire sur l’amour et l’argent \n Questionnaire sur le profil de risque \n Sondage de 2014 sur l’état d’esprit des Canadiens face aux risques liés à l’argent \n Votre modèle d’énoncé de politique de placement \n Graphique Interactif – Placements \n Feuilles de calcul \n Ressources \n Publications \n Bulletin électronique \n Recherches et rapports \n Glossaire \n Fiches d’information \n Infographies \n Brochures \n Introduction multilingue \n Re: Investir \n Le rendement des placements et le coût des conseils \n Introduction du financement participatif en capital \n Home  >  Politique d’accessibilité pour les services à la clientèle \n Politique d’accessibilité pour les services à la clientèle \n Politique d’accessibilité pour les services à la clientèle de la Commission des valeurs mobilières de l’Ontario – Prestation de services aux personnes handicapées \n 1. Prestation de services aux personnes handicapées \n La  Commission Commission  Somme que vous versez à un courtier ou à un mandataire pour ses services. On l’appelle souvent « commission de vente ». Par exemple, vous versez des honoraires à la personne qui achète ou vend des actions ou des biens immobiliers pour vous. + read full definition  des valeurs mobilières de l’Ontario (CVMO) s’est engagé à faire preuve d’excellence dans la  prestation Prestation  Argent, biens ou services que vous obtenez de votre travail ou d’un programme gouvernemental, comme le Régime de pensions du Canada. + read full definition  de services à tous les membres du public, y compris aux personnes handicapées, et elle assumera ses fonctions et ses responsabilités dans les domaines qui suivent. \n Communications \n Nous communiquerons avec les personnes handicapées en tenant  compte Compte  Entente que vous avez conclue avec une institution financière concernant votre argent. Vous pouvez ouvrir un compte pour faire des dépôts et des retraits, accumuler des intérêts, emprunter une somme d\u0092argent, investir, etc. + read full definition  de leur handicap. Nous formerons notre personnel sur la façon d’interagir et de communiquer avec des personnes ayant différents types de handicaps. \n Publications \n Nous fournirons nos publications et nos communications en médias substituts, sur demande, en temps opportun et selon les caractéristiques des documents (par exemple, la longueur d’un document ou le format requis). \n Appareils et accessoires fonctionnels \n Nous nous sommes engagés à fournir des services aux personnes handicapées ayant besoin d’appareils et accessoires fonctionnels pour les utiliser ou en profiter. Nous veillerons à ce que nos employés connaissent les divers appareils et accessoires fonctionnels dont les personnes handicapées peuvent se servir pour accéder à nos services. \n Nous nous assurerons aussi que nos employés savent comment utiliser les appareils et accessoires fonctionnels qui sont disponibles dans nos locaux. Les appareils et accessoires fonctionnels suivants ont été installés ou sont disponibles. \n Aires communes de l’immeuble : \n Des dispositifs d’ouverture automatique des portes ont été installés sur les portes d’entrée de la rue et du centre commercial de l’immeuble où est situé le bureau de la CVMO. \n Il y a aussi des plateformes élévatrices pour fauteuils roulants près des portes d’entrée de la rue et du centre commercial de l’immeuble. Il est possible d’obtenir de l’aide immédiate pour les utiliser en appuyant sur le bouton de contact qui s’y trouve. \n Les numéros d’étage sont indiqués sur le pourtour des ascenseurs au moyen d’un lettrage en relief et d’une signalisation en braille. \n Il y a des pavés numériques en relief à l’intérieur des ascenseurs pour le choix des étages. \n Un avis sonore se fait entendre dans les halls d’entrée des ascenseurs pour indiquer la direction des ascenseurs (une sonnerie pour indiquer qu’un ascenseur monte, et deux pour indiquer qu’il descend). \n 2. Recours à des personnes de soutien et à des animaux d’assistance \n Bien que les bureaux de la CVMO ne soient pas ouverts au public, nous nous sommes engagés à accueillir les visiteurs handicapés accompagnés d’une personne de soutien ou d’un animal d’assistance. Jamais nous n’empêcherons un visiteur handicapé accompagné d’une personne de soutien d’avoir accès à cette personne pendant sa visite dans nos locaux. \n 3. Avis d’interruption temporaire \n La CVMO émettra un avis en cas d’interruption planifiée ou imprévue de l’accès aux installations ou aux services habituellement utilisés par les personnes handicapées. Cet avis comprendra des renseignements sur la raison et la  durée Durée  Période de temps visée par un contrat. Aussi, période pendant laquelle un placement génère un taux d’intérêt donné. + read full definition  prévue de cette interruption, ainsi qu’une description des installations ou des services de remplacement à utiliser, le cas échéant. L’avis sera affiché dans toutes les entrées publiques et tous les comptoirs de services de nos locaux, ainsi que sur notre site Web. \n 4. Formation du personnel \n Tous les membres du personnel de la CVMO sont formés à l’égard des sujets suivants : \n Objectif de la Loi de 2005 sur l’accessibilité pour les personnes handicapées de l’Ontario et exigences des Normes d’accessibilité pour les services à la clientèle. \n Façon d’interagir et de communiquer avec des personnes ayant différents types de handicaps. \n Façon d’interagir avec les personnes handicapées qui utilisent un appareil ou accessoire fonctionnel, ou qui ont recours à une personne de soutien ou à un animal d’assistance. \n Disponibilité des appareils et accessoires fonctionnels dans nos locaux. \n Marche à suivre si une personne handicapée a de la difficulté à accéder à nos services. \n Politiques, pratiques et procédures relatives aux Normes d’accessibilité pour les services à la clientèle. \n Cette formation est donnée lorsque les employés entrent en fonction. Tous les employés doivent confirmer qu’ils ont reçu la formation sur les politiques, les pratiques et les procédures d’accessibilité. Ils recevront aussi une formation supplémentaire lorsque des modifications seront apportées à ces politiques, pratiques et procédures. \n 5. Processus de rétroaction \n Nous souhaitons que vous puissiez communiquer facilement avec nous. Nous offrons un accès égal à nos services, et l’excellence dans la prestation de ceux-ci nous tient à cœur. Vos commentaires à cet égard sont les bienvenus. Si vous n’êtes pas satisfait du niveau de service reçu, nous vous invitons à communiquer avec nous pour discuter de vos préoccupations ou pour fixer un rendez-vous afin d’en discuter en personne. Des employés formés pour servir la clientèle sont à votre disposition du lundi au vendredi, de 9 h à 17 h. Pour nous joindre par téléphone, composez le 416-309-4490. Vous pouvez également nous envoyer un courriel à InvestorOffice@osc.gov.on.ca ou nous écrire à la Commission des valeurs mobilières de l’Ontario, 20, rue Queen Ouest, 22e étage, Toronto (Ontario) M5H 3S8. De plus, vous pouvez communiquer avec nous en remplissant le formulaire de demande de renseignements en ligne que vous trouverez sur notre site Web à l’adresse www.GerezMieuxVotreArgent.ca. Nous nous engageons à répondre aux demandes de renseignements dans un délai de sept jours ouvrables. \n 6. Modifications à la présente politique ou à d’autres politiques \n Nous nous sommes engagés à élaborer des politiques concernant l’accessibilité des services, qui respectent et favorisent la dignité et l’autonomie des personnes handicapées. Par conséquent, avant d’apporter toute modification à la présente politique, nous tiendrons compte de son effet sur les personnes handicapées. Toutes les politiques de la CVMO respecteront et favoriseront la dignité et l’autonomie des personnes handicapées. \n 7. Questions sur la présente politique \n La présente politique vise à assurer l’excellence dans la prestation de services aux personnes handicapées. Si vous avez des questions sur la politique, communiquez avec nous en composant le 1-877-785-1555 ou en envoyant un courriel à  InvestorOffice@osc.gov.on.ca . Nous vous répondrons pendant les heures normales de bureau. \n Vous pourriez également aimer… Accessibilité à la Commission des valeurs mobilières de l’Ontario Bienvenue sur votre NOUVEAU site Web GerezMieux VotreArgent.ca Le point de vue des investisseurs Rapport d’activité de Bureau des investisseurs pour 2015-16 Recherches et rapports \n Vous pourriez également aimer… Accessibilité à la Commission des valeurs mobilières de l’Ontario Bienvenue sur votre NOUVEAU site Web GerezMieux VotreArgent.ca Le point de vue des investisseurs Rapport d’activité de Bureau des investisseurs pour 2015-16 Recherches et rapports \n Dernière mise à jour le  14 juin 2017   \n Communiquez avec nous \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n À notre sujet \n Communiquez avec nous \n Bulletin électronique \n Médias \n Multilingue \n Glossaire \n OSC in the Community \n Site Web de la CVMO \n Conditions d’utilisation \n Politique de confidentialité \n Accessibilité à la Commission des valeurs mobilières de l’Ontario \n Communiquez avec nous \n   Consulter notre page Facebook \n   Consulter notre page Twitter \n Inscrivez-vous à l'Actualité des investisseurs \n Tenez-vous au courant des plus récentes initiatives visant les investisseurs, des ressources pédagogiques ainsi que des avertissements et des alertes à l’intention des investisseurs. \n Inscrivez-vous \n Consulter les numéros précédents \n © Commission des valeurs mobilières de l’Ontario 2017 \n Partager sur Facebook \n Partager sur Twitter \n Partager par courriel \n Imprimer l'article \n Partager sur les réseaux sociaux \n Nous poser une question sur l'investissement \n Partage sur les réseaux sociaux \n Fermer le lien sur l'investissement \n Partager sur Facebook \n Partager sur Twitter \n Partager par courriel"}