{"url": "http://www.w3.org/TR/2016/NOTE-WCAG20-TECHS-20161007/F13", "content": "F13: Failure of Success Criterion 1.1.1 and 1.4.1 due to having a text alternative that does not\n                    include information that is conveyed by color differences in the image | Techniques for WCAG 2.0\n               Techniques for WCAG 2.0 Skip to Content (Press Enter)   Contents Intro Previous:  Failure F12 Next:  Failure F14 On this page: Important Information about Techniques Applicability Description Examples Resources Related Techniques Tests -     F13: Failure of Success Criterion 1.1.1 and 1.4.1 due to having a text alternative that does not\n                    include information that is conveyed by color differences in the image Important Information about Techniques See  Understanding Techniques for WCAG Success Criteria  for important information about the usage of these informative techniques and how they relate to the normative WCAG 2.0 success criteria. The Applicability section explains the scope of the technique, and the presence of techniques for a specific technology does not imply that the technology can be used in all situations to create content that meets WCAG 2.0. Applicability All technologies. This failure relates to: \n\t\t\t\tSuccess Criterion 1.1.1 (Non-text Content) \n\t\t\t\t\t\tHow to Meet 1.1.1 (Non-text Content)\n\t\t\t\t\t\tUnderstanding Success Criterion 1.1.1 (Non-text Content)\n\t\t\t\tSuccess Criterion 1.4.1 (Use of Color) \n\t\t\t\t\t\tHow to Meet 1.4.1 (Use of Color)\n\t\t\t\t\t\tUnderstanding Success Criterion 1.4.1 (Use of Color)\n\t\t\t\t\t Description The objective of this technique is to describe the failure that occurs when\n                        an image uses color differences to convey information, but the text alternative for the\n                        image does not convey that information. This can cause problems for people\n                        who are blind or colorblind because they will not be able to perceive the\n                        information conveyed by the color differences. Examples A bar chart of sales data is provided as an image. The chart includes\n                                yearly sales figures for four employees in the Sales Department. The\n                                text alternative for the image says, \"The following bar chart\n                                displays the yearly sales figures for the Sales Department. Mary\n                                sold 3.1 Million; Fred, 2.6 Million; Bob, 2.2 Million; and Andrew,\n                                3.4 Million. The red bars indicate sales that were below the yearly\n                                quota\". This text alternative fails to provide the information which\n                                is conveyed by the color red in the image. The alternative should\n                                indicate which people did not meet the sales quota rather than\n                                relying on color. Resources No resources available for this technique. Related Techniques G94: Providing short text alternative for non-text content that serves the same purpose and presents the same information as the non-text content Tests Procedure For all images in the content that convey information by way of color differences:  Check that the information conveyed by color differences is not included in\n                                    the text alternative for the image. Expected Results If step #1 is true, then this failure condition applies and\n                                    content fails the Success Criterion. Top Contents Intro Previous:  Failure F12 Next:  Failure F14 This Web page is part of  Techniques and Failures for Web Content Accessibility Guidelines 2.0  (see the  latest version of this document ). The entire document is also available as a  single HTML file . See the  The WCAG 2.0 Documents  for an explanation of how this document fits in with other Web Content Accessibility Guidelines (WCAG) 2.0 documents. To send public comments, please follow the  Instructions for Commenting on WCAG 2.0 Documents .\n  Copyright  © 2016  W3C ®  ( MIT ,  ERCIM ,  Keio ,  Beihang ). W3C  liability ,  trademark  and  document use  rules apply."}