{"url": "http://www.stm.info/fr/transport-adapte/utiliser-le-transport-adapte/reserver-modifier-et-annuler/reserver-un-deplacement", "content": "Réserver un déplacement | Société de transport de Montréal \n Aller au contenu principal \n Aller au champ de recherche \n Aller au menu principal de niveau 1 \n Aller au sous-menu de niveau 2 \n Aller au sous-menu de niveau 3 \n Aller au contenu additionnel \n Aller au pied de page \n Société de transport de Montréal \n Société de transport de Montréal \n Menu \n Se déplacer \n Se déplacer \n Infos pratiques \n   Nos réseaux \n Métro \n Bus - Horaires \n Taxi collectif \n      Tout voir       \n   État du service \n État du service métro \n État du service bus \n Travaux \n      Tout voir       \n   Titres et tarifs \n Télécharger la grille tarifaire en vigueur (PDF) \n Carte OPUS et autres supports \n Titres de transport \n      Tout voir       \n   Service à la clientèle \n Nous joindre \n Centres de service \n Objets trouvés \n      Tout voir       \n   Conseils aux passagers \n 5 façons d’obtenir vos horaires \n Outils lors d'interruptions de service \n Visiteurs \n      Tout voir       \n   Règlements et sécurité \n Règlements \n Voyager en sécurité \n Constats d'infraction et amendes \n      Tout voir       \n   Accessibilité réseau \n Accès en fauteuil roulant \n Accès au métro par ascenseur \n Accessibilité déficience intellectuelle ou visuelle \n      Tout voir       \n Vers Infos pratiques \n Transport adapté \n   À propos \n Qu’est-ce que le transport adapté? \n Service à la clientèle \n Bulletin Transport Contact \n      Tout voir       \n   Admission \n Demande d'admission \n Critères d’admission \n Carte d’identité sur OPUS \n      Tout voir       \n   Titres et tarifs \n Titres et support acceptés au Transport adapté \n Montant exact \n 1 passage \n      Tout voir       \n   Utiliser le transport adapté \n Territoire desservi \n Types de déplacements \n Horaire du service \n      Tout voir       \n   Consignes et conseils \n Se préparer au déplacement \n Aides à la mobilité \n Bagages et équipement \n      Tout voir       \n   Formulaires \n      Tout voir       \n Vers Transport adapté \n Offres et sorties \n   Privilèges \n Offres exclusives \n Concours \n      Tout voir       \n   Sorties \n Événements \n Lieux de grands rassemblements \n 375e de Montréal \n      Tout voir       \n   Dans le réseau \n Étoiles du métro \n Lire vous transporte \n Exposition à l'Escale \n      Tout voir       \n   Infolettres \n Mouvement collectif \n Découvrez notre infolettre \n      Tout voir       \n   Boutique STM \n Boutique \n      Tout voir       \n Vers Offres et sorties \n À propos \n   Découvrez la STM et son histoire \n Histoire \n Art dans le métro \n STM INFO \n      Tout voir       \n   Grands projets \n Métro AZUR \n iBUS \n Mesures préférentielles pour bus (MPB) \n      Tout voir       \n   Gouvernance d'entreprise \n Conseil d’administration \n Les membres du conseil d’administration \n Participer aux travaux du conseil d’administration \n      Tout voir       \n   Informations d'entreprise et financières \n Présentation de la STM \n Plan stratégique organisationnel 2025 \n Budgets et rapports d'entreprise \n      Tout voir       \n   Sondages et consultations \n Ma voix ma STM \n Bus électriques \n Consultations publiques \n      Tout voir       \n   Accessibilité \n Accessibilité universelle \n Accessibilité web \n      Tout voir       \n   Espace affaires \n Groupes \n Activités commerciales \n Partenariats et autorisations \n      Tout voir       \n   Développeurs \n Condition d'utilisation \n Description des données disponibles \n      Tout voir       \n Vers À propos \n À propos   \n Admission   \n Titres et tarifs   \n Utiliser le transport adapté   \n Consignes et conseils   \n Formulaires   \n Nous joindre   \n Emplois   \n Espace affaires   \n Salle de presse   \n Ma STM   \n English \n Rechercher dans ce site \n Réserver un déplacement \n Transport adapté \n Utiliser le transport adapté \n Réserver, modifier et annuler \n Réserver un déplacement \n Territoire desservi   \n Types de déplacements   \n Horaire du service   \n Temps de déplacement   \n Réserver, modifier et annuler   \n Réserver un déplacement   \n Modifier un déplacement   \n Annuler un déplacement   \n SIRTA étape par étape   \n Rappels automatisés   \n Véhicules du transport adapté   \n En ligne \n Par téléphone avec un agent \n Infos requises pour réserver \n Déplacement régulier \n Déplacement occasionnel \n Déplacement de groupe \n Déplacement métropolitain \n Par services automatisés \n Liste des lieux publics desservis par le service de transport adapté \n En ligne   SIRTA, le site de réservation en ligne, vous permettent de :   Consulter les informations de votre dossier   Réserver un déplacement occasionnel   Voir vos réservations confirmées pour les 7 prochains jours   Voir vos déplacements réguliers et occasionnels   Annuler un déplacement régulier ou occasionnel   Interrompre les déplacements réguliers pour un maximum de 8 semaines   Informations requises   Numéro de dossier   Mot de passe  \t\t(Même mot de passe que celui que vous utilisez pour les services automatisés par téléphone).  \t\tSi vous ne l’avez jamais modifié, le mot de passe est composé des quatre chiffres formant votre date de naissance (mois et jour – ex. 28 janvier = 0128).  \t\tVous devrez modifier votre mot de passe lors de votre première visite pour qu’il soit plus sécuritaire.   RÉSERVATION EN LIGNE   Consultez le  Guide d'utilisation de SIRTA  pour plus d'information.   Par téléphone avec un agent   Les heures d’ouverture du centre de réservations sont de 7 h à 21 h, tous les jours.   Composez le 514 280-8211, option 1, un agent vous demandera le type de réservation que vous souhaitez faire.   Infos requises pour réserver   Assurez-vous d’avoir ces informations en main avant de faire une réservation :   Le numéro de dossier de l’usager   Adresses exactes de l’origine et de la destination avec le lieu d’embarquement et de débarquement  \t\tPour les lieux publics très fréquentés, la STM détermine l’endroit d’embarquement et de débarquement.   Heures d'arrivée et de retour souhaitées  \t\tVous devez également connaître les heures d’ouverture et de fermeture de votre destination.   Aides à la mobilité utilisées lors de vos déplacements  \t\tEx. Fauteuil, marchette, chien de service, etc.   Présence d'un accompagnateur  \t\tIncluant ses aides à la mobilité ou l’espace supplémentaire requis.   Le motif du déplacement  \t\tEx. médical, travail, études, loisirs, atelier, etc.  \t\tCette information pourrait vous être demandée. Elle sert à déterminer la priorité du déplacement advenant une situation extraordinaire où des déplacements devraient être annulés par la STM.   Déplacement régulier   Avec un agent :  514 280-8211, option 1   Par télécopieur :  514 280-6313   Par courrier :  \t\tCentre de transport adapté de la STM  \t\t3111, rue Jarry Est  \t\tMontréal (Québec)  \t\tH1Z 2C2   Déplacement occasionnel   Avec un agent :  514 280-8211, option 1   Par les Services automatisés* :  514 280-8211, option 3   En ligne  1  :  cliquez ici pour réserver un déplacement occasionnel .   Vous pouvez réserver à compter de 7 jours avant la date du déplacement.   Toute demande de déplacement effectuée sur le territoire de la STM est acceptée pour le lendemain (aucun refus jusqu’à la veille du déplacement).   Une demande de déplacement pour le jour même sera traitée selon la disponibilité des ressources et pourrait être refusée.   Déplacement de groupe   Le déplacement de groupe est offert seulement pour les déplacements ayant lieu sur le territoire de l’île de Montréal.   Formulaires pour la réservation d'un déplacement de groupe   Un mois avant le premier déplacement d'un groupe, veuillez nous envoyer le formulaire :   Demande de déplacement de groupe - renseignements préliminaires (Word)   Réservez ensuite votre déplacement :   Demande de déplacement de groupe   Demande d’un horaire régulier pour plusieurs usagers (Word)   Nous devons avoir reçu votre demande de réservation de groupe au moins 10 jours à l'avance.   Par courriel :  groupes.ta@stm.info   Par télécopieur : 514 280-5317   Par courrier :  \t\tCentre de transport adapté de la STM  \t\t3111, rue Jarry Est  \t\tMontréal (Québec)  \t\tH1Z 2C2   Déplacement métropolitain   Pour réserver un déplacement métropolitain, régulier ou occasionnel, vous devez préalablement remplir et acheminer le formulaire  Consentement à la communication de renseignements personnels  (infos sur comment le transmettre sont sur le formulaire). Cela permet de partager les informations de votre dossier avec les autres transporteurs.   Au moment de votre première réservation, un délai de 5 jours pourrait s'appliquer, entre la réception du formulaire et le premier déplacement.   Toute demande de transport métropolitain doit être reçue avant midi la veille du déplacement.   Pour réserver, suivre la démarche habituelle du déplacement régulier ou occasionnel.   * Pour une réservation le jour même, il faut communiquer avec un agent (aucune réservation en ligne ou par les services automatisés n’est acceptée.)   Par services automatisés   Vous pouvez utiliser les services automatisés (un système de réponse vocale interactive) en composant le 514 280-8211, option 3.   Voici les services offerts :   Demande de déplacement occasionnel, aller-retour;   Demande de déplacement occasionnel, aller seulement;   Annulation de déplacement et interruption temporaire de déplacements réguliers (important ajout);   Signalement d’un retard;   Confirmation ou consultation de déplacements.   Pour parler à un agent (possible durant les heures d’ouvertures), faites le 0.   Informations requises   Numéro de dossier   Mot de passe  \t\tMême mot de passe que celui que vous utilisez pour la Réservation en ligne.  \t\tSi vous ne l’avez jamais modifié, le mot de passe est composé des quatre chiffres formant votre date de naissance (mois et jour – ex. 28 janvier = 2801). Vous devrez modifier votre mot de passe lors de votre première visite pour qu’il soit plus sécuritaire.     Ouvrir la section:  Vous trouverez plus de détails sur la réservation par services automatisées en cliquant ici.     Afin d’assurer la confidentialité de vos transactions, 2 étapes doivent être franchies pour accéder au menu des services automatisés.  Après avoir choisi l’option 3, vous devez :   Entrer d’abord les 5 ou 6 chiffres de votre numéro de dossier, suivi du dièse (#)   Entrer le code d’accès de 4 chiffres. Votre code d’accès est constitué du mois et du jour de votre date de naissance.  Exemple : 17 avril = 0417   Ces étapes franchies, il suffit de choisir un des services proposés.   Demande de déplacement occasionnel   Les menus 1 et 2 permettent de faire des demandes de déplacement occasionnel.   Attention! Avant d’utiliser ces menus, vous devez d’abord créer votre Liste d’adresses favorites (maximum de 8) afin d’utiliser la fonction Demande de déplacement occasionnel des services automatisés.   Vous devez compléter le formulaire à cet effet et le faire parvenir :   Par courriel :  adresses.favorites@stm.info  \t\t\t\tPar télécopieur : 514 280-6313 ou par la poste (adresse en page 52)    \t\t   \t\t Vous recevrez également une liste des lieux publics qui vous sera nécessaire pour toute demande de déplacement occasionnel à l’un de ces endroits.   Le lieu d’origine et la destination doivent toujours correspondre à l’une de ces 3 définitions :   Résidence   Adresse de résidence de l’usager   Adresse favorite   Adresse que vous aurez choisie lors de la création de votre Liste d’adresses favorites. Un numéro est associé à chaque adresse favorite (vous avez droit à un maximum de 8 adresses favorites). Une fois la liste établie, vous pouvez la maintenir à jour par l’entremise d’un agent à la réservation (option 1)   Lieu public   Lieu très fréquenté par nos usagers inscrit sur la Liste des lieux publics. Les demandes de déplacements peuvent se faire jusqu’à 7 jours à l’avance mais jamais pour le jour même par les services automatisés.   Détails sur le menu des services automatisés :    \t\t\tMenu 1 : Demande de déplacement occasionnel aller-retour   Choisir ce menu si :   La demande exige la planification de 2 déplacements, soit un aller et un retour   Vous connaissez l’adresse d’origine de chaque déplacement (adresse du lieu de départ)   Vous connaissez l’adresse de destination de chaque déplacement (adresse du lieu d’arrivée).   Menu 2 : Demande de déplacement occasionnel aller seulement   Choisir cette option si :   La demande exige la planification d’un seul déplacement (aller)   Vous connaissez l’adresse d’origine de votre déplacement (adresse du lieu de départ)   Vous connaissez l’adresse de destination de votre déplacement (adresse du lieu d’arrivée)  \t\t\t\t    Menu 3 : Annulation de déplacement   3+1  Annulation pour la journée en cours ou les 7 prochains jours de tout déplacement confirmé.   3+2  Annulation définitive d’un déplacement régulier dont vous n’aurez plus jamais besoin.   3+3  Interruption des déplacements réguliers pendant un maximum de 8 semaines (vacances, maladie, etc.). Les déplacements reprennent automatiquement après la période d’interruption. Une annulation de plus de 8 semaines exige l’annulation définitive des déplacements réguliers (menu 3+2).   Menu 4 : Signalement d’un retard   À utiliser lorsqu’un véhicule se présente plus de 30 minutes après l’heure de confirmation du déplacement.   Menu 5 : Consultation ou confirmation d’un déplacement   Les menus  5+1  à  5+4  vous permettent de consulter l’horaire de vos déplacements occasionnels et réguliers. De plus, vous pourrez parfois confirmer un ou des déplacements (occasionnels ou réguliers) préalablement mis en attente qui ont pu être programmés.   5+1  Horaire des déplacements pour la journée en cours ou les 7 prochains jours 5+2  Horaire des déplacements réguliers 5+3  Confirmation d’un déplacement occasionnel 5+4  Confirmation d’un déplacement régulier   Fermer     Liste des lieux publics desservis par le service de transport adapté   Ce document vous aidera à faire vos réservations de déplacements par transport adapté. Vous y trouverez la liste des lieux publics classés par catégories.   Pour chacun des lieux dans la liste, il y a un code de réservation et des détails sur l'endroit où se fait l'embarquement et le débarquement à cet endroit.   Version Word de la liste des lieux publics   Version PDF de la liste des lieux publics   \n Haut de page \n Réservation     ou     ou   PAR TÉLÉSCRIPTEUR (TTY)   AU 514 280-5308   \n Liens utiles   Grille tarifaire en vigueur   Contrôle du paiement   Service à la clientèle   Carte d’identité sur OPUS   Visiteurs   Trouver un point de vente   Liste des lieux publics desservis par le service de transport adapté   \n Télécharger le guide du transport adapté     \n Liens rapides \n Répondre aux sondages \n Accessibilité Réseau \n 5 façons d'obtenir vos horaires \n Service à la clientèle \n Privilèges \n Facebook \n Twitter \n YouTube \n Instagram \n        ©  STM  1997-2017       \n Réseau bus \n Réseau métro \n Notes juridiques \n Développeurs \n Accessibilité Web \n Plan du site \n Restez en contact"}