{"url": "http://www.artm.quebec", "content": "Autorité régionale de transport métropolitain - Accueil \n Passer au contenu \n Autorité régionale de transport métropolitain | ARTM \n L’autorité régionale de transport métropolitain (ARTM) planifie, développe, soutient et fait la promotion du transport collectif sur le territoire de la Communauté métropolitaine de Montréal (82 municipalités), de la réserve indienne de Kahnawake et de la Ville de Saint-Jérôme. \n À propos \n Politiques et règlements \n Tarification \n Planification \n Salle de presse \n Planification, organisation et financement du transport collectif   \n Des transports collectifs en mouvement… \n La grande réforme dans l’organisation des transports collectifs de la région métropolitaine de Montréal s’est concrétisée le 1 er   juin 2017, alors que deux nouvelles entités ont pris la relève de l’Agence métropolitaine de transport (AMT) et des autorités organisatrices de transport (AOT) des couronnes nord et sud : \n L’ Autorité régionale de transport métropolitain  (ARTM) est responsable de la planification, de l’organisation et du financement des services de transports collectifs pour la grande région métropolitaine de Montréal. Elle favorise l’intégration des services entre les différents modes de transport. \n Le  Réseau de transport métropolitain  (RTM) est responsable sous mandat de l’ARTM, d’exploiter sur son territoire les services de transport collectif réguliers par autobus (couronnes nord et sud) et par trains de banlieue, incluant le transport adapté pour les personnes handicapées (pour plus d’information :  rtm.quebec ). \n Le Réseau de transport de Longueuil (RTL), la Société de transport de Laval (STL) et la Société de transport de Montréal (STM), continuent de fournir leurs services respectifs, sous le mandat de l’ARTM. \n Une vision renouvelée \n Ce changement s’inscrit dans la mise en œuvre du projet de loi n° 76 (Loi modifiant principalement l’organisation et la gouvernance du transport collectif dans la région métropolitaine de Montréal), adopté par l’Assemblée nationale du Québec en mai 2016. \n En réduisant le nombre d’organismes de transport de 16 à 5, le nouveau modèle, inspiré des meilleures pratiques au Canada et ailleurs dans le monde, permettra notamment une planification plus efficace et cohérente des transports de la région, et une approche simplifiée pour les clients. \n Contactez-nous Autorité régionale de transport métropolitain \r\n700, rue De La Gauchetière Ouest, 21e étage \r\nMontréal Québec H3B 5M2 \n Plan du site   \n Plan du site \n Accueil Approvisionnement Emplois Politiques et règlements Mission, statut, mandats et territoire \n Planification Salle de presse Tarification \n\t© 2017 Autorité régionale de transport métropolitain | ARTM"}