{"url": "http://steemilieskillshare.org/?cat=7", "content": "Ste-Emilie Skillshare | Community Arts Collective \n Ste-Emilie Skillshare  | Community Arts Collective \n We’re doing lots of things! Seriously! \n Categories:  News & Upcoming Events Posted on March 16, 2014  \n Hey everybody, \n we’ve all survived the depths of winter up til this point, and we’re encouraging all your friendly faces to pop into the Skillshare for a slew of new groups and re occuring events. \n Mondays:  \n   Radical Meditation Group 4:30-6:30 PM. \n Tuesdays: \n Sew and Tell 5-8 PM \n Drawing Jams 7-10PM \n Saturdays:  \n   Radical Meditation Group 12:30-2PM \n Open Studio 1-6PM \n Last Friday of Every Month:  \n   POC (& Allies) Games Night 8-11PM \n Rotating Night of the Month:  \n POCluck (exclusive event, and will be advertised during the month) \n   \n As always, there will be extra events occurring and advertised as they occur. If you are interested in hosting an event, please email us with your proposal! \n (and like us on Facebook to get updates as well!) \n   \n <3 \n   \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n Celebrate People’s History Gallery \n Categories:  News & Upcoming Events Posted on June 10, 2013  \n If you hadn’t heard already, the Skillshare has an excellent exhibition of Just Seeds’ Celebrate People’s History posters right now. The vernissage was a success, and thank you to everyone who came. If you still haven’t see it, or want to see it again, the gallery will be open every Saturday during open studio, 1PM-6PM. We also have prints of some posters for sale, and will until the end of the month or until they sell out. \n Here’s some pictures of the lovely gallery!\r\n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n If you missed out… \n Categories:  News & Upcoming Events Posted on June 10, 2013  \n The Skillshare had a really neat exhibit of archived acetates for the AGM. If you missed out, here’s some snapshots!\r\n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n Celebrate People’s History Gallery Show \n Categories:  News & Upcoming Events Posted on June 2, 2013  \n We here at Ste Emilie are super proud to present the Just Seed’s Celebrate People’s History poster show. Just Seeds has done amazing work and is coming with a few new posters to add to the series as well. The vernissage will be held this Saturday, June 8 starting at 6pm and ending at 10pm. The gallery will also be open every Saturday of this month during open studios (1pm-6pm). An ending night will be announced this month as well, with activities! Posters are totally beautiful, and will be on sale all month as well. We hope to see you there! \n More info on Just Seeds (and poster previews!) \n http://justseeds.org/about/who_we_are.html \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n AGM Reportback \n Categories:  News & Upcoming Events Posted on May 23, 2013  \n We all at Ste-Émilie Skillshare are happy to state: the first annual general meeting was a great success! Thank you to all who attended, who have supported the skillshare over the years, and who made this possible. We couldn’t have done it without you. \n At the general meeting, we adopted a fresh and official constitution, gave updates on finances, outlined some planned activity, and elected a new board of directors. We’d like to welcome to the board Tasha, Marc, Marie, Frankie, Parneet, and Sasha. If you are interested in seeing the updated constitution, it can be viewed on this website. There is a link on the sidebar, to both an english and french version. \n With the AGM behind us, we are now looking to the future of the skillshare. Some brief updates include: \n After a hiatus of open studios (due to tragic pipe ruptures), we are now happy to announce its continuation. Open studio will resume as normal after this weekend: come in and get artsy Saturdays 1-6PM. We will be closed for the Anarchist Bookfair this Saturday, May 25. Feel free to come stop by our table both Saturday and Sunday, 10-5. We will be located in the Centre culturel Georges-Vanier at 2450 Rue Workman. \n For more information on the bookfair, check out their website here: \n http://www.anarchistbookfair.ca/ \n We are also planning fun events for the future! Be sure to check up through our mailing list, or on our facebook page. Some highlights include: workshops! Celebrate People’s History gallery showing! Gallery Residency! \n <3 Ste Emilie Skillshare \n   \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n FUN-A-DAY 5 a 7 & Gallery \n Categories:  News & Upcoming Events Posted on March 2, 2013  \n   \n ♥ FUN-A-DAY 5 a 7 & Gallery♥   \n Amber Dearest of the  Fight Boredom Distro  has organized this event. \n https://www.facebook.com/events/477122825688331/ \n (français ci-dessous) \nWinter is almost over – it’s time to come out of hibernation and show each other what we’ve been working on during these endless cold days. \n Saturday, March 2nd: 5 à 7 and Show & Tell \nSunday, March 3rd: Gallery Hours 12-6pm \n Do you have a project you’d like to display? Send an email to amber.norrean@gmail.com . \n What is Fun-A-Day? \n The premise is simple: pick a project, do it every day in January, then show your work in a big group show. More info at:  www.artclash.com \n L’hiver est presque terminé – il est l’heure de sortir de l’hivernation et de partager les projets sur lesquels nous travaillions pendant ces froids jours sans fin. \n Samedi le 2 mars: 5 à 7 et Show & Tell \nDimanche le 3 mars: Heures de galerie 12à18h \n Avez-vous un projet que vous aimeriez montrer? Envoyez un courriel à  amber.norrean@gmail.com . \n Qu’est-ce que Fun-A-Day? \n Le principe est simple: choisir un projet, le faire tous les jours en janvier, puis montrez votre travail dans un spectacle. Plus d’infos à: www.artclash.com \n *PLEASE SHARE THIS EVENT & BRING YR FRIENDS!* \n   \n Comments   \n\t\t\t\t\tTags: \t\t\t\t \n Next Page » \n Pages \n Home \n Join the Collective \n Zine Distro \n Who We Are / Mandate \n Photos and Glam \n Contact Us \n Sign up for our Newsletter \n Categories \n Distro  (4)\n News & Upcoming Events  (162)\n Ste-Emilie Skillshare  | Community Arts Collective RSS :  Entries  /  Comments \n WordPress  |  Valid :  XHTML  /  CSS"}