{"url": "http://legisquebec.gouv.qc.ca/fr/ShowDoc/cs/A-2.1", "content": "Légis Québec \n Accueil \n Nous joindre \n Plan du site \n Portail Québec \n FAQ \n English \n Recherche avancée \n   0 \n Lois et règlements codifiés \n Lois codifiées \n Règlements codifiés \n Lois et règlements annuels \n Lois annuelles \n Règlements annuels \n Information complémentaire \n L’Éditeur officiel du Québec \n Quoi de neuf? \n Note d’information \n Politique du ministre de la Justice \n Lois : Modifications \n Lois : Dispositions non en vigueur \n Lois : Entrées en vigueur \n Lois annuelles : Versions PDF depuis 1996 \n Règlements : Modifications \n Règlements annuels : Versions PDF depuis 1996 \n Décisions des tribunaux \n A-2.1  - Loi sur l’accès aux documents des organismes publics et sur la protection des renseignements personnels \n Table des matières  \n\t\t\t\t\t\tRèglements  7   \n Alphanumérique \n Titre \n A-2.1, r. 1 \n Code de déontologie des membres de la Commission d’accès à l’information  \n A-2.1, r. 2 \n Règlement sur la diffusion de l’information et sur la protection des renseignements personnels  \n A-2.1, r. 3 \n Règlement sur les frais exigibles pour la transcription, la reproduction et la transmission de documents et de renseignements personnels  \n A-2.1, r. 4 \n Règlement sur les organismes publics tenus de refuser de confirmer l’existence et de donner communication de certains renseignements  \n A-2.1, r. 5 \n Règlement sur la procédure de sélection des personnes aptes à être nommées membres de la Commission d’accès à l’information  \n A-2.1, r. 6 \n Règles de preuve et de procédure de la Commission d’accès à l’information  \n C-25.01, r. 9 \n Règlement de la Cour du Québec  \n Occurrences  0 \n À jour au 1 er  septembre 2017 Ce document a valeur officielle. \n Texte complet  \n chapitre  A-2.1 Loi sur l’accès aux documents des organismes publics et sur la protection des renseignements personnels ACCÈS AUX DOCUMENTS DES ORGANISMES PUBLICS 23   06 juin  1982 01 1 er   10 octobre  1982 CHAPITRE  I APPLICATION ET INTERPRÉTATION 1 .   La présente loi s’applique aux documents détenus par un organisme public dans l’exercice de ses fonctions, que leur conservation soit assurée par l’organisme public ou par un tiers. Elle s’applique quelle que soit la forme de ces documents: écrite, graphique, sonore, visuelle, informatisée ou autre. \n 1982, c. 30, a. 1 . 1.1 .   La présente loi s’applique aussi aux documents détenus par un ordre professionnel dans la mesure prévue par le Code des professions ( chapitre C-26 ). \n 2006, c. 22, a. 1 . 2 .   La présente loi ne s’applique pas: 1 °    aux actes et au registre de l’état civil; 2 °    aux registres et autres documents conservés dans les bureaux de la publicité des droits à des fins de publicité; 3 °    (paragraphe remplacé) ; 3.1 °    au registre visé au chapitre II de la Loi sur la publicité légale des entreprises ( chapitre P-44.1 ); 4 °    aux archives privées visées à l’article 27 de la Loi sur les archives ( chapitre A‐21.1 ). \n 1982, c. 30, a. 2 ;  1983, c. 38, a. 54 ;  1992, c. 57, a. 425 ;  1993, c. 48, a. 112 ;  1999, c. 40, a. 3 ;  2000, c. 42, a. 95 ;  2010, c. 7, a. 282 . 2.1 .   L’accès aux documents contenus dans un dossier ayant trait à l’adoption d’une personne et détenus par un organisme public de même que la protection des renseignements personnels contenus dans un tel dossier sont régis par le Code civil et les autres lois relatives à l’adoption. À l’égard des renseignements personnels contenus dans un tel dossier, la présente loi ne s’applique que pour permettre à la Commission d’exercer la fonction visée au paragraphe 5° de l’article 123 et les pouvoirs visés au paragraphe 2° de l’article 127 et à l’article 128.1. \n 1987, c. 68, a. 2 . 2.2 .   L’accès aux documents contenus dans un dossier que le curateur public détient sur une personne qu’il représente ou dont il administre les biens, de même que la protection des renseignements personnels contenus dans un tel dossier, sont régis par la Loi sur le curateur public ( chapitre C‐81 ). À l’égard des renseignements personnels contenus dans un tel dossier, la présente loi ne s’applique que pour permettre à la Commission d’exercer la fonction visée au paragraphe 6° de l’article 123 et les pouvoirs visés au paragraphe 3° de l’article 127 et à l’article 128.1. \n 1989, c. 54, a. 148 . 3 .   Sont des organismes publics: le gouvernement, le Conseil exécutif, le Conseil du trésor, les ministères, les organismes gouvernementaux, les organismes municipaux, les organismes scolaires et les établissements de santé ou de services sociaux. Sont assimilés à des organismes publics, aux fins de la présente loi: le lieutenant-gouverneur, l’Assemblée nationale, un organisme dont celle-ci nomme les membres et une personne qu’elle désigne pour exercer une fonction en relevant, avec le personnel qu’elle dirige. Les organismes publics ne comprennent pas les tribunaux au sens de la Loi sur les tribunaux judiciaires ( chapitre T‐16 ). \n 1982, c. 30, a. 3 ;  1982, c. 62, a. 143 . 4 .   Les organismes gouvernementaux comprennent les organismes non visés dans les articles 5 à 7, dont le gouvernement ou un ministre nomme la majorité des membres, dont la loi ordonne que le personnel soit nommé suivant la Loi sur la fonction publique ( chapitre F‐3.1.1 ) ou dont le fonds social fait partie du domaine de l’État. Aux fins de la présente loi, le curateur public est assimilé à un organisme gouvernemental, dans la mesure où il détient des documents autres que ceux visés par l’article 2.2. Est assimilée à un organisme gouvernemental, aux fins de la présente loi, une personne nommée par le gouvernement ou par un ministre, avec le personnel qu’elle dirige, dans le cadre des fonctions qui lui sont attribuées par la loi, le gouvernement ou le ministre. \n 1982, c. 30, a. 4 ;  1983, c. 55, a. 161 ;  1989, c. 54, a. 149 ;  1990, c. 57, a. 1 ;  1999, c. 40, a. 3 ;  2000, c. 8, a. 242 . 5 .   Les organismes municipaux comprennent: 1 °    une municipalité, une communauté métropolitaine, une régie intermunicipale, une société de transport en commun et l’Administration régionale Kativik; 2 °    tout organisme que la loi déclare mandataire ou agent d’une municipalité et tout organisme dont le conseil d’administration est formé majoritairement de membres du conseil d’une municipalité; 2.1 °     tout organisme dont le conseil d’administration est formé d’au moins un élu municipal siégeant à ce titre et dont une municipalité ou une communauté métropolitaine adopte ou approuve le budget ou contribue à plus de la moitié du financement; 3 °    une société d’économie mixte constituée conformément à la Loi sur les sociétés d’économie mixte dans le secteur municipal ( chapitre S‐25.01 ) et un organisme analogue constitué conformément à une loi d’intérêt privé, notamment les personnes morales constituées en vertu des chapitres 56, 61 et 69 des lois de 1994, du chapitre 84 des lois de 1995 et du chapitre 47 des lois de 2004. Sont assimilés à des organismes municipaux, aux fins de la présente loi: l’Administration régionale Baie-James et tout organisme délégataire visé à l’article 126.4 de la Loi sur les compétences municipales ( chapitre C-47.1 ). Toutefois, l’Union des municipalités du Québec et la Fédération québécoise des municipalités locales et régionales ne sont pas des organismes municipaux. \n 1982, c. 30, a. 5 ;  1984, c. 42, a. 137 ;  1985, c. 32, a. 159 ;  1990, c. 57, a. 2 ;  1996, c. 2, a. 13 ;  1997, c. 41, a. 64 ;  1997, c. 44, a. 92 ;  1999, c. 40, a. 3 ;  2000, c. 56, a. 81 ;  2006, c. 22, a. 2 ;  2009, c. 26, a. 109 ;  2015, c. 8, a. 206 . 6 .   Les organismes scolaires comprennent les commissions scolaires, le Comité de gestion de la taxe scolaire de l’île de Montréal, les institutions dont le régime d’enseignement est l’objet d’une entente internationale au sens de la Loi sur le ministère des Relations internationales ( chapitre M‐25.1.1 ), les collèges d’enseignement général et professionnel et les établissements universitaires mentionnés aux paragraphes 1° à 11° de l’article 1 de la Loi sur les établissements d’enseignement de niveau universitaire ( chapitre E‐14.1 ). Ils comprennent également les établissements agréés aux fins de subventions en vertu de la Loi sur l’enseignement privé ( chapitre E‐9.1 ) et les personnes qui les tiennent, à l’égard des documents détenus dans l’exercice de leurs fonctions relatives aux services éducatifs faisant l’objet de l’agrément et à la gestion des ressources qui y sont affectées. \n 1982, c. 30, a. 6 ;  1982, c. 62, a. 143 ;  1988, c. 84, a. 541 ;  1989, c. 17, a. 1 ;  1992, c. 68, a. 156, a. 157 ;  1994, c. 15, a. 33 ;  1996, c. 21, a. 70 ;  2000, c. 8, a. 239 ;  2002, c. 75, a. 33 ;  2006, c. 22, a. 3 . 7 .   Les établissements de santé ou de services sociaux comprennent les établissements publics visés par la Loi sur les services de santé et les services sociaux ( chapitre S-4.2 ), les établissements privés visés par cette loi qui fonctionnent en ayant recours à des sommes d’argent provenant du fonds consolidé du revenu, les agences visées par cette loi ainsi qu’un centre de communication santé visé par la Loi sur les services préhospitaliers d’urgence ( chapitre S-6.2 ). Les établissements de santé ou de services sociaux comprennent également les établissements publics visés par la Loi sur les services de santé et les services sociaux pour les autochtones cris ( chapitre S-5 ), les établissements privés visés par cette loi qui fonctionnent en ayant recours à des sommes d’argent provenant du fonds consolidé du revenu et les conseils régionaux de santé et de services sociaux institués en vertu de cette loi. \n 1982, c. 30, a. 7 ;  1990, c. 57, a. 3 ;  1992, c. 21, a. 73 ;  1994, c. 23, a. 23 ;  1999, c. 34, a. 53 ;  2002, c. 69, a. 119 ;  2005, c. 32, a. 308 ;  2011, c. 16, a. 175 . 8 .   La personne ayant la plus haute autorité au sein d’un organisme public exerce les fonctions que la présente loi confère à la personne responsable de l’accès aux documents ou de la protection des renseignements personnels. Toutefois, cette personne peut désigner comme responsable un membre de l’organisme public ou de son conseil d’administration, selon le cas, ou un membre de son personnel de direction et lui déléguer tout ou partie de ses fonctions. Cette délégation doit être faite par écrit. Celui qui la fait doit en transmettre un avis à la Commission d’accès à l’information. \n 1982, c. 30, a. 8 ;  1987, c. 68, a. 3 ;  2006, c. 22, a. 4 . CHAPITRE  II ACCÈS AUX DOCUMENTS DES ORGANISMES PUBLICS SECTION  I DROIT D’ACCÈS 9 .   Toute personne qui en fait la demande a droit d’accès aux documents d’un organisme public. Ce droit ne s’étend pas aux notes personnelles inscrites sur un document, ni aux esquisses, ébauches, brouillons, notes préparatoires ou autres documents de même nature. \n 1982, c. 30, a. 9 . 10 .   Le droit d’accès à un document s’exerce par consultation sur place pendant les heures habituelles de travail ou à distance. Le requérant peut également obtenir copie du document, à moins que sa reproduction ne nuise à sa conservation ou ne soulève des difficultés pratiques sérieuses en raison de sa forme. À la demande du requérant, un document informatisé doit être communiqué sous la forme d’une transcription écrite et intelligible. Lorsque le requérant est une personne handicapée, des mesures d’accommodement raisonnables doivent être prises, sur demande, pour lui permettre d’exercer le droit d’accès prévu par la présente section. À cette fin, l’organisme public tient compte de la politique établie en vertu de l’article 26.5 de la Loi assurant l’exercice des droits des personnes handicapées en vue de leur intégration scolaire, professionnelle et sociale ( chapitre E-20.1 ). \n 1982, c. 30, a. 10 ;  1990, c. 57, a. 4 ;  2001, c. 32, a. 82 ;  2006, c. 22, a. 5 . 11 .   L’accès à un document est gratuit. Toutefois, des frais n’excédant pas le coût de sa transcription, de sa reproduction ou de sa transmission peuvent être exigés du requérant. Le montant et les modalités de paiement de ces frais sont prescrits par règlement du gouvernement; ce règlement peut prévoir les cas où une personne est exemptée du paiement et il tient compte de la politique établie en vertu de l’article 26.5 de la Loi assurant l’exercice des droits des personnes handicapées en vue de leur intégration scolaire, professionnelle et sociale ( chapitre E-20.1 ). L’organisme public qui entend exiger des frais en vertu du présent article doit informer le requérant du montant approximatif qui lui sera chargé, avant de procéder à la transcription, la reproduction ou la transmission du document. Dans un cas d’accès à plus d’un document, l’information doit distinguer les frais de transcription ou de reproduction pour chacun des documents identifiés. \n 1982, c. 30, a. 11 ;  1987, c. 68, a. 4 ;  2006, c. 22, a. 6 . 12 .   Le droit d’accès à un document s’exerce sous réserve des droits relatifs à la propriété intellectuelle. \n 1982, c. 30, a. 12 . 13 .   Le droit d’accès à un document produit par un organisme public ou pour son compte et ayant fait l’objet d’une publication ou d’une diffusion s’exerce par consultation sur place pendant les heures habituelles de travail ou à distance ou par l’obtention d’informations suffisantes pour permettre au requérant de le consulter ou de se le procurer là où il est disponible. De même, le droit d’accès à un document produit par un organisme public ou pour son compte et devant faire l’objet d’une publication ou d’une diffusion dans un délai n’excédant pas six mois de la demande d’accès, s’exerce par l’un ou plusieurs des moyens suivants: 1 °    la consultation sur place pendant les heures habituelles de travail ou à distance; 2 °    l’obtention d’informations suffisantes pour permettre au requérant de le consulter là où il est disponible ou de se le procurer lors de sa publication ou de sa diffusion; 3 °    le prêt du document, à moins que cela ne compromette sa publication ou sa diffusion. Le présent article ne restreint pas le droit d’accès à un document diffusé conformément à l’article 16.1. \n 1982, c. 30, a. 13 ;  1990, c. 57, a. 5 ;  2001, c. 32, a. 83 ;  2006, c. 22, a. 7 . 14 .   Un organisme public ne peut refuser l’accès à un document pour le seul motif que ce document comporte certains renseignements qu’il doit ou peut refuser de communiquer en vertu de la présente loi. Si une demande porte sur un document comportant de tels renseignements, l’organisme public peut en refuser l’accès si ces renseignements en forment la substance.  Dans les autres cas, l’organisme public doit donner accès au document demandé après en avoir extrait uniquement les renseignements auxquels l’accès n’est pas autorisé. \n 1982, c. 30, a. 14 . 15 .   Le droit d’accès ne porte que sur les documents dont la communication ne requiert ni calcul, ni comparaison de renseignements. \n 1982, c. 30, a. 15 . 16 .   Un organisme public doit classer ses documents de manière à en permettre le repérage. Il doit établir et tenir à jour une liste de classement indiquant l’ordre selon lequel les documents sont classés. Elle doit être suffisamment précise pour faciliter l’exercice du droit d’accès. Pour un organisme public visé au paragraphe 1° de l’annexe de la Loi sur les archives ( chapitre A-21.1 ), le plan de classification de ses documents tient lieu de liste de classement. Toute personne qui en fait la demande a droit d’accès à la liste de classement ou au plan de classification, sauf à l’égard des renseignements dont la confirmation de l’existence peut être refusée en vertu des dispositions de la présente loi. \n 1982, c. 30, a. 16 ;  2001, c. 32, a. 84 ;  2006, c. 22, a. 8 . 16.1 .   Un organisme public, à l’exception du Lieutenant-gouverneur, de l’Assemblée nationale et d’une personne qu’elle désigne pour exercer une fonction en relevant, doit diffuser, dans un site Internet, les documents ou renseignements accessibles en vertu de la loi qui sont identifiés par règlement du gouvernement et mettre en oeuvre les mesures favorisant l’accès à l’information édictées par ce règlement. \n 2006, c. 22, a. 9 . 17 .   La Commission diffuse et met à jour un répertoire indiquant, pour chaque organisme public, le titre, l’adresse et le numéro de téléphone de la personne responsable de l’accès aux documents et de celle responsable de la protection des renseignements personnels. \n 1982, c. 30, a. 17 ;  1990, c. 57, a. 6 ;  2006, c. 22, a. 10 . SECTION  II RESTRICTIONS AU DROIT D’ACCÈS §  1 .  —  Renseignements ayant des incidences sur les relations intergouvernementales 18 .   Le gouvernement ou un ministère peut refuser de communiquer un renseignement obtenu d’un gouvernement autre que celui du Québec, d’un organisme d’un tel gouvernement ou d’une organisation internationale. Il en est de même du lieutenant-gouverneur, du Conseil exécutif et du Conseil du trésor. \n 1982, c. 30, a. 18 . 19 .   Un organisme public peut refuser de communiquer un renseignement lorsque sa divulgation porterait vraisemblablement préjudice à la conduite des relations entre le gouvernement du Québec et un autre gouvernement ou une organisation internationale. \n 1982, c. 30, a. 19 . §  2 .  —  Renseignements ayant des incidences sur les négociations entre organismes publics 20 .   Un organisme public peut refuser de communiquer un renseignement lorsque sa divulgation entraverait vraisemblablement une négociation en cours avec un autre organisme public dans un domaine de leur compétence. \n 1982, c. 30, a. 20 . §  3 .  —  Renseignements ayant des incidences sur l’économie 21 .   Un organisme public peut refuser de confirmer l’existence ou de donner communication d’un renseignement dont la divulgation aurait pour effet de révéler un emprunt, un projet d’emprunt, une transaction ou un projet de transaction relatifs à des biens, des services ou des travaux, un projet de tarification, un projet d’imposition d’une taxe ou d’une redevance ou de modification d’une taxe ou d’une redevance, lorsque, vraisemblablement, une telle divulgation: 1 °    procurerait un avantage indu à une personne ou lui causerait un préjudice sérieux; ou 2 °    porterait sérieusement atteinte aux intérêts économiques de l’organisme public ou de la collectivité à l’égard de laquelle il est compétent. \n 1982, c. 30, a. 21 . 22 .   Un organisme public peut refuser de communiquer un secret industriel qui lui appartient. Il peut également refuser de communiquer un autre renseignement industriel ou un renseignement financier, commercial, scientifique ou technique lui appartenant et dont la divulgation risquerait vraisemblablement d’entraver une négociation en vue de la conclusion d’un contrat, de causer une perte à l’organisme ou de procurer un avantage appréciable à une autre personne. Un organisme public constitué à des fins industrielles, commerciales ou de gestion financière peut aussi refuser de communiquer un tel renseignement lorsque sa divulgation risquerait vraisemblablement de nuire de façon substantielle à sa compétitivité ou de révéler un projet d’emprunt, de placement, de gestion de dette ou de gestion de fonds ou une stratégie d’emprunt, de placement, de gestion de dette ou de gestion de fonds. \n 1982, c. 30, a. 22 ;  2006, c. 22, a. 11 . 23 .   Un organisme public ne peut communiquer le secret industriel d’un tiers ou un renseignement industriel, financier, commercial, scientifique, technique ou syndical de nature confidentielle fourni par un tiers et habituellement traité par un tiers de façon confidentielle, sans son consentement. \n 1982, c. 30, a. 23 . 24 .   Un organisme public ne peut communiquer un renseignement fourni par un tiers lorsque sa divulgation risquerait vraisemblablement d’entraver une négociation en vue de la conclusion d’un contrat, de causer une perte à ce tiers, de procurer un avantage appréciable à une autre personne ou de nuire de façon substantielle à la compétitivité de ce tiers, sans son consentement. \n 1982, c. 30, a. 24 . 25 .   Un organisme public doit, avant de communiquer un renseignement industriel, financier, commercial, scientifique, technique ou syndical fourni par un tiers, lui en donner avis, conformément à l’article 49, afin de lui permettre de présenter ses observations, sauf dans les cas où le renseignement a été fourni en application d’une loi qui prévoit que le renseignement peut être communiqué et dans les cas où le tiers a renoncé à l’avis en consentant à la communication du renseignement ou autrement. \n 1982, c. 30, a. 25 ;  2006, c. 22, a. 12 . 26 .   (Abrogé). \n 1982, c. 30, a. 26 ;  2006, c. 22, a. 13 . 27 .   Un organisme public peut refuser de communiquer un renseignement dont la divulgation aurait vraisemblablement pour effet de révéler un mandat ou une stratégie de négociation de convention collective ou de contrat, pendant huit ans à compter du début de la négociation. Il peut également refuser de communiquer, pendant dix ans à compter de sa date, une étude préparée en vue de l’imposition d’une taxe, d’un tarif ou d’une redevance. \n 1982, c. 30, a. 27 . §  4 .  —  Renseignements ayant des incidences sur l’administration de la justice et la sécurité publique 28 .   Un organisme public doit refuser de confirmer l’existence ou de donner communication d’un renseignement contenu dans un document qu’il détient dans l’exercice d’une fonction, prévue par la loi, de prévention, de détection ou de répression du crime ou des infractions aux lois ou dans l’exercice d’une collaboration, à cette fin, avec une personne ou un organisme chargé d’une telle fonction, lorsque sa divulgation serait susceptible: 1 °    d’entraver le déroulement d’une procédure devant une personne ou un organisme exerçant des fonctions juridictionnelles; 2 °    d’entraver une enquête à venir, en cours ou sujette à réouverture; 3 °    de révéler une méthode d’enquête, une source confidentielle d’information, un programme ou un plan d’action destiné à prévenir, détecter ou réprimer le crime ou les infractions aux lois; 4 °    de mettre en péril la sécurité d’une personne; 5 °    de causer un préjudice à une personne qui est l’auteur du renseignement ou qui en est l’objet; 6 °    de révéler les composantes d’un système de communication destiné à l’usage d’une personne chargée d’assurer l’observation de la loi; 7 °    de révéler un renseignement transmis à titre confidentiel par un corps de police ayant compétence hors du Québec; 8 °    de favoriser l’évasion d’un détenu; ou 9 °    de porter atteinte au droit d’une personne à une audition impartiale de sa cause. Il en est de même pour un organisme public, que le gouvernement peut désigner par règlement conformément aux normes qui y sont prévues, à l’égard d’un renseignement que cet organisme a obtenu par son service de sécurité interne, dans le cadre d’une enquête faite par ce service et ayant pour objet de prévenir, détecter ou réprimer le crime ou les infractions aux lois, susceptibles d’être commis ou commis au sein de l’organisme par ses membres, ceux de son conseil d’administration ou de son personnel ou par ceux de ses agents ou mandataires, lorsque sa divulgation serait susceptible d’avoir l’un des effets mentionnés aux paragraphes 1° à 9° du premier alinéa. \n 1982, c. 30, a. 28 ;  1990, c. 57, a. 7 ;  2006, c. 22, a. 14 . 28.1 .   Un organisme public doit refuser de confirmer l’existence ou de donner communication d’un renseignement dont la divulgation aurait pour effet de porter atteinte à la sécurité de l’État. \n 2006, c. 22, a. 15 . 29 .   Un organisme public doit refuser de confirmer l’existence ou de donner communication d’un renseignement portant sur une méthode ou une arme susceptible d’être utilisée pour commettre un crime ou une infraction à une loi. Il doit aussi refuser de confirmer l’existence ou de donner communication d’un renseignement dont la divulgation aurait pour effet de réduire l’efficacité d’un programme, d’un plan d’action ou d’un dispositif de sécurité destiné à la protection d’un bien ou d’une personne. \n 1982, c. 30, a. 29 ;  2006, c. 22, a. 16 . 29.1 .   La décision rendue par un organisme public dans l’exercice de fonctions juridictionnelles est publique. Toutefois, un organisme public doit refuser de communiquer un renseignement contenu dans cette décision lorsque celle-ci en interdit la communication, au motif qu’il a été obtenu alors que l’organisme siégeait à huis-clos, ou que celui-ci a rendu à son sujet une ordonnance de non-publication, de non-divulgation ou de non-diffusion ou que sa communication révélerait un renseignement dont la confirmation de l’existence ou la communication doit être refusée en vertu de la présente loi. Un organisme public doit également refuser de communiquer un renseignement susceptible de révéler le délibéré lié à l’exercice de fonctions juridictionnelles. \n 1985, c. 30, a. 2 ;  1990, c. 57, a. 8 ;  2006, c. 22, a. 17 . §  5 .  —  Renseignements ayant des incidences sur les décisions administratives ou politiques 30 .   Le Conseil exécutif peut refuser de confirmer l’existence ou de donner communication d’un décret dont la publication est différée en vertu de la Loi sur l’exécutif ( chapitre E‐18 ). Il peut faire de même à l’égard d’une décision résultant de ses délibérations ou de celle de l’un de ses comités ministériels, avant l’expiration d’un délai de 25 ans de sa date. Sous réserve de la Loi sur l’administration publique ( chapitre A‐6.01 ), le Conseil du trésor peut refuser de confirmer l’existence ou de donner communication de ses décisions, avant l’expiration d’un délai de 25 ans de leur date. \n 1982, c. 30, a. 30 ;  2000, c. 8, a. 250 ;  2006, c. 22, a. 18 . 30.1 .   Un organisme public peut refuser de confirmer l’existence ou de donner communication d’un renseignement dont la divulgation aurait pour effet de révéler une politique budgétaire du gouvernement avant que le ministre des Finances ne la rende publique. \n 2006, c. 22, a. 19 . 31 .   Un organisme public peut refuser de communiquer une opinion juridique portant sur l’application du droit à un cas particulier ou sur la constitutionnalité ou la validité d’un texte législatif ou réglementaire, d’une version préliminaire ou d’un projet de texte législatif ou réglementaire. \n 1982, c. 30, a. 31 . 32 .   Un organisme public peut refuser de communiquer une analyse lorsque sa divulgation risquerait vraisemblablement d’avoir un effet sur une procédure judiciaire. \n 1982, c. 30, a. 32 . 33 .   Ne peuvent être communiqués avant l’expiration d’un délai de 25 ans de leur date: 1 °    les communications du Conseil exécutif à l’un de ses membres, au Conseil du trésor ou à un comité ministériel, à moins que le Conseil exécutif n’en décide autrement; 2 °    les communications d’un membre du Conseil exécutif à un autre membre de ce conseil, à moins que l’auteur n’en décide autrement; 3 °    les recommandations du Conseil du trésor ou d’un comité ministériel au Conseil exécutif, à moins que l’auteur ou le destinataire n’en décide autrement; 4 °    les recommandations d’un membre du Conseil exécutif au Conseil exécutif, au Conseil du trésor ou à un comité ministériel, à moins que l’auteur ou le destinataire n’en décide autrement; 5 °    les analyses effectuées au sein du ministère du Conseil exécutif ou du secrétariat du Conseil du trésor et portant sur une recommandation ou une demande faite par un ministre, un comité ministériel ou un organisme public, ou sur un document visé dans l’article 36; 6 °    les mémoires ou les comptes rendus des délibérations du Conseil exécutif ou d’un comité ministériel; 7 °    une liste de titres de documents comportant des recommandations au Conseil exécutif ou au Conseil du trésor; 8 °    l’ordre du jour d’une réunion du Conseil exécutif, du Conseil du trésor ou d’un comité ministériel. Le premier alinéa s’applique, compte tenu des adaptations nécessaires, aux mémoires des délibérations du comité exécutif d’un organisme municipal, aux recommandations qui lui sont faites par ses membres ainsi qu’aux communications entre ses membres. \n 1982, c. 30, a. 33 ;  2006, c. 22, a. 20 . 34 .   Un document du bureau d’un membre de l’Assemblée nationale ou un document produit pour le compte de ce membre par les services de l’Assemblée n’est pas accessible à moins que le membre ne le juge opportun. Il en est de même d’un document du cabinet du président de l’Assemblée, d’un membre de celle-ci visé dans le premier alinéa de l’article 124.1 de la Loi sur l’Assemblée nationale ( chapitre A‐23.1 ) ou d’un ministre visé dans l’article 11.5 de la Loi sur l’exécutif ( chapitre E‐18 ), ainsi que d’un document du cabinet ou du bureau d’un membre d’un organisme municipal ou scolaire. \n 1982, c. 30, a. 34 ;  1982, c. 62, a. 143 ;  1983, c. 55, a. 132 ;  1984, c. 47, a. 1 . 35 .   Un organisme public peut refuser de communiquer les mémoires de délibérations d’une séance de son conseil d’administration ou, selon le cas, de ses membres dans l’exercice de leurs fonctions, jusqu’à l’expiration d’un délai de quinze ans de leur date. \n 1982, c. 30, a. 35 . 36 .   Un organisme public peut refuser de communiquer toute version préliminaire ou tout projet de texte législatif ou réglementaire jusqu’à l’expiration de dix ans de sa date. Sous réserve du paragraphe 5° du premier alinéa de l’article 33, il en est de même des analyses s’y rapportant directement à moins que le projet de texte législatif ait été déposé devant l’Assemblée nationale ou que le projet de texte réglementaire ait été rendu public conformément à la loi. \n 1982, c. 30, a. 36 ;  1982, c. 62, a. 143 . 37 .   Un organisme public peut refuser de communiquer un avis ou une recommandation faits depuis moins de dix ans, par un de ses membres, un membre de son personnel, un membre d’un autre organisme public ou un membre du personnel de cet autre organisme, dans l’exercice de leurs fonctions. Il peut également refuser de communiquer un avis ou une recommandation qui lui ont été faits, à sa demande, depuis moins de dix ans, par un consultant ou par un conseiller sur une matière de sa compétence. \n 1982, c. 30, a. 37 . 38 .   Un organisme public peut refuser de communiquer un avis ou une recommandation que lui a fait un organisme qui en relève ou qu’il a fait à un autre organisme public, jusqu’à ce que la décision finale sur la matière faisant l’objet de l’avis ou de la recommandation ait été rendue publique par l’autorité compétente. Il en est de même pour un ministre en ce qui concerne un avis ou une recommandation que lui a fait un organisme qui relève de son autorité. \n 1982, c. 30, a. 38 . 39 .   Un organisme public peut refuser de communiquer une analyse produite à l’occasion d’une recommandation faite dans le cadre d’un processus décisionnel en cours, jusqu’à ce que la recommandation ait fait l’objet d’une décision ou, en l’absence de décision, qu’une période de cinq ans se soit écoulée depuis la date où l’analyse a été faite. \n 1982, c. 30, a. 39 . 40 .   Un organisme public peut refuser de communiquer une épreuve destinée à l’évaluation comparative des connaissances, des aptitudes, de la compétence ou de l’expérience d’une personne, jusqu’au terme de l’utilisation de cette épreuve. \n 1982, c. 30, a. 40 ;  2006, c. 22, a. 21 . §  6 .  —  Renseignements ayant des incidences sur la vérification 41 .   Le vérificateur général ou une personne exerçant une fonction de vérification dans un organisme public ou pour le compte de cet organisme peut refuser de confirmer l’existence ou de donner communication d’un renseignement dont la divulgation serait susceptible: 1 °    d’entraver le déroulement d’une opération de vérification; 2 °    de révéler un programme ou un plan d’activité de vérification; 3 °    de révéler une source confidentielle d’information relative à une vérification; ou 4 °    de porter sérieusement atteinte au pouvoir d’appréciation accordé au vérificateur général par les articles 38, 39, 40, 42, 43, 43.1 et 45 de la Loi sur le vérificateur général ( chapitre V‐5.01 ). \n 1982, c. 30, a. 41 ;  1985, c. 38, a. 82 ;  2006, c. 3, a. 18 . §  7 .  —  Restrictions inapplicables \n 2006, c. 22, a. 22 . 41.1 .   Les restrictions prévues dans la présente section, sauf celles des articles 28, 28.1, 29, 30, 33, 34 et 41, ne s’appliquent pas à un renseignement qui permet de connaître ou de confirmer l’existence d’un risque immédiat pour la vie, la santé ou la sécurité d’une personne ou d’une atteinte sérieuse ou irréparable à son droit à la qualité de l’environnement, à moins que l’effet prévisible de sa divulgation ne soit de nuire sérieusement aux mesures d’intervention pour parer à ce risque ou à cette atteinte. Elles ne s’appliquent pas non plus, sauf celle de l’article 28 et, dans le cas d’un document produit par le vérificateur général ou pour son compte, celle de l’article 41, à un renseignement concernant la quantité, la qualité ou la concentration des contaminants émis, dégagés, rejetés ou déposés par une source de contamination, ou concernant la présence d’un contaminant dans l’environnement. Dans le cas d’un renseignement fourni par un tiers et visé par le premier alinéa, le responsable doit lui donner avis de sa décision lorsqu’elle vise à y donner accès. Toutefois, cette décision est exécutoire malgré l’article 49. \n 2006, c. 22, a. 22 . 41.2 .   Un organisme public peut communiquer un renseignement visé par une restriction au droit d’accès prévue aux articles 23, 24, 28, 28.1 ou 29 dans les cas suivants: 1 °    à son procureur si le renseignement est nécessaire aux fins d’une poursuite pour infraction à une loi que l’organisme est chargé d’appliquer, ou au Directeur des poursuites criminelles et pénales si le renseignement est nécessaire aux fins d’une poursuite pour infraction à une loi applicable au Québec; 2 °    à son procureur ou au procureur général lorsqu’il agit comme procureur de l’organisme, si le renseignement est nécessaire aux fins d’une procédure judiciaire autre qu’une procédure visée dans le paragraphe 1°; 3 °    à un organisme qui, en vertu de la loi, est chargé de prévenir, détecter ou réprimer le crime ou les infractions aux lois, si le renseignement est nécessaire aux fins d’une poursuite pour infraction à une loi applicable au Québec; 4 °    à toute personne ou tout organisme si cette communication est nécessaire à l’application d’une loi au Québec, que cette communication soit ou non prévue expressément par la loi; 5 °    à un organisme public, dans le cas d’un renseignement visé à l’article 23 ou 24, si cette communication est nécessaire dans le cadre de la prestation d’un service à rendre au tiers concerné; 6 °    à toute personne ou tout organisme si cette communication est nécessaire à l’exercice d’un mandat ou à l’exécution d’un contrat de service ou d’entreprise confié par l’organisme public à cette personne ou à cet organisme. Dans le cas visé au paragraphe 6°, l’organisme public doit: 1 °    confier le mandat ou le contrat par écrit; 2 °    indiquer, dans le mandat ou le contrat, les dispositions de la présente loi qui s’appliquent au renseignement communiqué au mandataire ou à l’exécutant du contrat ainsi que les mesures qu’il doit prendre pour que ce renseignement ne soit utilisé que dans l’exercice de son mandat ou l’exécution de son contrat et pour qu’il ne le conserve pas après son expiration. Le deuxième alinéa ne s’applique pas lorsque le mandataire ou l’exécutant du contrat est un membre d’un ordre professionnel. De même, le paragraphe 2° du deuxième alinéa ne s’applique pas lorsque le mandataire ou l’exécutant du contrat est un autre organisme public. En outre, un corps de police peut communiquer un renseignement visé par une restriction au droit d’accès prévue aux articles 23, 24, 28, 28.1 ou 29 à un autre corps de police. Toutefois, l’application du présent article ne doit avoir pour effet de révéler une source confidentielle d’information ni le secret industriel d’un tiers. \n 2006, c. 22, a. 22 . 41.3 .   Lorsqu’un renseignement visé à l’article 23 ou 24 est communiqué en application du premier alinéa de l’article 41.2, le responsable de l’accès aux documents au sein de l’organisme doit inscrire la communication dans un registre qu’il tient à cette fin. \n 2006, c. 22, a. 22 . SECTION  III PROCÉDURE D’ACCÈS 42 .   La demande d’accès à un document doit, pour être recevable, être suffisamment précise pour permettre de le trouver. Lorsque la demande n’est pas suffisamment précise ou lorsqu’une personne le requiert, le responsable doit prêter assistance pour identifier le document susceptible de contenir les renseignements recherchés. \n 1982, c. 30, a. 42 ;  2006, c. 22, a. 23 . 43 .   La demande d’accès peut être écrite ou verbale. Elle est adressée au responsable de l’accès aux documents au sein de l’organisme public. Si une demande écrite d’accès est adressée à la personne ayant la plus haute autorité au sein de l’organisme public, cette personne doit la transmettre avec diligence au responsable qu’elle a désigné en vertu de l’article 8, le cas échéant. \n 1982, c. 30, a. 43 . 44 .   (Abrogé). \n 1982, c. 30, a. 44 ;  1990, c. 57, a. 9 ;  2006, c. 22, a. 24 . 45 .   Le responsable doit informer la personne qui lui fait une demande verbale de la possibilité de faire une demande écrite et que seule une décision sur une demande écrite est susceptible de révision en vertu de la présente loi. \n 1982, c. 30, a. 45 . 46 .   Le responsable doit donner à la personne qui lui a fait une demande écrite un avis de la date de la réception de sa demande. Cet avis est écrit; il indique les délais prescrits pour donner suite à la demande et l’effet que la présente loi attache au défaut, par le responsable, de les respecter. Il informe, en outre, le requérant du recours en révision prévu à la section III du chapitre IV. \n 1982, c. 30, a. 46 ;  2006, c. 22, a. 25 . 47 .   Le responsable doit, avec diligence et au plus tard dans les vingt jours qui suivent la date de la réception d’une demande: 1 °    donner accès au document, lequel peut alors être accompagné d’informations sur les circonstances dans lesquelles il a été produit; 1.1 °    donner accès au document par des mesures d’accommodement raisonnables lorsque le requérant est une personne handicapée; 2 °    informer le requérant des conditions particulières auxquelles l’accès est soumis, le cas échéant; 3 °    informer le requérant que l’organisme ne détient pas le document demandé ou que l’accès ne peut lui y être donné en tout ou en partie; 4 °    informer le requérant que sa demande relève davantage de la compétence d’un autre organisme ou est relative à un document produit par un autre organisme ou pour son compte; 5 °    informer le requérant que l’existence des renseignements demandés ne peut être confirmée; 6 °    informer le requérant qu’il s’agit d’un document auquel le chapitre II de la présente loi ne s’applique pas en vertu du deuxième alinéa de l’article 9; 7 °    informer le requérant que le tiers concerné par la demande ne peut être avisé par courrier et qu’il le sera par avis public; 8 °    informer le requérant que l’organisme demande à la Commission de ne pas tenir compte de sa demande conformément à l’article 137.1. Si le traitement de la demande dans le délai prévu par le premier alinéa ne lui paraît pas possible sans nuire au déroulement normal des activités de l’organisme public, le responsable peut, avant l’expiration de ce délai, le prolonger d’une période n’excédant pas 10 jours. Il doit alors en donner avis au requérant par courrier dans le délai prévu par le premier alinéa. \n 1982, c. 30, a. 47 ;  2006, c. 22, a. 26 . 48 .   Lorsqu’il est saisi d’une demande qui, à son avis, relève davantage de la compétence d’un autre organisme public ou qui est relative à un document produit par un autre organisme public ou pour son compte, le responsable doit, dans le délai prévu par le premier alinéa de l’article 47, indiquer au requérant le nom de l’organisme compétent et celui du responsable de l’accès aux documents de cet organisme, et lui donner les renseignements prévus par l’article 45 ou par le deuxième alinéa de l’article 46, selon le cas. Lorsque la demande est écrite, ces indications doivent être communiquées par écrit. \n 1982, c. 30, a. 48 . 49 .   Lorsque le responsable doit donner au tiers l’avis requis par l’article 25, il doit le faire par courrier dans les 20 jours qui suivent la date de la réception de la demande et lui fournir l’occasion de présenter des observations écrites. Il doit, de plus, en informer le requérant et lui indiquer les délais prévus par le présent article. Lorsque le responsable, après avoir pris des moyens raisonnables pour aviser un tiers par courrier, ne peut y parvenir, il peut l’aviser autrement notamment par avis public dans un journal diffusé dans la localité de la dernière adresse connue du tiers. S’il y a plus d’un tiers et que plus d’un avis est requis, les tiers ne sont réputés avisés qu’une fois diffusés tous les avis. Le tiers concerné peut présenter ses observations dans les 20 jours qui suivent la date où il a été informé de l’intention du responsable. À défaut de le faire dans ce délai, il est réputé avoir consenti à ce que l’accès soit donné au document. Le responsable doit donner avis de sa décision au requérant et au tiers concerné, par courrier, dans les 15 jours qui suivent la présentation des observations ou l’expiration du délai prévu pour les présenter. Dans le cas où le responsable a dû recourir à un avis public, il ne transmet un avis de cette décision qu’au tiers qui lui a présenté des observations écrites. Lorsqu’elle vise à donner accès aux documents, cette décision est exécutoire à l’expiration des 15 jours qui suivent la date de la mise à la poste de l’avis. \n 1982, c. 30, a. 49 ;  2006, c. 22, a. 27 . 50 .   Le responsable doit motiver tout refus de donner communication d’un renseignement et indiquer la disposition de la loi sur laquelle ce refus s’appuie. \n 1982, c. 30, a. 50 . 51 .   Lorsque la demande est écrite, le responsable rend sa décision par écrit et en transmet copie au requérant et, le cas échéant, au tiers qui a présenté des observations conformément à l’article 49. La décision doit être accompagnée du texte de la disposition sur laquelle le refus s’appuie, le cas échéant, et d’un avis les informant du recours en révision prévu par la section III du chapitre IV et indiquant notamment le délai pendant lequel il peut être exercé. \n 1982, c. 30, a. 51 ;  2006, c. 22, a. 28 . 52 .   À défaut de donner suite à une demande d’accès dans les délais applicables, le responsable est réputé avoir refusé l’accès au document. Dans le cas d’une demande écrite, ce défaut donne ouverture au recours en révision prévu par la section III du chapitre IV, comme s’il s’agissait d’un refus d’accès. \n 1982, c. 30, a. 52 . 52.1 .   Le responsable doit veiller à ce que tout document qui a fait l’objet d’une demande d’accès soit conservé le temps requis pour permettre au requérant d’épuiser les recours prévus à la présente loi. \n 1990, c. 57, a. 10 . CHAPITRE  III PROTECTION DES RENSEIGNEMENTS PERSONNELS SECTION  I CARACTÈRE CONFIDENTIEL DES RENSEIGNEMENTS PERSONNELS \n 2006, c. 22, a. 110 . 53 .   Les renseignements personnels sont confidentiels sauf dans les cas suivants: 1 °    la personne concernée par ces renseignements consent à leur divulgation; si cette personne est mineure, le consentement peut également être donné par le titulaire de l’autorité parentale; 2 °    ils portent sur un renseignement obtenu par un organisme public dans l’exercice d’une fonction juridictionnelle; ils demeurent cependant confidentiels si l’organisme les a obtenus alors qu’il siégeait à huis-clos ou s’ils sont visés par une ordonnance de non-divulgation, de non-publication ou de non-diffusion. \n 1982, c. 30, a. 53 ;  1985, c. 30, a. 3 ;  1989, c. 54, a. 150 ;  1990, c. 57, a. 11 ;  2006, c. 22, a. 29 . 54 .   Dans un document, sont personnels les renseignements qui concernent une personne physique et permettent de l’identifier. \n 1982, c. 30, a. 54 ;  2006, c. 22, a. 110 . 55 .   Un renseignement personnel qui a un caractère public en vertu de la loi n’est pas soumis aux règles de protection des renseignements personnels prévues par le présent chapitre. Cependant, un organisme public qui détient un fichier de tels renseignements peut en refuser l’accès, en tout ou en partie, ou n’en permettre que la consultation sur place si le responsable a des motifs raisonnables de croire que les renseignements seront utilisés à des fins illégitimes. \n 1982, c. 30, a. 55 ;  2006, c. 22, a. 30 . 56 .   Le nom d’une personne physique n’est pas un renseignement personnel, sauf lorsqu’il est mentionné avec un autre renseignement la concernant ou lorsque sa seule mention révélerait un renseignement personnel concernant cette personne. \n 1982, c. 30, a. 56 ;  2006, c. 22, a. 110 . 57 .   Les renseignements personnels suivants ont un caractère public: 1 °    le nom, le titre, la fonction, la classification, le traitement, l’adresse et le numéro de téléphone du lieu de travail d’un membre d’un organisme public, de son conseil d’administration ou de son personnel de direction et, dans le cas d’un ministère, d’un sous-ministre, de ses adjoints et de son personnel d’encadrement; 2 °    le nom, le titre, la fonction, l’adresse et le numéro de téléphone du lieu de travail et la classification, y compris l’échelle de traitement rattachée à cette classification, d’un membre du personnel d’un organisme public; 3 °    un renseignement concernant une personne en sa qualité de partie à un contrat de services conclu avec un organisme public, ainsi que les conditions de ce contrat; 4 °    le nom et l’adresse d’une personne qui bénéficie d’un avantage économique conféré par un organisme public en vertu d’un pouvoir discrétionnaire et tout renseignement sur la nature de cet avantage; 5 °    le nom et l’adresse de l’établissement du titulaire d’un permis délivré par un organisme public et dont la détention est requise en vertu de la loi pour exercer une activité ou une profession ou pour exploiter un commerce. Toutefois, les renseignements personnels prévus au premier alinéa n’ont pas un caractère public si leur divulgation est de nature à nuire ou à entraver le travail d’un organisme qui, en vertu de la loi, est chargé de prévenir, détecter ou réprimer le crime. De même, les renseignements personnels visés aux paragraphes 3° et 4° du premier alinéa n’ont pas un caractère public dans la mesure où la communication de cette information révélerait un renseignement dont la communication doit ou peut être refusée en vertu de la section II du chapitre II. En outre, les renseignements personnels prévus au paragraphe 2° ne peuvent avoir pour effet de révéler le traitement d’un membre du personnel d’un organisme public. \n 1982, c. 30, a. 57 ;  1985, c. 30, a. 4 ;  1990, c. 57, a. 12 ;  1999, c. 40, a. 3 ;  2006, c. 22, a. 31 . 58 .   Le fait qu’une signature apparaisse au bas d’un document n’a pas pour effet de rendre personnels les renseignements qui y apparaissent. \n 1982, c. 30, a. 58 ;  2006, c. 22, a. 110 . 59 .   Un organisme public ne peut communiquer un renseignement personnel sans le consentement de la personne concernée. Toutefois, il peut communiquer un tel renseignement sans le consentement de cette personne, dans les cas et aux strictes conditions qui suivent: 1 °    au procureur de cet organisme si le renseignement est nécessaire aux fins d’une poursuite pour infraction à une loi que cet organisme est chargé d’appliquer, ou au Directeur des poursuites criminelles et pénales si le renseignement est nécessaire aux fins d’une poursuite pour infraction à une loi applicable au Québec; 2 °    au procureur de cet organisme, ou au procureur général lorsqu’il agit comme procureur de cet organisme, si le renseignement est nécessaire aux fins d’une procédure judiciaire autre qu’une procédure visée dans le paragraphe 1°; 3 °    à un organisme qui, en vertu de la loi, est chargé de prévenir, détecter ou réprimer le crime ou les infractions aux lois, si le renseignement est nécessaire aux fins d’une poursuite pour infraction à une loi applicable au Québec; 4 °    à une personne à qui cette communication doit être faite en raison d’une situation d’urgence mettant en danger la vie, la santé ou la sécurité de la personne concernée; 5 °    à une personne qui est autorisée par la Commission d’accès à l’information, conformément à l’article 125, à utiliser ce renseignement à des fins d’étude, de recherche ou de statistique; 6 °    (paragraphe abrogé); 7 °    (paragraphe abrogé); 8 °    à une personne ou à un organisme, conformément aux articles 61, 66, 67, 67.1, 67.2, 68 et 68.1; 9 °    à une personne impliquée dans un événement ayant fait l’objet d’un rapport par un corps de police ou par une personne ou un organisme agissant en application d’une loi qui exige un rapport de même nature, lorsqu’il s’agit d’un renseignement sur l’identité de toute autre personne qui a été impliquée dans cet événement, sauf s’il s’agit d’un témoin, d’un dénonciateur ou d’une personne dont la santé ou la sécurité serait susceptible d’être mise en péril par la communication d’un tel renseignement. \n 1982, c. 30, a. 59 ;  1983, c. 38, a. 55 ;  1984, c. 27, a. 1 ;  1985, c. 30, a. 5 ;  1987, c. 68, a. 5 ;  1990, c. 57, a. 13 ;  2006, c. 22, a. 32 ;  2005, c. 34, a. 37 . 59.1 .   Outre les cas prévus à l’article 59, un organisme public peut également communiquer un renseignement personnel, sans le consentement des personnes concernées, en vue de prévenir un acte de violence, dont un suicide, lorsqu’il existe un motif raisonnable de croire qu’un risque sérieux de mort ou de blessures graves menace une personne ou un groupe de personnes identifiable et que la nature de la menace inspire un sentiment d’urgence. Les renseignements peuvent alors être communiqués à la ou aux personnes exposées à ce danger, à leur représentant ou à toute personne susceptible de leur porter secours. La personne ayant la plus haute autorité au sein de l’organisme public doit, par directive, établir les conditions et les modalités suivant lesquelles les renseignements peuvent être communiqués par le personnel de l’organisme. Le personnel est tenu de se conformer à cette directive. Pour l’application du premier alinéa, on entend par  « blessures graves »   toute blessure physique ou psychologique qui nuit d’une manière importante à l’intégrité physique, à la santé ou au bien-être d’une personne ou d’un groupe de personnes identifiable. \n 2001, c. 78, a. 1 ;  2006, c. 22, a. 110 ;  2017, c. 10 2017, c. 10 ,  a.  23 1 1 . 60 .   Avant de communiquer un renseignement personnel en vertu des paragraphes 1° à 3° de l’article 59, un organisme public doit s’assurer que le renseignement est nécessaire aux fins d’une poursuite ou d’une procédure visée dans ces paragraphes. Dans le cas visé au paragraphe 4° de cet article, l’organisme doit pareillement s’assurer du caractère urgent et dangereux de la situation. À défaut de s’être assuré que le renseignement est nécessaire pour ces fins ou, le cas échéant, du caractère urgent et dangereux de la situation, l’organisme public doit refuser de communiquer le renseignement. Lorsqu’un organisme public communique un renseignement personnel par suite d’une demande faite en vertu des paragraphes 1° à 4° de l’article 59, le responsable de la protection des renseignements personnels au sein de cet organisme doit enregistrer la communication. \n 1982, c. 30, a. 60 ;  2006, c. 22, a. 33 . 60.1 .   L’organisme qui communique un renseignement en application de l’article 59.1 ne peut communiquer que les renseignements nécessaires aux fins poursuivies par la communication. Lorsqu’un renseignement est ainsi communiqué, le responsable de la protection des renseignements personnels au sein de l’organisme doit inscrire la communication dans un registre qu’il tient à cette fin. \n 2001, c. 78, a. 2 . 61 .   Un corps de police peut, sans le consentement de la personne concernée, communiquer un renseignement personnel à un autre corps de police. \n 1982, c. 30, a. 61 ;  2006, c. 22, a. 110 . 61.1 .   (Abrogé). \n 1984, c. 27, a. 2 ;  1985, c. 30, a. 6 . 62 .   Un renseignement personnel est accessible, sans le consentement de la personne concernée, à toute personne qui a qualité pour le recevoir au sein d’un organisme public lorsque ce renseignement est nécessaire à l’exercice de ses fonctions. En outre, cette personne doit appartenir à l’une des catégories de personnes visées au paragraphe 4° du deuxième alinéa de l’article 76 ou au paragraphe 5° du premier alinéa de l’article 81. \n 1982, c. 30, a. 62 ;  1990, c. 57, a. 14 ;  2006, c. 22, a. 110 . 63 .   (Abrogé). \n 1982, c. 30, a. 63 ;  1985, c. 30, a. 7 . SECTION  II COLLECTE, UTILISATION, COMMUNICATION ET CONSERVATION DE RENSEIGNEMENTS PERSONNELS \n 2006, c. 22, a. 34 . 63.1 .   Un organisme public doit prendre les mesures de sécurité propres à assurer la protection des renseignements personnels collectés, utilisés, communiqués, conservés ou détruits et qui sont raisonnables compte tenu, notamment, de leur sensibilité, de la finalité de leur utilisation, de leur quantité, de leur répartition et de leur support. \n 2006, c. 22, a. 34 . 63.2 .   Un organisme public, à l’exception du Lieutenant-gouverneur, de l’Assemblée nationale et d’une personne qu’elle désigne pour exercer une fonction en relevant, doit protéger les renseignements personnels en mettant en oeuvre les mesures édictées à cette fin par règlement du gouvernement. \n 2006, c. 22, a. 34 . 64 .   Nul ne peut, au nom d’un organisme public, recueillir un renseignement personnel si cela n’est pas nécessaire à l’exercice des attributions de cet organisme ou à la mise en oeuvre d’un programme dont il a la gestion. Un organisme public peut toutefois recueillir un renseignement personnel si cela est nécessaire à l’exercice des attributions ou à la mise en oeuvre d’un programme de l’organisme public avec lequel il collabore pour la prestation de services ou pour la réalisation d’une mission commune. La collecte visée au deuxième alinéa s’effectue dans le cadre d’une entente écrite transmise à la Commission. L’entente entre en vigueur 30 jours après sa réception par la Commission. \n 1982, c. 30, a. 64 ;  2006, c. 22, a. 35 . 65 .   Quiconque, au nom d’un organisme public, recueille verbalement un renseignement personnel auprès de la personne concernée doit se nommer et, lors de la première collecte de renseignements et par la suite sur demande, l’informer: 1 °    du nom et de l’adresse de l’organisme public au nom de qui la collecte est faite; 2 °    des fins pour lesquelles ce renseignement est recueilli; 3 °    des catégories de personnes qui auront accès à ce renseignement; 4 °    du caractère obligatoire ou facultatif de la demande; 5 °    des conséquences pour la personne concernée ou, selon le cas, pour le tiers, d’un refus de répondre à la demande; 6 °    des droits d’accès et de rectification prévus par la loi. L’information qui doit être donnée en vertu des paragraphes 1° à 6° du premier alinéa doit être indiquée sur toute communication écrite qui vise à recueillir un renseignement personnel. Dans le cas où les renseignements personnels sont recueillis auprès d’un tiers, celui qui les recueille doit se nommer et lui communiquer l’information visée aux paragraphes 1°, 5° et 6° du premier alinéa. Toutefois, une personne dûment autorisée par un organisme public qui détient des dossiers ayant trait à l’adoption de personnes et qui recueille un renseignement relatif aux antécédents d’une personne visée dans l’un de ces dossiers ou permettant de retrouver un parent ou une personne adoptée n’est pas tenue d’informer la personne concernée ou le tiers de l’usage auquel est destiné le renseignement ni des catégories de personnes qui y auront accès. Le présent article ne s’applique pas à une enquête de nature judiciaire, ni à une enquête ou à un constat faits par un organisme qui, en vertu de la loi, est chargé de prévenir, détecter ou réprimer le crime ou les infractions aux lois. \n 1982, c. 30, a. 65 ;  1990, c. 57, a. 15 ;  2006, c. 22, a. 36 . 65.1 .   Un renseignement personnel ne peut être utilisé au sein d’un organisme public qu’aux fins pour lesquelles il a été recueilli. L’organisme public peut toutefois utiliser un tel renseignement à une autre fin avec le consentement de la personne concernée ou, sans son consentement, dans les seuls cas suivants: 1 °    lorsque son utilisation est à des fins compatibles avec celles pour lesquelles il a été recueilli; 2 °    lorsque son utilisation est manifestement au bénéfice de la personne concernée; 3 °    lorsque son utilisation est nécessaire à l’application d’une loi au Québec, que cette utilisation soit ou non prévue expressément par la loi. Pour qu’une fin soit compatible au sens du paragraphe 1° du deuxième alinéa, il doit y avoir un lien pertinent et direct avec les fins pour lesquelles le renseignement a été recueilli. Lorsqu’un renseignement est utilisé dans l’un des cas visés aux paragraphes 1° à 3° du deuxième alinéa, le responsable de la protection des renseignements personnels au sein de l’organisme doit inscrire l’utilisation dans le registre prévu à l’article 67.3. \n 2006, c. 22, a. 37 . 66 .   Un organisme public peut, sans le consentement de la personne concernée, communiquer un renseignement sur l’identité d’une personne afin de recueillir des renseignements personnels déjà colligés par une personne ou un organisme privé. L’organisme public en informe la Commission au préalable. \n 1982, c. 30, a. 66 ;  2006, c. 22, a. 38 . 67 .   Un organisme public peut, sans le consentement de la personne concernée, communiquer un renseignement personnel à toute personne ou organisme si cette communication est nécessaire à l’application d’une loi au Québec, que cette communication soit ou non prévue expressément par la loi. \n 1982, c. 30, a. 67 ;  1984, c. 27, a. 3 ;  1985, c. 30, a. 8 ;  2006, c. 22, a. 39 . 67.1 .   Un organisme public peut, sans le consentement de la personne concernée, communiquer un renseignement personnel à toute personne ou organisme si cette communication est nécessaire à l’application d’une convention collective, d’un décret, d’un arrêté, d’une directive ou d’un règlement qui établissent des conditions de travail. \n 1985, c. 30, a. 8 ;  2006, c. 22, a. 110 . 67.2 .   Un organisme public peut, sans le consentement de la personne concernée, communiquer un renseignement personnel à toute personne ou à tout organisme si cette communication est nécessaire à l’exercice d’un mandat ou à l’exécution d’un contrat de service ou d’entreprise confié par l’organisme public à cette personne ou à cet organisme. Dans ce cas, l’organisme public doit: 1 °    confier le mandat ou le contrat par écrit; 2 °    indiquer, dans le mandat ou le contrat, les dispositions de la présente loi qui s’appliquent au renseignement communiqué au mandataire ou à l’exécutant du contrat ainsi que les mesures qu’il doit prendre pour en assurer le caractère confidentiel, pour que ce renseignement ne soit utilisé que dans l’exercice de son mandat ou l’exécution de son contrat et pour qu’il ne le conserve pas après son expiration. En outre, l’organisme public doit, avant la communication, obtenir un engagement de confidentialité complété par toute personne à qui le renseignement peut être communiqué, à moins que le responsable de la protection des renseignements personnels estime que cela n’est pas nécessaire. Une personne ou un organisme qui exerce un mandat ou qui exécute un contrat de service visé au premier alinéa doit aviser sans délai le responsable de toute violation ou tentative de violation par toute personne de l’une ou l’autre des obligations relatives à la confidentialité du renseignement communiqué et doit également permettre au responsable d’effectuer toute vérification relative à cette confidentialité. Le deuxième alinéa ne s’applique pas lorsque le mandataire ou l’exécutant du contrat est un membre d’un ordre professionnel. De même, le paragraphe 2° du deuxième alinéa ne s’applique pas lorsque le mandataire ou l’exécutant du contrat est un autre organisme public. \n 1985, c. 30, a. 8 ;  1990, c. 57, a. 16 ;  1994, c. 40, a. 457 ;  2006, c. 22, a. 40 . 67.3 .   Un organisme public doit inscrire dans un registre toute communication de renseignements personnels visée aux articles 66, 67, 67.1, 67.2, 68 et 68.1, à l’exception de la communication d’un renseignement personnel requis par une personne ou un organisme pour imputer, au compte d’un membre d’un organisme public, de son conseil d’administration ou de son personnel, un montant dont la loi oblige la retenue ou le versement. Un organisme public doit aussi inscrire dans ce registre une entente de collecte de renseignements personnels visée au troisième alinéa de l’article 64, de même que l’utilisation de renseignements personnels à d’autres fins que celles pour lesquelles ils ont été recueillis visées aux paragraphes 1° à 3° du deuxième alinéa de l’article 65.1. Dans le cas d’une communication d’un renseignement personnel visée au premier alinéa, le registre comprend: 1 °    la nature ou le type de renseignement communiqué; 2 °    la personne ou l’organisme qui reçoit cette communication; 3 °    la fin pour laquelle ce renseignement est communiqué et l’indication, le cas échéant, qu’il s’agit d’une communication visée à l’article 70.1; 4 °    la raison justifiant cette communication. Dans le cas d’une entente de collecte de renseignements personnels, le registre comprend: 1 °    le nom de l’organisme pour lequel les renseignements sont recueillis; 2 °    l’identification du programme ou de l’attribution pour lequel les renseignements sont nécessaires; 3 °    la nature ou le type de la prestation de service ou de la mission; 4 °    la nature ou le type de renseignements recueillis; 5 °    la fin pour laquelle ces renseignements sont recueillis;  6 °    la catégorie de personnes, au sein de l’organisme qui recueille les renseignements et au sein de l’organisme receveur, qui a accès aux renseignements.  Dans le cas d’utilisation d’un renseignement personnel à une autre fin que celle pour laquelle il a été recueilli, le registre comprend: 1 °    la mention du paragraphe du deuxième alinéa de l’article 65.1 permettant l’utilisation; 2 °    dans le cas visé au paragraphe 3° du deuxième alinéa de l’article 65.1, la disposition de la loi qui rend nécessaire l’utilisation du renseignement; 3 °    la catégorie de personnes qui a accès au renseignement aux fins de l’utilisation indiquée. \n 1985, c. 30, a. 8 ;  1990, c. 57, a. 17 ;  2006, c. 22, a. 41 . 67.4 .   Toute personne qui en fait la demande a droit d’accès au registre tenu par un organisme public en vertu de l’article 67.3, sauf à l’égard des renseignements dont la confirmation de l’existence peut être refusée en vertu des dispositions des articles 21, 28, 28.1, 29, 30, 30.1 et 41. Ce droit s’exerce conformément aux modalités prévues à l’article 10. \n 1985, c. 30, a. 8 ;  2006, c. 22, a. 42 . 68 .   Un organisme public peut, sans le consentement de la personne concernée, communiquer un renseignement personnel: 1 °    à un organisme public ou à un organisme d’un autre gouvernement lorsque cette communication est nécessaire à l’exercice des attributions de l’organisme receveur ou à la mise en oeuvre d’un programme dont cet organisme a la gestion; 1.1 °    à un organisme public ou à un organisme d’un autre gouvernement lorsque la communication est manifestement au bénéfice de la personne concernée; 2 °    à une personne ou à un organisme lorsque des circonstances exceptionnelles le justifient; 3 °    à une personne ou à un organisme si cette communication est nécessaire dans le cadre de la prestation d’un service à rendre à la personne concernée par un organisme public, notamment aux fins de l’identification de cette personne. Cette communication s’effectue dans le cadre d’une entente écrite qui indique: 1 °    l’identification de l’organisme public qui communique le renseignement et celle de la personne ou de l’organisme qui le recueille; 2 °    les fins pour lesquelles le renseignement est communiqué; 3 °    la nature du renseignement communiqué; 4 °    le mode de communication utilisé; 5 °    les mesures de sécurité propres à assurer la protection du renseignement personnel; 6 °    la périodicité de la communication; 7 °    la durée de l’entente. \n 1982, c. 30, a. 68 ;  1985, c. 30, a. 8 ;  2006, c. 22, a. 43 . 68.1 .   Un organisme public peut, sans le consentement de la personne concernée, communiquer un fichier de renseignements personnels aux fins de le comparer avec un fichier détenu par une personne ou un organisme si cette communication est nécessaire à l’application d’une loi au Québec, que cette communication soit ou non prévue expressément par la loi. Dans le cas où la communication de renseignements personnels n’est pas prévue expressément par la loi, elle s’effectue dans le cadre d’une entente écrite. La communication prévue expressément par la loi s’effectue dans le cadre d’une entente écrite transmise à la Commission. L’entente entre en vigueur 30 jours après sa réception par la Commission. \n 1985, c. 30, a. 8 ;  2006, c. 22, a. 44 . 69 .   (Abrogé). \n 1982, c. 30, a. 69 ;  1985, c. 30, a. 9 ;  2006, c. 22, a. 45 . 70 .   Une entente visée à l’article 68 ou au deuxième alinéa de l’article 68.1 doit être soumise à la Commission pour avis. La Commission doit prendre en considération: 1 °    la conformité de l’entente aux conditions visées à l’article 68 ou à l’article 68.1; 2 °    l’impact de la communication du renseignement sur la vie privée de la personne concernée, le cas échéant, par rapport à la nécessité du renseignement pour l’organisme ou la personne qui en reçoit communication. La Commission doit rendre un avis motivé dans un délai d’au plus 60 jours de la réception de la demande d’avis accompagnée de l’entente. Si la demande est modifiée pendant ce délai, celui-ci court à compter de la dernière demande. Si le traitement de la demande d’avis dans ce délai ne lui paraît pas possible sans nuire au déroulement normal des activités de la Commission, le président peut, avant l’expiration de ce délai, le prolonger d’une période n’excédant pas 20 jours. Il doit alors en donner avis aux parties à l’entente dans le délai de 60 jours. L’entente entre en vigueur sur avis favorable de la Commission ou à toute date ultérieure prévue à l’entente. La Commission doit rendre publics cette entente ainsi que son avis. À défaut d’avis dans le délai prévu, les parties à l’entente sont autorisées à procéder à son exécution. En cas d’avis défavorable de la Commission, le gouvernement peut, sur demande, approuver cette entente et fixer les conditions applicables. Avant d’approuver l’entente, le gouvernement publie à la  Gazette officielle du Québec  l’entente et, le cas échéant, les conditions qu’il entend fixer avec un avis qu’il pourra approuver l’entente à l’expiration d’un délai de 30 jours de cette publication et que tout intéressé peut, durant ce délai, transmettre des commentaires à la personne qui y est désignée. L’entente entre en vigueur le jour de son approbation ou à toute date ultérieure fixée par le gouvernement ou prévue à l’entente. L’entente visée au cinquième alinéa ainsi que l’avis de la Commission et l’approbation du gouvernement sont déposés à l’Assemblée nationale dans les 30 jours de cette approbation si l’Assemblée est en session ou, si elle ne siège pas, dans les 30 jours de la reprise de ses travaux. Le gouvernement peut révoquer en tout temps une entente visée au cinquième alinéa. \n 1982, c. 30, a. 70 ;  1982, c. 62, a. 143 ;  1985, c. 30, a. 10 ;  1990, c. 57, a. 18 ;  2006, c. 22, a. 46 . 70.1 .   Avant de communiquer à l’extérieur du Québec des renseignements personnels ou de confier à une personne ou à un organisme à l’extérieur du Québec la tâche de détenir, d’utiliser ou de communiquer pour son compte de tels renseignements, l’organisme public doit s’assurer qu’ils bénéficieront d’une protection équivalant à celle prévue à la présente loi. Si l’organisme public estime que les renseignements visés au premier alinéa ne bénéficieront pas d’une protection équivalant à celle prévue à la présente loi, il doit refuser de les communiquer ou refuser de confier à une personne ou à un organisme à l’extérieur du Québec la tâche de les détenir, de les utiliser ou de les communiquer pour son compte. \n 2006, c. 22, a. 47 . SECTION  III ÉTABLISSEMENT ET GESTION DES FICHIERS §  1 .  —  Fichier de renseignements personnels 71 .   Un organisme public doit verser dans un fichier de renseignements personnels établi conformément à la présente sous-section tout renseignement personnel qui: 1 °    est identifié ou se présente de façon à être retrouvé par référence au nom d’une personne ou à un signe ou symbole propre à celle-ci; ou 2 °    lui a servi ou est destiné à lui servir pour une décision concernant une personne. \n 1982, c. 30, a. 71 ;  2006, c. 22, a. 110 . 72 .   Un organisme public doit veiller à ce que les renseignements personnels qu’il conserve soient à jour, exacts et complets pour servir aux fins pour lesquelles ils sont recueillis ou utilisés. \n 1982, c. 30, a. 72 ;  2006, c. 22, a. 48 . 73 .   Lorsque les fins pour lesquelles un renseignement personnel a été recueilli ou utilisé sont accomplies, l’organisme public doit le détruire, sous réserve de la Loi sur les archives ( chapitre A‐21.1 ) ou du Code des professions ( chapitre C‐26 ). \n 1982, c. 30, a. 73 ;  1983, c. 38, a. 56 ;  2006, c. 22, a. 49 . 74 .   (Abrogé). \n 1982, c. 30, a. 74 ;  1990, c. 57, a. 19 . 75 .   (Abrogé). \n 1982, c. 30, a. 75 ;  1990, c. 57, a. 19 . 76 .   Un organisme public doit établir et maintenir à jour un inventaire de ses fichiers de renseignements personnels. Cet inventaire doit contenir les indications suivantes: 1 °    la désignation de chaque fichier, les catégories de renseignements qu’il contient, les fins pour lesquelles les renseignements sont conservés et le mode de gestion de chaque fichier; 2 °    la provenance des renseignements versés à chaque fichier; 3 °    les catégories de personnes concernées par les renseignements versés à chaque fichier; 4 °    les catégories de personnes qui ont accès à chaque fichier dans l’exercice de leurs fonctions; 5 °    les mesures de sécurité prises pour assurer la protection des renseignements personnels. Toute personne qui en fait la demande a droit d’accès à cet inventaire, sauf à l’égard des renseignements dont la confirmation de l’existence peut être refusée en vertu des dispositions de la présente loi. \n 1982, c. 30, a. 76 ;  1990, c. 57, a. 20 ;  2006, c. 22, a. 50 . 77 .   (Abrogé). \n 1982, c. 30, a. 77 ;  2006, c. 22, a. 51 . 78 .   Les articles 64 à 77 ne s’appliquent pas au traitement de renseignements personnels recueillis par une personne physique et qui lui servent d’instrument de travail pour autant que ces renseignements ne soient pas communiqués à une autre personne que la personne concernée ou à un autre organisme que celui dont elle fait partie, et qu’ils soient utilisés à bon escient. Il en est de même du traitement de renseignements personnels recueillis par une personne physique et qui lui servent à des fins de recherche scientifique. L’organisme public devient assujetti à ces articles dès que la personne visée au premier ou au deuxième alinéa lui communique un renseignement personnel qu’elle a recueilli ou qui résulte du traitement. \n 1982, c. 30, a. 78 ;  2006, c. 22, a. 110 . 79 .   Les articles 63.1 à 66 et 67.3 à 76 ne s’appliquent pas aux documents versés à Bibliothèque et Archives nationales conformément à la Loi sur les archives ( chapitre A‐21.1 ). Les articles 63.1 à 66, 67.3 et 67.4 et les articles 71 à 76 ne s’appliquent pas aux renseignements communiqués à l’Institut de la statistique du Québec conformément à la Loi sur l’Institut de la statistique du Québec ( chapitre I‐13.011 ). \n 1982, c. 30, a. 79 ;  1983, c. 38, a. 57 ;  1985, c. 30, a. 11 ;  1998, c. 44, a. 43 ;  2004, c. 25, a. 58 ;  2006, c. 22, a. 52 . §  2 .  —  Fichier confidentiel 80 .   Le gouvernement peut, par décret, autoriser un organisme public à établir un fichier confidentiel. Un fichier confidentiel est un fichier constitué principalement de renseignements personnels destinés à être utilisés par une personne ou un organisme qui, en vertu de la loi, est chargé de prévenir, détecter ou réprimer le crime ou les infractions aux lois. \n 1982, c. 30, a. 80 ;  2006, c. 22, a. 53 . 81 .   Le décret indique les conditions auxquelles l’organisme visé doit se conformer et, notamment: 1 °    les types de renseignements qui peuvent être recueillis et les fins pour lesquelles ils peuvent être conservés; 2 °    l’usage qui peut être fait du fichier; 3 °    la nature des mesures de sécurité à prendre pour assurer le caractère confidentiel des renseignements personnels; 4 °    les conditions qui s’appliquent à la conservation et à la destruction des renseignements personnels; 5 °    les catégories de personnes qui ont accès aux renseignements personnels dans l’exercice de leurs fonctions et, s’il y a lieu, les restrictions à l’accès ainsi que les conditions particulières d’accès; 6 °    les conditions auxquelles la gestion et la consultation du fichier peuvent être assujetties, le cas échéant. En outre, ces conditions peuvent viser une catégorie de renseignements, de documents ou de fichiers. \n 1982, c. 30, a. 81 ;  2006, c. 22, a. 110 . 82 .   Avant de prendre, de modifier ou d’abroger un décret visé dans l’article 80, le gouvernement prend l’avis de la Commission. Le décret autorisant l’établissement d’un fichier confidentiel, ou le décret qui le modifie ou l’abroge, ainsi que l’avis de la Commission, sont déposés par le ministre de la Justice à l’Assemblée nationale dans les quinze jours qui suivent la prise du décret si l’Assemblée est en session ou, si elle ne siège pas, dans les quinze jours de l’ouverture de la session suivante ou de la reprise de ses travaux. \n 1982, c. 30, a. 82 ;  1982, c. 62, a. 143 . SECTION  IV DROITS DE LA PERSONNE CONCERNÉE PAR UN RENSEIGNEMENT PERSONNEL \n 2006, c. 22, a. 110 . §  1 .  —  Droit d’accès 83 .   Toute personne a le droit d’être informée de l’existence, dans un fichier de renseignements personnels, d’un renseignement personnel la concernant. Elle a le droit de recevoir communication de tout renseignement personnel la concernant. Toutefois, un mineur de moins de 14 ans n’a pas le droit d’être informé de l’existence ni de recevoir communication d’un renseignement personnel de nature médicale ou sociale le concernant, contenu dans le dossier constitué par l’établissement de santé ou de services sociaux visé au deuxième alinéa de l’article 7. \n 1982, c. 30, a. 83 ;  1987, c. 68, a. 6 ;  1990, c. 57, a. 21 ;  1992, c. 21, a. 74 ;  2006, c. 22, a. 110 . 84 .   L’organisme public donne communication d’un renseignement personnel à la personne qui a le droit de le recevoir en lui permettant de prendre connaissance du renseignement sur place pendant les heures habituelles de travail ou à distance et d’en obtenir une copie. À la demande du requérant, un renseignement personnel informatisé doit être communiqué sous la forme d’une transcription écrite et intelligible. Lorsque le requérant est une personne handicapée, des mesures d’accommodement raisonnables doivent, sur demande, être prises pour lui permettre d’exercer le droit d’accès prévu par la présente section. À cette fin, l’organisme public tient compte de la politique établie en vertu de l’article 26.5 de la Loi assurant l’exercice des droits des personnes handicapées en vue de leur intégration scolaire, professionnelle et sociale ( chapitre E-20.1 ). \n 1982, c. 30, a. 84 ;  1990, c. 57, a. 22 ;  2001, c. 32, a. 85 ;  2006, c. 22, a. 54 . 84.1 .   Un établissement de santé ou de services sociaux visé au deuxième alinéa de l’article 7, la Commission de la santé et de la sécurité du travail, la Société de l’assurance automobile du Québec, Retraite Québec ou un ordre professionnel qui fournit à une personne un renseignement personnel de nature médicale ou sociale la concernant doit, à la demande de cette personne, lui fournir l’assistance d’un professionnel, qualifié pour l’aider à comprendre ce renseignement. \n 1987, c. 68, a. 7 ;  1990, c. 19, a. 11 ;  1992, c. 21, a. 75 ;  2006, c. 22, a. 55 ;  2015, c. 20, a. 61 . 85 .   L’accès d’une personne à un renseignement personnel la concernant est gratuit. Toutefois, des frais n’excédant pas le coût de la transcription, de la reproduction et de la transmission du renseignement peuvent être exigés du requérant. Le montant et les modalités de paiement de ces frais sont prescrits par règlement du gouvernement; ce règlement peut prévoir les cas où une personne est exemptée du paiement et il tient compte de la politique établie en vertu de l’article 26.5 de la Loi assurant l’exercice des droits des personnes handicapées en vue de leur intégration scolaire, professionnelle et sociale ( chapitre E-20.1 ). L’organisme public qui entend exiger des frais en vertu du présent article doit informer le requérant du montant approximatif qui lui sera chargé, avant de procéder à la transcription, la reproduction ou la transmission du document. \n 1982, c. 30, a. 85 ;  1987, c. 68, a. 8 ;  2006, c. 22, a. 56 . §  2 .  —  Restrictions au droit d’accès 86 .   Un organisme public peut refuser de confirmer à une personne l’existence, dans un fichier confidentiel, d’un renseignement personnel la concernant ou de lui en donner communication. \n 1982, c. 30, a. 86 ;  2006, c. 22, a. 110 . 86.1 .   Un organisme public peut refuser de donner communication à une personne d’un renseignement personnel la concernant, lorsque ce renseignement est contenu dans un avis ou une recommandation fait par un de ses membres ou un membre de son personnel, un membre d’un autre organisme public ou un membre du personnel de cet autre organisme, dans l’exercice de leurs fonctions, ou fait à la demande de l’organisme par un consultant ou par un conseiller sur une matière de sa compétence et que l’organisme n’a pas rendu sa décision finale sur la matière faisant l’objet de cet avis ou de cette recommandation. \n 1990, c. 57, a. 23 ;  2006, c. 22, a. 110 . 87 .   Sauf dans le cas prévu à l’article 86.1, un organisme public peut refuser de confirmer l’existence ou de donner communication à une personne d’un renseignement personnel la concernant, dans la mesure où la communication de cette information révélerait un renseignement dont la communication doit ou peut être refusée en vertu de la section II du chapitre II ou en vertu des articles 108.3 et 108.4 du Code des professions ( chapitre C-26 ). \n 1982, c. 30, a. 87 ;  1990, c. 57, a. 24 ;  2006, c. 22, a. 57 . 87.1 .   Un établissement de santé ou de services sociaux visé au deuxième alinéa de l’article 7, la Commission des normes, de l’équité, de la santé et de la sécurité du travail, la Société de l’assurance automobile du Québec, Retraite Québec ou un ordre professionnel peut refuser momentanément de donner communication à une personne d’un renseignement personnel la concernant lorsque, de l’avis de son médecin traitant, il en résulterait vraisemblablement un préjudice grave pour sa santé. Dans le cas d’un renseignement de nature médicale, aucune autre restriction ne peut être invoquée. L’organisme public, sur la recommandation du médecin traitant, détermine le moment où ce renseignement pourra être communiqué et en avise la personne concernée. Un organisme public non visé par le premier alinéa qui détient des renseignements de nature médicale peut en refuser la communication à la personne concernée dans le seul cas où il en résulterait vraisemblablement un préjudice grave pour sa santé et à la condition d’offrir de communiquer ces renseignements à un professionnel du domaine de la santé choisi par cette personne. \n 1987, c. 68, a. 9 ;  1990, c. 19, a. 11 ;  1992, c. 21, a. 76 ;  2006, c. 22, a. 58 ;  2015, c. 15, a. 237 ;  2015, c. 20, a. 61 . 88 .   Sauf dans le cas prévu par le paragraphe 4° de l’article 59, un organisme public doit refuser de donner communication à une personne d’un renseignement personnel la concernant lorsque sa divulgation révélerait vraisemblablement un renseignement personnel concernant une autre personne physique ou l’existence d’un tel renseignement et que cette divulgation serait susceptible de nuire sérieusement à cette autre personne, à moins que cette dernière n’y consente par écrit. \n 1982, c. 30, a. 88 ;  2006, c. 22, a. 59 . 88.1 .   Un organisme public doit refuser de donner communication d’un renseignement personnel au liquidateur de la succession, au bénéficiaire d’une assurance-vie ou d’une indemnité de décès ou à l’héritier ou au successible de la personne concernée par ce renseignement, à moins que cette communication ne mette en cause ses intérêts ou ses droits à titre de liquidateur, de bénéficiaire, d’héritier ou de successible. \n 1986, c. 95, a. 5 ;  1993, c. 17, a. 99 ;  2006, c. 22, a. 60 . §  3 .  —  Droit de rectification 89 .   Toute personne qui reçoit confirmation de l’existence dans un fichier d’un renseignement personnel la concernant peut, s’il est inexact, incomplet ou équivoque, ou si sa collecte, sa communication ou sa conservation ne sont pas autorisées par la loi, exiger que le fichier soit rectifié. \n 1982, c. 30, a. 89 ;  2006, c. 22, a. 110 . 89.1 .   Un organisme public doit refuser d’accéder à une demande de rectification d’un renseignement personnel faite par le liquidateur de la succession, par le bénéficiaire d’une assurance-vie ou d’une indemnité de décès ou par l’héritier ou le successible de la personne concernée par ce renseignement, à moins que cette rectification ne mette en cause ses intérêts ou ses droits à titre de liquidateur, de bénéficiaire, d’héritier ou de successible. \n 1986, c. 95, a. 6 ;  1993, c. 17, a. 100 ;  2006, c. 22, a. 61 . 90 .   En cas de contestation relative à une demande de rectification, l’organisme public doit prouver que le fichier n’a pas à être rectifié, à moins que le renseignement en cause ne lui ait été communiqué par la personne concernée ou avec son accord. \n 1982, c. 30, a. 90 . 91 .   Lorsque l’organisme public refuse en tout ou en partie d’accéder à une demande de rectification d’un fichier, la personne concernée peut exiger que cette demande soit enregistrée. \n 1982, c. 30, a. 91 . 92 .   Un organisme public doit, lorsqu’il accède à une demande de rectification d’un fichier, délivrer sans frais à la personne qui l’a faite, une copie de tout renseignement personnel modifié ou ajouté, ou, selon le cas, une attestation du retrait d’un renseignement personnel. \n 1982, c. 30, a. 92 ;  2006, c. 22, a. 110 . 93 .   Toute personne qui a demandé la rectification d’un fichier peut exiger que l’organisme public fasse parvenir une copie des documents prévus à l’article 92 ou, selon le cas, de l’enregistrement visé à l’article 91 à l’organisme de qui il a obtenu le renseignement ou à tout organisme à qui le renseignement a pu être communiqué dans le cadre d’une entente conclue suivant la présente loi. \n 1982, c. 30, a. 93 . §  4 .  —  Procédure d’accès ou de rectification 94 .   Une demande de communication ou de rectification ne peut être considérée que si elle est faite par écrit par une personne physique justifiant de son identité à titre de personne concernée, à titre de représentant, d’héritier ou de successible de cette dernière, à titre de liquidateur de la succession, à titre de bénéficiaire d’assurance-vie ou d’indemnité de décès ou à titre de titulaire de l’autorité parentale même si l’enfant mineur est décédé. Elle est adressée au responsable de la protection des renseignements personnels au sein de l’organisme public. Si la demande est adressée à la personne ayant la plus haute autorité au sein de l’organisme public, cette personne doit la transmettre avec diligence au responsable qu’elle a désigné en vertu de l’article 8, le cas échéant. Le présent article ne restreint pas la communication à une personne d’un renseignement personnel la concernant ou sa correction par une personne autre que le responsable de la protection des renseignements personnels et résultant de la prestation d’un service à lui rendre. \n 1982, c. 30, a. 94 ;  1986, c. 95, a. 7 ;  1993, c. 17, a. 101 ;  2006, c. 22, a. 62 . 95 .   Lorsqu’une demande de communication porte sur un renseignement personnel qui n’est pas versé dans un fichier de renseignements personnels, la demande doit, pour être recevable, contenir des indications suffisamment précises pour permettre au responsable de le trouver. Lorsque la demande n’est pas suffisamment précise ou lorsqu’une personne le requiert, le responsable doit prêter assistance pour identifier le document susceptible de contenir les renseignements recherchés. \n 1982, c. 30, a. 95 ;  2006, c. 22, a. 63 . 96 .   (Abrogé). \n 1982, c. 30, a. 96 ;  1990, c. 57, a. 25 ;  2006, c. 22, a. 64 . 97 .   Le responsable doit donner au requérant un avis de la date de la réception de sa demande. Cet avis est écrit; il indique les délais prescrits pour donner suite à la demande et l’effet que cette loi attache au défaut, par le responsable, de les respecter. En outre, il informe le requérant du recours en révision prévu par la section III du chapitre IV. \n 1982, c. 30, a. 97 ;  2006, c. 22, a. 65 . 98 .   Le responsable doit donner suite à une demande de communication ou de rectification avec diligence et au plus tard dans les vingt jours qui suivent la date de sa réception. Si le traitement de la demande dans le délai prévu par le premier alinéa ne lui paraît pas possible sans nuire au déroulement normal des activités de l’organisme public, le responsable peut, avant l’expiration de ce délai, le prolonger d’une période n’excédant pas dix jours.  Il doit alors en donner avis au requérant, par courrier, dans le délai prévu au premier alinéa. \n 1982, c. 30, a. 98 . 99 .   (Abrogé). \n 1982, c. 30, a. 99 ;  1990, c. 57, a. 26 . 100 .   Le responsable doit motiver tout refus d’accéder à une demande et indiquer la disposition de la loi sur laquelle ce refus s’appuie. \n 1982, c. 30, a. 100 . 101 .   Le responsable rend sa décision par écrit et en transmet une copie au requérant. Elle doit être accompagnée du texte de la disposition sur laquelle le refus s’appuie, le cas échéant, et d’un avis l’informant du recours en révision prévu par la section III du chapitre IV et indiquant notamment le délai dans lequel il peut être exercé. \n 1982, c. 30, a. 101 ;  2006, c. 22, a. 66 . 102 .   À défaut de répondre à une demande dans les délais applicables, le responsable est réputé avoir refusé d’y accéder et ce défaut donne ouverture au recours en révision prévu par la section III du chapitre IV, comme s’il s’agissait d’un refus d’accéder à la demande. \n 1982, c. 30, a. 102 . 102.1 .   Le responsable doit veiller à ce que le renseignement faisant l’objet de la demande soit conservé le temps requis pour permettre au requérant d’épuiser les recours prévus à la présente loi. \n 1990, c. 57, a. 27 . CHAPITRE  IV COMMISSION D’ACCÈS À L’INFORMATION SECTION  I CONSTITUTION ET ORGANISATION 103 .   Est instituée la «Commission d’accès à l’information». La Commission comporte deux sections: une section de surveillance et une section juridictionnelle. \n 1982, c. 30, a. 103 ;  2006, c. 22, a. 67 . 104 .   La Commission se compose d’au moins cinq membres, dont un président et un vice-président. Les membres sont nommés, sur proposition du Premier ministre, par résolution de l’Assemblée nationale approuvée par au moins les deux tiers de ses membres. La résolution indique la section à laquelle les membres, autres que le président et le vice-président, sont affectés pour la durée du mandat. Toutefois, au moins deux membres sont affectés à la section juridictionnelle. L’Assemblée détermine de la même manière la rémunération, les avantages sociaux et les autres conditions de travail des membres de la Commission. Les membres de la Commission exercent leur fonction à temps plein. \n 1982, c. 30, a. 104 ;  1982, c. 62, a. 143 ;  1993, c. 17, a. 102 ;  2006, c. 22, a. 68 . 104.1 .   Les membres de la Commission sont préalablement choisis suivant la procédure de sélection des personnes aptes à être nommées membres de la Commission établie par règlement du Bureau de l’Assemblée nationale. Celui-ci peut notamment : 1 °    déterminer la manière dont une personne peut se porter candidate à la fonction de membre ; 2 °    former un comité de sélection pour évaluer l’aptitude des candidats à la fonction de membre et lui fournir un avis sur eux ; 3 °    fixer la composition et le mode de nomination des membres du comité ; 4 °    déterminer les critères de sélection dont le comité tient compte ; 5 °    déterminer les renseignements que le comité peut requérir d’un candidat et les consultations qu’il peut faire. Les membres du comité ne sont pas rémunérés, sauf dans le cas, aux conditions et dans la mesure que peut déterminer le Bureau de l’Assemblée nationale. Ils ont cependant droit au remboursement des dépenses faites dans l’exercice de leurs fonctions, aux conditions et dans la mesure déterminées par règlement du Bureau de l’Assemblée nationale. \n 2006, c. 22, a. 69 . 105 .   La durée du mandat des membres de la Commission est d’une durée fixe d’au plus cinq ans. À l’expiration de son mandat, un membre demeure toutefois en fonction jusqu’à ce qu’il soit nommé à nouveau ou remplacé. La procédure de sélection visée à l’article 104.1 ne s’applique pas au membre dont le mandat est renouvelé. Un membre remplacé peut, avec l’autorisation du président et pour une période que celui-ci détermine, continuer d’exercer ses fonctions comme membre en surnombre pour les demandes de révision ou les demandes d’examen de mésententes dont il a été saisi et sur lesquelles il n’a pas encore statué. \n 1982, c. 30, a. 105 ;  2006, c. 22, a. 70 . 106 .   Avant de commencer à exercer leurs fonctions, les membres de la Commission doivent, devant le président de l’Assemblée nationale, prêter le serment prévu à l’annexe B. \n 1982, c. 30, a. 106 ;  1982, c. 62, a. 143 ;  1999, c. 40, a. 3 . 107 .   Un membre de la Commission peut en tout temps démissionner en en donnant un avis écrit au président de l’Assemblée nationale. Il ne peut être destitué que par une résolution de l’Assemblée approuvée par au moins les deux tiers de ses membres. \n 1982, c. 30, a. 107 ;  1982, c. 62, a. 143 . 107.1 .   Le vice-président remplace le président en cas d’absence ou d’empêchement de ce dernier ou de vacance de son poste. En outre, le président peut déléguer ses attributions, en tout ou en partie, au vice-président. \n 2006, c. 22, a. 71 . 108 .   En cas d’absence ou d’empêchement du président et du vice-président de la Commission ou de vacance de leur poste, le président de l’Assemblée nationale peut, avec l’accord du Premier ministre et du Chef de l’opposition officielle à l’Assemblée, désigner l’un des autres membres de la Commission pour assurer l’intérim. \n 1982, c. 30, a. 108 ;  1982, c. 62, a. 143 ;  1999, c. 40, a. 3 ;  2006, c. 22, a. 72 . 109 .   Le président de l’Assemblée nationale peut, avec l’accord du Premier ministre et du Chef de l’opposition officielle à l’Assemblée, nommer une personne pour combler une vacance qui survient au sein de la Commission à un moment où la procédure prévue par l’article 104 ne peut être suivie en raison de l’ajournement des travaux de l’Assemblée ou de la prorogation de la session ou de la dissolution de la Législature; il peut également déterminer la rémunération et les autres conditions de travail de cette personne. Cette nomination cesse toutefois d’avoir effet à l’expiration d’un délai de trente jours à compter de la reprise des travaux de l’Assemblée, à moins qu’elle ne soit ratifiée de la manière prévue par le deuxième alinéa de l’article 104. \n 1982, c. 30, a. 109 ;  1982, c. 62, a. 143 . 110 .   Le président de la Commission est chargé de la direction et de l’administration des affaires de la Commission. Il peut, par délégation, exercer les pouvoirs de la Commission prévus aux articles 118 et 120. Il a notamment pour fonctions: 1 °    de favoriser la participation des membres à l’élaboration d’orientations générales de la Commission en vue de maintenir un niveau élevé de qualité et de cohérence des décisions; 2 °    de coordonner et de répartir le travail des membres de la Commission qui, à cet égard, doivent se soumettre à ses ordres et directives; 3 °    de veiller au respect de la déontologie; 4 °    de promouvoir le perfectionnement des membres quant à l’exercice de leurs fonctions. Pour la bonne expédition des affaires de la Commission, le président peut affecter temporairement un membre auprès d’une autre section. \n 1982, c. 30, a. 110 ;  2006, c. 22, a. 73 . 110.1 .   La Commission adopte, par règlement, des règles de régie interne et de déontologie. Les règles de déontologie sont publiées à la  Gazette officielle du Québec . \n 2006, c. 22, a. 74 . 111 .   Le secrétaire ainsi que les autres membres du personnel de la Commission sont nommés conformément à la Loi sur la fonction publique ( chapitre F‐3.1.1 ). \n 1982, c. 30, a. 111 ;  1983, c. 55, a. 161 ;  2000, c. 8, a. 242 . 112 .   Aucun membre de la Commission ne peut, sous peine de déchéance de sa charge, avoir un intérêt direct ou indirect dans une entreprise mettant en conflit son intérêt personnel et celui de la Commission. Toutefois, cette déchéance n’a pas lieu si cet intérêt lui échoit par succession ou par donation, pourvu qu’il y renonce ou en dispose avec diligence. \n 1982, c. 30, a. 112 . 113 .   Un membre de la Commission ou de son personnel ne peut être poursuivi en justice en raison d’un acte officiel accompli de bonne foi dans l’exercice de ses fonctions. \n 1982, c. 30, a. 113 . 114 .   Sauf sur une question de compétence, aucun pourvoi en contrôle judiciaire prévu au Code de procédure civile ( chapitre C‐25.01 ) ne peut être exercé, ni aucune injonction accordée contre la Commission ou un de ses membres agissant en sa qualité officielle. Deux juges de la Cour d’appel peuvent, sur demande, annuler sommairement un jugement, une décision, une ordonnance ou une injonction rendu ou prononcé à l’encontre de la présente loi relativement à un document. \n 1982, c. 30, a. 114 ;  2006, c. 22, a. 75 ;  N.I. 2016-01-01 (NCPC) . 115 .   La Commission a son siège sur le territoire de la Ville de Québec, à l’endroit déterminé par le gouvernement; un avis de la situation ou de tout changement du siège est publié à la  Gazette officielle du Québec. \n 1982, c. 30, a. 115 ;  2000, c. 56, a. 220 . 116 .   Les documents émanant de la Commission et leurs copies sont authentiques s’ils sont certifiés par un membre de la Commission ou par le secrétaire. \n 1982, c. 30, a. 116 . 117 .   L’exercice financier de la Commission se termine le 31 mars de chaque année. \n 1982, c. 30, a. 117 . 118 .   La Commission transmet au ministre désigné, au plus tard le 30 juin de chaque année, un rapport de ses activités pour l’exercice financier précédent. Ce rapport porte notamment sur l’observation de la présente loi et sur les moyens dont dispose la Commission pour son application. Il peut également contenir: 1 °    des recommandations visant à favoriser la protection des renseignements personnels, ainsi que l’exercice du droit d’accès aux documents, notamment par les communautés culturelles et les personnes handicapées; 2 °    des propositions relatives aux normes techniques sur la conservation, le classement, le repérage et le mode de consultation des documents; 3 °    les suggestions du public sur toute matière de la compétence de la Commission. Ce rapport porte aussi sur l’application de la Loi sur la protection des renseignements personnels dans le secteur privé ( chapitre P-39.1 ) et de la section V.1 du chapitre IV du Code des professions ( chapitre C-26 ). \n 1982, c. 30, a. 118 ;  1993, c. 17, a. 103 ;  2006, c. 22, a. 76 . 119 .   Le rapport d’activités est déposé devant l’Assemblée nationale dans les trente jours de sa réception, si l’Assemblée est en session ou, si elle ne siège pas, dans les trente jours de l’ouverture de la session suivante ou de la reprise de ses travaux. \n 1982, c. 30, a. 119 ;  1982, c. 62, a. 143 ;  1984, c. 27, a. 4 . 119.1 .   La commission de l’Assemblée nationale désigne, dans les meilleurs délais, la commission qui fera l’étude du rapport d’activités. La commission désignée doit faire l’étude de ce rapport dans les 60 jours de son dépôt à l’Assemblée nationale. \n 1984, c. 27, a. 5 . 120 .   La Commission fournit au ministre désigné tout renseignement et tout rapport financiers que celui-ci requiert sur ses activités. En outre, la Commission transmet au ministre, sur demande, une copie des avis finals qu’elle transmet à un ministère ou à un organisme gouvernemental visé au premier alinéa de l’article 3 ainsi que des règles, rapports, prescriptions et ordonnances découlant de ses fonctions de surveillance. \n 1982, c. 30, a. 120 ;  2006, c. 22, a. 77 . 121 .   (Abrogé). \n 1982, c. 30, a. 121 ;  2006, c. 22, a. 78 . SECTION  II SECTION DE SURVEILLANCE \n 2006, c. 22, a. 79 . 122 .   Les fonctions et pouvoirs de la Commission prévus à la présente section sont exercés par le président et les membres affectés à la section de surveillance. \n 1982, c. 30, a. 122 ;  1993, c. 17, a. 104 ;  2006, c. 22, a. 79 . 122.1 .   La Commission a pour fonction de surveiller l’application de la présente loi et de la Loi sur la protection des renseignements personnels dans le secteur privé ( chapitre P‐39.1 ). La Commission est aussi chargée d’assurer le respect et la promotion de l’accès aux documents et de la protection des renseignements personnels. \n 2006, c. 22, a. 79 . 123 .   La Commission a également pour fonctions: 1 °    de faire enquête sur l’application de la présente loi et sur son observation; 2 °    d’approuver les ententes conclues entre les organismes en vertu de l’article 172; 3 °    de donner son avis sur les projets de règlement qui lui sont soumis en vertu de la présente loi, sur les projets d’entente de transfert de renseignements, de même que sur les projets de décrets autorisant l’établissement de fichiers confidentiels; 4 °    d’établir, si elle le juge opportun, les règles de tenue du registre visé à l’article 67.3; 5 °    de veiller au respect de la confidentialité des renseignements personnels contenus dans les dossiers ayant trait à l’adoption d’une personne et détenus par un organisme public; 6 °    de veiller au respect de la confidentialité des renseignements personnels contenus dans le dossier que le curateur public détient sur une personne qu’il représente ou dont il administre les biens. \n 1982, c. 30, a. 123 ;  1985, c. 30, a. 12 ;  1987, c. 68, a. 10 ;  1989, c. 54, a. 151 ;  2006, c. 22, a. 80 . 123.1 .   Dans l’exercice de ses fonctions de surveillance, la Commission peut autoriser un membre de son personnel ou toute autre personne à agir comme inspecteur. \n 2006, c. 22, a. 81 . 123.2 .   La personne qui agit comme inspecteur peut: 1 °    pénétrer, à toute heure raisonnable, dans l’établissement d’un organisme ou d’une personne assujetti à la surveillance de la Commission; 2 °    exiger d’une personne présente tout renseignement ou tout document requis pour l’exercice de la fonction de surveillance de la Commission; 3 °    examiner et tirer copie de ces documents. \n 2006, c. 22, a. 81 . 123.3 .   Une personne qui agit comme inspecteur doit, sur demande, se nommer et exhiber un certificat attestant son autorisation. Elle ne peut être poursuivie en justice en raison d’un acte accompli de bonne foi dans l’exercice de sa fonction. \n 2006, c. 22, a. 81 . 124 .   La Commission peut prescrire des conditions applicables à un fichier de renseignements personnels auxquelles l’organisme public doit se conformer et notamment: 1 °    les types de renseignements qui peuvent être recueillis et les fins pour lesquelles ils peuvent être conservés; 2 °    l’usage qui peut être fait du fichier; 3 °    la nature des mesures de sécurité à prendre pour assurer la protection des renseignements personnels; 4 °    les catégories de personnes qui ont accès aux renseignements personnels dans l’exercice de leurs fonctions et, s’il y a lieu, les restrictions à l’accès ainsi que les conditions particulières d’accès; 5 °    les conditions particulières auxquelles la gestion du fichier peut être assujettie, le cas échéant. \n 1982, c. 30, a. 124 ;  1990, c. 57, a. 28 ;  2006, c. 22, a. 82 . 125 .   La Commission peut, sur demande écrite, accorder à une personne ou à un organisme l’autorisation de recevoir à des fins d’étude, de recherche ou de statistique, communication de renseignements personnels contenus dans un fichier de renseignements personnels, sans le consentement des personnes concernées, si elle est d’avis que: 1 °    l’usage projeté n’est pas frivole et que les fins recherchées ne peuvent être atteintes que si les renseignements sont communiqués sous une forme nominative; 2 °    les renseignements personnels seront utilisés d’une manière qui en assure le caractère confidentiel. Cette autorisation est accordée pour la période et aux conditions que fixe la Commission.  Elle peut être révoquée avant l’expiration de la période pour laquelle elle a été accordée, si la Commission a des raisons de croire que la personne ou l’organisme autorisés ne respecte pas le caractère confidentiel des renseignements qui lui ont été communiqués, ou ne respecte pas les autres conditions. \n 1982, c. 30, a. 125 ;  2006, c. 22, a. 110 . 126 .   (Abrogé). \n 1982, c. 30, a. 126 ;  1990, c. 57, a. 29 ;  2006, c. 22, a. 83 . 127 .   La Commission peut, de sa propre initiative ou sur la plainte d’une personne intéressée, faire enquête sur: 1 °    un fichier confidentiel pour déterminer si les renseignements personnels qui s’y trouvent ont été versés et utilisés conformément au décret; 2 °    le respect de la confidentialité des renseignements personnels contenus dans un dossier ayant trait à l’adoption d’une personne et détenu par un organisme public; 3 °    le respect de la confidentialité des renseignements personnels contenus dans le dossier que détient le curateur public sur une personne qu’il représente ou dont il administre les biens. L’enquête est secrète. Seul un membre de la Commission ou un membre de son personnel de direction désigné par écrit à cette fin par la Commission peut prendre connaissance des renseignements personnels versés au fichier ou des renseignements personnels contenus dans un dossier visé aux paragraphes 2° et 3° du premier alinéa. Toutefois, un membre du personnel de la Commission peut, si la Commission l’autorise par écrit, prendre connaissance des renseignements personnels contenus dans un dossier visé aux paragraphes 2° et 3° du premier alinéa. \n 1982, c. 30, a. 127 ;  1987, c. 68, a. 11 ;  1989, c. 54, a. 152 ;  2006, c. 22, a. 110 . 128 .   La Commission peut, au terme d’une enquête sur un fichier de renseignements personnels ou sur un fichier confidentiel et après avoir fourni à l’organisme public dont relève le fichier l’occasion de présenter des observations écrites: 1 °    ordonner de corriger ou de retrancher du fichier un renseignement personnel, ou de cesser d’utiliser le fichier contrairement à la présente loi, au décret ou aux prescriptions de la Commission, suivant le cas; 2 °    ordonner à l’organisme public de prendre les mesures qu’elle juge appropriées pour satisfaire aux conditions prévues par la présente loi ou par les prescriptions de la Commission; 3 °    ordonner la destruction d’un fichier de renseignements personnels établi ou utilisé contrairement à la présente loi; 4 °    recommander au gouvernement de modifier ou d’abroger le décret autorisant l’établissement d’un fichier confidentiel. \n 1982, c. 30, a. 128 ;  2006, c. 22, a. 110 . 128.1 .   La Commission peut au terme d’une enquête portant sur la matière visée au paragraphe 2° du premier alinéa de l’article 127 et après avoir fourni à l’organisme public qui détient le dossier visé à ce paragraphe l’occasion de présenter des observations écrites: 1 °    ordonner à un organisme public de prendre les mesures nécessaires pour assurer la confidentialité des renseignements personnels contenus dans un dossier ayant trait à l’adoption d’une personne; 2 °    indiquer les mesures nécessaires à prendre pour assurer le caractère confidentiel des renseignements personnels contenus dans un tel dossier; 3 °    indiquer les conditions particulières auxquelles la gestion d’un tel dossier peut être assujettie. La Commission exerce les mêmes pouvoirs à l’égard du curateur public au terme d’une enquête portant sur la matière visée au paragraphe 3° du premier alinéa de l’article 127. \n 1987, c. 68, a. 12 ;  1989, c. 54, a. 153 . 128.2 .   (Abrogé). \n 2005, c. 32, a. 229 ;  2012, c. 23, a. 171 . 129 .   La Commission, ses membres et toute personne qu’elle charge de faire enquête pour l’application de la présente section sont investis, à cette fin, des pouvoirs et de l’immunité des commissaires nommés en vertu de la Loi sur les commissions d’enquête ( chapitre C‐37 ), sauf du pouvoir d’ordonner l’emprisonnement. Les enquêtes de la Commission sont faites selon un mode non contradictoire. Au terme d’une enquête, la Commission peut, après avoir fourni à l’organisme public l’occasion de présenter ses observations écrites, lui ordonner de prendre les mesures qu’elle juge appropriées. \n 1982, c. 30, a. 129 ;  2006, c. 22, a. 84 . 130 .   Un organisme public doit, sur demande de la Commission, lui fournir toute information qu’elle requiert sur l’application de la présente loi. \n 1982, c. 30, a. 130 . 130.1 .   (Abrogé). \n 1993, c. 17, a. 105 ;  2006, c. 22, a. 85 . 130.2 .   Un membre de la Commission peut, au nom de celle-ci, exercer seul les fonctions et pouvoirs que le paragraphe 3° de l’article 123 à l’égard des projets d’entente de transfert de renseignements, les articles 124, 127 à 128.1, le troisième alinéa de l’article 129 et l’article 164 confèrent à la Commission ainsi que ceux visés au deuxième alinéa. Le président de la Commission peut déléguer, en tout ou en partie, à un membre de son personnel les fonctions et les pouvoirs qui sont dévolus à la Commission par les paragraphes 1°, 5° et 6° de l’article 123 et par les articles 123.1 et 125. \n 2006, c. 22, a. 86 . 131 .   (Abrogé). \n 1982, c. 30, a. 131 ;  1986, c. 22, a. 28 ;  2006, c. 22, a. 87 . 132 .   (Abrogé). \n 1982, c. 30, a. 132 ;  1990, c. 57, a. 30 ;  2006, c. 22, a. 88 . 133 .   Si, dans un délai raisonnable après avoir fait une recommandation à un organisme public ou après avoir rendu une ordonnance, la Commission juge que les mesures appropriées n’ont pas été prises pour y donner suite, elle peut en aviser le gouvernement ou, si elle le juge à propos, soumettre un rapport spécial à l’Assemblée nationale, ou exposer la situation dans son rapport annuel. \n 1982, c. 30, a. 133 ;  1982, c. 62, a. 143 . 134 .   La commission de l’Assemblée nationale désigne, dans les meilleurs délais, la commission qui fera l’étude du rapport spécial. La commission désignée doit faire l’étude de ce rapport dans les 60 jours de son dépôt à l’Assemblée nationale. \n 1982, c. 30, a. 134 ;  1982, c. 62, a. 143 ;  1984, c. 27, a. 6 . SECTION  III SECTION JURIDICTIONNELLE \n 2006, c. 22, a. 89 . 134.1 .   Les fonctions et pouvoirs de la Commission prévus à la présente section sont exercés par le président et les membres affectés à la section juridictionnelle. \n 2006, c. 22, a. 89 . 134.2 .   La Commission a pour fonction de décider, à l’exclusion de tout autre tribunal, des demandes de révision faites en vertu de la présente loi et des demandes d’examen de mésententes faites en vertu de la Loi sur la protection des renseignements personnels dans le secteur privé ( chapitre P‐39.1 ). \n 2006, c. 22, a. 89 . 135 .   Une personne dont la demande écrite a été refusée en tout ou en partie par le responsable de l’accès aux documents ou de la protection des renseignements personnels peut demander à la Commission de réviser cette décision. Une personne qui a fait une demande en vertu de la présente loi peut demander à la Commission de réviser toute décision du responsable sur le délai de traitement de la demande, sur le mode d’accès à un document ou à un renseignement, sur l’application de l’article 9 ou sur les frais exigibles. Ces demandes doivent être faites dans les trente jours qui suivent la date de la décision ou de l’expiration du délai accordé par la présente loi au responsable pour répondre à une demande.  La Commission peut toutefois, pour un motif raisonnable, relever le requérant du défaut de respecter ce délai. \n 1982, c. 30, a. 135 . 136 .   Un tiers ayant présenté des observations conformément à l’article 49 peut, dans les 15 jours qui suivent la date de la mise à la poste de l’avis l’informant de la décision de donner accès à tout ou partie du document, demander à la Commission de réviser cette décision. Sauf dans le cas visé dans le premier alinéa de l’article 41.1, cette demande suspend l’exécution de la décision du responsable jusqu’à ce que la décision de la Commission sur la demande soit exécutoire. \n 1982, c. 30, a. 136 ;  2006, c. 22, a. 90 . 137 .   La demande de révision doit être faite par écrit; elle peut exposer brièvement les raisons pour lesquelles la décision devrait être révisée. Avis en est donné à l’organisme public par la Commission. Lorsque la demande de révision porte sur le refus de communiquer un renseignement fourni par un tiers, la Commission doit en donner avis au tiers concerné. Lorsque la Commission, après avoir pris des moyens raisonnables pour aviser un tiers par courrier, ne peut y parvenir, elle peut l’aviser autrement, notamment par avis public dans un journal diffusé dans la localité de la dernière adresse connue du tiers. S’il y a plus d’un tiers et que plus d’un avis est requis, les tiers ne sont réputés avisés qu’une fois diffusés tous les avis. \n 1982, c. 30, a. 137 ;  2006, c. 22, a. 91 . 137.1 .   La Commission peut autoriser un organisme public à ne pas tenir compte de demandes manifestement abusives par leur nombre, leur caractère répétitif ou leur caractère systématique ou d’une demande dont le traitement serait susceptible de nuire sérieusement aux activités de l’organisme. Il en est de même lorsque, de l’avis de la Commission, ces demandes ne sont pas conformes à l’objet des dispositions de la présente loi sur la protection des renseignements personnels. \n 2006, c. 22, a. 92 . 137.2 .   La Commission peut refuser ou cesser d’examiner une affaire si elle a des motifs raisonnables de croire que la demande est frivole ou faite de mauvaise foi ou que son intervention n’est manifestement pas utile. \n 2006, c. 22, a. 92 . 137.3 .   La Commission doit, par règlement, édicter des règles de procédure et de preuve. Ce règlement doit prévoir des dispositions pour assurer l’accessibilité à la Commission ainsi que la qualité et la célérité de son processus décisionnel. À cette fin, il doit encadrer le temps consacré aux instances à partir du dépôt de la demande de révision jusqu’à la tenue de l’audience, le cas échéant. Ce règlement est soumis à l’approbation du gouvernement. \n 2006, c. 22, a. 92 . 138 .   Les membres du personnel de la Commission doivent prêter assistance pour la rédaction d’une demande de révision à toute personne intéressée qui le requiert. \n 1982, c. 30, a. 138 . 138.1 .   Lorsque la Commission est saisie d’une demande, elle peut, si elle le considère utile et si les circonstances d’une affaire le permettent, charger une personne qu’elle désigne de tenter d’amener les parties à s’entendre. \n 2006, c. 22, a. 93 . 139 .   Un membre de la Commission peut, au nom de celle-ci, exercer seul les pouvoirs prévus aux articles 135, 137.1, 137.2, 142.1 et 146.1. \n 1982, c. 30, a. 139 ;  2006, c. 22, a. 94 . 140 .   Lorsqu’elle est saisie d’une demande de révision, la Commission doit donner aux parties l’occasion de présenter leurs observations. \n 1982, c. 30, a. 140 . 141 .   La Commission a tous les pouvoirs nécessaires à l’exercice de sa compétence; elle peut rendre toute ordonnance qu’elle estime propre à sauvegarder les droits des parties et décider de toute question de fait ou de droit. Elle peut notamment ordonner à un organisme public de donner communication d’un document ou d’une partie de document, de s’abstenir de le faire, de rectifier, compléter, clarifier, mettre à jour ou effacer tout renseignement personnel ou de cesser un usage ou une communication de renseignements personnels. \n 1982, c. 30, a. 141 ;  1999, c. 40, a. 3 ;  2006, c. 22, a. 110 . 141.1 .   La Commission doit exercer ses fonctions et pouvoirs en matière de révision de façon diligente et efficace. La Commission doit rendre sa décision dans les trois mois de sa prise en délibéré, à moins que le président, pour des motifs sérieux, n’ait prolongé ce délai. Lorsqu’un membre de la Commission saisi d’une affaire ne rend pas sa décision dans le délai requis, le président peut, d’office ou sur demande d’une des parties, dessaisir ce membre de cette affaire. Avant de prolonger le délai ou de dessaisir le membre qui n’a pas rendu sa décision dans les délais requis, le président doit tenir compte des circonstances et de l’intérêt des parties. \n 2006, c. 22, a. 95 . 142 .   La Commission peut, en décidant d’une demande de révision, fixer les conditions qu’elle juge appropriées pour faciliter l’exercice d’un droit conféré par la présente loi. \n 1982, c. 30, a. 142 . 142.1 .   La décision entachée d’erreur d’écriture ou de calcul ou de quelque autre erreur matérielle peut être rectifiée par la Commission ou le membre qui l’a rendue; il en est de même de celle qui, par suite d’une inadvertance manifeste, accorde plus qu’il n’est demandé ou omet de prononcer sur une partie de la demande. La rectification peut être faite d’office tant que l’exécution n’est pas commencée; elle peut l’être sur requête d’une partie en tout temps, sauf si la décision est interjetée en appel. La requête est adressée à la Commission et soumise au membre qui a rendu la décision. Si ce dernier n’est plus en fonction, est absent ou est empêché d’agir, la requête est soumise à la Commission. Le délai d’appel ou d’exécution de la décision rectifiée ne court que depuis la date de la rectification lorsque celle-ci porte sur le dispositif. \n 2006, c. 22, a. 96 . 143 .   Une copie de la décision de la Commission est transmise aux parties par tout moyen permettant la preuve de la date de sa réception. \n 1982, c. 30, a. 143 ;  2006, c. 22, a. 97 . 144 .   Une décision de la Commission ayant pour effet d’ordonner à un organisme public de faire quelque chose est exécutoire à l’expiration des 30 jours qui suivent la date de sa réception par les parties. Une décision ordonnant à un organisme public de s’abstenir de faire quelque chose est exécutoire dès qu’elle est transmise à l’organisme public. Dès le moment où une décision devient exécutoire, copie conforme peut en être déposée par la Commission ou une partie au bureau du greffier de la Cour supérieure du district de Montréal ou de Québec ou du district où est situé le siège, l’établissement d’entreprise ou la résidence d’une partie. Le dépôt d’une décision lui confère alors la même force et le même effet que s’il s’agissait d’un jugement émanant de la Cour supérieure. \n 1982, c. 30, a. 144 ;  1985, c. 30, a. 13 ;  1990, c. 57, a. 31 ;  1999, c. 40, a. 3 . 145 .   Le gouvernement peut, lorsqu’il le juge nécessaire dans l’intérêt public, ordonner par décret à un organisme public de surseoir, pour la période qu’il indique, à l’exécution d’une décision de la Commission ayant pour effet d’ordonner de communiquer un document ou un renseignement. Pendant cette période, toute demande d’accès au document ou au renseignement visé par le décret est irrecevable. Une procédure en appel de la décision de la Commission ne peut être introduite ni continuée pendant cette période. En outre, le délai pour interjeter appel de la décision de la Commission est interrompu pour cette période à compter de la prise du décret. Le décret est déposé à l’Assemblée nationale dans les quinze jours qui suivent la prise du décret si l’Assemblée est en session ou, si elle ne siège pas, dans les quinze jours de l’ouverture de la session suivante ou de la reprise de ses travaux. \n 1982, c. 30, a. 145 ;  1982, c. 62, a. 143 . 146 .   Une décision de la Commission sur une question de fait de sa compétence est finale et sans appel. \n 1982, c. 30, a. 146 . 146.1 .   La Commission peut déclarer périmée une demande de révision s’il s’est écoulé une année depuis la production du dernier acte de procédure utile. \n 1993, c. 17, a. 106 ;  2002, c. 7, a. 161 . CHAPITRE  V APPEL \n 2006, c. 22, a. 98 . 147 .   Une personne directement intéressée peut interjeter appel sur toute question de droit ou de compétence, devant un juge de la Cour du Québec, de la décision finale de la Commission, y compris une ordonnance de la Commission rendue au terme d’une enquête, ou, sur permission d’un juge de cette Cour, d’une décision interlocutoire à laquelle la décision finale ne pourra remédier. \n 1982, c. 30, a. 147 ;  1988, c. 21, a. 66 ;  1990, c. 57, a. 32 ;  2006, c. 22, a. 99 . 147.1 .   La demande pour permission d’appeler d’une décision interlocutoire doit préciser les questions de droit ou de compétence qui devraient être examinées en appel et pourquoi la décision finale ne pourra y remédier et, après avis aux parties et à la Commission, être déposée au greffe de la Cour du Québec dans les 10 jours qui suivent la date de la réception de la décision de la Commission par les parties. Si la demande est accordée, le jugement qui autorise l’appel tient lieu de déclaration d’appel. \n 2006, c. 22, a. 99 ;  N.I. 2016-01-01 (NCPC) . 148 .   La compétence que confère la présente section à un juge de la Cour du Québec est exercée par les seuls juges de cette cour que désigne le juge en chef. \n 1982, c. 30, a. 148 ;  1988, c. 21, a. 66 ;  1990, c. 57, a. 33 ;  1993, c. 17, a. 107 . 149 .   L’appel est formé par le dépôt auprès de la Cour du Québec d’une déclaration à cet effet précisant les questions de droit ou de compétence qui devraient être examinées en appel. La déclaration d’appel doit être déposée au greffe de la Cour du Québec dans les 30 jours qui suivent la date de la réception de la décision finale par les parties. \n 1982, c. 30, a. 149 ;  1985, c. 30, a. 14 ;  1988, c. 21, a. 66 ;  1990, c. 57, a. 34 ;  2006, c. 22, a. 100 ;  N.I. 2016-01-01 (NCPC) . 149.1 .   (Remplacé). \n 1990, c. 57, a. 35 ;  2006, c. 22, a. 100 . 150 .   Le dépôt de la déclaration d’appel ou de la demande pour permission d’en appeler d’une décision interlocutoire suspend l’exécution de la décision de la Commission jusqu’à ce que la décision de la Cour soit rendue. S’il s’agit de l’appel d’une décision ordonnant à un organisme public de cesser ou de s’abstenir de faire quelque chose, le dépôt de la déclaration ou de la demande ne suspend pas l’exécution de la décision. \n 1982, c. 30, a. 150 ;  2006, c. 22, a. 100 ;  N.I. 2016-01-01 (NCPC) . 151 .   La déclaration d’appel doit être signifiée aux parties et à la Commission dans les 10 jours de son dépôt au greffe de la Cour du Québec. Le secrétaire de la Commission transmet au greffe, pour tenir lieu de dossier conjoint, un exemplaire de la décision contestée et les pièces de la contestation. \n 1982, c. 30, a. 151 ;  1988, c. 21, a. 66 ;  1990, c. 57, a. 36 ;  1993, c. 17, a. 108 ;  2006, c. 22, a. 100 ;  N.I. 2016-01-01 (NCPC) . 152 .   L’appel est régi par les articles 351 à 390 du Code de procédure civile ( chapitre C‐25.01 ), compte tenu des adaptations nécessaires.  Toutefois, les parties ne sont pas tenues de déposer de mémoire de leurs prétentions. \n 1982, c. 30, a. 152 ;  1990, c. 57, a. 37 ;  N.I. 2016-01-01 (NCPC) . 153 .   La Cour du Québec peut, en la manière prévue par la Loi sur les tribunaux judiciaires ( chapitre T‐16 ), adopter les règlements jugés nécessaires à l’application de la présente section. \n 1982, c. 30, a. 153 ;  1988, c. 21, a. 66, a. 67 ;  N.I. 2016-01-01 (NCPC) . 154 .   La décision du juge de la Cour du Québec est sans appel. \n 1982, c. 30, a. 154 ;  1988, c. 21, a. 66 ;  1990, c. 57, a. 38 . CHAPITRE  VI RÉGLEMENTATION 155 .   Le gouvernement peut adopter des règlements pour: 1 °    prescrire les frais exigibles pour la transcription, la reproduction ou la transmission de documents ou de renseignements personnels, ainsi que les modalités de paiement de ces frais, en tenant compte de la politique établie en vertu de l’article 26.5 de la Loi assurant l’exercice des droits des personnes handicapées en vue de leur intégration scolaire, professionnelle et sociale ( chapitre E‐20.1 ); 2 °    prévoir des cas d’exemption totale ou partielle du paiement des frais exigés en vertu de la présente loi; 3 °    définir ce qu’est un document produit par un autre organisme public ou pour son compte, aux fins de l’article 48; 3.1 °    aux fins des articles 16.1 et 63.2, prévoir des règles de diffusion de l’information et de protection des renseignements personnels, comportant, notamment, des mesures destinées à favoriser l’accès à l’information et la protection des renseignements personnels; ces règles peuvent identifier les types de documents ou de renseignements accessibles en vertu de la loi qu’un organisme public doit diffuser compte tenu, notamment, de l’intérêt qu’ils présentent pour l’information du public; ces règles peuvent prévoir la formation d’un comité chargé de soutenir l’organisme public dans l’exercice de ses responsabilités et confier des fonctions à d’autres personnes que le responsable de l’accès aux documents ou de la protection des renseignements personnels; ces règles peuvent varier selon qu’elles sont applicables à un organisme visé à l’un ou l’autre des articles 3 à 7; 4 °    (paragraphe abrogé) ; 5 °    (paragraphe abrogé) ; 6 °    (paragraphe abrogé) ; 7 °    désigner suivant les normes qu’il y prévoit et aux fins de l’application du deuxième alinéa de l’article 28, les organismes publics qui doivent refuser de confirmer l’existence ou de donner communication d’un renseignement obtenu par leur service de sécurité interne; 8 °    fixer des frais exigibles pour tout acte accompli par la Commission. Dans l’exercice de son pouvoir de réglementation, le gouvernement peut établir des catégories de personnes, d’organismes publics, de renseignements, de documents et de fichiers. \n 1982, c. 30, a. 155 ;  1990, c. 57, a. 39 ;  2006, c. 22, a. 101 . 156 .   Après avoir pris l’avis de la Commission, le ministre désigné publie à la  Gazette officielle du Québec  le texte d’un projet de règlement avec avis qu’à l’expiration d’au moins quarante-cinq jours suivant cette publication il sera soumis au gouvernement pour adoption. \n 1982, c. 30, a. 156 . 157 .   (Abrogé). \n 1982, c. 30, a. 157 ;  1986, c. 22, a. 29 ;  2006, c. 22, a. 102 . CHAPITRE  VII SANCTIONS SECTION  I DISPOSITIONS PÉNALES 158 .   Quiconque refuse ou entrave sciemment l’accès à un document ou à un renseignement auquel l’accès ne peut être refusé en vertu de la loi commet une infraction et est passible d’une amende de 100 $ à 500 $ et, en cas de récidive, d’une amende de 250 $ à 1 000 $. \n 1982, c. 30, a. 158 ;  1990, c. 4, a. 22 . 159 .   Quiconque, sciemment, donne accès à un document ou à un renseignement dont la présente loi ne permet pas la communication ou auquel un organisme public, conformément à la loi, refuse de donner accès, commet une infraction et est passible d’une amende de 200 $ à 1 000 $ et, en cas de récidive, d’une amende de 500 $ à 2 500 $. \n 1982, c. 30, a. 159 ;  1990, c. 4, a. 23 . 159.1 .   Quiconque, sciemment, 1 °    donne accès à un document auquel une personne n’a pas droit d’accès en vertu d’une disposition d’une loi qui s’applique malgré une disposition de la présente loi, 2 °    informe une personne de l’existence d’un renseignement dont elle n’a pas le droit d’être informée en vertu d’une disposition d’une loi qui s’applique malgré une disposition de la présente loi, 3 °    communique un renseignement dont une personne ne peut recevoir communication en vertu d’une disposition d’une loi qui s’applique malgré une disposition de la présente loi, commet une infraction et est passible d’une amende de 200 $ à 1 000 $ et, en cas de récidive, d’une amende de 500 $ à 2 500 $. \n 1987, c. 68, a. 13 ;  1990, c. 4, a. 24 . 159.2 .   Quiconque, sciemment, contrevient à l’article 67.2 ou au deuxième alinéa de l’article 70.1 est passible d’une amende de 5 000 $ à 50 000 $ et, en cas de récidive, d’une amende de 10 000 $ à 100 000 $. \n 2006, c. 22, a. 103 . 160 .   Quiconque entrave le déroulement d’une enquête ou d’une inspection ou l’instruction d’une demande par la Commission en lui communiquant sciemment des renseignements faux ou inexacts ou autrement, commet une infraction et est passible de l’amende prévue par l’article 159. \n 1982, c. 30, a. 160 ;  1990, c. 4, a. 25 ;  2006, c. 22, a. 104 . 161 .   Quiconque entrave le déroulement d’une enquête ou l’instruction d’une demande par la Commission en omettant sciemment de lui communiquer les renseignements qu’elle requiert, commet une infraction et est passible d’une amende de 50 $ par jour ou partie de jour que dure l’infraction. \n 1982, c. 30, a. 161 ;  1990, c. 4, a. 25 . 162 .   Quiconque contrevient à la présente loi, aux règlements du gouvernement ou à une ordonnance de la Commission commet une infraction et est passible de l’amende prévue par l’article 158. \n 1982, c. 30, a. 162 . 163 .   Une erreur ou une omission faite de bonne foi ne constitue pas une infraction au sens de la présente loi. \n 1982, c. 30, a. 163 . 164 .   La Commission peut, conformément à l’article 10 du Code de procédure pénale ( chapitre C‐25.1 ), intenter une poursuite pénale pour une infraction prévue dans la présente section. \n 1982, c. 30, a. 164 ;  1990, c. 4, a. 26 ;  1992, c. 61, a. 28 . 165 .   (Abrogé). \n 1982, c. 30, a. 165 ;  1990, c. 4, a. 27 . SECTION  II DISPOSITIONS PARTICULIÈRES À CERTAINS RECOURS 166 .   Une personne physique peut, si elle souffre préjudice de la décision d’un organisme public qui la concerne et si aucun autre recours ne lui est ouvert, demander à la Cour supérieure de prononcer la nullité de cette décision si celle-ci est fondée sur un renseignement personnel inexact ou recueilli, utilisé, conservé ou communiqué contrairement à la présente loi. Le tribunal prononce la nullité de la décision s’il est établi que l’inexactitude du renseignement ou l’incompatibilité avec la présente loi ne résulte pas du fait intentionnel de la personne concernée. L’organisme public peut toutefois faire rejeter la demande s’il établit que sa décision eût été maintenue même si une rectification du renseignement avait été faite en temps utile. \n 1982, c. 30, a. 166 ;  2006, c. 22, a. 105 . 167 .   À moins que le préjudice ne résulte d’une force majeure, l’organisme public qui conserve un renseignement personnel est tenu de la réparation du préjudice résultant d’une atteinte illicite à un droit reconnu par le chapitre III. En outre, lorsque l’atteinte est intentionnelle ou résulte d’une faute lourde, le tribunal accorde des dommages-intérêts punitifs d’au moins 200 $. \n 1982, c. 30, a. 167 ;  1999, c. 40, a. 3 . CHAPITRE  VIII DISPOSITIONS GÉNÉRALES 168 .   Les dispositions de la présente loi prévalent sur celles d’une loi générale ou spéciale postérieure qui leur seraient contraires, à moins que cette dernière loi n’énonce expressément s’appliquer malgré la présente loi. \n 1982, c. 30, a. 168 . 169 .   Sous réserve de l’article 170, toute disposition d’une loi générale ou spéciale qui est inconciliable avec celles du chapitre II relatives à l’accès aux documents des organismes publics ou celles du chapitre III relatives à la protection des renseignements personnels cesse d’avoir effet le 31 décembre 1987. Il en est de même de toute disposition d’un règlement qui est inconciliable avec celles de la présente loi ou d’un règlement du gouvernement adopté en vertu de la présente loi. \n 1982, c. 30, a. 169 ;  1986, c. 56, a. 1 ;  1987, c. 33, a. 1 . 170 .   Les dispositions législatives mentionnées à l’annexe A continuent d’avoir effet. \n 1982, c. 30, a. 170 . 171 .   Malgré les articles 168 et 169, la présente loi n’a pas pour effet de restreindre: 1 °    l’exercice du droit d’accès d’une personne à un document résultant de l’application d’une autre loi ou d’une pratique établie avant le 1 er  octobre 1982, à moins que l’exercice de ce droit ne porte atteinte à la protection des renseignements personnels; 2 °    la protection des renseignements personnels ni l’exercice du droit d’accès d’une personne à un renseignement personnel la concernant, résultant de l’application d’une autre loi ou d’une pratique établie avant le 1 er  octobre 1982; 2.1 °    la protection d’un renseignement contenu dans un dossier fiscal prévue à la section VIII du chapitre III de la Loi sur l’administration fiscale ( chapitre A-6.002 ) à l’égard d’une personne visée par cette section; 3 °    la communication de documents ou de renseignements exigés par le Protecteur du citoyen ou par assignation, citation à comparaître, mandat ou ordonnance d’une personne ou d’un organisme ayant le pouvoir de contraindre à leur communication. \n 1982, c. 30, a. 171 ;  1985, c. 30, a. 15 ;  2002, c. 5, a. 30 ;  2006, c. 22, a. 110 ;  2010, c. 31, a. 175 ;  N.I. 2016-01-01 (NCPC) . 172 .   Les obligations qu’impose la présente loi à un organisme public peuvent être assumées par un autre organisme public dans le cadre d’une entente approuvée par la Commission. \n 1982, c. 30, a. 172 . 173 .   Le Protecteur du citoyen et la Commission des droits de la personne et des droits de la jeunesse doivent, sur réception d’une plainte relative à une matière qui relève de la compétence de la Commission, transmettre le dossier à cette dernière qui en est alors saisie de plein droit. \n 1982, c. 30, a. 173 ;  1995, c. 27, a. 16 . 174 .   Le ministre désigné par le gouvernement est responsable de l’application de la présente loi. Le ministre conseille le gouvernement en lui fournissant des avis en matière d’accès à l’information et de protection des renseignements personnels, notamment, sur des projets de législation ou de développement de systèmes d’information. À cette fin, le ministre peut consulter la Commission. Le ministre offre le soutien nécessaire aux organismes publics pour l’application de la présente loi. Aux fins de l’exercice de ses fonctions, le ministre peut notamment: 1 °    conclure des ententes avec toute personne, association, société ou tout organisme; 2 °    réaliser ou faire réaliser des recherches, des inventaires, des études ou des analyses et les rendre publics; 3 °    obtenir des ministères et organismes publics les renseignements nécessaires à l’exercice de ses fonctions. \n 1982, c. 30, a. 174 ;  1993, c. 17, a. 109 ;  1994, c. 14, a. 10 ;  1996, c. 21, a. 30 ;  2005, c. 24, a. 19 ;  2006, c. 22, a. 106 . La ministre responsable de l’Accès à l’information et de la Réforme des institutions démocratiques est responsable de l’application de la présente loi. Décret 40-2016 du 28 janvier 2016, (2016) 148 G.O. 2, 1260. CHAPITRE  IX DISPOSITIONS TRANSITOIRES ET FINALES 175 .   (Modification intégrée au c. E-18, Section II.1, aa. 11.1-11.4). \n 1982, c. 30, a. 175 . 176 .   Un organisme public peut, dans les deux ans à compter de l’entrée en vigueur des dispositions de la présente loi qui confèrent à une personne le droit d’accès à un document, refuser de donner accès à ce document s’il est daté de plus de deux ans lors de cette entrée en vigueur. \n 1982, c. 30, a. 176 . 177 .   Malgré la section III du chapitre III, un organisme public qui détient des renseignements personnels, au moment où cette section prend effet à son égard, a un délai de 12 mois pour établir conformément à la présente loi un fichier de renseignements personnels ou un fichier confidentiel. \n 1982, c. 30, a. 177 ;  2006, c. 22, a. 110 . 178 .   La Commission doit, avant le 1 er  octobre 1985, étudier les dispositions des lois et des règlements visés dans l’article 169 et, après avoir entendu les représentations des personnes intéressées, faire au gouvernement des recommandations sur l’opportunité d’en maintenir l’application ou de les modifier. \n 1982, c. 30, a. 178 . 179 .   La Commission doit, au plus tard le 14 juin 2011, et par la suite tous les cinq ans, faire au gouvernement un rapport sur l’application de la présente loi et de la section V.1 du chapitre IV du Code des professions ( chapitre C‐26 ) ainsi que sur les sujets que le ministre peut lui soumettre. Ce rapport comprend également, le cas échéant, les constatations de vérification et les recommandations que le vérificateur général juge approprié de transmettre à la Commission en application de la Loi sur le vérificateur général ( chapitre V‐5.01 ) et qu’il indique comme devant être reproduites dans ce rapport. Le ministre dépose ce rapport à l’Assemblée nationale dans les 15 jours de sa réception ou, si elle ne siège pas, dans les 15 jours de la reprise de ses travaux. \n 1982, c. 30, a. 179 ;  1982, c. 62, a. 143 ;  1984, c. 27, a. 7 ;  2006, c. 22, a. 107 . 179.1 .   La commission de l’Assemblée nationale désigne, dans les meilleurs délais, la commission qui fera l’étude du rapport sur la mise en oeuvre de la loi. Dans l’année qui suit le dépôt du rapport à l’Assemblée nationale, la commission désignée doit étudier l’opportunité de modifier la présente loi et entendre à ce sujet les représentations des personnes et des organismes intéressés. \n 1984, c. 27, a. 8 ;  2006, c. 22, a. 108 . 180 .   Les sommes requises pour l’application de la présente loi sont prises, pour l’exercice financier 1982-1983, sur le fonds consolidé du revenu et pour les années subséquentes, sur les sommes accordées annuellement à cette fin par le Parlement. \n 1982, c. 30, a. 180 . 181 .   Le gouvernement doit établir dans les douze mois suivant le 1 er  octobre 1982 un calendrier de l’entrée en vigueur et de la prise d’effet des dispositions de la présente loi. Ce calendrier est déposé dans les quinze jours de son adoption devant l’Assemblée nationale si elle siège ou, si elle ne siège pas, auprès de son président. \n 1982, c. 30, a. 181 ;  1982, c. 62, a. 143 . 182 .   (Cet article a cessé d’avoir effet le 1 er  octobre 1987). \n 1982, c. 30, a. 182 ;  R.-U., 1982, c. 11, ann. B, ptie I, a. 33 . 183 .   (Omis). \n 1982, c. 30, a. 183 . ANNEXE A (article 170) \n DISPOSITIONS LÉGISLATIVES QUI CONTINUENT D’AVOIR EFFET MALGRÉ L’ARTICLE 169 TITRE                            DISPOSITIONS Loi sur la consultation          Articles 16 à 18 et 61 à 155 populaire                        de l’appendice 2 (chapitre C‐64.1) Loi sur l’instruction            Articles 624 à 626 publique pour les autochtones cris, inuit et naskapis (chapitre I‐14) Loi sur les villages nordiques   Articles 67 à 75 et l’Administration régionale Kativik (chapitre V‐6.1)     \n 1982, c. 30, annexe A; 1984, c. 51, a. 525 ;  1985, c. 46, a. 89 ;  1987, c. 57, a. 660 ;  1989, c. 1, a. 581 ;  1988, c. 84, a. 699 ;  1989, c. 36, a. 225 ;  1998, c. 44, a. 44 ;  2002, c. 5, a. 31 . ANNEXE B ( article 106 ) SERMENT D’ALLÉGEANCE, D’HONNÊTETÉ PROFESSIONNELLE ET DE DISCRÉTION Je, A. B., déclare sous serment que je serai loyal et porterai vraie allégeance à l’autorité constituée, que j’exercerai honnêtement, objectivement et impartialement mes fonctions et qu’hormis mon traitement et ce qui me sera alloué en vertu de la loi ou d’un décret du gouvernement, je ne recevrai aucune somme d’argent ou avantage quelconque dans l’exercice de mes fonctions. De plus, je déclare sous serment que je ne révélerai et ne ferai connaître, sans y être dûment autorisé, aucun renseignement confidentiel dont j’aurai eu connaissance dans l’exercice de mes fonctions. \n 1982, c. 30, annexe B ;  1999, c. 40, a. 3 ;  2006, c. 22, a. 109 . ANNEXES ABROGATIVES Conformément à l’article 17 de la Loi sur la refonte des lois et des règlements (chapitre R-3), le chapitre 30 des lois de 1982, tel qu’en vigueur le 1 er  janvier 1983, à l’exception de l’article 183, est abrogé à compter de l’entrée en vigueur du chapitre A-2.1 des Lois refondues. Conformément à l’article 17 de la Loi sur la refonte des lois et des règlements (chapitre R-3), les articles 155 à 157, 168, 169 et 178 du chapitre 30 des lois de 1982, tels qu’en vigueur le 1 er  janvier 1984, sont abrogés à compter de l’entrée en vigueur de la mise à jour au 1 er  janvier 1984 du chapitre A-2.1 des Lois refondues. Conformément à l’article 17 de la Loi sur la refonte des lois et des règlements (chapitre R-3), les articles 9 à 15, 17 à 68, 71 à 102, 122 à 130, 132 à 154, 158 à 167, 170 à 173 et 175 à 177 ainsi que l’annexe A du chapitre 30 des lois de 1982, tels qu’en vigueur le 1 er  juillet 1984, sont abrogés à compter de l’entrée en vigueur de la mise à jour au 1 er  juillet 1984 du chapitre A-2.1 des Lois refondues. Conformément à l’article 17 de la Loi sur la refonte des lois et des règlements (chapitre R-3), les articles 69 et 70 du chapitre 30 des lois de 1982, tels qu’en vigueur le 1 er  septembre 1985, sont abrogés à compter de l’entrée en vigueur de la mise à jour au 1 er  septembre 1985 du chapitre A-2.1 des Lois refondues. Conformément à l’article 17 de la Loi sur la refonte des lois et des règlements (chapitre R-3), l’article 16 du chapitre 30 des lois de 1982, tel qu’en vigueur le 1 er  mars 1986, est abrogé à compter de l’entrée en vigueur de la mise à jour au 1 er  mars 1986 du chapitre A-2.1 des Lois refondues. \n Copier \n Sélectionner cet élément \n Sélectionner l'élément parent \n Désélectionner tous les éléments \n Copier vers Arbortext \n Copier vers LAW \n × \n Copier vers le presse-papier \n Pour copier : Ctrl+C \n OK \n Nous joindre \n Plan du site \n Portail Québec \n Accessibilité \n Politique de confidentialité \n © Gouvernement du Québec \n × \n Sélections \n Afficher \n Les sélections du document courant \n Toutes les sélections de la collection \n Fragments sélectionnés \n Supprimer toutes les sélections \n Afficher les sélections \n Fermer \n × \n Cyberlex \n\t\t\t\t\t\tVersion 1.0.19.0"}