{"url": "https://en.wikipedia.org/wiki/Design_for_All_(in_ICT)", "content": "Design for All (in ICT) - Wikipedia \n Design for All (in ICT)   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article  may be  confusing or unclear  to readers .  Please help us  clarify the article . There might be a discussion about this on  the talk page .   (September 2010)   ( Learn how and when to remove this template message ) \n Design for All  in the context of  information and communications technology  (ICT) is the conscious and systematic effort to proactively apply principles, methods and tools to promote  universal design  in  computer -related technologies, including  Internet -based technologies, thus avoiding the need for  a posteriori  adaptations, or specialised design (Stephanidis et al., 2001). [1] \n Design for All is design for  human diversity ,  social inclusion  and equality. [2]  It should not be conceived of as an effort to advance a single solution for everybody, but as a user-centred approach to providing products that can automatically address the possible range of human abilities, skills, requirements, and preferences. Consequently, the outcome of the design process is not intended to be a singular design, but a design space populated with appropriate alternatives, together with the rationale underlying each alternative, that is, the specific user and usage context characteristics for which each alternative has been designed. \n Traditionally,  accessibility  problems have been solved with adaptations and the use of  assistive technology  products has been a technical approach to obtain adaptations. Universal Access implies the accessibility and  usability  of information and telecommunications technologies by anyone at any place and at any time and their inclusion in any living context. It aims to enable equitable access and active participation of potentially all people in existing and emerging computer-mediated human activities, by developing universally accessible and usable products and services and suitable support functionalities in the environment. These products and services must be capable of accommodating individual user requirements in different contexts of use, independent of location, target machine, or runtime environment. Therefore, the approach aiming to grant the use of equipment or services is generalized, seeking to give access to the Information Society as such. Citizens are supposed to live in environments populated with  intelligent objects , where the tasks to be performed and the way of performing them are completely redefined, involving a combination of activities of access to information, interpersonal communication, and environmental control. Citizens must be given the possibility of carrying them out easily and pleasantly. \n For a thorough discussion of the challenges and benefits of Design for All in the context of ICT, see also the EDeAN White Paper (2005) [3]  and the \"Report on the impact of technological developments on eAccessibility\" [4]  of the DfA@eInclusion project. [5] \n Contents \n 1   Benefits and challenges \n 2   Legislative and regulative background \n 2.1   Equality and non-discrimination \n 2.2   Telecommunications and information society \n 2.3   Public procurement \n 2.4   Copyright \n 2.5   Protection of privacy \n 3   Relevant guidelines and standards \n 3.1   Standardisation: general overview \n 3.2   Recent developments in DfA related standardisation (formal standards) \n 3.3   DfA in ICT related standards \n 4   Application domains \n 5   Education and training \n 6   Examples of good practice \n 7   Related networks and projects \n 7.1   European Design for all eAccessibility Network \n 7.2   Design for All Europe \n 7.3   Examples of EU-funded research projects addressing ICT and inclusion \n 8   See also \n 9   References \n 10   External links \n Benefits and challenges [ edit ] \n The  European Commission  Communication on e-Accessibility, [6]  identified a core of practical challenges, as well as market, legal and policy issues towards improving eAccessibility and  e-Inclusion  in Europe, and elaborated a three-fold approach based on: \n accessibility requirements in  public procurement \n accessibility  certification  and \n better use of existing legislation. \n In that respect, the challenges that need to be addressed include: \n the introduction of specific legislative measures to complement and enhance existing legislation, \n addressing and motivating the industry, \n effective  benchmarking , \n providing harmonised  standardisation , \n the creation of a curriculum for DfA and, \n addressing future research activities. \n Legislative and regulative background [ edit ] \n The present policy context of accessibility in the  Information Society  in Europe is the i2010 initiative. [7]  The \"i2010 – A European Information Society for growth and employment\" initiative was launched by the European Commission as a framework for addressing the main challenges and developments in the information society and media sectors up to 2010. It promotes an open and competitive digital economy and emphasises ICT as a driver of inclusion and quality of life. The initiative contains a range of EU policy instruments to encourage the development of the digital economy, such as regulatory instruments, research and partnerships with stakeholders. \n Equality and non-discrimination [ edit ] \n The goal of the  European Union  Disability Strategy is a society that is open and accessible to all. The barriers need to be identified and removed. The European Union Disability Strategy has three main focuses: co-operation between the Commission and the  Member States , full participation of people with disabilities, and mainstreaming disability in policy formulation. Non-discrimination is also one of the general principles of the \"Convention on the Rights of Persons with Disabilities\", [8]  adopted by the  United Nations  General Assembly on 13 December 2006 and was opened for signatures on 30 March 2007. \n Telecommunications and information society [ edit ] \n There is a long tradition of European legislation with regard to telecommunications. In 2002, the European Union adopted a new regulatory framework for electronic communications networks and services, covering all forms of fixed and wireless telecoms,  data transmission  and broadcasting. From a Design for All perspective, the most important  Directives  are the Directive on a common regulatory framework [9]  and the Directive on universal service and users' rights relating to electronic communications networks and services [10]  ( Universal Service Directive ). \n Public procurement [ edit ] \n Public procurement  is an important economic force, and therefore it is an important tool to promote accessibility. The legislative package of public procurement Directives, approved in 2004 by the  European Parliament  and the EU's Council of Ministers, will help simplify and modernize procurement procedures. \n The new directives make it possible to take accessibility needs into account at several stages of a procurement process. It is obvious that it is most convenient to refer to standards when making technical specifications. There are already many  CEN ,  ETSI  and  ITU  standards which can be used for this purpose and many sources which can be useful in practice. Likewise, guidelines like the  WAI  guidelines, for example, or national guidelines have been used. In the future it will be easier to find suitable standards. Mandate M/376 [11]  has been given by the European Commission to the European Standardisation Organisations  CEN ,  CENELEC  and  ETSI , to come up with a solution for common requirements and conformance assessment. \n Copyright [ edit ] \n Not all products are accessible for persons with disabilities. When producing audio books, or certain other accessible works, an additional copy is created, and  copyright  can be a problem in this situation. On the other hand, copyright is an essential part of the sustainability of a creative society. This conflict of interests must be solved somehow in order to ensure the Information Society is a Society for All. There is international and European legislation in this field. The objectives of the Directive on the harmonisation of certain aspects of copyright and related rights in the information society [12]  are to adapt legislation on copyright and related rights to reflect technological developments and to transpose into Community law the main international obligations arising from the two treaties on copyright and related rights adopted within the framework of the World Intellectual Property Organisation (WIPO) [13]  in December 1996. \n Protection of privacy [ edit ] \n The relationship between design and  privacy  is not necessarily obvious. Modern technology, which is a result of design, is able to collect significant amounts of personal information. The user has an interest in that information being correct and in it being used appropriately. The person may want to keep something confidential and have access to the information that has been collected. In other words, privacy is desired. In 1995 the European Union adopted a Directive on the processing of personal data. [14] \n This directive established the basic principles for the collection, storage and use of personal data which should be respected by governments, businesses and any other organizations or individuals engaged in handling personal data. Within the context of Design for All (in ICT), privacy protection is called  Privacy by Design . \n Relevant guidelines and standards [ edit ] \n In the US, Australia, Japan and in the  European Union  more and more legislative actions are put in place to require public bodies and companies to make sure that their products and services are accessible and usable not only by “standard” users but also by others such as elderly persons or people with an impairment. As it would be unwise to write down technical – and therefore time-bound – requirements into a law, legislative texts preferably refer to (international) standards. \n Standardisation: general overview [ edit ] \n Standardisation , i.e., in very general terms, producing a \"standard\" (French:  norme, standard ; German:  Norm ; Spanish:  norma ) is a voluntary action set up in the past, almost uniquely, by commercial partners who believe that the standardisation will permit easier exchanges of products and goods. This implied very often that the acceptance of the standards is also voluntary and triggered by expected commercial benefits. Only to a very limited extent consumer representatives did participate in standardisation. On the other hand, laws in many countries are referring more and more to the required acceptance of several standards (e.g. on safety or on ecological aspects). The net result of this need for standards is that nowadays many standardisation initiatives are stimulated (= subsidised) by public bodies or, in Europe, directly and indirectly by the European Commission. Also many guidelines have been created by stakeholder groups. \n Recent developments in DfA related standardisation (formal standards) [ edit ] \n As DfA standardisation was explicitly mentioned in the eEurope2002 [15]  and i2010 [16]  Action Plans of the European Union, several new actions were established since then. Four major recent strategies can be distinguished: \n the set up of coordinating working groups and organisations; \n the democratisation of the standardisation processes themselves; \n the increasing impact of non-formal standardisation bodies and; \n the establishment of standardisation related discussion fora open for non-specialists. \n DfA in ICT related standards [ edit ] \n ETSI EG 202 116 V1.2.2 (2009-03) \n ETSI Guide  Human Factors (HF);  Guidelines for ICT products and services; \"Design for All\" . [17] \n Web Content Accessibility Guidelines 2.0 \n The  Web Content Accessibility Guidelines  (WCAG) 2.0 [18]  is a technical standard that covers a wide range of recommendations for making Web content more accessible. Following these guidelines will make content accessible to a wider range of people with disabilities, including blindness and low vision, deafness and hearing loss, learning disabilities, cognitive limitations, limited movement, speech disabilities, photosensitivity and combinations of these. Following these guidelines will also often make your Web content more usable to users in general. \n BS 8878:2010 Web accessibility - Code of Practice \n BS 8878:2010 Web accessibility - Code of Practice [19]  provides guidance on how to embed accessibility concerns into organisation's policies and digital production processes. The Standard provides non-technical website owners a better understanding of the value of inclusive design, and a framework for how to use guidelines like WCAG 2.0 to help them create products which are Designed for All. The Standard's lead-author, Jonathan Hassell, has created a  summary of BS 8878  to help organisations better understand how the standard can help them. \n Application domains [ edit ] \n The application domains of Design for All in the context of ICT, practically include every field involving Information and Communication Technologies. \n The significance of the application domains reflects their role in establishing a coherent and socially acceptable Information Society, but also the diverse range of human activities affected. The critical application domains for Design for All, can be summarised as follows: \n Life-long learning \n Public information systems, terminals and information appliances (e.g. kiosks, smart home environments) \n Transaction services (e.g., banking) \n Electronic commerce  applications and services \n Social services for the citizens (e.g., administration, elderly, transport, health care, awareness) \n Tools to allow for added-value information services (e.g., creation, storage, retrieval and exchange of user experiences, traces and views) \n Security \n The White Paper \"Toward an Information Society for All: An International R&D Agenda\" (1998) [20]  published by the International Scientific Forum \"Towards an Information Society for All\" (ISF-IS4ALL), [21]  has discussed the significance of these application domains: \n \"Life-long learning is a critical area where emphasis should be placed, in the \"knowledge\" society of the future. It entails a continuous engagement in the acquisition of knowledge and skills to facilitate and sustain equitable participation in the Information Society. New technologies may play a catalytic role in providing new educational mechanisms and structures, thus allowing learning to become an inseparable part of life-long human activities in the context of knowledge-intensive learning communities, and social interaction amongst groups of people. \n Another important application area and a critical short-term target is the development of general purpose public information systems, terminals and information appliances, (e.g., information kiosks for access to community-wide information services). These are expected to be used in increasingly different contexts, including public places, homes, classrooms, etc., and provide the means for ubiquitous and nomadic access. Environmental control will also become increasingly important. Smart environments will progressively penetrate a wide range of human activities in hospitals, hotels, public administration buildings, etc. Teleoperation of such environments will also gain increasing attention to facilitate responsiveness to unforeseen events, enhanced mobility and security. \n Finally, a broad range of transaction services (e.g., banking, advertising, entertainment), social services for the citizens (e.g., administration, health care, education, transport), and electronic commerce applications, will become increasingly important in reshaping business and residential human activities (...) security, privacy and control are central themes in the evolution of a socially acceptable Information Society and should receive immediate attention. At the same time, they will increasingly constitute more complex targets to accomplish, as they span across different levels of the telecommunications infrastructure, from network services to application services (such as business transactions and entertainment), terminals and information appliances.\" \n Education and training [ edit ] \n One major lever to improve awareness and practice in Design for All is the development of education and training programs. Professionals are needed who have acquired comprehensive specialist knowledge and skills in Design for All; in addition those professionals who currently work in ICT industry need to acquire additional knowledge and skills concerning Design for All. \n Little evidence can be found of university degree programmes that specialize in Design for All (or Universal Design) or that explicitly includes a module about this. [22]  This lack was tackled in the project DfA@eInclusion, which devised curricula: [23] \n A bachelor level introductory course which aims to enable students to have an understanding of the ethical and social issues of Design for All, and the role of Design for All as an enabler of accessibility and participation in the information society \n A masters level programme which aims to enable students to have the relevant knowledge, personal and professional skills & competencies to design, develop, implement, evaluate and manage a wide range of ICT systems products and services that adhere to the principles and practices of Design for All. [24] \n The implementation of such programmes is already under way in a few places, for example at Oslo and Akershus University College of Applied Sciences, [25]  the Middlesex University, [26]  UK, University of Linz, [27]  Austria and the University of Trás-os-Montes e Alto Douro, [28]  Portugal. Core topics include an understanding of the principles of human rights, the development of standards, regulations and legislation, the design and development of assistive technologies as well as improved access of mainstream products and services. \n Web accessibility  is an important component of accessing the information society and information and guidance is offered by the World Wide Web Consortium's  Web Accessibility Initiative  (WAI) [29]  as well as online tutorials (for example, Opera's Web Standards Curriculum [30] ). \n The complementary approach of training for professionals in ICT industry has also been tackled by the DfA@eInclusion project. [31]  A comprehensive curriculum for such trainings has been recommended and is currently subject to a CEN workshop negotiation. The CEN workshop \"Curriculum for training professionals in Universal Design (UD-Prof)\" [32]  has been implemented in May 2009. Following the general rules for CEN workshops, it offers all interested stakeholders an opportunity to discuss and improve this DfA curriculum for ICT professionals. \n Examples of good practice [ edit ] \n Opera (web browser)  was designed with the commitment to be used by as many people as possible thus following a Design for All approach. \n Audiobooks  are good examples for Design for All because they enable people to read a book. Virtually anyone who does not have a hearing disability can use audiobooks for leisure, learning, and information.  Listening Books  it is the only audiobook charity in the UK providing an internet streaming and postal service to anyone who has a disability or illness which makes it difficult to hold a book, turn its pages, or read in the usual way. [33] \n e-Government  uses information and communication (ICT) technology to provide and improve government services, transactions and interactions with citizens, businesses, and other arms of government. [34] [35] \n Elevators  provide an alternative way to reach different floor levels. Modern accessible elevators use information and communication technology to adapt themselves to any user imaginable. The closing speed of the doors is adjustable so people can safely enter quickly or slowly as required. Controls of the elevator provide visual and audible feedback to the user so that people with different sensory abilities can operate the elevator without assistance. Blind people profit from tactile keys.  Braille  labeling is located besides the keys so that they are not accidentally pushed while reading them. The emergency intercom system operates aurally and visually. Wireless tagging (e.g.  RFID ),  facial recognition , remote controls further enhance the capabilities of a modern elevator which can be used by almost anyone. \n The Inclusive Design Toolkit [36]  presents examples of how Design for All principles can be implemented. \n Other examples of Design for All in ICT are presented in EDeAN's Education and Training Resource. [37] \n Related networks and projects [ edit ] \n European Design for all eAccessibility Network [ edit ] \n The European Design for All e-Accessibility Network - EDeAN [38]  is a network of 160 organisations in European Union member states. The goal of the network is to support all citizens' access to the Information Society. EDeAN provides: \n a European forum for Design for All issues, supporting EU's e-inclusion goals \n awareness raising in the public and private sectors \n online resources on Design for All \n The network is coordinated by the EDeAN Secretariat, which rotates annually and the corresponding National Contact Centres which are the contact points for EDeAN in each EU member state. \n Design for All Europe [ edit ] \n EIDD - Design for All Europe is a 100% self-financed European organisation that covers the entire area of theory and practice of Design for All, from the built environment and tangible products to communication, service and system design. Originally set up in 1993 as the European Institute for Design and Disability (EIDD),to enhance the quality of life through Design for All, it changed its name in 2006 to bring it into line with its core business. EIDD - Design for All Europe disseminates the application of Design for All to business and administration communities previously unaware of its benefits and currently (2009) has active member organisations in 22 European countries. The aim of EIDD is to encourage active interaction and communication between professionals interested in the theory and practice of Design for All and to build bridges between, on the one hand, these and other members of the design community and, on the other hand, all those other communities where Design for All can make a real difference to the quality of life for everyone. \n Examples of EU-funded research projects addressing ICT and inclusion [ edit ] \n Design for all for e-Inclusion [39] \n This is a support project to EDeAN. The project aims to develop an exemplary training course for Design for all targeted to the Industry, course structures and curricula for studying Design for All in undergraduate and postgraduate levels as well as an online knowledge base on Design for All. \n DIADEM: [40]  Delivering Inclusive Access for Disabled or Elderly Members of the Community \n The project aims to develop an adaptable web browser interface for people with reduced cognitive skills, which can be used at home and at work. \n I2Home: [41]  Intuitive interaction for everyone with home appliances based on industry standards \n The project seeks to develop a universal remote console that will allow networked access to everyday appliances in the home. \n SHARE-IT: [42]  Supported Human Autonomy for Recovery and Enhancement of cognitive and motor abilities using Information Technologies \n This project is developing scalable and adaptive ‘add-ons’ which will allow assistive technologies to be integrated into intelligent ICTs for the home. \n HaH: [43]  Hearing at Home \n This project is looking at the next generation of assistive devices which will help hearing-impaired people to participate fully in the Information Society. \n CogKnow: [44]  Helping people with mild dementia navigate their day \n CogKnow aims to develop and prototype a cognitive prosthetic device to help those struggling with dementia to perform their daily activities. \n MonAmi: [45]  Mainstreaming  Ambient Intelligence \n The project seeks to mainstream the accessibility of consumer goods and services. The aim is to develop technology platforms that allow elderly and disabled people to continue living in their own homes and stay in their communities. \n USEM : User Empowerment in Standardisation [46] \n The project aims to train end-users in standardisation related issues and to enable them to participate in standardisation activities in the area of ICT. \n VAALID: [47]  Accessibility and Usability Validation Framework for AAL Interaction Design Process \n The project aims at creating modeling and simulation supporting tools to optimize user interaction design and accessibility and usability validation process when developing Ambient Assisted Living solutions. \n PERSONA: [48]  Perceptive Spaces promoting Independent Aging \n The project aims at further develop Ambient Assisted Living products and services that are affordable, easy to use and commercially viable. The project develops an integrated technological platform that seamlessly links up the different products and services for social inclusion, for support in daily life activities, for early risk detection, for personal protection from health and environmental risks, for support in mobility and displacements within his neighbourhood/town, all of which make a life of freedom worth living within their families and within the society. \n See also [ edit ] \n Design for All (design philosophy) \n Universal Design \n Computer accessibility \n Accessibility \n Knowbility \n References [ edit ] \n ^   User Interfaces for All: Concepts, Methods and Tools. Constantine Stephanidis, (Ed.) Lawrence Erlbaum Associates, 2001 , Accessed 2009-10-05. \n ^   EIDD Stockholm Declaration, 2004 \n ^   EDeAN White Paper: promoting Design for All and e-Accessibility in Europe , Accessed 2009-10-05. \n ^   Report on the impact of technological developments on eAccessibility , Accessed 2009-10-05. \n ^   DfA@eInclusion project website , Accessed 2009-10-05. \n ^   Communication from the Commission to the Council, the European Parliament, the European Economic and Social Committee and the Committee of the Regions: e Accessibility, Brussels 2005 , Accessed 2009-10-05. \n ^   The i2010 initiative website , Accessed 2009-10-05. \n ^   Convention on the Rights of Persons with Disabilities , Accessed 2009-10-05. \n ^   Directive 2002/21/EC of the European Parliament and of the Council of 7 March 2002 on a common regulatory framework for electronic communications networks and services (Framework Directive) , Accessed 2009-10-05. \n ^   Directive 2002/22/EC of the European Parliament and of the Council of 7 March 2002 on universal service and users' rights relating to electronic communications networks and services (Universal Service Directive) [Official Journal L 108 of 24 April 2002] , Accessed 2009-10-05. \n ^   European Commission Enterprise and Industry Directorate-General (2005):  Standardisation Mandate to CEN, CENELEC, and ETSI in support of European accessibility requirements for public procurement of products and services in the ICT domain , Accessed 2009-10-09. \n ^   Directive 2001/29/EC of the European Parliament and of the Council of 22 May 2001 on the harmonisation of certain aspects of copyright and related rights in the information society. , Accessed 2009-10-05. \n ^   World Intellectual Property Organisation , Accessed 2009-10-05. \n ^   Directive 2002/58/EC of the European Parliament and of the Council of 12 July 2002 concerning the processing of personal data and the protection of privacy in the electronic communications sector (Directive on privacy and electronic communications) , Accessed 2009-10-05. \n ^   Council of The European Union Commission of the European Communities: E-Europe2002: An Information Society For All Action Plan prepared by the Council and the European Commission for the Feira European Council , Accessed 2009-10-05. \n ^   Communication from the Commission to the Council, the European Parliament, the European Economic and Social Committee and the Committee of the Regions - “i2010 – A European Information Society for growth and employment” {SEC(2005) 717} , Accessed 2009-10-05. \n ^   ETSI EG 202 116 V1.2.1 (2002-09): Human Factors (HF); Guidelines for ICT products and services; \"Design for All\"   Archived  27 July 2011 at the  Wayback Machine ., Accessed 2009-10-05. \n ^   Web Content Accessibility Guidelines (WCAG) 2.0 . Accessed 2009-07-24. \n ^   BS 8878:2010 Web accessibility - Code of Practice . Accessed 2010-12-07. \n ^   Stephanidis, C. (Ed.), Salvendy, G., Akoumianakis, D., Bevan, N., Brewer, J., Emiliani, P.L., Galetsas, A., Haataja, S., Iakovidis, I., Jacko, J., Jenkins, P., Karshmer, A., Korn, P., Marcus, A., Murphy, H., Stary, C., Vanderheiden, G., Weber, G., & Ziegler, J. (1998):  Towards an Information Society for All: An International R&D Agenda. International Journal of Human-Computer Interaction, 10 (2), 107-134 , Accessed 2009-10-05. \n ^   International Scientific Forum \"Towards an Information Society for All\" , Accessed 2009-10-05 \n ^   Whitney G, Keith S (2008) European Developments in the Design and Implementation of Training for eInclusion. Springer Lecture Notes in Computer Science: Computers Helping People with Special Needs (Book) Volume 5105/2008 pp156-161 \n ^   Keith S., Whitney G.  The production of syllabi for a range of DfA courses in ICT [ permanent dead link ] , November 2008. Accessed 2009-06-20. \n ^   Keith, S., G. Whitney, and J. Wilson, Design For All @ eInclusion: Best Practice in Education And Training, in AAATE '09. 2009: Florence. \n ^   Master of Universal Design of ICT , Accessed 2014-06.02. \n ^   MSc Digital Inclusion at Middlesex University   Archived  27 May 2012 at  Archive.is , Accessed 2009-10-06. \n ^   ' Institut Integriert Studieren ' at the University of Linz , Accessed 2009-10-06. \n ^   Licenciatura and master degree in Rehabilitation Engineering and Accessibility at UTAD  Accessed 2013-11-12. \n ^   W3C-WAI , Accessed 2009-10-05. \n ^   Opera Web Standards Curriculum , Accessed 2009-10-05. \n ^   Schmidt-Belz, B. and Y. Mohamad,  Exemplary Training Modules on eAccessibility for industry training, 2009 [ permanent dead link ] , Accessed 2009-06-20. \n ^   CEN Workshop on 'Curriculum for training professionals in Universal Design' (WS/UD-PROF) , Accessed 2009-06-09. \n ^   Listening Books , Accessed 2009-08-17. \n ^   Austrian e-Government portal . Accessed 2009-08-17 \n ^   Greek e-Government Portal [ permanent dead link ] , Accessed 2009-08-17. \n ^   Inclusive Design Toolkit   Archived  26 November 2009 at the  Wayback Machine ., Accessed 2009-10-06. \n ^   Education and Training Resource , Accessed 2009-10-06. \n ^   European Design for All e-Accessibility Network - EDeAN , Accessed 2009-08-04. \n ^   DfA@eInclusion project website , Accessed 2009-10-06. \n ^   DIADEM project website   Archived  30 April 2009 at the  Wayback Machine ., Accessed 2009-10-06. \n ^   I2Home project website , Accessed 2009-10-06. \n ^   SHARE-IT project website   Archived  15 January 2010 at the  Wayback Machine ., Accessed 2009-10-06. \n ^   HaH project website , Accessed 2009-10-06. \n ^   CogKnow project website , Accessed 2009-10-06. \n ^   MonAmi project website , Accessed 2009-10-06. \n ^   USEM project website , Accessed 2009-10-06. \n ^   VAALID project website , Accessed 2009-12-10. \n ^   PERSONA project website , Accessed 2009-12-10 \n External links [ edit ] \n Website of the EU-funded Project \"DfA@eInclusion\" \n Website of the European Design for All e-Accessibility Network (EDeAN) \n Website of EIDD - Design for All Europe \n European Commission - Information Society Portal, Design for All \n v \n t \n e \n Design \n Outline \n Portal \n Designer \n Disciplines \n Communication \ndesign \n Advertising \n Book design \n Corporate design \n Exhibit design \n Film title design \n Graphic design \n Motion \n Postage stamp design \n Print design \n Illustration \n Information design \n Instructional design \n News design \n Photography \n Retail design \n Signage  /  Traffic sign design \n Typography  /  Type design \n Video design \n Visual merchandising \n Environmental \ndesign \n Architecture \n Architectural lighting design \n Building design \n Passive solar \n Ecological design \n Environmental impact design \n Garden design \n Computer-aided \n Healthy community design \n Hotel design \n Interior architecture \n Interior design \n EID \n Keyline design \n Landscape architecture \n Sustainable \n Landscape design \n Spatial design \n Urban design \n Industrial \ndesign \n Automotive design \n Automotive suspension design \n CMF design \n Corrugated box design \n Electric guitar design \n Furniture design \n Sustainable \n Hardware interface design \n Motorcycle design \n Packaging and labeling \n Photographic lens design \n Product design \n Production design \n Sensory design \n Service design \n Interaction \ndesign \n Experience design \n EED \n Game design \n Level design \n Video game design \n Hardware interface design \n Icon design \n Immersive design \n Information design \n Sonic interaction design \n User experience design \n User interface design \n Web design \n Other \n applied arts \n Public art design \n Ceramic  /  glass design \n Fashion design \n Costume design \n Jewelry design \n Floral design \n Game art design \n Property design \n Scenic design \n Sound design \n Stage/set lighting design \n Textile design \n Other \ndesign \n&  engineering \n Algorithm design \n Boiler design \n Conceptual design \n Database design \n Drug design \n Electrical system design \n Experimental design \n Filter design \n Job design \n Integrated circuit design \n Circuit design \n Physical design \n Power network design \n Mechanism design \n Nuclear weapon design \n Nucleic acid design \n Organization design \n Process design \n Processor design \n Protein design \n Research design \n Social design \n Software design \n Spacecraft design \n Strategic design \n Systems design \n Approaches \n Activity-centered \n Adaptive web \n Affective \n Brainstorming \n By committee \n By contract \n C-K theory \n Closure \n Co-design \n Concept-oriented \n Configuration \n Contextual \n Continuous \n Cradle-to-cradle \n Creative problem-solving \n Creativity techniques \n Critical \n Design fiction \n Defensive \n Design–bid–build \n Design–build \n architect-led \n Domain-driven \n Ecodesign \n Energy neutral \n Engineering design process \n Probabilistic design \n Error-tolerant \n Fault-tolerant \n Framework-oriented \n For assembly \n For behaviour change \n For manufacturability \n For Six Sigma \n For testing \n For X \n Functional \n Generative \n Geodesign \n High-level \n Integrated \n Integrated topside \n Intelligence-based \n Iterative \n KISS principle \n Low-level \n Metadesign \n Mind mapping \n Modular \n New Wave \n Object-oriented \n Open \n Parametric \n Participatory \n Platform-based \n Policy-based \n Process-centered \n Public interest \n Rational \n Regenerative \n Reliability engineering \n Research-based \n Responsibility-driven \n RWD \n Safe-life \n Sustainable \n Systemic \n SOD \n Tableless web \n Theory of constraints \n Top-down and bottom-up \n Transformation \n Transgenerational \n TRIZ \n Universal \n Design for All \n Usage-centered \n Use-centered \n User-centered \n Empathic \n User innovation \n Value-driven \n Value sensitive \n Privacy by \n Design  choice \n computing \n controls \n flow \n leadership \n management \n marker \n methods \n pattern \n research \n science \n strategy \n theory \n thinking \n Tools \n Intellectual property \n Organizations \n Awards \n Tools \n AAD \n Architectural model \n Blueprint \n Comprehensive layout \n CAD \n CAID \n Virtual home design software \n CAutoD \n Design quality indicator \n Electronic design automation \n Flowchart \n Mockup \n Product design specification \n Prototype \n Sketch \n Storyboard \n Technical drawing \n Web design program \n Website wireframe \n Intellectual \nproperty \n Community design \n Design around \n Design patent \n Geschmacksmuster \n Industrial design rights \n European Union \n Organizations \n AIGA \n Chartered Society of Designers \n Design and Industries Association \n Design Council \n International Forum Design \n The Design Society \n Design Research Society \n Awards \n European Design Award \n German Design Award \n Good Design Award (Chicago) \n Good Design Award (Japan) \n Graphex \n IF product design award \n James Dyson Award \n Prince Philip Designers Prize \n Related topics \n Aesthetics \n Agile \n Concept art \n Creative industries \n Cultural icon \n .design \n Enterprise architecture \n Futures studies \n Innovation Management \n Intelligent design \n Lean Startup \n New product development \n OODA Loop \n Philosophy of design \n Process simulation \n Slow design \n STEAM fields \n Unintelligent design \n Visualization \n Wicked problem \n Design  brief \n change \n classic \n director \n education \n elements and principles \n engineer \n firm \n history \n knowledge \n language \n life \n load \n museum \n paradigm \n rationale \n review \n specification \n studio \n technology \n Commons \n Wikibooks \n Wikinews \n Wikiquote \n Wikisource \n Wiktionary \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Design_for_All_(in_ICT)&oldid=799708361 \"\t\t\t\t\t \n Categories :  Computing and society Information technology Accessibility Hidden categories:  Webarchive template wayback links All articles with dead external links Articles with dead external links from September 2017 Articles with permanently dead external links Webarchive template archiveis links Articles containing German-language text Use dmy dates from July 2013 Wikipedia articles needing clarification from September 2010 All Wikipedia articles needing clarification Articles containing French-language text Articles containing Spanish-language text   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n Čeština Dansk Deutsch Ελληνικά Español Italiano Lietuvių Nederlands Norsk Slovenščina Svenska   \n Edit links   \n  This page was last edited on 9 September 2017, at 10:46. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}