{"url": "https://kbp.wikipedia.org/wiki/Urduu_k%CA%8An%CA%8A%C5%8B", "content": "Urduu kʊnʊŋ — Wikipediya \n Urduu kʊnʊŋ   \n Pɩlɩɩna Wikipediya   \n\t\t\t\t\tWolo:\t\t\t\t\t tʋʋzɩtʋ , \t\t\t\t\t ñɩnɩ \n Urduu, egeetiye hɩɖɛ, kɛ kʊnʊŋ ŋgʊ kɩ-tɛ nɛ Ɛndo-Ɩranɩyɛ agbela taa nɛ kɩlɩna Ɛndɩ Erɔpʊ kʊnʊmɩŋ cejewiye taa yɔ. Pɔyɔɔdʊʊ-kʊ [Ɛɛndɩ]] nɛ Hayi kɩŋ ɛjaɖɛ taa nɛ ɖɔɖɔ  Pakɩsɩtanɩ  ɛjaɖɛ taa. Kɩ-kɛ ajɛyɛ ana a-tɛ kewiyaɣ kʊnʊŋ. Ɛndɩ ɛjaɖɛ taa lɛ payaɣ-kʊ se Ɛndi nɛ pama-kʊ nɛ devanagari masɩ wɛtʊ taa. \n Urduu kɛ kewiyaɣ taa kʊnʊmɩŋ taa kʊnʊŋ lɛɛkʊ ŋgʊ kɩwɛ ɛjaɖɛ kewiyaɣ paɣtʊ takayaɣ taa yɔ. Malɩŋ ñɩma mba pɔyɔɔdʊʊ-kʊ yɔ ha-kʊ hɩɖɛ se Urduu nɛ pama-kʊ nɛ Arabɩ matʊ taa ɖɔɖɔ ɛzɩ Pakɩsɩtanɩ taa yɔ. Ɛyaa miiliyɔɔ waa 165 lakɩ tʊmɩyɛ nɛ Urduu kʊnʊŋ nɛ pada peeɖe lɛ, ɛyaa miiliyɔɔ waa 60 pɩtalɩ miiliyɔ waa 80 lakɩ-kʊ nɛ tɩmɩyɛ ɛzɩ kajalaɣ kʊnʊŋ yɔ. \n Urduu kewiyaɣ kʊnʊŋ Pakɩsɩtanɩ ɛjaɖɛ taa, palakɩ-kʊ nɛ tʊmɩyɛ kpɛlɛkʊ nɔmɔʊ taa nɛ matʊ nɛ tɔm hʊɣʊ kpamɩŋ taa. Pakpaɣ-kʊ ɛzɩ kʊnʊŋ ŋgʊ pasɩŋna malɩŋ ñɩma yɔ Ɛndɩ kedeŋga nɛ haɖɛ kɩŋ yɔ. Pɔyɔɔdʊʊ-kʊ tɛtʊ sɔsɔtʊ taa tʊma sɔsɔna taa kɔzɩ kɔzɩ muhadjir mba Karachi tɛtʊ taa ɖeeɖe nabʊyʊ taa kɩ-hɩɖɛ sɛwa mbʊ pʊyɔɔ yɔ Ɛndɩ nɛ hayi kɩŋ cɔzɩya yaa agɔma Ɛndɩ kedeŋga nɛ haɖɛ kɩŋ tɛyɩyʊ wayɩ pɩnaɣ 1947 taa. \n Ɛɛndɩ  taa lɛ, pasɩma ɖɔɖɔ Urduu kʊnʊŋ ɛjaɖɛ kewiyaɣ paɣtʊ takayaɣ taa. Urduu kɛ ɖɔɖɔ kewiyaɣ kʊnʊŋ ajɛya anɛ a-taa Andrhra Pradesh nɛ Bihar nɛ Jammu-et-Cachemire nɛ Uttar Pradesh nɛ ɖɔɖɔ ɛjaɖɛ taa tɛtʊ sɔsɔtʊ ndʊ payaɣ se Delhi yɔ.  Ɛɛndɩ  ɛjaɖɛ taa sukuli kɩtɛzɩŋ nɩɩyɛ taa lɛ, pamazɩɣ se Urduu kɛ hɩɖɛ sɛʊ tɛ kʊnʊŋ. Pɩkɛ tevenim tɔm Lucknow nɛ Aligarh nɛ Hyderaba tɛtʊ taa. \n Ɛndi nɛ Urduu, kʊnʊmɩŋ nɩɩlɛ weyi ɛmalɩna ɖama kpam yɔ. Ɛyɔɔdɩyaa kpɛnda ɛyaa miiliyɔɔ waa 950 nɛ pʊyɔɔ mbʊ yɔ ɛzɩ palʊlɩ-wɛ kɩ-ta yɔ nɛ kɩ-kɛ naalɛ ŋgʊ  Ɛɛndɩ  nɛ kɩ-hadɛ kɩŋ kedeŋga. \n\t\t\t\t\t\tPɩɖaɣna mʋʋna \" https://kbp.wikipedia.org/w/index.php?title=Urduu_kʊnʊŋ&oldid=9476 \"\t\t\t\t\t \n Pɩlɩŋ  :  !Main category Kʋnʋmɩŋ Pakisitaanɩ   \n Ɖiwoɖe tʋʋzʋʋ \n Man-kɩlabɩnaʋ \n Non connecté Ndɔnjɔɔlɩyɛ Tambaɣ Tʋlɩ koozaɣ Kpɩtɩna   \n Hɩla loniye \n Takayɩhayʋʋ Ndɔncɔɔlɩyɛ   \n Ndɩ ndɩ \n Taaɖɩtʋ \n Kalɩ Ñɔɔzɩ Ñɔɔzɩ wikicode Caanaʋ tɔm kɛdʋʋ   \n Sɔzʋʋ \n Ñɩnɩ \n Tʋʋzɩtʋ \n Talɩ ɖeu Ŋgbɛyɛ Sɔnɔ tɔm Wayɩ wayɩ ñɔɔzɩtʋ Takayɩhayʋʋ nakʋyʋ yem Sɩnaʋ Ha haɖɛ   \n Lɩzɩ takayahayʋʋ kɩlɩʋ / poliŋ taa wonaʋ \n La takayaɣ Poliŋ taa mʋʋ ɛzɩ PDF yɔ Ñɔɔzɩtʋ kɩlɛɣzɩtʋ kɩlɩʋ lone   \n Tambasɩ lɛɛsɩ taa \n Wikimédia Commons   \n Kɩlabɩnaʋ \n Takayɩhatʋ kɩtamtʋ Takayɩhatʋ ndʋ tɩtamsɩna kanɛ yɔ tɩ-tɩŋʋʋ Tiyina poliŋ taa takayaɣ Takayɩhatʋ ndɩ Ɖɩtɩlɩyɛ caɣdam Takayɩhayʋʋ yɔɔ kiheyitu Wonuu Wikidata Tasɩ yaʋ takayɩhayʋʋ kʋnɛ   \n Kʋnʋmɩŋ lɛɛŋ \n Acèh Afrikaans አማርኛ Aragonés العربية ܐܪܡܝܐ مصرى অসমীয়া Asturianu Azərbaycanca Беларуская Беларуская (тарашкевіца)‎ Български भोजपुरी বাংলা বিষ্ণুপ্রিয়া মণিপুরী Brezhoneg Bosanski Català Нохчийн Cebuano کوردی Čeština Чӑвашла Cymraeg Dansk Deutsch Zazaki Dolnoserbski ދިވެހިބަސް Ελληνικά English Esperanto Español Eesti Euskara فارسی Suomi Français Frysk Gaeilge Galego Avañe'ẽ गोंयची कोंकणी / Gõychi Konknni ગુજરાતી 客家語/Hak-kâ-ngî עברית हिन्दी Fiji Hindi Hrvatski Hornjoserbsce Magyar Հայերեն Bahasa Indonesia Interlingue Íslenska Italiano 日本語 Basa Jawa ქართული Қазақша Kalaallisut ಕನ್ನಡ 한국어 कॉशुर / کٲشُر Kurdî Коми Latina Limburgs Ligure Lietuvių Latviešu मैथिली Malagasy Māori Baso Minangkabau Македонски മലയാളം Монгол मराठी Bahasa Melayu مازِرونی Nāhuatl Plattdüütsch नेपाली नेपाल भाषा Nederlands Norsk nynorsk Norsk Occitan ଓଡ଼ିଆ ਪੰਜਾਬੀ पालि Polski Piemontèis پنجابی پښتو Português Runa Simi Română Русский Kinyarwanda Scots سنڌي Davvisámegiella Srpskohrvatski / српскохрватски Simple English Slovenčina Slovenščina Shqip Српски / srpski Svenska Kiswahili Ślůnski தமிழ் ತುಳು తెలుగు Тоҷикӣ ไทย Tagalog Türkçe Татарча/tatarça ئۇيغۇرچە / Uyghurche Українська اردو Oʻzbekcha/ўзбекча Tiếng Việt მარგალური ייִדיש Vahcuengh 中文 Bân-lâm-gú 粵語   \n Ñɔɔzɩ kpasɩ   \n  Takayahayʋʋ kɩfalʋ wayɩ wayɩ ñɩŋgʋ ñɔɔzɩtʋ 10 Kamɩŋ fenaɣ 2017 wiye, 07:41 yɔɔ. \n Ŋpɩzɩɣ ŋna takayɛsɩ sɩnɛ cɩnɛ:  licence Creative Commons Attribution-tɛyʋʋ mbʋ pɩlɩ ɖama yɔ ;\npapɩzɩɣ paɖʋ paɣtʋ lɛɛtʋ.\n\\nCɔna  Labɩnaʋ paɣtʋ  nɛ ŋtasɩ pɩ-taa nɩʋ camɩyɛ.\" \n Mɛsaɣ tɛɛ tɔm ɖɔkʋʋ paɣtʋ \n pɩlɩɩna Wikipediya \n Paɣʋ \n Leɣtʋ tɩlɩyaa \n Déclaration sur les témoins (cookies) \n Nesi tɛɛ kaŋgalafʋ taaɖʋʋ"}