{"url": "https://www.wikihow.com/wikiHow:Creative-Commons", "content": "wikiHow:Creative Commons - wikiHow \n MESSAGES \n LOG IN \n Log in \n Facebook \n Google \n Civic \n wikiHow Account \n\t\tNo account yet?\t\t Create an account \n EXPLORE \n Community Dashboard Random Article About Us Categories Recent Changes   \n HELP US \n Write an Article Request a New Article Answer a Request More Ideas...   \n Article Edit Discuss \n wikiHow:Creative Commons \n Creative Commons  is a non-profit organization that is devoted to expanding creative work for others to build upon and legally share. \n Under an  Attribution-Noncommercial-Share Alike 3.0 Creative Commons License , wikiHow's content is free to modify, republish and share. \n wikiHow's images may be shared according to the license marked on each image page. \n This enables blogs, websites and organizations, such as UNICEF and One Laptop Per Child, to freely redistribute our content to more readers and allows our community a right to fork. \n Conditions \n If you redistribute wikiHow content, please follow these conditions: \nYou must attribute the work to wikiHow by prominently linking back to the source pages on wikiHow. See our attribution requirements for details. \nDo not use our content for commercial purposes (e.g., a website or app with advertisements or a paid app). Commercial republishing requests for the text of selected articles may be approved, provided that republication is consistent with the wikiHow community's goal of providing a free education to the world. If you are seeking to republish wikiHow content for commercial purposes, please send a detailed email to wiki@wikihow.com that includes the URLs of the articles you would like to republish, how you plan to republish the articles, and how you plan to monetize the content. \nIf you alter, remix, transform or build upon our content, you may distribute the resulting work under the same or similar Creative Commons License. \n Additional Information \n wikiHow is a registered trademark at the U.S. Patent and Trademark Office. \n Videos, user profile photos, advertisements, trademarks or trade dress do not fall under wikiHow's Creative Commons License. \n To learn more about our goals and mission, take the wikiHow Tour or read  About wikiHow . \n If you have any questions, please email us at  wiki@wikihow.com . We love to hear about the redistribution of our content. \n Article Info \n  Categories:  Licenses \n Discuss \n Print \n Email \n Edit \n Thanks to all authors for creating a page that has been read 155,050 times. \n Did this article help you? \n Yes \n No \n   \n Cookies make wikiHow better. By continuing to use our site, you agree to our  cookie policy . \n Random Article \n Write An Article \n Featured Articles \n How to  Buy Nike Stock How to  Deal With Tons of Homework How to  Use a Milk Frother How to  Tame a Fully Grown Quail   \n Follow Us On... \n Home \n About wikiHow \n Jobs \n Terms of Use \n RSS \n Site map \n Log In \n    All text shared under a  Creative Commons License .\n Powered by Mediawiki. \n 64"}