{"url": "http://ev.buaa.edu.cn/info/1035/1613.htm", "content": "Cranfield Delegation Visits BUAA-BEIHANG \n About BUAA \n Overview \n President's Welcome \n BUAA Today \n Current Leaders \n Administration \n Statistics \n Maps \n Admission \n Why BUAA \n Undergraduate \n Graduate \n Chinese Training \n International Education \n Exchange Program \n Scholarship \n Research \n NLAA \n IRI \n Labs & Centers \n Key Disciplines \n News & Events \n News \n Events \n Campus Life \n General Information \n Campus Map \n Alumni \n Alumni \n Donate \n Share To \n   中文版 \n                                                News\r\n Cranfield Delegation Visits BUAA \n Release time：September 26, 2017  /  Mingzhu Li  \n A Cranfield University delegation led by Prof. Philip John, its Pro-Vice-Chancellor, visited Beihang University in the afternoon of September 15th. The delegation met with Prof. Haijun Huang, Vice President of Beihang University, together with representatives from the International Division, the School of Energy and Power Engineering, the School of Aeronautic Science and Engineering and the School of Transportation Science and Engineering. \n    \n    \n Prof. Huang first extended his warm welcome to the delegation and then reviewed the efforts and achievements of cooperation between the two universities. Following him, Prof. John introduced the latest development of Cranfield University and hoped that both sides could join hands in preponderant disciplines, strengthening their cooperation in aeronautic education and research. The attenders fully exchanged their views on topics like research collaboration, joint cultivation of doctoral students and hosting international aerospace seminars together, and reached a consensus during the meeting. \n    \n    \n Founded in 1946, Cranfield University focuses on graduate education. It currently has over 4,600 students from more than 100 countries and regions, half of which are international students. It leads the world in aerospace, management and machinery manufacturing, and is also strong in aircraft and engine design, automatic control engineering, manufacturing and materials, defence technology, etc.  \r\n     \n    \n Beihang and Cranfield have a long history of cooperation, witnessing frequent exchanges between their professors in a wide range of fields. The Beihang-Cranfield double master degree program established in 2014 is subsidized by China Scholarship Council.  \r\n     \n    \n Written by Mi Zhou \n  Photo by Chao Song \n  Edited by Qing Wang \n  Translated by Mingzhu Li \n    \n September 25, 2017 \n Several Cooperation Agreement Signed Between Beihang and Russian Universities"}