{"url": "https://en.wikipedia.org/wiki/Hindi%E2%80%93Urdu_controversy", "content": "Hindi–Urdu controversy - Wikipedia \n Hindi–Urdu controversy   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n Status change of languages \n Urdu  replaces  Persian \n 1837 [1] \n Hindi  and  Urdu  granted equal status \n 1900 \n Urdu  declared sole national language in Pakistan \n 1948 [1] \n Hindi  granted separate status and official precedence over  Urdu  and all other languages in the Republic of India \n 1950 \nUrdu (Top) and Hindi (Middle) along with  English  (Bottom) on a road sign in India. \n The  Hindi–Urdu controversy  is an ongoing dispute—dating back to the 19th century—regarding the status of  Hindi  and  Urdu  as a single language,  Hindustani  (lit \"of  Hindustan \"), or as two  dialects  of a single language, and the establishment of a single  standard language  in certain areas of  North India . Although this debate was officially settled by a government order in 1950, declaring Hindi as the official language, some resistance remains. The present notion among some Muslims about this dispute is that  Hindus  abandoned the Urdu language, whereas some Hindus claim that Urdu was artificially created during Muslim rule. [2] \n Hindi  is a literary  register  of the Hindustani language, derived from the  Khariboli dialect  of the  Hindi languages . A Persianized variant of Hindustani began to take shape during the  Delhi Sultanate  (1206–1526 AD) and  Mughal Empire  (1526–1858 AD) in  South Asia . [3] [ not in citation given ]  Urdu, along with English, became the first official language of  British India  in 1850, [4] [5]  which still favoured Muslims, even though many Hindus knew it as well. Urdu was being written, spoken and translated to and from English in all courts, schools, official documents, and government institutes, and learnt to communicate with both religious groups. Although the need to have a language for Hindus developed post 1850, the irrevocable birth of the Hindi language took place in 1880. Urdu is a name derived from the  Turkic  word  ordu  (army) or  orda . When the  Turco-Persian   Mughals  who invaded the Indian subcontinent made camps, the colloquial Persian spoken by the soldiers, known as the \"language of the camp\", or \" Zaban-i-Ordu \", became gradually more and more Indianised, as they themselves settled and married into the local communities, until the dialect they spoke was readily intelligible to the native Hindu population. \n The last few decades of the nineteenth century witnessed the eruption of the Hindi–Urdu controversy in the  United Provinces  (present-day  Uttar Pradesh , then known as \"the  North-Western Provinces  and  Oudh \"). The controversy comprised \"Hindi\" and \"Urdu\" protagonists each advocating the official use of Hindustani with the  Devanagari  script or with the  Nastaʿlīq  script, respectively. Hindi movements advocating the growth of and official status for Devanagari were established in Northern India.  Babu Shiva Prasad  and  Madan Mohan Malaviya  were notable early proponents of this movement. This, consequently, led to the development of Urdu movements defending Urdu's official status;  Syed Ahmed Khan  was one of its noted advocates. \n In 1900, the Government issued a decree granting symbolic equal status to both Hindi and Urdu, which was opposed by Muslims and received with jubilation by  Hindus . Hindi and Urdu started to diverge linguistically, with Hindi drawing on  Sanskrit  as the primary source for formal and academic vocabulary, often with a conscious attempt to purge the language of Persian-derived equivalents. Deploring this Hindu-Muslim divide,  Gandhi  proposed re-merging the standards, using either Devanagari or Urdu script, under the traditional generic term Hindustani. Bolstered by the support of the  Indian National Congress  and various leaders involved in the  Indian Independence Movement , Hindi, in the Devanagari script, along with English, replaced Urdu as the official language of India during the institution of the  Indian constitution  in 1950. \n Contents \n 1   Background \n 2   Controversy \n 2.1   British language policy \n 2.2   Hindi and Urdu movements \n 2.3   Gandhi's idea of Hindustani \n 2.4   Muslim nationalism \n 2.5   Linguistic purism \n 3   Hindi to Urdu \n 4   See also \n 5   References \n 6   External links \n Background [ edit ] \n The main cause of this divide may be attributed to the aspirations of both communities (Hindu and Muslim) to spread their cultural views, which became open contention during  Indian independence . Muslims have mostly looked towards their Muslim  Ummah  for cultural inspiration whereas Hindus generally get inspiration from the ancient  Vedic  Culture and other ancient past. During the rule of Muslims in the subcontinent, often having been  Turkic  and  Afghan , an amount of people who converted to  Islam  readily adopted aspects of the culture of the Turko-Afghan conquerors and rulers brought with them.  Persian  at that time was considered a prestigious and important language in many parts of Islamic world like Central Asia, which they thus brought with them. The founders of Islamic rule in India were from different ethnic background viz. Turks, Mongols, Arabs, Afghans etc. and all of them used Persian as their lingua franca and court language. In general, from its earliest days foreign Muslim culture was imported and patronised in the subcontinent by Turks and Afghans, laying the firm basis for what would, eventually, develop further under the  Mughals . [6]  Hindus considered these things as an alien culture. With the passage of time things like  Sanskrit  language,  Dhoti ,  Ayurveda  etc. came to be associated with Hindus, and  Arabic , Persian,  Chaghatai ,  Yunani  medicine with Muslims. [7]  There also came to be differences in the cuisine and culture of two communities. \n Urdu became the language of the courts of Muslim rulers who governed parts of the  Indian subcontinent  from the eighth century onwards. It developed from the  Khariboli  dialect of the Delhi area with an infusion of words from  Arabic  and Persian. The modern vocabulary is derived from Persian, Arabic and Sanskrit, together with  Prakrit . [8]  As the Muslim rule spread in the northern subcontinent, Hindustani interacted with various vernaculars and introduced Persian words into local languages and absorbed local vocabulary, and over a period of time developed into a distinct spoken language. Hindi also developed from Khariboli, albeit with the assimilation of words from local languages and Sanskrit. \n Several factors contributed to the increasing divergence of Hindi and Urdu. The Muslim rulers chose to write Hindustani in Perso-Arabic script instead of  Devanagari  script. In time, Hindustani written in Perso-Arabic script also became a  literary language  with an increasing body of literature written in the 18th and 19th century. A division developed gradually between Hindus who chose to write Hindustani in Devanagari script and Muslims and some Hindus who chose to write the same in Urdu script. The development of Hindi movements in the late nineteenth century further contributed to this divergence. [9] \n Sumit Sarkar  notes that in the 18th and the bulk of the 19th century, \"Urdu had been the language of polite culture over a big part of north India, for Hindus quite as much as Muslims\". For the decade of 1881-90, Sarkar gives figures which showed that the circulation of Urdu newspapers was twice that of Hindi newspapers and there were 55% more Urdu books as Hindi books. He gives the example of the author  Premchand  who wrote mainly in Urdu till 1915, until he found it difficult to publish in the language. [10] \n Professor  Paul R. Brass  notes in his book,  Language, Religion and Politics in North India , \n The Hindi-Urdu controversy by its very bitterness demonstrates how little the objective similarities between language groups matter when people attach subjective significance to their languages. Willingness to communicate through the same language is quite a different thing from the mere ability to communicate. [9] \n Controversy [ edit ] \n British language policy [ edit ] \n Further information:  Persian language in South Asia \n In 1837, the British East India company replaced Persian with local vernacular in various provinces as the official language of government offices and of the lower courts. However, in the northern regions of the Indian subcontinent, Urdu in  Urdu script  was chosen as the replacement for Persian, rather than  Hindi  in the  Devanagari  script. [9] [11]  This was done despite the fact that the great majority of people in the northern plains of India were Hindu with an affinity for Hindi and for the Devanagri script. Why exactly this decision was taken is unclear. \n The most immediate reason for the controversy is believed to be the contradictory language policy in North India in the 1860s. Although the then government encouraged both Hindi and Urdu as a medium of education in school, it discouraged Hindi or Nagari script for official purposes. This policy gave rise to conflict between students educated in Hindi or Urdu for the competition of government jobs, which eventually took on a communal form. [12] \n Hindi and Urdu movements [ edit ] \n See also:  Urdu movement \n In 1867, some Hindus in the  United Provinces of Agra and Oudh  during the  British Raj  in  India  began to demand that  Hindi  be made an official language in place of  Urdu . [13]  Babu Shiva Prasad of Banares was one of the early proponents of the Nagari script. In a  Memorandum on court characters  written in 1868, he accused the early Muslim rulers of India for forcing them to learn Persian. In 1897,  Madan Mohan Malaviya  published a collection of documents and statements titled  Court character and primary education in North Western Provinces and Oudh , in which, he made a compelling case for Hindi. [12] [14] \n Several Hindi movements were formed in the late 19th and early 20th century; notable among them were  Nagari Pracharini Sabha  formed in  Banaras  in 1893, Hindi Sahitya Sammelan in  Allahabad  in 1910, Dakshina Bharat Hindi Prachar Sabha in 1918 and Rashtra Bhasha Prachar Samiti in 1926. [14]  The movement was encouraged in 1881 when Hindi in Devanagari script replaced Urdu in Persian script as the official language in neighboring  Bihar . They submitted 118 memorials signed by 67,000 people to the Education Commission in several cities. [9] [14]  The proponents of Hindi argued that the majority of people spoke Hindi and therefore introduction of Nagari script would provide better education and improve prospects for holding Government positions. They also argued that Urdu script made court documents illegible, encouraged forgery and promoted the use of complex Arabic and Persian words. \n Organisations such as  Anjuman Taraqqi-e-Urdu  were formed for the advocacy of Urdu. [9]  Advocates of Urdu argued that Hindi scripts could not be written faster, and lacked standardisation and vocabulary. They also argued that the Urdu language originated in India, asserted that Urdu could also be spoken fluently by most of the people and disputed the assertion that official status of language and script is essential for the spread of education. \n Communal violence broke out as the issue was taken up by firebrands.  Sir Syed Ahmed Khan  had once stated, \"I look to both Hindus and Muslims with the same eyes & consider them as two eyes of a bride. By the word nation I only mean Hindus and Muslims and nothing else. We Hindus and Muslims live together under the same soil under the same government. Our interest and problems are common and therefore I consider the two factions as one nation.\" Speaking to Mr. Shakespeare, the governor of  Banaras , after the language controversy heated up, he said \"I am now convinced that the Hindus and Muslims could never become one nation as their religion and way of life was quite distinct from one and other.\" \n In the last three decades of the 19th century the controversy flared up several times in  North-Western provinces  and  Oudh . The Hunter commission, appointed by the Government of India to review the progress of education, was used by the advocates of both Hindi and Urdu for their respective causes. \n Gandhi's idea of Hindustani [ edit ] \n Hindi and Urdu continued to diverge both linguistically and culturally. Linguistically, Hindi continued drawing words from Sanskrit, and Urdu from Persian, Arabic and  Chagatai . Culturally Urdu came to be identified with Muslims and Hindi with Hindus. This wide divergence in the 1920s was deplored by  Gandhi  who exhorted the re-merging of both Hindi and Urdu naming it Hindustani written in both Nagari and Persian scripts. [9]  Though he failed in his attempt to bring together Hindi and Urdu under the Hindustani banner, he popularised Hindustani in other non-Hindustani speaking areas. [14] \n Muslim nationalism [ edit ] \n It has been argued that the Hindi–Urdu controversy sowed the seeds for  Muslim nationalism in India . Some also argued that Syed Ahmad had expressed separatist views long before the controversy developed. [9] \n Linguistic purism [ edit ] \n Because of linguistic purism and its orientation towards the pre-Islamic past, Hindi and especially its standard literary form has removed many Persian, Arabic and Turkic loanwords and replaced them with borrowings from Sanskrit (that is, from its own ancestral form). Conversely, Urdu retains the Perso-Arabic words that were introduced into the Khariboli dialect during Muslim rule and in formal settings employs far more Perso-Arabic words than in vernacular Khariboli. \n Hindi to Urdu [ edit ] \n In April 1900, the colonial Government of the North-Western Provinces issued an order granting equal official status to both  Nagari  and  Perso-Arabic  scripts. [15]  This decree evoked protests from Urdu supporters and joy from Hindi supporters. However, the order was more symbolic in that it did not provision exclusive use of Nagari script. Perso-Arabic remained dominant in North-Western provinces and  Oudh  as the preferred writing system until independence. [12] \n C. Rajagopalachari , chief minister of  Madras Presidency  introduced Hindi as a compulsory language in secondary school education though he later relented and opposed the introduction of Hindi during the Madras anti-Hindi agitation of 1965. [16]   Bal Gangadhar Tilak  supported Devanagari script as the essential part of nationalist movement. The language policy of Congress and the  independence movement  paved its status as an alternative  official language of independent India . Hindi was supported by religious and political leaders, social reformers, writers and intellectuals during independence movement securing that status. Hindi, along with English, was recognised as the official language of India during the institution of the  Indian constitution  in 1950. [14] \n See also [ edit ] \n Urdu movement \n Hindi in Pakistan \n Linguistic purism \n History of Hindustani \n Persian and Urdu \n References [ edit ] \n ^  a   b   Maria Isabel Maldonado Garcia (2015).  Urdu Evolution and Reforms . Punjab University Department of Press and Publications, Lahore, Pakistan. p. 223.   \n ^   Abdul Jamil Khan (2006).  Urdu/Hindi: an artificial divide . Algora. p. 290.  ISBN   978-0-87586-437-2 .   \n ^   \"A Historical Perspective of Urdu\" . National Council for Promotion of Urdu language. Archived from  the original  on 11 June 2007 . Retrieved  2007-06-15 .   \n ^   Coatsworth, John (2015).  Global Connections: Politics, Exchange, and Social Life in World History . United States: Cambridge Univ Pr. p. 159.  ISBN   9780521761062 .   \n ^   Tariq Rahman  (2011).  \"Urdu as the Language of Education in British India\"   (PDF) .  Pakistan Journal of History and Culture . NIHCR.  32  (2): 1–42.   \n ^   Sigfried J. de Laet.  History of Humanity: From the seventh to the sixteenth century  UNESCO, 1994.  ISBN   9231028138  p 734 \n ^   The New Cambridge History of India , Volumes 3–5, page 180 \n ^   Maria Isabel Maldonado Garcia, Mustafa Yapici (2014).  \"Common Vocabulary in Urdu and Turkish Languages. A Case of Historical Onomasiology\"   (PDF) .  15  (1). Journal of Pakistan Vision: 193–225.   CS1 maint: Uses authors parameter ( link ) \n ^  a   b   c   d   e   f   g   Language, Religion and Politics in North India by Paul R. Brass, Publisher: iUniverse, Incorporated,  ISBN   978-0-595-34394-2 \n ^   Sumit Sarkar (1983).  Modern India, 1885-1947 . Macmillan. pp. 85–86.  ISBN   978-0-333-90425-1 .   \n ^   John R. McLane (1970).  The political awakening in India . Prentice-Hall. Inc, Englewood Cliffs, New Jersey. p. 105.   \n ^  a   b   c   Religious Controversy in British India by Kenneth W. Jones, p124,  ISBN   0-7914-0827-2   Google book \n ^   Urdu-Hindi Controversy , from  Story of Pakistan . \n ^  a   b   c   d   e   Status Change of Languages by Ulrich Ammon, Marlis Hellinger \n ^   Christopher R. King (1994).  \"Chapter V: The Hindi-Nagari movement\"   (PDF) .  One language, two scripts . Oxford University Press. p. 155.  ISBN   0-19-563565-5 .   \n ^   Venkatachalapathy, A. R. (December 20, 2007).  \"Tongue tied\" .  India Today .   \n External links [ edit ] \n South Asia Analysis Group: Hindi-Urdu controversy \n A century of dedicated service: Anjuman Tarraqqi-i-Urdu , from  Dawn Newspaper \n Urdu Scholarship-Maldonado Garcia \n The poisonous potency of script: Hindi and Urdu   ROBERT D. KING \n v \n t \n e \n Aligarh Muslim University \n History \n Syed Ahmad Khan \n Muhammadan Anglo-Oriental College \n Aga Khan III \n Mohammad Ali Mohammad Khan \n Aligarh Movement \n Pakistan Movement \n All India Muhammadan Educational Conference \n Scientific Society of Aligarh \n Aligarh Institute Gazette \n Tehzeeb-ul-Akhlaq \n Faculty & departments \n Faculty of Arts \n Faculty of Law \n Faculty of Theology \n Faculty of Social Sciences \n Colleges & schools \n Minto Circle \n Ahmadi School for the Visually Challenged \n Women's College \n Jawaharlal Nehru Medical College \n Libraries \n Maulana Azad Library \n Clubs & societies \n Cricket Club \n Horse Riding Club \n Siddons Union Club \n Arts & culture \n Moinuddin Ahmad Art Gallery \n Filmsaaz \n Halls \n Aftab Hall \n Campus \n Aligarh Fort \n Sir Syed Masjid \n People \n Mahendra Pratap \n Jai Kishan Das \n Mufaddal Saifuddin \n Zameer Uddin Shah \n Syed Zafarul Hasan \n Notable alumni  (category) \n v \n t \n e \n Indian Independence Movement \n History \n Colonisation \n Porto Grande de Bengala \n Dutch Bengal \n East India Company \n British Raj \n French India \n Portuguese India \n Battle of Plassey \n Battle of Buxar \n Anglo-Mysore Wars \n First \n Second \n Third \n Fourth \n Anglo-Maratha Wars \n First \n Second \n Third \n Polygar Wars \n Vellore Mutiny \n First Anglo-Sikh War \n Second Anglo-Sikh War \n Sannyasi Rebellion \n Rebellion of 1857 \n Radcliffe Line \n more \n Philosophies \nand ideologies \n Ambedkarism \n Gandhism \n Hindu nationalism \n Indian nationalism \n Khilafat Movement \n Muslim nationalism in South Asia \n Satyagraha \n Socialism \n Swadeshi movement \n Swaraj \n Events and \nmovements \n Partition of Bengal (1905) \n Partition of Bengal (1947) \n Revolutionaries \n Direct Action Day \n Delhi-Lahore Conspiracy \n The Indian Sociologist \n Singapore Mutiny \n Hindu–German Conspiracy \n Champaran Satyagraha \n Kheda Satyagraha \n Rowlatt Committee \n Rowlatt Bills \n Jallianwala Bagh massacre \n Noakhali riots \n Non-Cooperation Movement \n Christmas Day Plot \n Coolie-Begar Movement \n Chauri Chaura incident, 1922 \n Kakori conspiracy \n Qissa Khwani Bazaar massacre \n Flag Satyagraha \n Bardoli \n 1928 Protests \n Nehru Report \n Fourteen Points of Jinnah \n Purna Swaraj \n Salt March \n Dharasana Satyagraha \n Vedaranyam March \n Chittagong armoury raid \n Gandhi–Irwin Pact \n Round table conferences \n Act of 1935 \n Aundh Experiment \n Indische Legion \n Cripps' mission \n Quit India \n Bombay Mutiny \n Coup d'état of Yanaon \n Provisional Government of India \n Independence Day \n Organisations \n All India Kisan Sabha \n All-India Muslim League \n Anushilan Samiti \n Arya Samaj \n Azad Hind \n Berlin Committee \n Ghadar Party \n Hindustan Socialist Republican Association \n Indian National Congress \n India House \n Indian Home Rule movement \n Indian Independence League \n Indian National Army \n Jugantar \n Khaksar Tehrik \n Khudai Khidmatgar \n Swaraj Party \n more \n Social \nreformers \n A. Vaidyanatha Iyer \n Ayya Vaikundar \n Ayyankali \n B. R. Ambedkar \n Baba Amte \n Bal Gangadhar Tilak \n Dayananda Saraswati \n Dhondo Keshav Karve \n G. Subramania Iyer \n Gazulu Lakshminarasu Chetty \n Gopal Ganesh Agarkar \n Gopal Hari Deshmukh \n Gopaldas Ambaidas Desai \n Ishwar Chandra Vidyasagar \n J. B. Kripalani \n Jyotirao Phule \n Kandukuri Veeresalingam \n Mahadev Govind Ranade \n Mahatma Gandhi \n Muthulakshmi Reddi \n Narayana Guru \n Niralamba Swami \n Pandita Ramabai \n Periyar E. V. Ramasamy \n Ram Mohan Roy \n Rettamalai Srinivasan \n Sahajanand Saraswati \n Savitribai Phule \n Shahu \n Sister Nivedita \n Sri Aurobindo \n Syed Ahmad Khan \n Vakkom Moulavi \n Vinayak Damodar Savarkar \n Vinoba Bhave \n Vitthal Ramji Shinde \n Vivekananda \n Independence \nactivists \n Abul Kalam Azad \n Accamma Cherian \n Achyut Patwardhan \n A. K. Fazlul Huq \n Alluri Sitarama Raju \n Annapurna Maharana \n Annie Besant \n Ashfaqulla Khan \n Babu Kunwar Singh \n Bagha Jatin \n Bahadur Shah II \n Bakht Khan \n Bal Gangadhar Tilak \n Basawon Singh \n Begum Hazrat Mahal \n Bhagat Singh \n Bharathidasan \n Bhavabhushan Mitra \n Bhikaiji Cama \n Bhupendra Kumar Datta \n Bidhan Chandra Roy \n Bipin Chandra Pal \n C. Rajagopalachari \n Chandra Shekhar Azad \n Chetram Jatav \n Chittaranjan Das \n Dadabhai Naoroji \n Dayananda Saraswati \n Dhan Singh \n Dukkipati Nageswara Rao \n Gopal Krishna Gokhale \n Govind Ballabh Pant \n Har Dayal \n Hemu Kalani \n Inayatullah Khan Mashriqi \n Jatindra Mohan Sengupta \n Jatindra Nath Das \n Jawaharlal Nehru \n K. Kamaraj \n Kanaiyalal Maneklal Munshi \n Khan Abdul Ghaffar Khan \n Khudiram Bose \n Krishna Singh \n Lala Lajpat Rai \n M. Bhaktavatsalam \n M. N. Roy \n Mahadaji Shinde \n Mahatma Gandhi \n Mangal Pandey \n Mir Qasim \n Mithuben Petit‎ \n Muhammad Ali Jauhar \n Muhammad Ali Jinnah \n Muhammad Mian Mansoor Ansari \n Nagnath Naikwadi \n Nana Fadnavis \n Nana Sahib \n P. Kakkan \n Prafulla Chaki \n Pritilata Waddedar \n Pritilata Waddedar \n Purushottam Das Tandon \n R. Venkataraman \n Rahul Sankrityayan \n Rajendra Prasad \n Ram Prasad Bismil \n Rani Lakshmibai \n Rash Behari Bose \n Sahajanand Saraswati \n Sangolli Rayanna \n Sarojini Naidu \n Satyapal Dang \n Shuja-ud-Daula \n Shyamji Krishna Varma \n Sibghatullah Shah Rashidi \n Siraj ud-Daulah \n Subhas Chandra Bose \n Subramania Bharati \n Subramaniya Siva \n Surya Sen \n Syama Prasad Mukherjee \n Tara Rani Srivastava \n Tarak Nath Das \n Tatya Tope \n Tiruppur Kumaran \n Ubaidullah Sindhi \n V O Chidamabaram \n V. K. Krishna Menon \n Vallabhbhai Patel \n Vanchinathan \n Veeran Sundaralingam \n Vinayak Damodar Savarkar \n Virendranath Chattopadhyaya \n Yashwantrao Holkar \n Yogendra Shukla \n more \n British leaders \n Wavell \n Canning \n Cornwallis \n Irwin \n Chelmsford \n Curzon \n Ripon \n Minto \n Dalhousie \n Bentinck \n Mountbatten \n Wellesley \n Lytton \n Clive \n Outram \n Cripps \n Linlithgow \n Hastings \n Independence \n Cabinet Mission \n Annexation of French colonies in India \n Constitution \n Republic of India \n Indian annexation of Goa \n Indian Independence Act \n Partition of India \n Political integration \n Simla Conference \n v \n t \n e \n Pakistan Movement \n History of Pakistan  ( timeline: 1947–present) \n History \n East India Company \n Indian Rebellion of 1857 \n Aligarh Movement \n Urdu movement \n Partition of Bengal \n Lucknow Pact \n Khilafat Movement \n Shuddhi Movement \n Nehru Report \n Fourteen Points of Jinnah \n Allahabad Address \n Now or Never pamphlet \n World War II \n Two nation theory \n Round Table Conferences \n Lahore Resolution \n Direct Action Day \n Muslim nationalism in South Asia \n Cabinet Mission \n Indian Independence Act \n Partition of India \n Radcliffe Line \n Durand Line \n Pakistan \n Osmanistan \n Enlightened Moderation \n Objectives Resolution \n Independence \n Republic Day \n Kashmir conflict \n National symbols \n Constitution of Pakistan \n British heritage \n Organisations \n Muslim League \n Punjab Muslim League \n Unionist Muslim League \n All India Muslim Students Federation \n Khaksars \n East Pakistan Renaissance Society \n Leaders \n Sir  Syed Ahmad Khan \n Allama  Muhammad Iqbal \n Aga Khan III \n Nawab Salimullah \n Mian  Muhammad Shafi \n Syed Ameer Ali \n Muhammad Ali Jinnah \n Fatima Jinnah \n Liaquat Ali Khan \n Muhammad Zafarullah Khan \n Bahadur Yar Jung \n Nawab Waqar-ul-Mulk Kamboh \n Mohsin-ul-Mulk \n Hasrat Mohani \n Maulana  Shabbir Ahmad Usmani \n Baba-e-Urdu Maulvi Abdul Haq \n G. M. Syed \n Abdur Rab Nishtar \n Qazi Muhammad Essa \n Choudhary Rahmat Ali \n Muhammad Ali Jouhar \n Maulana Shaukat Ali \n A. K. Fazlul Huq \n K. H. Khurshid \n Sikandar Hayat Khan \n Raja Ghazanfar Ali Khan \n Maulana  Zafar Ali Khan \n Khawaja Nazimuddin \n Khan  Abdul Qayyum Khan \n Ghulam Bhik Nairang \n Huseyn Shaheed Suhrawardy \n Ra'ana Liaquat Ali Khan \n Jogendra Nath Mandal \n more \n Activists \n Z. A. Suleri \n Hameed Nizami \n Abdullah Haroon \n Yusuf Haroon \n Altaf Husain \n Adamjee Haji Dawood \n Yusuf Khattak \n Mian Iftikharuddin \n Iftikhar Hussain Khan Mamdot \n Shaukat Hayat Khan \n Muhammad Asad \n Ziauddin Ahmad \n A. B. A. Haleem \n Maulana Ghulam Rasool Mehr \n Hakim Said \n Chaudhry Ghulam Abbas \n Sardar  Muhammad Abdul Qayyum Khan \n Sardar  Muhammad Ibrahim Khan \n Fida Mohammad Khan \n Sheikh Sir Abdul Qadir \n Professor  M. M. Sharif \n more \n Literature \n Idea of Pakistan \n Jinnah: India, Partition, Independence \n Notes on Afghanistan and Baluchistan \n A Short History of Pakistan \n Pakistan: A Personal History \n The Myth of Independence \n Pakistan: A Hard Country \n Now or Never; Are We to Live or Perish Forever? \n Causes of Indian Mutiny of 1857 \n Architecture \n Minar-e-Pakistan \n Bab-e-Pakistan \n The Monument \n Mazar-e-Quaid \n Ziarat Residency \n Iqbal's Tomb \n Wazir Mansion \n National Library \n Deena Public Hall \n Bab-e-Khyber \n Jinnah Terminal \n In Memory \n Youm-e-Pakistan   ( 23 March ) \n Youm-e-Dastur   ( 10 April ) \n Youm-e-Takbir   ( 28 May ) \n Youm-e-Azadi   ( 14 August ) \n Youm-e-Difah   ( 6 September ) \n Youm-e-Tasees   ( 24 October ) \n Youm-e-Iqbal   ( 9 November ) \n Youm-e-Viladat   ( 25 December ) \n v \n t \n e \n Hindi \n Grammar \n Phonology \n Devanagari \n Braille \n History \n Vocabulary \n Hindustani \n Varieties \n Western \n Braj Bhasha \n Bundeli \n Haryanvi \n Kannauji \n Khari Boli  ( Registers : \n Standard Hindi \n Standard Urdu ) \n Sansi Boli \n Eastern \n Awadhi \n Bagheli \n Caribbean Hindi \n Chhattisgarhi \n Fiji Hindi \n Pidgins  and  Creoles \n Bombay Hindi \n Haflong Hindi \n Hinglish \n Language politics \n Anti-Hindi agitations of Karnataka \n Anti-Hindi agitations of Tamil Nadu \n Hindi-Urdu controversy \n Punjabi Suba movement \n Global organizations \n World Hindi Secretariat \n World Hindi Conference \n Arts \n Literature \n Awards \n Sahitya Akademi Award \n Jnanpith Award \n Cinema \n Music \n Writers \n Poets \n v \n t \n e \n Urdu \n History \n Alphabet \n Grammar \n Phonology \n Vocabulary \n Nastaliq \n Braille \n Varieties \n Dialects \n Standard Urdu \n Dakhini \n Hyderabadi \n Rekhta \n Forms \n Aurangabad Urdu \n British Urdu \n Roman Urdu \n Politics \n Urdu movement \n Hindi-Urdu controversy \n Arts \n Awards \n Literature \n Informatics \n Cinema \n Poetry \n Music \n Writers \n Poets \n Progressive Writers' Movement \n Uddin & Begum Romanisation \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Hindi–Urdu_controversy&oldid=809993241 \"\t\t\t\t\t \n Categories :  Pakistan Movement Hindustani language Hindi Urdu Politics of British India History of Hinduism India–Pakistan relations Political controversies 1867 in India Language conflict in India Language versus dialect Muslim politics in India Hidden categories:  CS1 maint: Uses authors parameter Use dmy dates from May 2016 Use Indian English from May 2016 All Wikipedia articles written in Indian English All articles with failed verification Articles with failed verification from February 2017   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n বাংলা हिन्दी اردو   \n Edit links   \n  This page was last edited on 12 November 2017, at 20:03. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}