{"url": "https://www.concordia.ca/students/exchanges/funding/mesrst-bursary.html", "content": "Quebec Mobility Bursary \n Concordia University \n https://www.concordia.ca/content/concordia/en/students/exchanges/funding/mesrst-bursary.html \n Study resources \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links   \n Webmail \n Library \n Cspace \n Study resources    \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services    \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new    \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges    \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links  \n The Campaign for Concordia \n MyConcordia \n Cspace \n Webmail \n Library \n Directories \n A-Z \n Maps \n Future students \n Student hub \n Alumni & friends \n Parents \n Faculty & staff \n Media \n Concordia University \n Concordia University \n Student hub \n Academic resources \n                                                                Studying in Québec\n                                                                Registration & advising\n                                                                Academic regulations\n                                                                Academic integrity\n                                                                Exams\n                                                                Graduation\n                                                                Transcripts\n                                                                Student Success Centre\n Financial matters \n                                                                Costs & budgeting\n                                                                Government student aid\n                                                                Bursaries\n                                                                Work-study program\n                                                                Undergraduate awards\n                                                                Graduate funding\n Campus services \n                                                                Learning support\n                                                                New students\n                                                                Maps & transportation\n                                                                Health & wellness\n                                                                Safety\n                                                                Birks Student Service Centre\n Beyond the classroom \n                                                                Jobs & careers\n                                                                Volunteering\n                                                                Student groups\n                                                                Leadership\n                                                                Recreation & athletics\n                                                                Faith & spirituality\n                                                                Co-curricular record\n Oui Can Help! \n The Campaign for Concordia \n Study resources \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Quick links   \n Webmail \n Library \n Cspace \n Study resources    \n Calendar - Graduate \n Calendar - Undergraduate \n Class schedules \n Class cancellations \n Course registration \n Important academic dates \n More academic resources Campus services    \n Concordia Stores \n IT services \n Job opportunities \n Security \n Shuttle bus \n Student Service Centre (Birks) \n All campus services What's new    \n Calendar of events \n Latest news \n Media Relations Faculties, Schools & Colleges    \n Arts and Science \n Engineering and Computer Science \n Fine Arts \n John Molson School of Business \n School of Graduate Studies \n All Schools, Colleges & Departments \n Information for...  \n Future students \n Student hub \n Alumni & friends \n Parents \n Faculty & staff \n Media \n                    Concordia\r\n                    Directories\r\n Search \n Concordia University \n Student hub \n                    Concordia.ca\r\n\t         / \r\n                    Students\r\n\t         / \r\n                    International programs for Concordia students\r\n\t         / \r\n                    Funding\r\n\t         / \r\n                    Quebec Mobility Bursary\r\n Facebook \n Twitter \n LinkedIn \n GooglePlus \n Quebec Mobility Bursary \n Quebec Mobility Bursary:  2017-18 \n Through limited funding made available by Québec’s  Ministère de l'Éducation et de l'Enseignement supérieur  (MEES), qualified students studying outside Quebec as part of their Concordia degree program can apply for a Quebec Mobility Bursary. Although this Bursary is funded by the Ministère, it is administered jointly by Concordia International and the Concordia Financial Aid and Awards Office. \n How much can I get? \n The amount of your Bursary will depend on where you study: \n $2,500 CAD for each full semester (maximum of 2 semesters) of full-time studies in: Australia, Japan, New Zealand, United States and Western Europe (Austria, Belgium, Denmark, Finland, France, Germany, Greece, Hong Kong Special Administrative Region, China, Iceland, Ireland, Italy, the Netherlands, Norway, Portugal, Singapore, Spain, Sweden, Switzerland, and the United Kingdom. Microstates: Andorra, Luxembourg, Monaco, San Marino, Liechtenstein, and the Vatican City). \n $1,500 CAD for each full semester (maximum of 2 semesters) of full-time studies in all other countries and other provinces in Canada. \n Other conditions:  \n If you are receiving any other scholarships, awards or forms of remuneration (for example, payments, stipends, salaries, etc. for internships, co-op placements or research) for your program outside Quebec, then this amount must be deducted from the amount you are eligible to receive through the Quebec Mobility Bursary. \n Students enrolled at Concordia as part of the cotutelle program are not eligible to receive the Quebec Mobility Bursary. \n American students participating in the U.S. government Federal Student Aid program (FSA) are strongly encouraged to contact the Financial Aid and Awards Office to confirm their program eligibility before finalizing plans to study abroad. \n Am I eligible? \n To be eligible for the Quebec Mobility Bursary, you must meet all of the requirements listed below: \n Be enrolled in a Concordia University Bachelor's, Master's or PhD degree program (certificate and diploma programs are not eligible) and be in good standing at the University. \n Have completed 24 credits at Concordia towards your current Bachelor's degree program or 9 Concordia credits towards your current Master's or PhD program.  \n Participate in a Concordia or independent program of study, internship or research outside Quebec approved for credit towards your Concordia degree on a full-time basis for a minimum of one semester (two months minimum lengh of stay) and a maximum of two semesters. \n Have your Faculty's approval to receive credit for your courses, research project, internship or other activity outside Quebec. \n What types of programs? \n You may apply for a Quebec Mobility Bursary for a variety of programs in addition to the Concordia Student Exchange Program (CSEP)!  For example, if you are participating in a research project or internship outside of Quebec and provide written approval from your Faculty stating you will receive credit towards your degree requirements (and meet the rest of the eligibility requirements), then you may apply for the Bursary. Past Bursary recipients have participated in: \n Concordia Student Exchange Program \n Co-op placements outside Quebec \n Internships for Concordia credit outside Quebec \n Research projects for credit outside Quebec \n Independent study abroad programs \n Other conditions? \n Failure to maintain your enrolment as a full-time student during and/or not receiving the equivalent of full-time credit at Concordia from your program outside Quebec could result in your having to pay back all or a portion of your Bursary. Should you ever fall below full-time enrolment, then you must contact Concordia International immediately. \n How to apply? \n Complete the Quebec Mobility Bursary online application form by  April 1  for the following Summer and/or Fall Semester  or August 1  for the following Winter Semester. \n If you are particpating in the Concordia Student Exchange Program: please submit:    \n Complete  Quebec Mobility Bursary Application \n Attach direct deposit information   \n If you are not participating in the Concordia Student Exchange Program (CSEP), please also attach the following materials to your  Quebec Mobility Bursary Application : \n Students participating in a  Co-op placement  must include: \n A letter from Co-op indicating the terms and dates of your placement, that you will be registered as a full-time student at Concordia while participating in the program and if you are receiving any other compensation as part of your placement. \n  Students participating in an  independent study abroad program   for credit at Concordia  must include: \n A copy of your acceptance letter from your host institution (which must include the semester/program dates). \n A letter/documentation from your Faculty indicating: \n The name of the institution you have permission to attend. \n The semester(s) you have permission to attend this institution. \n The courses you plan to take abroad and how they will transfer to Concordia. \n Students participating in an  independent internship for credit at Concordia  must include: \n A copy of your acceptance letter from your host organization.  It must state where the internship is taking place, the dates and if you are receiving any compensation.  (Again, this compensation and other awards must be deducted from the Bursary and could make you ineligible if it exceeds the Bursary amount for your destination.) \n A letter from the Concordia department or Faculty overseeing your internship.  It must indicate in which course(s) you will be enrolled at Concordia while participating in the internship and the amount of credit you will be receiving.  (Again, you must be enrolled as a full-time student and earn full-time credit for it.  You are also responsible for making sure you are enrolled at Concordia while away as indicated in this letter.) \n Students participating in a  research project for credit at Concordia  must include: \n A copy of your acceptance letter from your host organization.  It must state where the research is taking place, the dates and if you are receiving any compensation.  (Again, this compensation and other awards must be deducted from the Bursary and could make you ineligible if it exceeds the Bursary amount for your destination.) \n A letter from the Concordia department, Faculty or graduate program director overseeing your research.  It must indicate in which course(s) you will be enroled at Concordia while participating in the project and the amount of credit you will be receiving.  (Again, you must be enrolled as a full-time student and earn full-time credit at Concordia while away.).  \n After you apply:  Confirmation of Enrolment (all recipients) \n Within approximately 3-6 weeks after you submit your Quebec Mobility Bursary application, Concordia International will send you an e-mail confirming receipt of your application, preliminary approval and a Confirmation of Enrolment (COE) form.  \n You must return the Conformation of Enrolment form to Concordia International once you arrive at your destination. \n After receiving your Confirmation of Enrolment, Concordia International will forward your completed Mobility Bursary file to the Financial Aid and Awards Office, which will advise you when your bursary payment(s) will be issued. \n If you do not return your Confirmation of Enrolment to Concordia International while you are on sojourn, you will not receive the Mobility Bursary funding. Concordia International will not accept your COE and you will not receive Mobility Bursary funds after your sojourn has ended. \n Please be advised that funds are limited.  We strive to offer Bursaries to as many students as possible, but may have to apply other restrictions and may not be able to offer everyone a Bursary who applies if the number of applicants exceeds the availability of funds. \n Back to top \n © Concordia University \n Concordia University  - Call us at 514-848-2424 \n About \n Academics \n Admissions \n Campus life \n Research \n International \n Future students \n Current students \n Alumni & friends \n Parents  \n Faculty & staff \n Media \n Sir George Williams Campus \n 1455 De Maisonneuve Blvd. W. \n Montreal ,  Quebec ,  Canada \n H3G 1M8 \n See SGW Campus map  \n Loyola Campus \n 7141 Sherbrooke Street W. \n Montreal ,  Quebec ,  Canada \n H4B 1R6 \n See Loyola Campus map  \n facebook \n twitter \n google \n youtube \n linkedin \n pinterest \n instagram \n flickr \n Concordia social \n © Concordia University \n Terms \n Privacy \n Accessibility \n Website feedback \n Share this page \n Concordia.ca \n Call us at \n 514-848-2424 \n Sir George Williams Campus \n 1455 De Maisonneuve Blvd. W. \n Montreal ,  Quebec ,  Canada \n H3G 1M8 \n See SGW Campus map  \n Loyola Campus \n 7141 Sherbrooke Street W. \n Montreal ,  Quebec ,  Canada \n H4B 1R6 \n See Loyola Campus map  \n Website feedback \n Terms \n Privacy \n Accessibility \n © Concordia University"}