{"url": "http://www.osc.gov.on.ca/en/NewsEvents_nr_20170713_misleading-registration-and-changes.htm", "content": "CSA News Release - Canadian securities regulators caution industry about false and misleading registration applications and outline changes to trading supervision reports \n Skip to main content \n Menu \n About \n Our Role Our Structure Governance Accountability International Activities Dealing with the OSC Careers Contact Us \n Securities Law & Instruments \n Legislation Instruments, Rules & Policies Proposed Instruments, Rules & Policies OSC Bulletin Electronic Filing Orders, Rulings & Decisions \n Proceedings \n Before the Commission Before the Courts Cease Trade Orders \n News & Events \n News Releases Speeches & Events Media Room OSC in the Community Reports and Publications OSC Dialogue 2017 \n Investors \n OSC's Role The Investor Office Investor Advisory Panel Check Before You Invest Investor Warnings Learning About Investing Tools & Resources Questions & Complaints \n Industry \n Companies Dealers, Advisers and Investment Fund Managers Investment Funds & Structured Products Marketplaces, SROs & Clearing Agencies Derivatives Participants Industry Resources \n Search Box \n Twitter \n LinkedIn \n Youtube \n Email Alerts \n Rss Feeds \n Français \n Home   /   News & Events   /   News Releases   /   2017   /   CSA News Release - Canadian securities regulators caution industry about false and misleading registration applications and outline changes to trading supervision reports \n            News & Events\n Hide Section Menu   × \n News Releases \n OSC News Releases \n Organizational News Releases \n Regulatory News Releases \n Enforcement News Releases \n OSC Investor Alerts \n CSA News Releases \n Speeches & Events \n Media Room \n Social Media \n OSC in the Community \n Reports and Publications \n OSC Annual Report \n Statement of Priorities \n OSC Investor News \n OSC Dialogue 2017 \n   Section Menu \n For Immediate Release \nJuly 13, 2017 \n Canadian securities regulators caution industry about false and misleading registration applications and outline changes to trading supervision reports \n Toronto  – The Canadian Securities  Administrators (CSA) today published  CSA Staff Notice 33-320  The Requirement for True and Complete  Applications for Registration  to caution firms and individuals about the  potential consequences of submitting false or misleading applications for  registration. \n Each year, CSA staff  receive many applications for registration that omit relevant information or  contain information that is vague or untrue.   \n “The CSA will  continue to hold individuals and firms accountable for false or misleading  applications,” said Louis Morisset, CSA Chair and President and CEO of the  Autorité des marchés financiers. “Applications for registration must be  completed with truth and candour, and we expect firms to have robust policies  and procedures in place to ensure this is the case for any applications they  sponsor.”    \n Applications for  registration are made through a prescribed form that requires the applicant to  disclose information that CSA staff use to assess fitness for registration.  This information includes, but is not limited to, information about current and  previous employment, as well as financial and criminal disclosure.  \n After an  individual becomes registered, if any of the information provided in their  initial application changes, they must update their information using the  prescribed form and within the time periods provided for in National Instrument  33-109  Registration Information .  \n If an individual  discloses false or misleading information to CSA staff, the matter may result  in a denial of registration or in regulatory action being taken against a  registrant. False or misleading statements made during the application process  may also constitute a provincial or criminal offence. CSA staff may also take  regulatory action against anyone complicit in an applicant’s delivery of a  false or misleading application, including the sponsoring firm.   \n The CSA also  published today  CSA Staff Notice 31-349  Change  to Standard Form Reports for Close Supervision and Strict Supervision Terms and  Conditions , which relates to dealing representatives that require enhanced  supervision on their trading activities. The notice describes close and strict  supervision and outlines changes to standard form reports. \n The notices can  be found on CSA members’ websites. \n The CSA, the  council of the securities regulators of Canada’s provinces and territories,  co-ordinates and harmonizes regulation for the Canadian capital markets. \n - 30 - \n For more information: \n Kristen\n            Rose \n            Ontario Securities Commission \n            416-593-2336 \n Hilary McMeekin \n            Alberta Securities Commission \n            403-592-8186   \n            Alison Walker \n            British Columbia Securities Commission \n            604-899-6713  \n            Sylvain Théberge \n            Autorité des marchés financiers \n            514-940-2176\n Jason (Jay) Booth \n            Manitoba Securities Commission \n            204-945-1660 \n Andrew\n            Nicholson \n            Financial and Consumer Services \n            Commission, New Brunswick \n            506-658-3021\n David Harrison \n            Nova Scotia Securities Commission \n            902-424-8586\n Steve Dowling \n            Government of Prince Edward Island, \n            Superintendent of Securities                \n            902-368-6288 \n            John O’Brien \n            Office of the Superintendent of\n            Securities \n            Newfoundland and Labrador \n            709-729-4909\n            Rhonda Horte \n            Office of the Yukon Superintendent \n            of Securities \n            867-667-5466\n            Jeff Mason \n            Nunavut Securities Office \n            867-975-6591 \n Tom\n            Hall \n            Northwest Territories Securities Office \n            867-767-9305\n            Shannon McMillan \n            Financial and Consumer Affairs \n            Authority of Saskatchewan \n            306-798-4160\n Contact  | \n                                     Legal  |\n                                     Legislation  |\n                                     Accessibility  |\n                                     Français \n © Ontario Securities Commission 2017 \n Government of Ontario \n JavaScript is disabled or not supported by this browser. This website works best with JavaScript enabled."}