{"url": "https://m.wikihow.com/Speed-up-a-Windows-XP-Computer", "content": "How to Speed up a Windows XP Computer: 10 Steps (with Pictures) \n Home Random Browse Articles Notifications Add to This Page Add Tip Easy Ways to Help Approve Questions Review Tech Feedback Fix Spelling More Things to Try...   \n Log in / Sign up   \n Desktop Site   \n Reader Approved How to Speed up a Windows XP Computer   \n Windows XP computers may go slower and slower over time. Follow this guide to learn how to speed it up. \n Steps Edit \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/90\\/Speed-up-a-Windows-XP-Computer-Step-1-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-1-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/9\\/90\\/Speed-up-a-Windows-XP-Computer-Step-1-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 1 \n Physically upgrade your computer or get a new one.  Face it: if your computer is old and slow, tweaking Windows itself may not help very much. Sometimes, it may be better to upgrade your computer or get a completely new one.  Upgrading your computer requires some experience in technology. You might need to hire a professional if you want to upgrade your PC but are not willing to do it yourself. \n Upgrade your RAM. More RAM allows programs to start and run faster. \n Upgrade your CPU. Doing so increases program performance. \n Upgrade your graphics. Video editors, gaming, photo editors, etc will benefit from this. \n Upgrade your HDD/SSD. A larger HDD/SSD and a faster one will speed up your computer. \n If you're considering a new computer, do your research before deciding what to buy. A wrong choice may cost you more money or get you a worse computer. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/7f\\/Speed-up-a-Windows-XP-Computer-Step-2-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-2-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/7f\\/Speed-up-a-Windows-XP-Computer-Step-2-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 2 \n Regularly use  CCleaner  to clean your computer.  Over time, your computer may become cluttered with unnecessary files that can slow it down. CCleaner is a free program which can remove these files for free. CCleaner also comes with a free registry cleaner, although  Microsoft recommends not to use registry cleaners .\n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/b\\/b4\\/Speed-up-a-Windows-XP-Computer-Step-3-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-3-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/b\\/b4\\/Speed-up-a-Windows-XP-Computer-Step-3-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 3 \n Remove Spyware and Viruses.  Spyware and viruses are leading causes of slowdown because you may have several spyware cookies or trojans that are taking up your processor time for reading and storing and reporting your activity to several spy databases. Read  Rid-Your-Computer-of-Adware,-Spyware-and-Viruses  to learn how to remove them and speed up your system. Update and run your spyware and virus software every week.\n If you do not have tools installed to protect against malware and spyware then you can download  Spyware Blaster , and for viruses, download a free copy of  AVG - \" A nti- V ir  G uard\"  or this one  Avira - \" A nti- Vira  guard\"  ( all three of those are  free \"For Personal Use\"), all three are also available in  Business or Pro  versions. Also, Microsoft's  Windows Defender  is a widely-used  anti-spyware tool  that is currently distributed freely for users with a \"Genuine\"  verified  copy of Windows. \"Windows Defender\" is also included with other Microsoft services and products such as \"Live OneCare\" and \"Vista.\" \n Download and install  Mozilla Firefox , Opera or Google Chrome. It will allow you to import all of your Internet Explorer settings, and is much less prone to malware than Microsoft Internet Explorer. It will prompt you with a \"Set as Default Browser\" message. Check \"Don't show this again\" and click \"Yes\". Firefox also has a cool feature to delete cookies, cache, and temporary internet files each time you close it. You are strongly recommended to use this option. It can speed up your internet experience. You should also check Google Chrome which is noticeably faster and less prone to virus attacks from internet  Chrome . \n If you have a really complicated virus infection, try using the  Quick Virus Remover . It is a free utility, though not a replacement for commercial products but can be helpful for removing some of the most common viruses infecting your system. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/ae\\/Speed-up-a-Windows-XP-Computer-Step-4-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-4-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/ae\\/Speed-up-a-Windows-XP-Computer-Step-4-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 4 \n Perform a disk clean up.  Clean up your disk quickly to remove unnecessary files.\n Click Start in the bottom left corner, then click Run. \n Type, \"cleanmgr.exe\" in the text field. \n Click OK to start Disk Cleanup. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/66\\/Speed-up-a-Windows-XP-Computer-Step-5-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-5-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/66\\/Speed-up-a-Windows-XP-Computer-Step-5-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 5 \n Remove unwanted/unneeded software which may be the reason for slowdown. \n Click Start, then click Control Panel. \n Click Add/Remove Programs. \n Right click any unnecessary software and click \"Remove\". \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/8c\\/Speed-up-a-Windows-XP-Computer-Step-6-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-6-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/8\\/8c\\/Speed-up-a-Windows-XP-Computer-Step-6-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 6 \n Defragment Your Computer .  This will place similar files physically closer on the hard disk and will help improve load speeds.\n Click Start then click Run. \n Type, \"dfrg.msc\" in the text field. \n Click OK to open Windows Disk Defragmenter. \n Click Analyze to determine whether you need to defrag your disk and click Defrag to defrag the disk. \n Do not defrag solid state drives. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a5\\/Speed-up-a-Windows-XP-Computer-Step-7-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-7-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/a\\/a5\\/Speed-up-a-Windows-XP-Computer-Step-7-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 7 \n Stop unnecessary start-up programs.  Limit the number of programs that automatically start when your computer turns on.\n Click the Start button then Run. \n Type \"msconfig\" and click OK to open System Configuration. \n In System Configuration, go to the Startup tab and uncheck any programs which are not required.\n If you are not sure what some of the programs listed are, you can search them up online to see if they are safe to disable. \n Click OK on the System Configuration window to save the changes.\n If you encounter problems after disabling some startup programs, re-open System Configuration and choose \"Normal Startup\" from the General tab. \n Programs can also schedule unnecessary tasks to launch automatically when Windows starts. To stop such tasks, use Windows Task Scheduler. To open Windows Task Scheduler, click Start, click All Programs, point to Accessories, point to System Tools, and then click Scheduled Tasks. \n Disable all Services you do not use or need. Open Control Panel, click Administrative Tools, and select Services. Right click the services you want to disable and select \"Properties\", then set the start-up type to manual to disable them. Disabling the wrong services may lead to serious problems that you may not notice right away. You should not disable services if you are not experienced in this area. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/74\\/Speed-up-a-Windows-XP-Computer-Step-8-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-8-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/74\\/Speed-up-a-Windows-XP-Computer-Step-8-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 8 \n Free up graphics resources.  Turning off the fancy Windows XP graphics will noticeably increase the speed of your computer.\n Go to Start, right click Computer in the Start menu, and click Properties. \n Go to the Advanced tab. Click the Settings button under Performance. \n Select the \"Adjust for best performance\" option, then click OK. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/74\\/Speed-up-a-Windows-XP-Computer-Step-9-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-9-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/7\\/74\\/Speed-up-a-Windows-XP-Computer-Step-9-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 9 \n Set Page File size. \n Go to Start, right click Computer, and select Properties. \n Go to the Advanced tab. Click the Settings button under Performance. \n Now switch to the Advanced tab of the new dialog box that opens and click on '\"Change\" under Virtual Memory. \n You will see \"Initial Size (MB)\" and the \"Maximum Size (MB)\". \n Change 'Initial Size' to the same value as 'Maximum Size' then click set. \n NOTE: When your computer consumes your computer's hard drive and uses it as RAM, it is referred to as thrashing. Thrashing is bad for your computer and buying RAM (it's not that expensive) is much more worthwhile. \n {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/66\\/Speed-up-a-Windows-XP-Computer-Step-10-Version-3.jpg\\/v4-460px-Speed-up-a-Windows-XP-Computer-Step-10-Version-3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/66\\/Speed-up-a-Windows-XP-Computer-Step-10-Version-3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570} \n 10 \n Set Priorities.  Press Control+Alt+Delete at the same time or right click your task-bar and select Task Manager. Once Task Manager opens, click the Processes tab. Now, find \"explorer.exe\", right click it, and set the priority to real-time. This makes your computer focus on explorer.exe, which is Windows Explorer (the program you view files on your computer in and your task-bar and Start menu). This method greatly increases speed of Windows Explorer and if other programs you use are slow, you can also set their priority.\n Advertisement \n Community Q&A \n Search \n Add New Question \n How do I know what is safe to delete on my disk cleanup? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\t Ethan Mellow   \n Disk cleanup shows the files that are safe to delete. It won't kill your computer. \n Thanks! \n 6 \n 0 \n How can I speed up Windows even more? \n\t\t\t\t\t\t\t\tAnswered by  \n\t\t\t\t\t\t\t\twikiHow Contributor\t\t\t\t\t\t\t \n Clean out all the physical hardware with a duster can.  \n Thanks! \n 10 \n 3 \n How do I make my computer work properly? \n Answer \n Show more unanswered questions \n Ask a Question \n 200 characters left \n Submit \n Video Edit \n Tips Edit \n Do all the above steps quite often to maintain the speed of your PC. \n 49 \n Helpful? \n   17 \n Download Ccleaner from majorgeeks.com. It's a good freeware program, and if you don't use other unnecessary programs, you will be able to gain a lot of space. It also gives you other features such as:\n Startup Manager and \n Registry Cleaner. \n 0 \n Helpful? \n   0 \n For best results, run defragmenter last after performing all other steps and do not use your computer while defragmenter is running. \n 22 \n Helpful? \n   14 \n If this is your first defrag, do it after the disk clean up twice, then a disk defrag, and then another disk clean up. It is suggested to defrag your hard drive weekly. \n 25 \n Helpful? \n   25 \n Clean your Computer's Inside. Dust off the fans, gently wash the monitor screen, and clean the keyboard/mouse. Dust blocking the fans and heat sink inside the computer can cause performance problems, including memory problems. \n 16 \n Helpful? \n   18 \n Also go to Start/Run type in %temp% and delete them all. \n 20 \n Helpful? \n   34 \n Optimize the registry with a third-party application. Many of these registry tweaking programs are available on the Internet, including freeware, shareware and commercial applications that are released as free trials. If you are not familiar with the registry, do  not  try to edit it manually -- the registry is vital to Windows' operation. \n 8 \n Helpful? \n   16 \n Although time-intensive, a re-partition and re-format of the hard disk drive, along with a clean installation of Windows XP will improve performance. Performing this task will remove all of your existing data, so a back-up or file copy is recommended first. Only save the files you created, as you will need to reinstall each application on the new installation of Windows. If you did not change the default location when saving documents, it may be safe to copy only the user folder and all files and folders within it (ie: \"C:\\Documents and Settings\\(your user name)\"). Typically, most users will need to be sure to copy these files: \n Documents created using applications such as Microsoft Word or similar office suite programs \n Bookmarks/Favorites from your Internet browser \n Fonts installed that are not included by default with Windows (note that some fonts are installed by applications). \n E-mail in-box and folders if you use an e-mail client that does not use an Internet browser \n Any schedule data for programs such as Outlook \n Financial records for programs such as Quicken \n 0 \n Helpful? \n   0 \n Run an alternate Windows shell to save on RAM usage and boost performance (Alternative shells for Windows). Although more expensive, installing additional RAM is a better option. Running an alternate shell is a compatibility risk as many proprietary Microsoft programs, such as their latest game or Visual Studio, may not function properly on a third-party shell. \n 2 \n Helpful? \n   2 \n Add \n Warnings Edit \n Always create a restore point before uninstalling software, even better before you start any step. \n 13 \n Helpful? \n   6 \n Using a registry cleaning software will have  very little  improvement, if any. Many registry editors imply that registry problems are much worse than they are, or are spyware/adware. In general, do not bother unless there is a problem which requires adjusting the registry. \n 7 \n Helpful? \n   4 \n Be careful when using msconfig. Do not uncheck unfamiliar items, and do not experiment with settings in any other tab. Doing so could prevent your Windows install from booting! \n 7 \n Helpful? \n   8 \n Related wikiHows Edit \n How to  Speed Up a Slow Windows Computer for Free \n How to  Defragment a Disk on a Windows Computer \n How to  Tune up Your Windows XP PC \n How to  Maximize the Speed of Your Internet Connection \n How to  Back up a Computer \n How to  Alter Startup Programs in Windows XP \n How to  Change a Computer Hard Drive Disk \n How to  Reset the Update Interval in Windows XP Task Manager \n How to  Check Your Chrome Downloads \n How to  Clean up a Slow Performing Computer \n How to  Optimize Your PC Performance \n How to  Fix the Application Error 0xc000007b Using AIO 210 \n Advertisement \n About This Article \n How helpful is this? \n\t\t\t\tCo-authors:   92 \n Updated:  \n\t\t\t\tViews:  2,181,069 \n\t\t\t\tCategories:  System Maintenance and Repair  |  XP Instructions \n Sources and Attribution \n Reader Success Stories \n\t\t\t\t\t\tRK\n Robert Kidder \n May 22 \n\t\t\t\t\"This article was very helpful, I was able to speed up my computer using Windows XP. Thank you!\"\n Rated this article:  \n\t\t\t\t\t\tRA\n Ramanathan A. R. \n Dec 20, 2016 \n\t\t\t\t\"It was a comprehensive guide on speed-up of PC.\"\n\t\t\t\t\t\tAK\n Anil Kumar \n Sep 24, 2016 \n\t\t\t\t\"It helped me greatly.\"\n More reader stories \n All reader stories \n Hide reader stories \n Share your story \n Is this article up to date? \n Yes \n No \n\t\t\t\tNo\n\t\t\t\t\t\t{{questionText}}\n\t\t\t\t\t\t{{currentMethod}}\n\t\t\t\t\t{{cheerText}}\n\t\t\t\t\t{{oopsText}}\n\t\t\t\tYes\n How To Speed up Your Computer \n Share \n Steps Community Q&A Video Tips Warnings Related wikiHows \n Surprise Me! \n 234"}