{"url": "http://www.stm.info/en/info/fares/opus-cards-and-other-fare-media/opus-card", "content": "OPUS card | Société de transport de Montréal \n Go to main content \n Go to search field \n Go to level 1 main menu \n Go to level 2 sub-menu \n Go to level 3 sub-menu \n Go to additionnal content \n Go to footer \n Société de transport de Montréal \n Société de transport de Montréal \n Menu \n Getting around \n Getting around \n Useful info \n   Networks \n Métro \n Bus - Schedules \n Shared taxibus \n      See all       \n   Service updates \n Métro service updates \n Bus service updates \n STM Works \n      See all       \n   Fares \n Download current fare schedule (PDF) \n OPUS cards  and other fare media \n Transit fares \n      See all       \n   Customer service \n Contact us \n Customer service centres \n Lost and found \n      See all       \n   Advice for passengers \n 5 ways to view bus schedules \n Tools to stay informed during service disruptions \n Visitors \n      See all       \n   Rules and safety \n Rules and regulations \n Travelling safely \n Statements of offence and fines \n      See all       \n   Accessibility \n Using public transit in a wheelchair \n Elevator access to the métro \n Accessibility for the visually or intellectually disabled \n      See all       \n To Useful info \n Paratransit \n   About Paratransit \n What is paratransit? \n Paratransit customer service \n Transport Contact newsletter \n      See all       \n   Admission \n Application form \n Eligibility criteria \n OPUS ID Card \n      See all       \n   Titles and fares \n Fares and Fare media accepted by Transport adapté \n Exact change \n 1 trip \n      See all       \n   Using paratransit \n Area served \n Types of trips \n Operating hours \n      See all       \n   Tips and guidelines \n Preparing for trips \n Mobility aids \n Luggage items and special equipment \n      See all       \n   Forms \n      See all       \n To Paratransit \n Offers and outings \n   Benefits \n Exclusive offers \n Contests \n      See all       \n   Outings \n Events \n Great places for great gatherings \n Montréal 375th anniversary \n      See all       \n   In transit \n Étoiles du métro \n Lire vous transporte \n Exhibition at Escale \n      See all       \n   Newsletters \n Society in Motion \n Discover our newsletter \n      See all       \n   Boutique STM \n Boutique \n      See all       \n To Offers and outings \n About \n   Discover the STM and its history \n History \n Art in the métro \n The STM's archives \n      See all       \n   Major projects \n AZUR Métro \n iBUS \n Bus preferential measures (BPM) \n      See all       \n   Corporate governance \n Board of directors \n Board members \n Taking part in the Board’s work \n      See all       \n   Financial and Corporate Information \n About the STM \n Organisational Strategic Plan 2025 \n Budget and Reports \n      See all       \n   Surveys and consultations \n Join your voice \n Electric buses \n Boarding through all doors \n      See all       \n   Business zone \n Commercial activities \n Partnerships and permissions \n Groups \n      See all       \n   Developers \n Available data description \n Terms of Use \n      See all       \n   Accessibility \n Universal accessibility \n Web accessibility \n      See all       \n To About \n Networks   \n Service updates   \n Fares   \n Customer service   \n Advice for passengers   \n Rules and safety   \n Accessibility   \n Contact us   \n Jobs   \n Business zone   \n Press room   \n Ma STM   \n Français \n Search within this site \n OPUS card \n Useful info \n Fares \n OPUS cards  and other fare media \n OPUS card \n Download current fare schedule (PDF)   \n OPUS cards  and other fare media   \n OPUS card   \n OPUS reduced fare - Students   \n OPUS reduced fare - 65 years and over   \n Tickets   \n Occasional card   \n Registered OPUS card   \n OPUS en ligne- Card reader   \n Transit fares   \n Subscriptions   \n Special offers   \n Buying large quantities of transit fares   \n Transfers   \n Points of sale   \n List of authorized retailers   \n OPUS card purchase \n Recharging an OPUS card \n Registering your OPUS card - Protection against loss or theft \n How to use the OPUS card \n Lost or stolen card \n Damaged or malfunctioning card \n Replacement of an expired OPUS card without a photo \n   An OPUS card is a smart card on which you can charge all STM transit fares, with the exception of group fares, which are available on tickets only. OPUS cards are used by most transit authorities in the Greater Montréal area, and in the Québec City area.   OPUS card purchase   OPUS card  without a photo : can be loaded with regular fare tickets and passes.   Get your card from fare collectors or vending machines in métro stations and at other  points of sale . When you buy an  OPUS card for $6 , you must charge it with a fare for at least one trip. Please note: OPUS card is not refundable.  \t      Texte important   OPUS cards without a photo are valid for 4 years. Go to  carteopus.info  to look up your card's expiry date.       OPUS card  with a photo : Only if you are entitled to pay the reduced fare.  Read here about obtaining one .     Ouvrir la section:  Cost and validity period of an OPUS card  without a photo      Validity period   Cost    4 years   $6   Go to  carteopus.info  to find out when your OPUS card without photo is due to expire and conditions for replacing it. Card issuing fees apply when replacing this card.   Close       Ouvrir la section:  Cost and validity period of an OPUS card  with a photo      OPUS card with photo       Validity period       Cost   6 -11 years   Until October 31 in the year the child turns 12   $6   12 -14 years   2 years   $15   15 -25 years   1 year  \t\t\t\t\t\tIf you turn 26 during the school term (after October 31), your fare privilege will terminate August 31 of the following year.    $15   65 and over   7 years   $15   Expiry date appears on back of OPUS cards with photo. Card issuing fees apply to all card replacements.    Close     Recharging an OPUS card   You can recharge a valid OPUS card with your choice of transit fares:   Online at  opusenligne.ca  using a computer and OPUS card reader   In the métro: at a fare vending machine, a recharging terminal, or a ticket booth   At  points of sale  throughout the city   Registering your OPUS card - Protection against loss or theft   Registering your OPUS card without a photo provides you with a guarantee in the event your card is lost or stolen. You can have it replaced and recoup any transit fares left over when you reported the card missing.   Fare replacement guarantee is automatic for OPUS cards with a photo.   How to register your OPUS card without a photo?   In person: go to the  customer service centre or to a service point    Online :  your request will be processed within 10 business days.   Learn more about registered OPUS cards without a photo   How to use the OPUS card   Hold your OPUS card above the fare box on the bus or the card reader on the métro turnstile.   Hold it steady for a few seconds while card is validated.   Validation is confirmed by a green or yellow light and an audio signal (beep).   Lost or stolen card     Ouvrir la section:  Loss or theft of an unregistered OPUS card without a photo     You must buy a new OPUS card and charge it with a new fare. We encourage you to register your next OPUS card as a guarantee against loss or theft.   Close       Ouvrir la section:  Loss or theft of a registered OPUS card without a photo     Go to the  Customer service centre  or a  point of service  with a photo ID card. You will be given a new OPUS card charged with any fares remaining on the old one when you reported it lost or stolen. You will pay only the cost of a new OPUS card.   Close       Ouvrir la section:  Loss or theft of an OPUS card with a photo     Go to the  STM photo studio  or a  point of service  with a photo ID card. You will receive a new OPUS card charged with any fares remaining on the old one when you reported it lost or stolen. You will pay only the cost of a new OPUS card with photo.   Close     Damaged or malfunctioning card   Go to the  Customer service centre  or a  point of service  to replace your OPUS card.   If your card was damaged by misuse, you will have to pay the cost of a new card.  \tIf your card is defective, it will be replaced free of charge.   Be advised that you must pay your fare, as usual, even when going to a customer service centre or service point to replace a card.   Our advice: Protect your OPUS card by keeping it in a plastic sleeve.   Replacement of an expired OPUS card without a photo   Your OPUS card expires after four (4) years. To find out your card's expiry date, go to  carteopus.info   Our advice: Replace your OPUS card without a photo within 90 days of its expiration date.     Ouvrir la section:  OPUS cards with a serial number higher than 02-2461523030     If your valid or expired card is empty of fares or only has a monthly or weekly STM pass:  buy a new card.   If your valid or expired card has any of these STM fares:  single or multiple trips, Unlimited Evening, Unlimited Weekend, 1-day or 3-day pass, take your card and go to a customer service centre or service point.   If your card is still valid and has fares from other transit organizations : take your card and go to an STM service centre or your transit provider's service point.  If your card has already expired,  bring your card and go to your transit organization's customer service centre.     Texte important   Card issuing fees apply when replacing an expired OPUS card without a photo.     Our advice   Please note that your card's registrered status is not automatically transferred onto your new card by either fare controllers or authorized retailers. Please fill out the  electronic form  or drop by the Customer service centre or one of our service points to register your new card.   Close         Ouvrir la section:  OPUS cards with a serial number inferior to 02-2461523030       If your valid or expired card is empty of fares or only has a monthly STM pass for current month:  go to a métro ticket counter or service point   If your valid or expired card has any of these STM fares:  single or multiple trips, Unlimited Evening, Unlimited Weekend, 1-day or 3-day pass, weekly Hebdo pass, take your card and go to a customer service centre or service point.   If your card is still valid and has fares from other transit organizations : take your card and go to an STM service centre or your transit provider's service point.  If your card has already expired,  bring your card and go to your transit organization's customer service centre.     Texte important   Expired OPUS cards without a photo with a serial number inferior to 02-2461523030 are replaced free of charge.     Our advice   Please note that your card's registrered status is not automatically transferred onto your new card by either fare controllers or authorized retailers. Please fill out the  electronic form  or drop by the Customer service centre or one of our service points to register your new card.   How to obtain a refund if you already purchased a new card:     Ouvrir la section:  In person     Go to the  STM Customer service centre or one of its service points  and bring the following with you:   Your original purchase receipt for the new OPUS card (it will be returned to you)   Your expired OPUS card (or about to expire in less than 90 days)   Your new OPUS card   As the registered status of your card is not automatically transferred onto the new card, take this opportunity to register your new OPUS card.           Ouvrir la section:  By mail     Fill out the  form  by providing all required information.   Send in: \t\t\t\t\t\t\t your expired OPUS card  or  the one that expires in less than 90 days   the original purchase receipt for the new OPUS card (If you purchased a monthly CAM pass, an equivalent official receipt will be forwarded to you.)   the duly completed  form .     Forward all documents to this address:  \t\t\t\t\t\t\tSTM  \t\t\t\t\t\t\tPO Box 248  \t\t\t\t\t\t\tSuccursale Place D’Armes  \t\t\t\t\t\t\tMontréal, Québec, H2Y 3G7   How you    will    be refunded:   The $6.00 purchase price of the new card will be refunded in the form of: a two-trip fare, valid within the bus and métro system, loaded onto an occasional smart card.   Remaining fares on your expired card will be loaded onto an occasional smart card.   Please note that postage fees will not be refunded.     Texte important   Your card was registered?   Be advised that the registered status of your OPUS card is not automatically transferred onto your new card. You must register your new card again.   To do so, please complete the  electronic form  or drop by the Customer service centre or one of our service points.         Close       General advice about OPUS cards   \n Top of page \n Subscribe to métro service alerts from your My STM account   Receive service alerts by email or SMS messaging informing you of any métro service disruptions lasting more than 10 minutes.   To subscribe or change your profile     \n Useful links   Fares schedule   747 Aéroport P.-E.-Trudeau / Centre-ville shuttle   Visitors   Find a point of sale   OPUS en ligne online fare purchasing service   Registered OPUS card   Customer service   \n Useful links   OPUS CARD   Customer service   Lost and found   Visitors   \n Quick links \n Answer to surveys \n Network Accessibility \n 5 ways to obtain bus timetables \n Benefits \n Customer service \n Facebook \n Twitter \n YouTube \n Instagram \n        ©  STM  1997-2017       \n Bus network \n Metro Network \n Legal Notices \n Developers \n Web Accessibility \n Site Plan \n Keep in touch"}