{"url": "http://www.w3.org/Translations/WCAG20-fr/", "content": "Règles pour l'accessibilité des contenus Web (WCAG) 2.0 \n [ accès aux contenus ]  \n Web Content Accessibility\nGuidelines (WCAG) 2.0 \n Lead translating\n  organization : \n Association BrailleNet \n INSERM - UPMC B23 \n 9 quai Saint Bernard \n 75252 Paris Cedex 05 \n France \n Web site :  http://www.braillenet.org/ \n Coordinator of the translation :\n      Sylvie DUCHATEAU ( e-mail:  sylvie.duchateau@accessiweb.org ) \n Traduction Française\nAgréée \n Publication le 25 juin 2009 \n Cette version : \n http://www.w3.org/Translations/WCAG20-fr/WCAG20-fr-20090625/ \n Version la plus récente : \n http://www.w3.org/Translations/WCAG20-fr/ \n Version originale (anglais) : \n http://www.w3.org/TR/WCAG20/ \n Errata : \n http://www.braillenet.org/accessibilite/wcag20/errata.html . \n Organisation coordinatrice de la traduction : \n Association BrailleNet \n INSERM - UPMC B23 \n 9 quai Saint Bernard \n 75252 Paris Cedex 05 \n France \n Site Web :  http://www.braillenet.org/ \n Coordinatrice de la traduction : Sylvie DUCHATEAU (courriel :  sylvie.duchateau@accessiweb.org ) \n Partenaires du comité de traduction : \n 19 décembre 2008 :  notification\n      d'intention au  W3C  pour devenir l'Organisation Leader de la\n      Traduction ( LTO ) et pour présenter la  liste\n      des partenaires du comité de traduction des  WCAG  2.0 en français . \n Résumé des commentaires publics sur la Traduction Candidate\n  Agréée ( CAT ) : \n http://www.braillenet.org/accessibilite/wcag20/resume_public.html . \n Ceci est une traduction autorisée d'un document du  W3C . La\npublication de cette traduction a suivi les étapes décrites dans la  Politique des\nTraductions Autorisées du  W3C . En cas de litiges, la version\nfaisant foi est le document original en anglais. \n Règles pour l'accessibilité des contenus\nWeb (WCAG) 2.0 \n Recommandation du W3C 11\ndécembre 2008 \n Version actuelle (anglais) : \n http://www.w3.org/TR/2008/REC-WCAG20-20081211/ \n Version la plus récente (anglais) : \n http://www.w3.org/TR/WCAG20/ \n Ancienne version (anglais) : \n http://www.w3.org/TR/2008/PR-WCAG20-20081103/ \n Auteurs : \n Ben Caldwell,  Trace R&D\n      Center , Université du  Wisconsin-Madison \n Michael Cooper, W3C \n Loretta Guarino Reid,  Google,\n    Inc. \n Gregg Vanderheiden,  Trace R&D\n      Center , Université du  Wisconsin-Madison \n Anciens auteurs : \n Wendy Chisholm (jusqu'à juillet 2006 lorsqu'elle était au W3C) \n John Slatin (jusqu'à juin 2006 lorsqu'il était à  Accessibility Institute , Université du  Texas  à  Austin ) \n Jason White (jusqu'en mai 2005 lorsqu'il était à Université de  Melbourne ) \n Se reporter aux  errata (en\nanglais)  de ce document, qui peuvent contenir des corrections\nnormatives. \n Voir aussi  les\ntraductions (en anglais) . \n Ce document est également disponible dans des formats qui ne sont pas\nnormatifs, consultables à  autres versions des\nrègles pour l'accessibilité des contenus Web 2.0 (en anglais) . \n Copyright  ©\n2008  W3C ®  ( MIT ,  ERCIM ,\n Keio ), All Rights Reserved. W3C  liability ,\n trademark \nand  document\nuse  rules apply. \n Copyright  © 2008  W3C ®  ( MIT ,  ERCIM ,\n Keio ), tous droits réservés. La  déclaration\nde responsabilité (en anglais) , les  droits\nd'utilisation de la marque (en anglais)  et la  licence\nd'utilisation de ce document (en anglais)  du W3C s'appliquent. \n Résumé \n Les Règles pour l'accessibilité des contenus Web (WCAG) 2.0 présentent un\nlarge éventail de recommandations pour rendre les contenus Web plus\naccessibles. Suivre ces règles rendra les contenus accessibles à une plus\ngrande variété de personnes en situation de handicap, incluant les personnes\naveugles et malvoyantes, les personnes sourdes et malentendantes, les personnes\nayant des troubles d'apprentissage, des limitations cognitives, des limitations\nmotrices, des limitations de la parole, de la photosensibilité et les\npersonnes ayant une combinaison de ces limitations fonctionnelles. Suivre ces\nrègles rendra aussi les contenus Web souvent plus faciles d'utilisation aux\nutilisateurs en général.  \n Les critères de succès des WCAG 2.0 sont écrits sous la forme d'énoncés\ntestables qui ne se rattachent pas à une technologie particulière. Des\nconsignes sur la façon de satisfaire à un critère de succès spécifique\npour une technologie particulière ainsi que de l'information générale à\npropos de l'interprétation d'un critère de succès sont données dans des\ndocuments distincts. Voir  Vue d'ensemble des Règles pour l'accessibilité des contenus Web\n(en anglais)  à titre d'introduction et suivre les liens vers la\ndocumentation technique et pédagogique sur les WCAG. \n Les WCAG 2.0 remplacent les  Règles pour l'accessibilité des contenus Web 1.0 (en\nanglais)   [WCAG10]  qui ont été publiées comme\nRecommandation du W3C en mai 1999. Bien qu'il soit possible de se conformer\naussi bien aux WCAG 1.0 qu'aux WCAG 2.0 (ou aux deux), le W3C recommande que\nles nouveaux contenus et les contenus mis à jour utilisent les WCAG 2.0. Le\nW3C recommande aussi que les politiques d'accessibilité se réfèrent aux WCAG\n2.0. \n Statut du présent document \n Cette section décrit le statut de ce document au moment de sa\npublication. D'autres documents peuvent remplacer ce document. Une liste des\npublications actuelles du W3C et la dernière version corrigée de ce rapport\ntechnique peuvent être trouvées dans le  catalogue des rapports techniques du W3C (en anglais)  sur  http://www.w3.org/TR/ . \n Ceci est la  Recommandation du W3C (en anglais)  sur les Règles pour\nl'accessibilité des contenus Web (WCAG) 2.0 émanant du  groupe de travail sur les\nRègles pour l'accessibilité des contenus Web . \n Ce document a été passé en revue par les membres du W3C, par des\ndéveloppeurs de logiciels et par d'autres groupes du W3C et par des tiers\nintéressés ; il a été approuvé par le directeur en tant que\nrecommandation du W3C. C'est un document stable pouvant être utilisé comme\nréférence ou cité dans un autre document. Le rôle du W3C, dans\nl'élaboration de cette recommandation, est d'attirer l'attention sur les\nspécifications et d'en promouvoir le large déploiement. Ceci améliore la\nfonctionnalité et l'interopérabilité du Web. \n Les WCAG 2.0 sont soutenues par des documents non-normatifs associés,  Comprendre les\nWCAG 2.0 (en anglais)  et  Techniques pour les WCAG 2.0 (en anglais) . Bien que ces\ndocuments n'aient pas le statut formel des WCAG 2.0, ils fournissent\nd'importantes informations pour comprendre et implémenter les WCAG. \n Le groupe de travail demande que tous les commentaires soient faits en\nutilisant le  formulaire de commentaire en ligne (en anglais) . Si cela\nn'est pas possible, les commentaires peuvent également être envoyés à  public-comments-wcag20@w3.org .\nLes  archives de la liste de commentaires publics (en anglais) \nsont accessibles au public. Les commentaires reçus concernant la\nRecommandation des WCAG 2.0 ne peuvent entraîner de modifications de cette\nversion des règles, mais peuvent être pris en compte dans des errata ou dans\nde futures versions des WCAG. Le groupe de travail n'envisage pas de produire\ndes réponses formelles aux commentaires. Les archives des  listes de\ndiscussions du groupe de travail sur les WCAG (en anglais)  sont publiques\net les travaux futurs entrepris par le groupe de travail pourront tenir compte\ndes commentaires reçus sur ce document. \n Ce document fait partie des travaux de l' Initiative pour l'accessibilité du WEB (en anglais)  (WAI) du\nW3C. Les objectifs du groupe de travail sur les WCAG sont présentés dans la\n charte du groupe\nde travail sur les WCAG (en anglais) . Le groupe de travail sur les WCAG\nfait partie de l' activité technique de la WAI (en anglais) . \n Ce document a été produit par un groupe œuvrant dans le cadre de la  politique de brevets du W3C du 5 février 2004 (en anglais) .\nLe W3C conserve une  liste publique de toutes les divulgations des\nbrevets (en anglais)  faites en relation avec les livrables du groupe ;\ncette page inclut également les instructions concernant la divulgation d'un\nbrevet. Un individu ayant la réelle connaissance d'un brevet dont il pense\nqu'il contient des «  droits essentiels (en anglais)  », doit révéler cette\ninformation en accord avec la  section 6 de la politique des brevets du W3C (en anglais) . \n Table des matières \n Introduction  \n Les différents niveaux de lecture\n        des WCAG 2.0  \n Les documents d'accompagnement des WCAG\n        2.0 \n Les termes importants des WCAG 2.0 \n Les Règles des WCAG 2.0 \n Principe 1 : perceptible \n 1.1  Proposer des équivalents textuels à\n            tout contenu non textuel qui pourra alors être présenté sous\n            d'autres formes selon les besoins de l'utilisateur : grands\n            caractères, braille, synthèse vocale, symboles ou langage\n            simplifié. \n 1.2  Proposer des versions de remplacement\n            aux média temporels. \n 1.3  Créer un contenu qui\n            puisse être présenté de différentes manières sans perte\n            d'information ni de structure (par exemple avec une mise en page\n            simplifiée). \n 1.4  Faciliter la perception\n            visuelle et auditive du contenu par l'utilisateur, notamment en\n            séparant le premier plan de l'arrière-plan. \n Principe 2 : utilisable \n 2.1  Rendre toutes les\n            fonctionnalités accessibles au clavier. \n 2.2  Laisser à l'utilisateur suffisamment\n            de temps pour lire et utiliser le contenu. \n 2.3  Ne pas concevoir de contenu susceptible de\n            provoquer des crises. \n 2.4  Fournir à l'utilisateur des\n            éléments d'orientation pour naviguer, trouver le contenu et se\n            situer dans le site. \n Principe 3 : compréhensible \n 3.1  Rendre le contenu textuel lisible et\n            compréhensible. \n 3.2  Faire en sorte que les pages\n            apparaissent et fonctionnent de manière prévisible.  \n 3.3  Aider l'utilisateur à éviter et\n            à corriger les erreurs de saisie. \n Principe 4 : robuste \n 4.1  Optimiser la compatibilité avec les\n            agents utilisateurs actuels et futurs, y compris avec les\n            technologies d'assistance. \n Conformité \n Les exigences de conformité \n Déclarations de conformité\n        (optionnel) \n Déclaration de conformité partielle\n        - Contenu fourni par un tiers \n Déclaration de conformité\n        partielle - Langue  \n Annexes \n Annexe A :  Glossaire  (normatif) \n Annexe B :  Remerciements \n Annexe C :  Références \n Introduction  \n Cette section est  informative .  \n Les Règles pour l'accessibilité des contenus Web (WCAG) 2.0 définissent\nla façon de rendre les contenus Web plus accessibles aux personnes en\nsituation de handicap. L'accessibilité couvre un large spectre de limitations\nfonctionnelles, telles que les limitations visuelles, auditives, physiques,\ncognitives, neurologiques ou encore, celles liées à la parole, au langage ou\nà l'apprentissage. Bien que ces règles couvrent un éventail varié de\nproblématiques, elles ne peuvent prétendre répondre aux besoins des\npersonnes avec tous les types, les degrés ou les combinaisons possibles de\nlimitations fonctionnelles. Ces règles rendent également les contenus Web\nplus utilisables par les individus dont les capacités changent en raison du\nvieillissement et améliorent souvent l'utilisabilité pour l'ensemble des\nutilisateurs. \n Les WCAG 2.0 sont développées selon le  processus du W3C (en\nanglais)  en collaboration avec différents individus et organisations\nprovenant des quatre coins du globe, dans le but de fournir un cadre commun de\nnormalisation pour l'accessibilité des contenus Web répondant aux besoins des\nindividus, des organisations et des gouvernements de partout dans le monde. Les\nWCAG 2.0 se fondent sur les WCAG 1.0  [WCAG10]  et sont\nconçues pour être largement appliquées à différentes technologies Web\nexistantes ou à venir, en plus d'être vérifiables avec une combinaison de\ntests automatiques et d'évaluations manuelles. Pour une introduction aux WCAG,\nvoir la  Vue d'ensemble des\nRègles pour l'accessibilité des contenus Web (WCAG) . \n L'accessibilité du Web ne dépend pas uniquement des contenus accessibles,\nmais également des navigateurs Web accessibles et des autres agents\nutilisateurs. Les outils d'édition jouent un rôle majeur dans\nl'accessibilité du Web. Pour une vue d'ensemble de la manière dont ces\néléments d'interaction et de développement Web coopèrent, voir : \n Éléments essentiels de\n    l'accessibilité du Web (en anglais) \n Vue\n    d'ensemble des Règles pour l'accessibilité des agents utilisateurs (UAAG)\n    (en anglais) \n Vue\n    d'ensemble des Règles pour l'accessibilité des outils d'édition (ATAG)\n    (en anglais) \n Les\ndifférents niveaux de lecture des WCAG 2.0 \n Les particuliers et les organisations qui utilisent les WCAG sont très\nvariés et comprennent des concepteurs Web, des développeurs Web, des\ndécideurs, des acheteurs, des enseignants et des étudiants. Afin de répondre\naux besoins variés de ces publics, plusieurs niveaux de lecture sont\nproposés : de grands  principes , des  règles  générales,\ndes  critères de succès  testables ainsi qu'un riche ensemble de\n techniques suffisantes, de techniques recommandées  et d' échecs\nfréquents documentés  avec des exemples, des liens vers des ressources et\ndu code. \n Les principes  - Le premier niveau traite des quatre\n    principes fondamentaux pour l'accessibilité des contenus Web :\n    perceptible, utilisable, compréhensible et robuste. Voir aussi  Comprendre\n    les quatre principes de l'accessibilité (en anglais) . \n Les règles  - Après les principes il y a les\n    règles. Les 12 règles donnent les objectifs de base que les auteurs\n    doivent atteindre afin de rendre le contenu plus accessible pour les\n    utilisateurs ayant différents types de limitations fonctionnelles. Les\n    règles ne sont pas testables, mais elles fournissent la trame et les\n    objectifs principaux pour aider les auteurs à comprendre les critères de\n    succès et à mieux mettre en œuvre les techniques. \n Les critères de succès  - Des critères de succès\n    testables sont fournis pour chaque règle afin de permettre l'utilisation\n    des WCAG 2.0 là où des exigences et des tests de conformité sont\n    nécessaires, notamment pour la spécification de conception, l'achat, la\n    réglementation et les accords contractuels. Afin de répondre aux besoins\n    de divers groupes et de différents contextes, trois niveaux de conformité\n    ont été définis : A (le plus bas), AA et AAA (le plus élevé). Des\n    informations complémentaires sur les niveaux des WCAG peuvent être\n    consultées dans  Comprendre\n    les niveaux de conformité (en anglais) . \n Techniques suffisantes et techniques recommandées  -\n    Pour chaque  règle  et chaque  critère de succès  des WCAG\n    2.0, le groupe de travail a également documenté une grande variété de\n     techniques . Ces techniques sont informatives et se divisent en\n    deux catégories : celles qui sont  suffisantes  pour satisfaire au\n    critère de succès et celles qui sont  recommandées . Les\n    techniques recommandées vont plus loin que ce qui est requis par chacun\n    des critères de succès et elles permettent aux auteurs de mieux respecter\n    les règles. Certaines techniques recommandées concernent des problèmes\n    d'accessibilité qui ne sont pas traités par les critères de succès\n    testables. Lorsque des échecs fréquents sont connus, ils sont aussi\n    documentés. Voir également  les\n    techniques suffisantes et les techniques recommandées dans Comprendre les\n    WCAG 2.0 (en anglais) . \n Tous ces niveaux de lecture (les principes, les règles, les critères de\nsuccès ainsi que les techniques suffisantes et les techniques recommandées)\nforment un ensemble qui donne une aide sur la façon de créer un contenu plus\naccessible. Les auteurs sont encouragés à consulter et à appliquer tous les\nniveaux qu'ils peuvent mettre en œuvre, y compris les techniques\nrecommandées, afin de répondre au mieux aux besoins du plus grand nombre\npossible d'utilisateurs. \n Notons que même du contenu conforme au niveau le plus élevé (AAA) ne sera\npas accessible aux personnes ayant tous les types, les degrés ou les\ncombinaisons de limitations fonctionnelles, en particulier dans les domaines\ncognitifs, du langage et de l'apprentissage. Les auteurs sont encouragés à\nprendre en compte l'ensemble des techniques, y compris les techniques\nrecommandées, et à rechercher des conseils appropriés à propos des bonnes\npratiques en vigueur afin de faire en sorte que les contenus Web soient\naccessibles, autant que possible, à cette communauté. Des  métadonnées\n(en anglais)  pourront aider l'utilisateur à trouver les contenus qui\ncorrespondent le mieux à ses besoins. \n Les documents\nd'accompagnement des WCAG 2.0 \n Le document des WCAG 2.0 est conçu pour satisfaire ceux qui ont besoin de\nstandards techniques stables auxquels il est possible de faire référence.\nD'autres documents, appelés documents d'accompagnement, sont basés sur les\nWCAG 2.0. Ils répondent à d'autres fins et offrent la possibilité d'être\nmis à jour pour décrire comment les WCAG devront être appliquées pour les\ntechnologies futures. Les documents d'accompagnement comprennent : \n Comment satisfaire aux WCAG 2.0 (en anglais)  -\n    Une liste personnalisable de références rapides pour les WCAG 2.0 qui\n    contient toutes les règles, les critères de succès et les techniques\n    utilisables par les auteurs lorsqu'ils développent et évaluent les\n    contenus Web. \n Comprendre les WCAG 2.0 (en anglais)  - Un guide\n    pour comprendre et mettre en œuvre les WCAG 2.0. On y trouve un court\n    document de « compréhension » pour chaque règle et chaque critère de\n    succès dans les WCAG 2.0 ainsi que pour certains éléments clés. \n Les\n    techniques pour les WCAG 2.0 (en anglais)  - Un regroupement de\n    techniques et d'échecs fréquents, chacun dans un document distinct\n    contenant une description, des exemples, du code et des tests. \n Les\n    documents des WCAG 2.0 (en anglais)  - Un diagramme et une\n    description de la façon dont les documents techniques sont reliés entre\n    eux. \n Voir la  Vue\nd'ensemble des Règles pour l'accessibilité des contenus Web (en anglais) \npour une description des éléments d'accompagnement, y compris les ressources\néducatives en lien avec les WCAG 2.0.  Des ressources supplémentaires\nqui couvrent des points tels que des analyses de rentabilité sur\nl'accessibilité, la planification des mises en œuvre d'améliorations de\nl'accessibilité des sites Web ou les politiques d'accessibilité sont décrits\ndans les  ressources de la WAI (en anglais) . \n Les termes importants des WCAG\n2.0 \n Les WCAG 2.0 contiennent trois termes importants qui sont différents des\nWCAG 1.0. Chacun d'entre eux est présenté brièvement ci-dessous et\ndétaillé de façon plus complète dans le glossaire.  \n Page Web \n Il est important de noter que, dans ce standard, le terme «  page\n      Web  » va plus loin que la notion de page HTML statique. Cela inclut\n      les pages Web de plus en plus dynamiques qui apparaissent sur le Web,\n      notamment les « pages » qui peuvent présenter une communauté\n      virtuelle interactive complète. Par exemple, le terme « page Web »\n      peut inclure une expérience immersive, interactive, proche du cinéma,\n      pouvant être trouvée sur une seule URI. Pour plus d'informations, voir\n       Comprendre le terme « page Web » (en anglais) . \n Déterminé par un programme informatique \n Plusieurs critères de succès exigent que le contenu (ou certains\n      aspects du contenu) puisse être «  déterminé\n      (déterminable) par un programme informatique . » Cela veut dire que\n      le contenu est fourni de façon à ce que les  agents utilisateurs , y compris les  technologies d'assistance , puissent\n      extraire et présenter l'information concernée de différentes manières\n      aux utilisateurs. Pour plus d'informations, voir  Comprendre déterminé par un programme informatique (en\n      anglais) .  \n Compatible avec l'accessibilité \n Utiliser une technologie compatible avec l'accessibilité signifie\n      que celle-ci fonctionne avec les technologies d'assistance et les\n      fonctionnalités d'accessibilité des systèmes d'exploitation, des\n      navigateurs ainsi que d'autres agents utilisateurs. La conformité aux\n      critères de succès des WCAG 2.0 ne peut  dépendre  des fonctionnalités\n      d'une technologie que si elles sont utilisées d'une façon qui soit\n      «  compatible avec\n      l'accessibilité  ». Les fonctionnalités d'une technologie peuvent\n      être utilisées d'une manière non compatible avec l'accessibilité (ne\n      fonctionnant pas avec des technologies d'assistance, etc.) tant que la\n      conformité à un critère de succès quel qu'il soit ne dépend pas de\n      ces fonctionnalités (par exemple la même information ou une\n      fonctionnalité similaire seront disponibles d'une autre manière qui\n      sera compatible). \n La définition de « compatible avec l'accessibilité » est\n      disponible dans la section  Annexe A : Glossaire \n      de ces règles. Pour plus d'informations, voir  Comprendre la compatibilité avec l'accessibilité (en\n      anglais) .  \n Les Règles des WCAG 2.0 \n Cette section est  normative . \n Principe 1 :\nperceptible - L'information et les composants de l'interface utilisateur\ndoivent être présentés à l'utilisateur de façon à ce qu'il puisse les\npercevoir. \n  Règle 1.1 Les équivalents\ntextuels : proposer des équivalents textuels à tout contenu non textuel qui\npourra alors être présenté sous d'autres formes selon les besoins de\nl'utilisateur : grands caractères, braille, synthèse vocale, symboles ou\nlangage simplifié. \n Comprendre la règle 1.1 (en anglais) \n 1.1.1 Contenu non\ntextuel :  tout  contenu non-textuel  présenté\nà l'utilisateur a un  équivalent textuel  qui remplit une\nfonction équivalente sauf dans les situations énumérées ci-dessous. (Niveau\nA)  \n Composant d'interface ou de saisie :\n      si le contenu non textuel est un composant d'interface ou s'il\n    permet la saisie d'informations par l'utilisateur, alors il a un  nom  qui\n    décrit sa fonction. (Se référer à la  Règle\n    4.1  pour des exigences supplémentaires à propos des composants\n    d'interfaces utilisateur ou des contenus qui permettent la saisie\n    d'informations par l'utilisateur.)  \n Média temporel :   si le contenu\n    non textuel est un média temporel, alors l'équivalent textuel fournit au\n    moins une identification descriptive du contenu non textuel. (Se référer\n    à la  Règle 1.2  pour des exigences\n    supplémentaires concernant les médias temporels.)  \n Test :   si le contenu non textuel\n    est un test ou un exercice qui serait invalide s'il était présenté en  texte ,\n    alors l'équivalent textuel fournit au moins une identification descriptive\n    du contenu non textuel.  \n Contenu sensoriel :   si le contenu\n    non textuel vise d'abord à créer une  expérience sensorielle\n    spécifique , l'équivalent textuel fournit au moins une identification\n    descriptive de ce contenu non textuel.  \n CAPTCHA  :  si ce contenu\n    non textuel vise à confirmer que le contenu est consulté par une personne\n    plutôt que par un ordinateur, alors un équivalent textuel est fourni pour\n    identifier et décrire la fonction du contenu non textuel, et des formes\n    alternatives du CAPTCHA sont proposées pour différents types de\n    perception sensorielle afin d'accommoder différents types de limitations\n    fonctionnelles. \n Décoration, formatage, invisibilité :\n     si le contenu non textuel est  purement décoratif , s'il est utilisé seulement pour\n    un formatage visuel ou s'il n'est pas présenté à l'utilisateur, alors il\n    est implémenté de manière à être ignoré par les  technologies d'assistance . \n Comment satisfaire à 1.1.1 (en anglais) |   Comprendre 1.1.1 (en anglais) \n Règle 1.2 Média temporel :\nproposer des versions de remplacement aux médias temporels. \n Comprendre la règle 1.2 (en anglais) \n 1.2.1 Contenu seulement audio ou\nvidéo (pré-enregistré) :   pour des médias  pré-enregistrés   seulement audio  et pré-enregistrés\n seulement vidéo , sauf si l'audio ou la vidéo sont un  média de remplacement pour un\ntexte  et qu'ils sont clairement identifiés comme tels : (Niveau A) \n Contenu pré-enregistré seulement audio :\n      fournir une  version de remplacement\n    pour un média temporel , présentant une information équivalente au\n    contenu seulement audio. \n Contenu pré-enregistré seulement vidéo :\n      fournir, soit une version de remplacement pour un média\n    temporel, soit une piste audio (présentant une information équivalente)\n    pour un contenu pré-enregistré seulement vidéo. \n Comment satisfaire à 1.2.1 (en anglais)   |   Comprendre 1.2.1 (en anglais) \n 1.2.2 Sous-titres\n(pré-enregistrés) :  fournir des  sous-titres  pour tout contenu  audio   pré-enregistré  dans un  média synchronisé , excepté lorsque le média est un  média de remplacement pour un\ntexte  et qu'il est clairement identifié comme tel. (Niveau A)  \n Comment satisfaire à 1.2.2 (en anglais)   |   Comprendre 1.2.2 (en anglais) \n 1.2.3 Audio-description ou version\nde remplacement pour un média temporel (pré-enregistré) :  fournir\nune  version de remplacement pour un\nmédia temporel  ou une  audio-description  du contenu  vidéo   pré-enregistré  pour un  média synchronisé , excepté quand le média est un  média de remplacement pour un\ntexte  et qu'il est clairement identifié comme tel. (Niveau A) \n Comment satisfaire à 1.2.3 (en anglais)   |   Comprendre 1.2.3 (en anglais) \n 1.2.4 Sous-titres (en\ndirect) :  fournir des  sous-titres  pour tout contenu  audio   en direct ,\nsous forme de  média synchronisé . (Niveau\nAA)  \n Comment satisfaire à 1.2.4 (en anglais)   |   Comprendre 1.2.4 (en anglais) \n 1.2.5 Audio-description\n(pré-enregistrée) :  fournir une  audio-description  pour tout contenu  vidéo   pré-enregistré , sous forme de  média synchronisé . (Niveau AA) \n Comment satisfaire à 1.2.5 (en anglais)   |   Comprendre 1.2.5 (en anglais) \n 1.2.6 Langue des signes\n(pré-enregistrée) :  fournir une  interprétation en langue des\nsignes  pour tout contenu  audio   pré-enregistré , sous forme de  média synchronisé . (Niveau AAA)  \n Comment satisfaire à 1.2.6 (en anglais)   |   Comprendre 1.2.6 (en anglais) \n 1.2.7 Audio-description étendue\n(pré-enregistrée) :  lorsque les blancs présents dans le fond\nsonore ne sont pas suffisants pour permettre à l' audio-description  de transmettre le sens de la vidéo,\nfournir une  audio-description étendue  pour tout\ncontenu  vidéo   pré-enregistré  sous la forme de  média synchronisé . (Niveau AAA)  \n Comment satisfaire à 1.2.7 (en anglais)   |   Comprendre 1.2.7 (en anglais) \n 1.2.8 Version de remplacement pour\nun média temporel (pré-enregistrée) :  fournir une  version de remplacement pour un\nmédia temporel , pour tout contenu de type  média synchronisé   pré-enregistré  et pour tout média pré-enregistré  seulement vidéo . (Niveau AAA) \n Comment satisfaire à 1.2.8 (en anglais)   |   Comprendre 1.2.8 (en anglais) \n 1.2.9 Seulement audio (en\ndirect) :  fournir une  version de remplacement pour un\nmédia temporel , donnant une information équivalente pour un contenu  seulement audio   en direct . (Niveau AAA)  \n Comment satisfaire à 1.2.9 (en anglais)   |   Comprendre 1.2.9 (en anglais) \n Règle 1.3 Adaptable : créer un contenu\nqui puisse être présenté de différentes manières sans perte d'information\nni de structure (par exemple avec une mise en page simplifiée). \n Comprendre la règle 1.3 (en anglais) \n 1.3.1 Information et\nrelations :  l'information, la  structure  et les  relations  véhiculées par la  présentation  peuvent être  déterminées par un\nprogramme informatique  ou sont disponibles sous forme de texte. (Niveau\nA) \n Comment satisfaire à 1.3.1 (en anglais)   |   Comprendre 1.3.1 (en anglais) \n 1.3.2 Ordre séquentiel\nlogique :  lorsque l'ordre de présentation du contenu affecte sa\nsignification, un  ordre de lecture\ncorrect  peut être  déterminé par un\nprogramme informatique . (Niveau A) \n Comment satisfaire à 1.3.2 (en anglais)   |   Comprendre 1.3.2 (en anglais) \n 1.3.3 Caractéristiques\nsensorielles :  les instructions données pour la compréhension et\nl'utilisation du contenu ne doivent pas reposer uniquement sur les\ncaractéristiques sensorielles des éléments comme la forme, la taille,\nl'emplacement visuel, l'orientation ou le son. (Niveau A) \n Note :  pour les exigences liées à la couleur, se\nréférer à la  Règle 1.4 . \n Comment satisfaire à 1.3.3 (en anglais)   |   Comprendre 1.3.3 (en anglais) \n  Règle 1.4\nDistinguable : faciliter la perception visuelle et auditive du contenu par\nl'utilisateur, notamment en séparant le premier plan de l'arrière-plan. \n Comprendre la règle 1.4 (en anglais)   \n 1.4.1 Utilisation de la\ncouleur :  la couleur n'est pas utilisée comme la seule façon de\nvéhiculer de l'information, d'indiquer une action, de solliciter une réponse\nou de distinguer un élément visuel. (Niveau A) \n Note :  ce critère de succès traite\nspécifiquement de la perception des couleurs. Les autres formes de perception\nsont traitées à la  règle 1.3 \ncomme l'accès à la couleur par programme informatique et les autres formes de\ncodage de la présentation visuelle. \n Comment satisfaire à 1.4.1 (en anglais)   |   Comprendre 1.4.1 (en anglais) \n 1.4.2 Contrôle du son : \nsi du son sur une page Web est audible automatiquement pendant plus de 3\nsecondes, un  mécanisme  est disponible pour le mettre\nen pause, l'arrêter ou pour en contrôler le volume de façon indépendante du\nniveau de volume du système général. (Niveau A) \n Note :  puisque tout contenu ne satisfaisant pas à\nce critère de succès peut interférer avec la capacité de l'utilisateur à\nexploiter la page entière, tout le contenu présent dans la page Web (qu'il\nsoit utilisé pour satisfaire à d'autres critères de succès ou non) doit\nsatisfaire à ce critère de succès. Voir l' exigence de\nconformité 5 : Non-interférence . \n Comment satisfaire à 1.4.2 (en anglais)   |   Comprendre 1.4.2 (en anglais) \n 1.4.3 Contraste\n(minimum) :   la présentation visuelle du  texte  et du  texte sous forme d'image  a\nun  rapport de contraste  d'au moins\n 4, 5:1, sauf dans les cas suivants : (Niveau AA) \n Texte agrandi :  le  texte agrandi  et le texte agrandi\n    sous forme d'image ont un rapport de contraste d'au moins 3:1; \n Texte décoratif :   aucune\n    exigence de contraste pour le texte ou le texte sous forme d'image qui fait\n    partie d'un  composant\n    d'interface utilisateur  inactif, qui est  purement\n    décoratif , qui est invisible pour tous ou qui est une partie d'une\n    image contenant un autre contenu significatif. \n Logotypes :  aucune exigence de\n    contraste pour le texte faisant partie d'un logo ou d'un nom de marque. \n Comment satisfaire à 1.4.3 (en anglais)   |   Comprendre 1.4.3 (en anglais) \n 1.4.4 Redimensionnement du\ntexte :  à l'exception des  sous-titres  et du  texte\nsous forme d'image , le  texte  peut être redimensionné jusqu'à 200\npour cent sans l'aide d'une  technologie\nd'assistance  et sans perte de contenu ou de fonctionnalité. (Niveau AA) \n Comment satisfaire à 1.4.4 (en anglais)   |   Comprendre 1.4.4 (en anglais) \n 1.4.5 Texte sous forme\nd'image :  si les technologies utilisées peuvent réaliser la\nprésentation visuelle, du  texte  est utilisé pour véhiculer\nl'information plutôt que du  texte sous forme d'image \nsauf dans les cas suivants : (Niveau AA) \n Personnalisable :  le texte sous forme d'image peut\n    être  personnalisé\n    visuellement  selon les exigences de l'utilisateur; \n Essentielle :  une présentation spécifique du texte\n    est  essentielle  à l'information\n    véhiculée. \n Note :  les logotypes sont considérés comme\nessentiels (le texte qui fait partie d'un logo ou d'un nom de marque). \n Comment satisfaire à 1.4.5 (en anglais)   |   Comprendre 1.4.5 (en anglais) \n 1.4.6 Contraste\n(amélioré) :   la présentation visuelle du  texte  et du  texte sous forme d'image  a\nun  rapport de contraste  d'au moins\n7:1, sauf dans les cas suivants : (Niveau AAA) \n Texte agrandi :  le  texte agrandi  et le texte agrandi\n    sous forme d'image ont un rapport de contraste d'au moins\n     4, 5:1; \n Texte décoratif :   aucune\n    exigence de contraste pour le texte ou le texte sous forme d'image qui fait\n    partie d'un  composant\n    d'interface utilisateur  inactif, qui est  purement\n    décoratif , qui est invisible pour tous ou qui est une partie d'une\n    image contenant un autre contenu significatif. \n Logotypes :  aucune exigence de\n    contraste pour le texte faisant partie d'un logo ou d'un nom de marque. \n Comment satisfaire à 1.4.6 (en anglais)   |   Comprendre 1.4.6 (en anglais) \n 1.4.7 Arrière-plan sonore de faible\nvolume ou absent :  pour un contenu  seulement audio \n pré-enregistré  qui (1) contient\nprincipalement de la parole au premier plan, (2) n'est pas un  CAPTCHA  ou\nun logo sonore et (3) qui n'est pas une vocalisation dont l'intention est\nprincipalement d'être musicale comme une chanson ou un rap, au moins l'une des\nconditions suivantes est vraie : (Niveau AAA) \n Sans arrière-plan :  le contenu\n    audio ne contient pas d'arrière-plan sonore. \n Désactivation :  l'arrière-plan\n    sonore peut être désactivé. \n 20 dB :   l'arrière-plan sonore\n    est au moins 20 décibels plus faible que le contenu parlé au premier plan\n    sauf pour certains effets sonores occasionnels durant seulement une ou deux\n    secondes. \n Note :  par la définition du\n    « décibel » , le volume de l'arrière-plan sonore correspondant à\n    cette exigence est approximativement quatre fois plus faible que le contenu\n    parlé au premier plan.  \n Comment satisfaire à 1.4.7 (en anglais)   |   Comprendre 1.4.7 (en anglais) \n 1.4.8 Présentation\nvisuelle :  pour la présentation visuelle des  blocs de texte ,\nun  mécanisme  est disponible permettant de\nréaliser ce qui suit : (Niveau AAA) \n Les couleurs de premier plan et d'arrière-plan peuvent être choisies\n    par l'utilisateur. \n La largeur n'excède pas 80 caractères ou glyphes (40 si  CJK ). \n Le texte n'est pas justifié (aligné simultanément à droite et à\n    gauche). \n L'espacement entre les lignes (interlignage) est d'une valeur d'au\n    moins 1,5 dans les paragraphes et l'espacement entre les paragraphes est au\n    moins 1,5 fois plus grand que la valeur de l'interligne. \n La taille du texte peut être redimensionnée jusqu'à 200 pour cent\n    sans l'aide d'une technologie d'assistance et sans que l'utilisateur soit\n    obligé de faire défiler le texte horizontalement pour lire une ligne\n    complète  dans une fenêtre\n    plein écran . \n Comment satisfaire à 1.4.8 (en anglais)   |   Comprendre 1.4.8 (en anglais) \n 1.4.9 Texte sous forme d'image (sans\nexception) :  le  texte sous forme d'image  est\nutilisé seulement pour du texte  purement décoratif  ou lorsqu'une\nprésentation spécifique du  texte  est  essentielle  à\nl'information véhiculée. (Niveau AAA) \n Note :  les logotypes (le texte qui fait partie d'un\nlogo ou d'un nom de marque) sont considérés comme essentiels. \n Comment satisfaire à 1.4.9 (en anglais)   |   Comprendre 1.4.9 (en anglais) \n Principe 2 :\nutilisable - Les composants de l'interface utilisateur et de navigation doivent\nêtre utilisables. \n Règle 2.1\nAccessibilité au clavier : rendre toutes les fonctionnalités accessibles au\nclavier. \n Comprendre la règle 2.1 (en anglais) \n 2.1.1 Clavier :  toutes les\n fonctionnalités  du contenu sont utilisables à l'aide\nd'une  interface clavier  sans exiger un rythme de frappe propre à\nl'utilisateur, sauf lorsque la fonction sous-jacente nécessite une saisie qui\ndépend du tracé du mouvement effectué par l'utilisateur et pas seulement des\npoints de départ et d'arrivée de ce tracé. (Niveau A)  \n Note 1 :  cette exception ne concerne que la\nfonction sous-jacente et non la technique de saisie. Par exemple, lorsqu'on\nutilise l'écriture manuscrite pour saisir du texte, la technique de saisie\n(l'écriture manuscrite) nécessite une saisie qui dépend d'un tracé, mais la\nfonction sous-jacente (la saisie de texte) ne le requiert pas. \n Note 2 :  cela n'interdit pas et ne devrait pas\ndécourager l'utilisation de la souris ou de toute autre méthode de saisie en\nplus de l'utilisation du clavier. \n Comment\nsatisfaire à 2.1.1 (en anglais)   |   Comprendre 2.1.1\n(en anglais) \n 2.1.2 Pas de piège au\nclavier :  si le focus du clavier peut être positionné sur un\nélément de la page à l'aide d'une  interface clavier ,\nréciproquement, il peut être déplacé hors de ce même composant simplement\nà l'aide d'une interface clavier et, si ce déplacement exige plus que\nl'utilisation d'une simple touche flèche ou tabulation ou toute autre méthode\nstandard de sortie, l'utilisateur est informé de la méthode permettant de\ndéplacer le focus hors de ce composant. (Niveau A)  \n Note :  puisque tout contenu ne satisfaisant pas à\nce critère de succès peut interférer avec la capacité de l'utilisateur à\nexploiter la page entière, tout le contenu présent dans la page Web (qu'il\nsoit utilisé pour satisfaire à d'autres critères de succès ou non) doit\nsatisfaire à ce critère de succès. Voir l' exigence de\nconformité 5 : Non-interférence . \n Comment\nsatisfaire à 2.1.2 (en anglais)   |   Comprendre 2.1.2\n(en anglais) \n 2.1.3 Clavier (pas\nd'exception) :  toutes les  fonctionnalités  du contenu sont\nutilisables à l'aide d'une  interface clavier  sans exiger\nun rythme de frappe propre à l'utilisateur. (Niveau AAA)  \n Comment\nsatisfaire à 2.1.3 (en anglais)   |   Comprendre 2.1.3\n(en anglais) \n Règle 2.2 Délai suffisant :\nlaisser à l'utilisateur suffisamment de temps pour lire et utiliser le\ncontenu. \n Comprendre la\nrègle 2.2 \n 2.2.1 Réglage du délai : \npour chaque limite de temps fixée par le contenu, au moins l'un des points\nsuivants est vrai : (Niveau A) \n Suppression :  l'utilisateur a la\n    possibilité de supprimer la limite de temps avant de la rencontrer ;\n    ou \n Ajustement :  l'utilisateur a la\n    possibilité d'ajuster la limite de temps avant de la rencontrer dans un\n    intervalle d'au moins dix fois la durée paramétrée par défaut ; ou \n Extension :  l'utilisateur est\n    averti avant que la limite de temps n'expire et il lui est accordé au\n    moins 20 secondes pour étendre cette limite par une action simple (par\n    exemple, « appuyer sur la barre d'espace ») et l'utilisateur a la\n    possibilité d'étendre la limite de temps au moins dix fois ; ou \n L'exception du temps réel :  la\n    limite de temps est une partie constitutive d'un événement en temps réel\n    (par exemple, une enchère) et aucune alternative n'est possible ; ou \n l'exception de la limite essentielle :\n     la limite de temps est  essentielle  et l'étendre\n    invaliderait alors l'activité ; ou \n L'exception des 20 heures :  la\n    limite de temps est supérieure à 20 heures. \n Note :  ce critère de succès permet de s'assurer\nque les utilisateurs peuvent compléter leurs tâches sans changement inattendu\nde contenu ou de contexte résultant de la limite de temps. Il devrait être\nconsidéré conjointement avec le  critère de succès 3.2.1 , qui\npose des limites aux changements de contenu ou de contexte résultant d'une\naction de l'utilisateur. \n Comment satisfaire à 2.2.1 (en anglais)   |   Comprendre 2.2.1 (en anglais) \n 2.2.2 Mettre en pause, arrêter,\nmasquer :  pour toute information en mouvement,  clignotante , défilante ou mise à jour automatiquement,\ntous les points suivants sont vrais : (Niveau A) \n Déplacement, clignotement, défilement :\n     pour toute information en mouvement, clignotante ou défilante qui\n    (1) démarre automatiquement, (2) dure plus de cinq secondes et (3) est\n    présentée conjointement avec un autre contenu, il y a un mécanisme à la\n    disposition de l'utilisateur pour la  mettre en pause , l'arrêter ou la\n    masquer, à moins que le mouvement, le clignotement ou le défilement\n    s'avère un élément  essentiel  au bon déroulement de\n    l'activité; et \n Mise à jour automatique :  pour\n    toute information mise à jour automatiquement qui (1) démarre\n    automatiquement (2) et est présentée conjointement avec un autre contenu,\n    il y a un mécanisme à la disposition de l'utilisateur pour la mettre en\n    pause, l'arrêter ou pour en contrôler la fréquence des mises à jour à\n    moins que la mise à jour automatique s'avère essentielle au bon\n    déroulement de l'activité. \n Note 1 :  pour les exigences relatives au contenu\nscintillant ou flashant, se référer à la  règle\n2.3 . \n Note 2 :  puisque tout contenu ne satisfaisant pas\nà ce critère de succès peut interférer avec la capacité de l'utilisateur\nà exploiter la page entière, tout le contenu présent dans la page Web (qu'il\nsoit utilisé pour satisfaire à d'autres critères de succès ou non) doit\nsatisfaire à ce critère de succès. Lire  Exigence de\nconformité 5 : Non-interférence . \n Note 3 :  il n'est pas exigé que le contenu mis à\njour périodiquement par logiciel ou diffusé en flux à l'agent utilisateur\nconserve ou présente l'information générée ou reçue entre la mise en pause\net la reprise de la présentation, puisque cela peut ne pas être techniquement\npossible et s'avérer trompeur dans beaucoup de situations. \n Note 4 :  une animation survenant dans une phase de\npré-chargement ou dans une situation similaire peut être considérée comme\nessentielle si aucune interaction n'est permise à tous les utilisateurs durant\ncette phase et si l'absence d'indication de progression est susceptible de\nperturber les utilisateurs ou de leur faire croire que le contenu est figé ou\ndéfectueux. \n Comment satisfaire à 2.2.2 (en anglais)   |   Comprendre 2.2.2 (en anglais) \n 2.2.3 Pas de délai\nd'exécution :  le temps n'est pas un facteur  essentiel  dans le déroulement de l'événement ou de\nl'activité, à l'exception des  médias synchronisés  non\ninteractifs et des  événements en temps réel .\n(Niveau AAA) \n Comment satisfaire à 2.2.3 (en anglais)   |   Comprendre 2.2.3 (en anglais) \n 2.2.4 Interruptions :  les\ninterruptions peuvent être reportées ou supprimées par l'utilisateur, à\nl'exception des interruptions impliquant une  urgence . (Niveau AAA) \n Comment satisfaire à 2.2.4 (en anglais)   |   Comprendre 2.2.4 (en anglais) \n 2.2.5 Nouvelle\nauthentification :  quand une session authentifiée expire,\nl'utilisateur peut poursuivre son activité sans perte de données après une\nnouvelle authentification. (Niveau AAA) \n Comment satisfaire à 2.2.5 (en anglais)   |   Comprendre 2.2.5 (en anglais) \n  Règle 2.3 Crises : ne pas concevoir\nde contenu susceptible de provoquer des crises. \n Comprendre la Règle 2.3 (en anglais) \n 2.3.1 Pas plus de trois flashs ou\nsous le seuil critique :  une  page Web  doit être exempte de tout\nélément qui flashe plus de trois fois dans n'importe quel intervalle d'une\nseconde ou ce  flash  doit se situer sous le  seuil de flash générique et le\nseuil de flash rouge . (Niveau A) \n Note :  puisque tout contenu ne satisfaisant pas à\nce critère de succès peut interférer avec la capacité de l'utilisateur à\nexploiter la page entière, tout le contenu présent dans la page Web (qu'il\nsoit utilisé pour satisfaire à d'autres critères de succès ou non) doit\nsatisfaire à ce critère de succès. Voir l' exigence de\nconformité 5 : Non-interférence . \n Comment\nsatisfaire à 2.3.1 (en anglais)   |   Comprendre 2.3.1\n(en anglais) \n 2.3.2 Trois flashs :  une\n page\nWeb  doit être exempte de tout élément qui  flashe  plus de trois fois dans n'importe\nquel intervalle d'une seconde. (Niveau AAA) \n Comment satisfaire à 2.3.2 (en anglais)   |   Comprendre 2.3.2 (en anglais) \n Règle 2.4\nNavigable : fournir à l'utilisateur des éléments d'orientation pour\nnaviguer, trouver le contenu et se situer dans le site. \n Comprendre la règle 2.4 (en anglais)  \n 2.4.1 Contourner des blocs :\n  un  mécanisme  permet de contourner les blocs de contenu qui\nsont répétés sur plusieurs  pages Web . (Niveau A)  \n Comment satisfaire à 2.4.1 (en anglais)   |   Comprendre 2.4.1 (en anglais) \n 2.4.2 Titre de page :  les\n pages\nWeb  présentent un titre qui décrit leur sujet ou leur but. (Niveau A)  \n Comment satisfaire à 2.4.2 (en anglais)    |   Comprendre 2.4.2 (en anglais) \n 2.4.3 Parcours du focus : \nsi une  page Web  peut être  parcourue de façon séquentielle  et que les séquences de\nnavigation affectent la signification ou l'action, les éléments reçoivent le\nfocus dans un ordre qui préserve la signification et l'opérabilité. (Niveau\nA)  \n Comment satisfaire à 2.4.3 (en anglais)    |   Comprendre 2.4.3 (en anglais)  \n 2.4.4 Fonction du lien (selon le\ncontexte) :  la  fonction de chaque lien  est\ndéterminée par le texte du lien seul ou par le texte du lien associé à un\n contexte du lien déterminé par un\nprogramme informatique , sauf si la fonction du lien est  ambiguë pour tout utilisateur . (Niveau A)  \n Comment satisfaire à 2.4.4 (en anglais)   |   Comprendre 2.4.4 (en anglais) \n 2.4.5 Accès multiples : \nune  page\nWeb  peut être située par plus d'un moyen dans un  ensemble de pages Web   sauf si cette page est le résultat\nou une étape d'un  processus . (Niveau AA)  \n Comment satisfaire à 2.4.5 (en anglais)   |   Comprendre 2.4.5 (en anglais) \n 2.4.6 En-têtes et\nétiquettes :  les en-têtes et les  étiquettes  décrivent le sujet ou le but. (Niveau AA)  \n Comment satisfaire à 2.4.6 (en anglais)   |   Comprendre 2.4.6 (en anglais) \n 2.4.7 Visibilité du\nfocus :  toute interface utilisable au clavier comporte un mode de\nfonctionnement où le focus est visible. (Niveau AA)  \n Comment satisfaire à 2.4.7 (en anglais)   |   Comprendre 2.4.7 (en anglais) \n 2.4.8 Localisation : \nl'utilisateur dispose d'informations pour se situer dans un  ensemble de pages Web . (Niveau AAA)  \n Comment satisfaire à 2.4.8 (en anglais)   |   Comprendre 2.4.8 (en anglais) \n 2.4.9 Fonction du lien (lien\nuniquement) :  un  mécanisme  permet de déterminer la\nfonction de chaque lien par le texte du lien uniquement, sauf si la fonction du\nlien est  ambiguë pour tout utilisateur .\n(Niveau AAA)  \n Comment satisfaire à 2.4.9 (en anglais)   |   Comprendre 2.4.9 (en anglais) \n 2.4.10 En-têtes de\nsection :  les en-têtes de  section  sont utilisés pour organiser le\ncontenu. (Niveau AAA)  \n Note 1 :  « en-tête » est utilisé dans le sens\ngénéral et comprend les titres et autres moyens de structurer les différents\ntypes de contenus.  \n Note 2 :  ce critère de succès concerne les\ncontenus de sections et non les  composants d'interface\nutilisateur . Les composants d'interface utilisateur sont traités par le  critère de succès 4.1.2 . \n Comment satisfaire à 2.4.10 (en anglais)   |   Comprendre 2.4.10 (en anglais) \n Principe\n3 : compréhensible - Les informations et l'utilisation de l'interface\nutilisateur doivent être compréhensibles. \n Règle 3.1 Lisible : rendre le contenu\ntextuel lisible et compréhensible. \n Comprendre la règle 3.1 (en anglais) \n 3.1.1 Langue de la page : \nla  langue  par défaut de chaque  page Web \npeut être  déterminée par un\nprogramme informatique . (Niveau A) \n Comment\nsatisfaire à 3.1.1 (en anglais)   |   Comprendre 3.1.1\n(en anglais) \n 3.1.2 Langue d'un\npassage :  la  langue  de chaque passage ou expression du contenu peut\nêtre  déterminée par un\nprogramme informatique  sauf pour un nom propre, pour un terme technique,\npour un mot dont la langue est indéterminée ou pour un mot ou une expression\nfaisant partie du langage courant de la langue utilisée dans le contexte\nimmédiat. (Niveau AA)  \n Comment\nsatisfaire à 3.1.2 (en anglais)   |   Comprendre 3.1.2\n(en anglais) \n 3.1.3 Mots rares :  un  mécanisme  est disponible pour identifier la définition\nspécifique des mots ou expressions  utilisés de manière\ninhabituelle ou de façon limitée , y compris les  expressions idiomatiques  et le  jargon .\n(Niveau AAA)  \n Comment\nsatisfaire à 3.1.3 (en anglais)   |   Comprendre 3.1.3\n(en anglais) \n 3.1.4 Abréviations :  un\n mécanisme  est disponible pour identifier la forme\ncomplète ou la signification d'une  abréviation . (Niveau AAA)  \n Comment\nsatisfaire à 3.1.4 (en anglais)   |   Comprendre 3.1.4\n(en anglais) \n 3.1.5 Niveau de lecture : \nlorsqu'un texte nécessite une capacité de lecture plus avancée que le  premier cycle de l'enseignement\nsecondaire , après la suppression des noms propres et des titres, un  contenu additionnel  ou une version qui ne requiert pas de\ncapacité de lecture supérieure au premier cycle de l'enseignement secondaire\nest disponible. (Niveau AAA) \n Comment\nsatisfaire à 3.1.5 (en anglais)   |   Comprendre 3.1.5\n(en anglais) \n 3.1.6 Prononciation :  un\n mécanisme  permet d'identifier la prononciation spécifique\ndes mots dont la signification est ambiguë dans le contexte si leur\nprononciation n'est pas connue. (Niveau AAA) \n Comment\nsatisfaire à 3.1.6 (en anglais)   |   Comprendre 3.1.6\n(en anglais) \n  Règle 3.2\nPrévisible : faire en sorte que les pages apparaissent et fonctionnent de\nmanière prévisible. \n Comprendre\nla règle 3.2 (en anglais) \n 3.2.1 Au focus :  quand un\ncomposant reçoit le focus, il ne doit pas initier de  changement de contexte . (Niveau A)  \n Comment satisfaire à 3.2.1 (en anglais)   |   Comprendre 3.2.1 (en anglais) \n 3.2.2 À la saisie :  le\nchangement de paramètre d'un  composant d'interface\nutilisateur  ne doit pas initier de  changement de contexte   à moins que l'utilisateur n'ait\nété avisé de ce comportement avant d'utiliser le composant. (Niveau A) \n Comment satisfaire à 3.2.2 (en anglais)   |   Comprendre 3.2.2 (en anglais) \n 3.2.3 Navigation cohérente :\n  dans un  ensemble de pages , les\nmécanismes de navigation qui se répètent sur plusieurs  pages Web \nse présentent dans le  même ordre relatif  chaque fois\nqu'ils sont répétés, à moins qu'un changement soit initié par\nl'utilisateur. (Niveau AA)  \n Comment satisfaire à 3.2.3 (en anglais)   |   Comprendre 3.2.3 (en anglais) \n 3.2.4 Identification\ncohérente :  dans un ensemble de  pages Web  les composants qui ont la  même fonctionnalité  sont identifiés de la même façon.\n(Niveau AA)  \n Comment satisfaire à 3.2.4 (en anglais)   |   Comprendre 3.2.4 (en anglais) \n 3.2.5 Changement à la\ndemande :  un  changement de contexte  est\ninitié uniquement sur demande de l'utilisateur ou un  mécanisme  est disponible pour désactiver un tel\nchangement. (Niveau AAA)  \n Comment satisfaire à 3.2.5 (en anglais)   |   Comprendre 3.2.5 (en anglais) \n  Règle 3.3 Assistance à\nla saisie : aider l'utilisateur à éviter et à corriger les erreurs de\nsaisie. \n Comprendre la règle 3.3 (en anglais) \n 3.3.1 Identification des\nerreurs :  si une  erreur de saisie  est détectée\nautomatiquement, l'élément en erreur est identifié et l'erreur est décrite\nà l'utilisateur sous forme de texte. (Niveau A)  \n Comment satisfaire à 3.3.1 (en anglais)   |   Comprendre 3.3.1 (en anglais) \n 3.3.2 Étiquettes ou\ninstructions :  des  étiquettes  sont présentées ou des\ninstructions sont fournies quand un contenu requiert une saisie utilisateur.\n(Niveau A)  \n Comment satisfaire à 3.3.2 (en anglais)   |   Comprendre 3.3.2 (en anglais) \n 3.3.3 Suggestion après une\nerreur :  si une  erreur de saisie  est automatiquement\ndétectée et que des suggestions de corrections sont connues, ces suggestions\nsont alors proposées à l'utilisateur à moins que cela puisse compromettre la\nsécurité ou la finalité du contenu. (Niveau AA)  \n Comment satisfaire à 3.3.3 (en anglais)   |   Comprendre 3.3.3 (en anglais) \n 3.3.4 Prévention des erreurs\n(juridiques, financières, de données) :  pour les  pages Web \nqui entraînent des  engagements juridiques  ou des\ntransactions financières de la part de l'utilisateur, qui modifient ou\neffacent des données  contrôlables par\nl'utilisateur  dans des systèmes de stockages de données, qui enregistrent\nles réponses de l'utilisateur à un test ou un examen, au moins l'une des\nconditions suivantes est vraie : (Niveau AA)  \n Réversible :   les actions d'envoi\n    sont réversibles. \n Vérifiée :   les données saisies\n    par l'utilisateur sont vérifiées au niveau des  erreurs de saisie  et la possibilité est donnée à\n    l'utilisateur de les corriger. \n Confirmée :   un  mécanisme  est disponible pour revoir, confirmer et\n    corriger les informations avant leur soumission finale. \n Comment satisfaire à 3.3.4 (en anglais)   |   Comprendre 3.3.4 (en anglais) \n 3.3.5 Aide :  une  aide contextuelle  est disponible. (Niveau AAA) \n Comment satisfaire à 3.3.5 (en anglais)   |   Comprendre 3.3.5\n(en anglais) \n 3.3.6 Prévention des erreurs\n(toutes) :  pour des  pages Web  demandant à l'utilisateur de\nsoumettre des informations, au moins l'une des conditions suivantes est\nvraie : (Niveau AAA)  \n Réversible :   les actions d'envoi\n    sont réversibles. \n Vérifiée :   les données saisies\n    par l'utilisateur sont vérifiées au niveau des  erreurs de saisie  et la possibilité est donnée à\n    l'utilisateur de les corriger. \n Confirmée :   un  mécanisme  est disponible pour revoir, confirmer et\n    corriger les informations avant leur soumission finale. \n Comment satisfaire à 3.3.6 (en anglais)   |   Comprendre 3.3.6 (en anglais) \n Principe 4 : robuste -\nLe contenu doit être suffisamment robuste pour être interprété de manière\nfiable par une large variété d'agents utilisateurs, y compris les\ntechnologies d'assistance. \n  Règle 4.1 Compatible :\noptimiser la compatibilité avec les agents utilisateurs actuels et futurs, y\ncompris les technologies d'assistance. \n Comprendre la règle 4.1 (en anglais) \n 4.1.1 Analyse syntaxique : \nà moins que les spécifications ne le permettent, dans un contenu implémenté\nvia un langage de balisage, les éléments ont des balises de début et de fin\ncomplètes, ils sont imbriqués conformément à leurs spécifications, ils ne\ncontiennent pas d'attributs dupliqués et chaque ID est unique. (Niveau A)  \n Note:  les balises de début et de fin auxquelles il\nmanque un caractère critique, comme un chevron fermant ou un guillemet pour\nune valeur d'attribut, sont considérées incomplètes. \n Comment satisfaire à 4.1.1 (en anglais)   |   Comprendre 4.1.1 (en anglais) \n 4.1.2 Nom, rôle et\nvaleur :  pour tout  composant d'interface\nutilisateur  (comprenant mais n'étant pas limité aux éléments de\nformulaire, liens et composants générés par des scripts), le  nom  et le  rôle  peuvent\nêtre  déterminés par un\nprogramme informatique  ; les états, les propriétés et les valeurs qui\npeuvent être paramétrés par l'utilisateur peuvent être  définis par programmation  ; et la notification des\nchangements de ces éléments est disponible aux  agents utilisateurs , incluant les  technologies d'assistance . (Niveau A)  \n Note :  ce critère de succès s'adresse d'abord aux\nauteurs qui développent ou programment leurs propres composants d'interface\nutilisateur. Toutefois, les contrôles HTML standards se conforment déjà à\nce critère de succès lorsqu'ils sont utilisés conformément à la\nspécification. \n Comment satisfaire à 4.1.2 (en anglais)   |   Comprendre 4.1.2 (en anglais) \n Conformité \n Cette section est  normative .  \n Cette section reprend les exigences de  conformité  aux WCAG 2.0. Elle\nexplique aussi comment faire une déclaration de conformité, ce qui est\noptionnel. Finalement, elle décrit la signification du terme  compatible avec\nl'accessibilité , puisque la conformité ne peut  dépendre  que des technologies qui\nsont utilisées de manière compatible avec l'accessibilité. Le document  Comprendre la conformité (en anglais)  comprend des\nexplications plus précises sur la notion de compatibilité avec\nl'accessibilité. \n Les exigences de\nconformité \n Afin qu'une page Web soit conforme aux WCAG 2.0, toutes les exigences\nsuivantes doivent être satisfaites : \n 1. Niveau de conformité : \nl'un des niveaux de conformité suivants est atteint par le respect de la\ntotalité de ses critères de succès. \n Niveau A :  pour une conformité de\n    niveau A (le niveau minimal de conformité), la  page\n    Web   satisfait  à tous les critères de\n    succès de niveau A ou une  version de\n    remplacement conforme  est fournie.  \n Niveau AA :  pour une conformité\n    de niveau AA, la page Web remplit tous les critères de succès de niveau A\n    et AA ou une version de remplacement conforme au niveau AA est fournie. \n Niveau AAA :  pour une conformité\n    de niveau AAA, la page Web remplit tous les critères de succès de niveau\n    A, AA et AAA ou une version de remplacement conforme au niveau AAA est\n    fournie.  \n Note 1 :  bien que la conformité se définisse par\npaliers, les auteurs sont invités à mentionner (dans leur déclaration) tous\nles critères de succès satisfaits au-delà du niveau de conformité\natteint. \n Note 2 :  il n'est pas recommandé de se fixer le\nniveau AAA comme objectif à l'échelle de sites entiers car il n'est pas\npossible de satisfaire à tous les critères de succès du niveau AAA pour\ncertains contenus. \n 2. Pages complètes :  la\n conformité  (et le niveau de conformité) s'entend\nuniquement pour des  pages Web  complètes et ne peut être atteinte si une\npartie de la page Web est exclue.  \n Note 1 :  dans le but de déterminer la conformité,\nles versions de remplacement à une partie du contenu de la page sont\nconsidérées comme une partie de la page quand les versions de remplacement\npeuvent être obtenues directement depuis la page, comme par exemple, une\ndescription longue ou la présentation de remplacement d'une vidéo. \n Note 2 : les auteurs de  pages Web qui\nne peuvent être considérées comme conformes en raison d'un contenu qui n'est\npas sous le contrôle de l'auteur peuvent envisager d'utiliser une  déclaration de conformité partielle . \n 3. Processus complets : \nquand une  page Web  fait partie d'un ensemble représentant un  processus  (comme une succession d'étapes devant être\ncomplétées afin d'accomplir une activité), toutes les pages Web du processus\nsont conformes au moins au niveau spécifié. (La conformité à un certain\nniveau est impossible s'il existe une page de ce processus qui n'atteint pas au\nmoins ce niveau.) \n Exemple :  une boutique en ligne présente une\nsérie de pages permettant de sélectionner et d'acheter des produits. Toutes\nles pages de la séquence depuis le début jusqu'à la fin (le paiement) sont\nconformes afin que toute page faisant partie du processus soit conforme. \n 4. L'usage des technologies selon\ndes méthodes exclusivement compatibles avec l'accessibilité :  la\nsatisfaction à un critère de succès ne  dépend  que des méthodes\nd'utilisation des  technologies  qui sont  compatibles avec\nl'accessibilité . Toute information ou fonctionnalité proposée d'une\nmanière non compatible avec l'accessibilité est également disponible sous\nune forme compatible avec l'accessibilité. (Voir  Comprendre la compatibilité avec l'accessibilité (en\nanglais) .)  \n 5. Non interférence :  si\ndes  technologies  sont employées de manière non  compatible avec\nl'accessibilité  ou non conforme, alors elles n'empêchent pas les\nutilisateurs d'accéder au reste de la page. En outre, la  page Web \ndans sa globalité continue de répondre aux exigences de conformité dans\nchacun des cas suivants :  \n quand toute technologie non  dépendante  est activée dans\n    l'agent utilisateur, \n quand toute technologie non dépendante est désactivée dans l'agent\n    utilisateur et \n quand toute technologie non dépendante n'est pas reconnue par l'agent\n    utilisateur \n De plus, les critères de succès suivants s'appliquent à\ntout le contenu de la page, y compris au contenu dont on ne dépend pas\nautrement pour atteindre la conformité, car un échec à les satisfaire\npourrait perturber toute utilisation de la page : \n 1.4.2 - Contrôle du son , \n 2.1.2 - Pas de piège au clavier , \n 2.3.1 - Pas plus de trois flashs ou sous le seuil\n    critique  et \n 2.2.2 - Mettre en pause, arrêter, masquer . \n Note :  si une page ne peut pas être rendue\nconforme (par exemple une page de test de la conformité ou une page\nd'exemple), elle ne peut pas être incluse dans le périmètre de conformité\nou dans une déclaration de conformité. \n Pour plus d'information et des exemples, voir  Comprendre les exigences de conformité (en anglais) .  \n Déclarations de\nconformité (optionnelle)  \n La conformité est définie seulement pour les  pages\nWeb . Toutefois, une déclaration de conformité peut être faite pour une\nseule page, une série de pages ou un ensemble de pages Web reliées entre\nelles. \n Éléments\nrequis pour une déclaration de conformité \n Une déclaration de conformité  n'est pas\nobligatoire . Les auteurs peuvent se conformer aux WCAG 2.0 sans faire\naucune déclaration. Toutefois, si une déclaration de conformité est faite,\ncette déclaration de conformité  doit  inclure les\ninformations suivantes : \n Date  de la déclaration; \n Titre des Règles, version et URI :   « Règles\n    pour l'accessibilité des contenus Web 2.0 à  http://www.w3.org/TR/2008/REC-WCAG20-20081211/  »\n Niveau de conformité  satisfait : (Niveau A, AA ou\n    AAA)  \n Une brève description des pages Web , comme une liste\n    d'URI pour lesquelles la déclaration est faite en précisant si les\n    sous-domaines sont inclus dans la déclaration. \n Note 1 :  les pages Web peuvent être décrites\n    sous forme de liste ou par une expression qui décrit tous les URI inclus\n    dans la déclaration. \n Note 2 :  les produits Web qui ne comportent pas\n    d'URI avant leur installation sur le site Web du client peuvent comporter\n    un engagement à l'effet que le produit sera conforme une fois\n    installé. \n Une liste des  technologies Web  dont  dépend  l'utilisation du\n    contenu. \n Note :  si un logo de conformité est utilisé, il\ndevrait constituer une déclaration et doit donc être accompagné des\néléments requis pour une déclaration de conformité tel qu'énumérés\nci-dessus. \n Éléments\noptionnels d'une déclaration de conformité  \n En plus des éléments ci-dessus qui sont requis pour une\ndéclaration de conformité, considérer la possibilité d'ajouter des\ninformations pour aider les utilisateurs. Les informations supplémentaires\nrecommandées comprennent : \n Une liste des critères de succès qui vont au-delà du niveau de\n    conformité atteint. Cette information devrait être donnée d'une façon\n    que les utilisateurs pourront utiliser, de préférence sous la forme de\n    métadonnées lisibles par machine.  \n Une liste des technologies qui «  sont utilisées mais dont\n    l'utilisation du contenu ne  dépend  pas ». \n Une liste des agents utilisateurs, incluant les technologies\n    d'assistance qui ont été utilisées pour vérifier le contenu.  \n De l'information à propos des dispositions prises pour aller au-delà\n    des critères de succès dans le but d'améliorer l'accessibilité. \n Une version lisible par machine d'une métadonnée sur les\n    technologies spécifiques dont  dépend  l'utilisation du contenu.\n Une version lisible par machine de la déclaration de conformité. \n Note 1 :  lire  Comprendre la déclaration de conformité (en anglais)  pour\nplus d'information et pour des exemples de déclarations de conformité. \n Note 2 :  lire  Comprendre les métadonnées (en anglais)  pour plus\nd'informations à propos de l'utilisation des métadonnées dans une\ndéclaration de conformité. \n Déclaration de\nconformité partielle - Contenu fourni par un tiers \n Parfois, des pages Web sont créées afin que l'on puisse y rajouter un\ncontenu. Par exemple, une application Web de courrier électronique, un blogue,\nun article permettant l'ajout de commentaires par les utilisateurs ou des\napplications acceptant du contenu généré par l'utilisateur. Un autre exemple\nserait une page, telle que celles d'un portail ou d'un site d'informations,\ncomposées d'une somme de contenus rédigés par de multiples contributeurs ou\ndes sites insérant automatiquement, au fur et à mesure, du contenu provenant\nd'autres sites, tels que des publicités insérées automatiquement. \n Dans ces cas-là, il est impossible lors de l'affichage\noriginal de savoir quel sera le contenu non contrôlé de ces pages. Il est\nimportant de remarquer que le contenu non contrôlé peut également affecter\nl'accessibilité du contenu contrôlé. Deux options sont envisageables : \n La détermination de conformité peut être basée sur la connaissance\n    de l'existant. Si une page de ce type est vérifiée et réparée (le\n    contenu non conforme est enlevé ou mis en conformité) en moins de deux\n    jours ouvrables, alors une détermination ou affirmation de la conformité\n    peut être faite puisque, excepté les erreurs dans le contenu généré en\n    externe qui sont corrigées ou enlevées lorsqu'elles sont découvertes, la\n    page est conforme. Aucune affirmation de conformité ne peut être faite\n    s'il est impossible de vérifier ou de réparer le contenu non conforme \n ou \n Une « déclaration de conformité partielle » peut être faite\n    comme quoi la page n'est pas conforme, mais qu'elle pourrait l'être si\n    certaines parties étaient enlevées. La forme de cette déclaration\n    pourrait être : « Cette page n'est pas conforme, mais pourrait être\n    conforme aux WCAG 2.0 niveau X si les parties suivantes, issues de sources\n    non contrôlées, lui étaient retirées ». De plus, ce qui suit pourrait\n    également être reconnu comme un contenu non contrôlé comme décrit dans\n    la déclaration de conformité partielle : \n C'est du contenu qui n'est pas contrôlé par l'auteur. \n C'est du contenu décrit de façon à être identifié par les\n        utilisateurs (par exemple, on ne peut pas les décrire comme « toutes\n        les parties que nous ne contrôlons pas » à moins qu'elles ne soient\n        clairement marquées comme telles). \n Déclaration de conformité partielle -\nLangue \n Une « déclaration de conformité partielle selon la langue » peut être\nfaite lorsqu'une page n'est pas conforme et pourrait l'être si la  compatibilité avec\nl'accessibilité  était assurée pour toutes les langues utilisées dans la\npage. La déclaration s'énonce alors comme suit : « Cette page  n'est\npas conforme, mais  serait conforme aux WCAG 2.0 au niveau X si la\ncompatibilité avec l'accessibilité était assurée pour la (les) langue(s)\nsuivante(s) : » \n Annexe A : Glossaire \n Cette section est  normative .  \n abréviation \n forme abrégée d'un mot, d'une expression ou d'un nom lorsque\n      l'abréviation ne fait pas encore partie de la langue courante  \n Note 1 :  ceci comprend les sigles et les\n      acronymes formés à partir des initiales des mots où : \n les sigles  sont une forme abrégée d'un nom ou\n          d'une expression constituée des lettres initiales des mots ou des\n          syllabes contenues dans ce nom ou cette expression. \n Note 1 :  ne sont pas définies dans\n          toutes les langues.  \n Exemple 1 :  SNCF est le sigle de la\n          Société nationale des chemins de fer français.  \n Exemple 2 :  ESP est le sigle, en anglais,\n          de  extrasensory\n          perception , la perception extrasensorielle. \n les acronymes  sont des abréviations formées\n          à partir des premières lettres ou des parties d'autres mots (dans\n          un nom ou une expression) et qui peuvent être prononcés comme un\n          mot.  \n Exemple :  ONU est un acronyme constitué\n          des premières lettres de Organisation des Nations unies. \n Note 2 :  quelques sociétés ont adopté ce\n      qui constituait un sigle ou un acronyme comme nom de leur société. Dans\n      un tel cas, le nouveau nom de la société est constitué des lettres\n      (par exemple, Ecma) et le mot n'est plus alors considéré comme une\n      abréviation. \n agent\n  utilisateur \n tout logiciel qui récupère et présente le contenu Web aux\n      utilisateurs \n Exemple :  les navigateurs Web, les lecteurs\n      de média, les modules d'extensions et les autres programmes — dont  les technologies d'assistance  — qui aident à\n      récupérer, restituer et interagir avec le contenu Web. \n  (texte)\n  agrandi \n avec au minimum 18 points ou 14 points gras ou une taille de\n      caractère équivalente pour les polices chinoises, japonaises ou\n      coréennes (CJK)  \n Note 1 :  les polices avec des traits\n      extraordinairement fins ou des aspects et des caractéristiques\n      inhabituels qui réduisent la reconnaissance de la forme des lettres sont\n      plus difficiles à lire, spécialement à des niveaux de contrastes\n      bas. \n Note 2 :  la taille de caractère est la\n      taille lorsque le contenu est affiché. Cela n'inclut pas le\n      redimensionnement qui pourrait être fait par l'utilisateur. \n Note 3 :  la taille réelle des caractères\n      qu'un utilisateur voit est dépendante à la fois de la définition de la\n      taille faite par l'auteur, du périphérique de restitution de\n      l'utilisateur ou du paramétrage de l'agent utilisateur. Pour la\n      majorité des polices de corps de texte, 14 et 18 points est sensiblement\n      équivalent à 1,2 et 1,5 em ou à 120% et 150% de la taille par défaut\n      du corps de texte (en considérant que la police de corps est à 100%),\n      mais les auteurs seraient tenus de vérifier cela pour les polices\n      particulières qui seraient utilisées. Quand les polices sont définies\n      en unités relatives, la taille réelle du point est mesurée par l'agent\n      utilisateur pour l'affichage. La taille d'un point doit être obtenue\n      auprès de l'agent utilisateur ou calculée sur la même base de mesure\n      que celle de l'agent utilisateur, lors de l'évaluation de ce critère de\n      succès. Les utilisateurs qui ont une basse vision auront à choisir les\n      paramètres appropriés. \n Note 4 :  lors de l'utilisation de texte sans\n      spécification de taille de caractère, la taille la plus petite\n      utilisée dans les principaux navigateurs pour le texte dont la taille\n      n'est pas spécifiée serait considérée comme une taille raisonnable\n      pour la police. Si un titre de niveau 1 est restitué en 14pt gras ou\n      plus sur les principaux navigateurs, alors il est raisonnable de\n      considérer qu'il s'agit de texte agrandi. Le redimensionnement relatif\n      peut être calculé de manière identique à partir de la taille par\n      défaut. \n Note 5 :  la taille 18 ou 14 points pour les\n      textes en alphabet latin est définie à partir de la taille minimum pour\n      les grands caractères (14pt) et de la taille standard plus grande\n      (18pt). Pour les autres polices telles que les langues CJK, les tailles\n      « équivalentes » seraient la taille de grand caractère minimum\n      utilisée pour ces langues et la taille de grands caractères plus grande\n      suivante. \n aide contextuelle \n texte d'aide qui fournit des informations relatives à la fonction\n      actuellement utilisée \n Note :  des étiquettes claires peuvent jouer\n      le rôle d'aide contextuelle. \n ambigu\n  pour tout utilisateur \n l'intention ne peut être déterminée à partir du lien et de toute\n      l'information de la page Web présentée à l'utilisateur en même temps\n      que ce lien. (c'est-à-dire qu'un lecteur sans limitations fonctionnelles\n      ne connaîtrait pas la fonction d'un lien avant de l'activer) \n Exemple :  le mot goyave dans la phrase\n      suivante utilisé comme lien : « L'une des exportations importantes\n      est la goyave ». Ce lien pourrait conduire à une définition de la\n      goyave, à un graphe présentant une liste des quantités de goyave\n      exportées ou à une photo de gens récoltant la goyave. Jusqu'à ce que\n      le lien soit activé, tout utilisateur est dans l'incertitude et une\n      personne handicapée n'est donc pas désavantagée. \n art ASCII \n dessin créé par une disposition spatiale de caractères ou glyphes\n      (habituellement à partir des 95 caractères imprimables définis en\n      ASCII) \n audio \n la technologie de reproduction des sons \n Note :  le son peut être créé de façon\n      synthétique (y compris la synthèse vocale), être enregistré à partir\n      de sons réels ou les deux. \n audio-description \n narration ajoutée à une piste sonore pour décrire les détails\n      visuels importants qui ne peuvent être compris à partir de la piste\n      sonore principale seulement \n Note 1 :  l'audio-description d'une  vidéo \n      fournit de l'information à propos des actions, des personnages, des\n      changements de scènes, du texte apparaissant à l'écran et d'autres\n      contenus visuels.  \n Note 2 :  dans une audio-description standard,\n      la narration est ajoutée durant les pauses qui existent dans le\n      dialogue. (Voir aussi  audio-description\n      étendue .) \n Note 3 :  lorsque toute l'information de la  vidéo \n      est déjà donnée dans la piste  audio , aucune audio-description\n      supplémentaire n'est requise. \n Note 4 :  aussi nommée\n      « vidéo-description » et « narration descriptive ». \n  audio-description étendue \n audio-description ajoutée à une présentation audiovisuelle en\n      mettant en pause la  vidéo  de manière à avoir le temps\n      d'ajouter des descriptions supplémentaires \n Note :  cette technique est à utiliser\n      seulement si le sens de la  vidéo  est perdu sans  audio-description \n      supplémentaire et que les pauses entre les dialogues ou la narration\n      sont trop courtes. \n blocs de\n  texte \n plus d'une phrase de texte \n CAPTCHA \n sigle de  « Completely Automated\n      Public Turing test to tell Computers and Humans Apart »  (test\n      public de Turing entièrement automatique ayant pour but de distinguer\n      les humains des ordinateurs) \n Note 1 :  les tests de type CAPTCHA demandent\n      souvent à l'utilisateur de taper un texte présenté dans une image ou\n      un extrait audio déformés. \n Note 2 :  un test de Turing est tout système\n      de tests conçu pour distinguer un humain d'un ordinateur. Il est nommé\n      en l'honneur du célèbre informaticien Alan Turing. Ce terme a été\n      popularisé par les chercheurs de l'Université  Carnegie Mellon .  [CAPTCHA] \n changements de contexte \n changements majeurs dans le contenu d'une  page\n      Web  qui, s'ils sont faits sans que l'utilisateur en soit conscient,\n      peuvent désorienter l'utilisateur qui ne peut voir l'ensemble de la page\n      en même temps \n Les changements de contexte comprennent les changements de :  \n agent utilisateur  ; \n espace de restitution  ; \n focus ; \n contenu  qui modifie la signification de la  page Web . \n Note :  Un changement de contenu n'est pas\n      toujours un changement de contexte. Un changement dans le contenu comme\n      le déploiement d'une arborescence, un menu dynamique ou un déplacement\n      de tabulation ne change pas nécessairement le contexte à moins qu'il ne\n      change aussi l'un des éléments énumérés ci-dessus (par exemple le\n      focus). \n Exemple :  l'ouverture d'une nouvelle\n      fenêtre, le déplacement du focus sur un composant différent, le\n      déplacement vers une nouvelle page (y compris tout ce qui, pour\n      l'utilisateur, aurait l'air d'un déplacement vers une autre page) ou la\n      réorganisation significative du contenu d'une page sont autant\n      d'exemples d'un changement de contexte. \n clignotement \n alternance entre deux états visuels d'une façon qui veut attirer\n      l'attention  \n Note :  voir aussi  flash .\n      Il est possible que quelque chose soit suffisamment gros et clignote de\n      façon suffisamment lumineuse à la fréquence appropriée pour être\n      aussi considéré comme un flash. \n compatible avec l'accessibilité \n compatible avec les  technologies d'assistance  des\n      utilisateurs ainsi qu'avec les fonctions d'accessibilité des navigateurs\n      et des autres  agents utilisateurs \n Pour que l'utilisation d'une technologie Web (ou d'une fonctionnalité\n      d'une technologie) soit considérée comme compatible avec\n      l'accessibilité, les conditions 1 et 2 doivent toutes deux être\n      respectées pour une technologie Web (ou pour une fonctionnalité d'une\n      technologie) :  \n La façon dont la  technologie Web  est utilisée doit être\n          compatible avec les technologies d'assistance des\n          utilisateurs.  Cela signifie que la façon dont la\n          technologie est utilisée a été testée dans une perspective\n          d'interopérabilité avec des utilisateurs des technologies\n          d'assistance dans la ou les  langues  du contenu ; \n ET   \n La technologie Web doit fonctionner avec des agents\n          utilisateurs qui sont compatibles avec l'accessibilité et qui sont\n          à la disposition des utilisateurs.  Cela signifie qu'au\n          moins une des quatre affirmations suivantes est vraie : \n La technologie fonctionne de façon native dans des agents\n              utilisateurs largement distribués qui sont eux-mêmes\n              compatibles avec l'accessibilité (comme HTML et CSS) ; \n OU   \n La technologie fonctionne avec un module d'extension\n              largement distribué et qui est lui-même compatible avec\n              l'accessibilité ; \n OU   \n Le contenu est disponible dans un environnement fermé comme\n              le réseau d'une université ou d'une entreprise où l'agent\n              utilisateur requis par la technologie et utilisé par\n              l'organisation est lui-même compatible avec l'accessibilité ;\n OU   \n Les agents utilisateurs avec lesquels fonctionne la\n              technologie sont compatibles avec l'accessibilité et sont\n              disponibles en téléchargement ou à l'achat d'une façon\n              qui : \n ne coûte pas plus cher à une personne handicapée\n                  qu'à une personne sans limitations fonctionnelles\n                   et \n est aussi facile à trouver et à obtenir par une\n                  personne handicapée qu'elle l'est pour une personne sans\n                  limitations fonctionnelles. \n Note 1 :  le Groupe de travail des WCAG et le\n      W3C ne précisent pas quel niveau de compatibilité avec les technologies\n      d'assistance une technologie Web particulière doit avoir pour être\n      considérée comme compatible avec l'accessibilité. (Voir  le niveau de compatibilité avec les technologies\n      d'assistance nécessaire à la «  compatibilité avec l'accessibilité\n       » (en anglais) .) \n Note 2 :  les technologies Web peuvent être\n      utilisées d'une manière qui n'est pas compatible avec l'accessibilité\n      tant que l'utilisation du contenu n'en  dépend  pas et que la page dans\n      son ensemble satisfait aux exigences de conformité, incluant  l'Exigence de conformité 4 :  L'usage des\n      technologies selon des méthodes exclusivement compatibles avec\n      l'accessibilité  et  l'Exigence de conformité\n      5 : Non interférence  sont satisfaites. \n Note 3 :  quand une  technologie Web  est utilisée d'une manière qui est\n      « compatible avec l'accessibilité », cela n'implique pas que toute\n      la technologie ou que tous les usages de cette technologie sont\n      compatibles. La plupart des technologies, y compris HTML, comportent une\n      fonction ou un usage qui n'est pas compatible. Les pages sont conformes\n      aux WCAG seulement si les usages de la technologie qui sont compatibles\n      avec l'accessibilité sont les seuls dont dépend l'utilisation du\n      contenu et que ces usages permettent de satisfaire aux exigences des\n      WCAG. \n Note 4 :  lorsqu'une technologie Web est\n      citée et qu'elle se présente en plusieurs versions, la ou les versions\n      compatibles devraient être spécifiées. \n Note 5 :  pour les auteurs, une façon de\n      repérer les usages d'une technologie qui sont compatibles avec\n      l'accessibilité consisterait à consulter la compilation des usages qui\n      sont documentés comme compatibles avec l'accessibilité. (Voir  Comprendre les usages des technologies compatibles avec\n      l'accessibilité (en anglais) .) Les auteurs, les sociétés, les\n      vendeurs de technologies ou n'importe qui d'autre peuvent documenter les\n      usages des technologies qui sont compatibles avec l'accessibilité.\n      Toutefois, tous les usages des technologies documentés devraient\n      satisfaire à la définition des technologies Web compatibles avec\n      l'accessibilité telle qu'elle est énoncée ci-dessus. \n composant d'interface utilisateur \n partie du contenu qui est perçue par les utilisateurs comme un\n      élément de contrôle unique pour une fonction distincte \n Note 1 :  plusieurs composants d'interface\n      utilisateur peuvent être implémentés au sein d'un seul programme. La\n      notion de composant n'est pas liée ici aux techniques de programmation,\n      mais plutôt à ce que les utilisateurs perçoivent comme des éléments\n      de contrôle distincts. \n Note 2 :  les composants d'interface\n      utilisateur incluent les éléments de formulaire et les liens aussi bien\n      que des composants générés par scripts. \n Exemple :  un microprogramme (applet) dispose\n      d'un « élément de contrôle » permettant de se déplacer dans le\n      contenu ligne par ligne, page par page ou au hasard. Puisque chacune de\n      ces fonctions devrait avoir un nom et fonctionner indépendamment, elles\n      constitueraient chacune un « composant d'interface utilisateur ». \n conformité \n satisfaire à toutes les exigences d'une norme ou d'un standard\n      donné, d'une règle ou d'une spécification \n contenu\n  additionnel \n contenu  supplémentaire illustrant ou clarifiant le\n      contenu primaire \n Exemple 1 :  la version audio d'une  page\n      Web . \n Exemple 2 :  l'illustration d'un  processus  complexe. \n Exemple 3 :  un paragraphe résumant les\n      principales conclusions et recommandations d'un rapport de recherche. \n contenu non textuel \n tout contenu qui n'est pas une suite de caractères  déterminée par un\n      programme informatique  ou suite de caractères sans signification\n      dans aucune  langue \n Note :  ceci inclut  l'art\n      ASCII  (qui est un dessin à base de caractères), les émoticônes,\n      l'écriture « leetspeak » (qui utilise la substitution de\n      caractères) et les images représentant du texte. \n contenu Web \n information et expérience sensorielle à communiquer à\n      l'utilisateur au moyen d'un  agent utilisateur , y compris le\n      code ou le balisage qui définit la  structure , la  présentation  et les interactions du contenu \n contexte du lien déterminé par un programme\n  informatique \n information supplémentaire qui peut être  déterminée par un\n      programme informatique  à partir des  relations  avec un lien, combinée avec le texte du\n      lien et présentée aux utilisateurs sous différentes formes \n Exemple :  en HTML, l'information qui est\n      déterminée par un programme informatique à partir d'un lien en\n      français, y compris le texte qui est dans le même paragraphe, la même\n      liste ou la même cellule de tableau que le lien, ou une cellule\n      d'en-tête de tableau associée avec la cellule contenant le lien. \n Note :  puisque les lecteurs d'écran\n      interprètent la ponctuation, ils peuvent aussi fournir le contexte de la\n      phrase en cours, lorsque le focus est sur le lien contenu dans cette\n      phrase. \n contrôlable par l'utilisateur \n donnée auxquelles les utilisateurs ont accès \n Note :  ceci ne concerne pas les journaux de\n      connexions (logs) Internet et les données de supervision des moteurs de\n      recherche. \n Exemple :  les champs nom et adresse d'un\n      compte utilisateur. \n dans une fenêtre plein écran \n sur les écrans d'ordinateur de bureau ou portable de taille\n      courante dont l'espace de restitution est maximisé \n Note :  du fait que les gens gardent leurs\n      ordinateurs pendant plusieurs années, il est conseillé de ne pas se\n      baser sur les dernières résolutions d'écrans des ordinateurs de bureau\n      ou portable, mais de prendre en considération la plus représentative\n      des résolutions d'écrans durant une période de plusieurs années\n      précédant cette évaluation. \n défini par programmation \n défini par un logiciel utilisant des méthodes qui fonctionnent\n      avec les agents utilisateur, y compris les technologies d'assistance \n dépendre\n  (technologies) \n le contenu ne serait pas  conforme  si cette  technologie  est inactivée ou si elle n'est pas\n      compatible \n déterminé (déterminable) par un\n  programme informatique \n déterminé par un programme à partir de données fournies par\n      l'auteur d'une manière qui permet aux  agents utilisateur , y compris les  technologies d'assistance , d'extraire\n      et de présenter cette information aux utilisateurs sous différentes\n      formes \n Exemple 1 :  déterminé dans un langage de\n      balisage à partir d'éléments et d'attributs auxquels on accède grâce\n      aux technologies d'assistance couramment disponibles. \n Exemple 2 :  déterminé grâce à des\n      structures de données spécifiques d'une technologie pour un langage\n      non-balisé et exposée aux technologies d'assistance via une  API  d'accessibilité\n      aux technologies d'assistance couramment disponibles.  \n  en direct \n information captée depuis un événement du monde réel et transmis\n      à un récepteur sans autre délai que celui de la diffusion \n Note 1 :  le délai de diffusion est un court\n      délai souvent automatisé, utilisé par exemple pour permettre aux\n      diffuseurs de mettre en liste d'attente ou de censurer le flux sonore (ou\n      vidéo), mais insuffisant pour permettre un montage significatif. \n Note 2 :  si l'information est totalement\n      générée par ordinateur il ne s'agit pas d'information en direct. \n engagements juridiques \n transactions par lesquelles la personne contracte une obligation ou\n      reçoit un bénéfice de nature juridique \n Exemple :  un contrat de mariage, un échange\n      d'actions (financier et juridique), un legs, un prêt, une adoption, un\n      enrôlement dans l'armée, un contrat de tout type, etc. \n enseignement\n  primaire \n période de six ans qui commence entre l'âge de 5 et 7 ans, sans\n      forcément d'antécédents d'éducation \n Note :  cette définition se fonde sur la\n      norme de Classification internationale type de l'éducation de l' [UNESCO] . \n ensemble de pages Web \n groupe de  pages Web  partageant un objectif commun et créées\n      par le même auteur, groupe ou organisation \n Note :  différentes versions linguistiques\n      seraient considérées comme des ensembles de pages Web distincts. \n équivalent\n  textuel \n Texte  associé par programmation à un  contenu non textuel  ou dont il est fait mention\n      depuis un texte associé par programmation à un contenu non textuel. Un\n      texte associé par programmation est un texte dont l'emplacement peut\n      être déterminé par programmation depuis le contenu non textuel. \n Exemple :  l'image d'un graphique est décrite\n      textuellement dans le paragraphe suivant le graphique. Le bref\n      équivalent textuel du graphique indique que la description suit\n      celui-ci. \n Note :  se référer à  Comprendre les équivalents\n      textuels (en anglais )  pour plus d'informations. \n  erreur de\n  saisie \n information fournie par l'utilisateur qui n'est pas acceptée \n Note :  cela inclut : \n L'information qui est demandée par la  page Web  mais\n          oubliée par l'utilisateur. \n L'information qui est fournie par l'utilisateur mais qui ne\n          correspond pas au format ou aux valeurs des données attendus. \n espace de\n  restitution \n objet au sein duquel l'agent utilisateur présente du contenu \n Note 1 :  l'agent utilisateur  présente le contenu au travers\n      d'un ou plusieurs espaces de restitution. Les espaces de restitution\n      peuvent être des fenêtres, des cadres, des haut-parleurs et des loupes\n      virtuelles. Un espace de restitution peut contenir lui-même un autre\n      espace de restitution (par exemple, des cadres imbriqués). Les\n      composants d'interface créés par l'agent utilisateur, tels que des\n      invites de commandes, des menus et des alertes ne sont pas des espaces de\n      restitution. \n Note 2 :  cette définition est fondée sur le\n       Glossaire des règles pour l'accessibilité des agents\n      utilisateurs 1.0 (en anglais) . \n  essentiel(le) \n élément qui changerait fondamentalement les informations ou les\n      fonctionnalités du contenu s'il était supprimé  et \n      informations et fonctionnalités qui ne pourraient être restituées\n      autrement d'une manière conforme \n  étiquette \n texte  ou autre composant avec un  équivalent textuel  qui est\n      restitué à l'utilisateur pour permettre d'identifier un composant dans\n      un  contenu  Web \n Note 1 :  une étiquette est présentée à\n      tous les utilisateurs alors que le  nom  peut être masqué et seulement\n      restitué par une technologie d'assistance. Dans de nombreux cas (mais\n      pas tous) le nom et l'étiquette sont identiques. \n Note 2 :  le terme étiquette n'est pas\n      limité à l'élément label en HTML. \n événement en temps réel \n événement qui a) se produit en même temps que la visualisation et\n      b) n'est pas entièrement généré par le contenu \n Exemple 1 :  une diffusion Web d'une\n      représentation en direct (qui se produit en même temps que la\n      visualisation et qui n'est pas pré-enregistrée). \n Exemple 2 :  des enchères en ligne avec des\n      gens qui enchérissent (avec une visualisation en direct). \n Exemple 3 :  des humains interagissant dans un\n      monde virtuel grâce à des avatars (qui ne sont pas entièrement\n      générés par le contenu et qui se produisent en même temps que la\n      visualisation). \n expérience\n  sensorielle spécifique \n une expérience sensorielle qui n'est pas purement décorative et\n      dont l'objectif premier n'est pas de transmettre une information\n      importante ou d'accomplir une fonction \n Exemple :  on compte parmi les exemples un\n      morceau de flûte solo, des œuvres d'art visuel, etc. \n  expression\n  idiomatique \n phrase dont le sens ne peut être déduit du sens des mots qui la\n      composent et dont les mots spécifiques ne peuvent être changés sans en\n      perdre le sens \n Note :  les expressions idiomatiques ne\n      peuvent être traduites littéralement sans perdre leur sens (culturel ou\n      linguistique). \n Exemple 1 :  en anglais, «  spilling the beans  » signifie\n      « révéler un secret ». Cependant, «  knocking over the beans  » ou «  spilling the vegetables  » ne signifie pas la même\n      chose. \n Exemple 2 :  en japonais, la phrase «  さじを投げる  » se traduit\n      littéralement par « il jette une cuillère » mais cela signifie\n      qu'il n'y a rien qu'il puisse faire et que finalement il abandonne. \n Exemple 3 :  en néerlandais, «  Hij ging met de kippen op stok  » se\n      traduit littéralement par « il est allé rôtir avec les poulets »\n      mais cela signifie qu'il est allé au lit tôt. \n  flash \n alternance de  luminosité relative  qui\n      peut causer des crises chez certaines personnes si leur taille est\n      suffisamment importante dans une gamme de fréquences spécifiques \n Note 1 :  voir  seuil\n      de flash générique et seuil de flash rouge  pour plus d'informations\n      sur les types de flashs qui ne sont pas autorisés. \n Note 2 :  voir aussi  clignotement . \n  fonction\n  du lien \n nature d'un résultat obtenu par l'activation d'un lien \n  fonctionnalité \n processus  et résultats atteignables\n      par une action de l'utilisateur \n fonctionnalité similaire \n produit le même résultat à l'utilisation \n Exemple :  un bouton « rechercher » sur\n      une page Web et un bouton « trouver » sur une autre peuvent tous les\n      deux proposer un champ pour saisir un terme et lister les sujets\n      présents dans le site et pertinents par rapport au terme soumis. Dans ce\n      cas, ils offrent la même fonctionnalité mais ne sont pas nommés à\n      l'identique. \n  informatif, informative \n Dans un but d'informations complémentaires et non exigé pour la\n      conformité \n Note :  le contenu exigé pour la  conformité  est indiqué comme\n      «  normatif  ». \n  interface clavier \n interface utilisée par un logiciel pour obtenir une saisie au\n      clavier \n Note 1 :  une interface clavier permet aux\n      utilisateurs de fournir aux programmes une saisie au clavier même si la\n      technologie native ne comporte pas de clavier. \n Exemple :  un assistant numérique personnel\n      (PDA) à écran tactile possède une interface clavier intégrée à son\n      système d'exploitation et un connecteur pour des claviers externes. Les\n      applications dans le PDA peuvent utiliser l'interface pour obtenir une\n      saisie au clavier externe ou par d'autres applications qui simulent une\n      sortie clavier comme les interpréteurs d'écriture manuscrite ou les\n      applications de transcription vocale en texte avec des fonctionnalités\n      « d'émulation clavier ». \n Note 2 :  l'utilisation d'une application (ou\n      de parties d'une application) à travers un pointeur souris dirigé au\n      clavier, comme MouseKeys, ne constitue pas une opération réalisée au\n      travers d'une interface clavier car l'utilisation du programme passe par\n      l'interface de pointage et non pas par l'interface clavier. \n interprétation en langue des signes \n traduction d'une langue, généralement parlée, en  langue des signes \n Note :  les véritables langues des signes\n      sont des langues indépendantes qui ne sont pas attachées à la langue\n      parlée de la même région ou du même pays. \n  jargon \n termes utilisés par les personnes d'une façon particulière dans\n      un domaine particulier \n Exemple :  les termes « touches\n      rémanentes » sont du jargon du domaine des technologies\n      d'assistance. \n  langue \n langue qui est parlée, écrite ou signée (à l'aide des signes\n      visuels ou tactiles) pour communiquer avec les humains \n Note :  voir aussi  langue\n      des signes . \n langue\n  des signes \n un langage employant des combinaisons de mouvements des mains et des\n      bras, des expressions faciales ou des positions corporelles pour\n      transmettre du sens \n luminosité relative \n luminosité relative d'un quelconque point de l'espace\n      colorimétrique normalisé à 0 pour le noir le plus foncé et à 1 pour\n      le blanc le plus clair \n Note 1 :  pour l'espace colorimétrique de\n      couleur sRGB, la luminance relative d'une couleur est définie par L =\n      0,2126 *  R  + 0,7152 *  G  + 0,0722 *\n       B  où  R ,  G  and\n       B  sont définis par :  \n si R sRGB  <= 0,03928 alors  R  =\n          R sRGB /12,92 sinon  R  =\n          ((R sRGB +0,055)/1,055) ^ 2,4 \n si G sRGB  <= 0,03928 alors -- G  =\n          G sRGB /12,92 sinon  G  =\n          ((G sRGB +0,055)/1,055) ^ 2,4 \n si B sRGB  <= 0,03928 alors  B  =\n          B sRGB /12.92 sinon  B  =\n          ((B sRGB +0,055)/1,055) ^ 2,4 \n et R sRGB , G sRGB  et\n      B sRGB  sont définis par : \n R sRGB  = R 8bit /255 \n G sRGB  = G 8bit /255 \n B sRGB  = B 8bit /255 \n Le caractère \"^\" est l'opérateur exponentiel.\n      (formules tirées de  [sRGB]  et  [IEC-4WD] ). \n Note 2 :  la plupart des systèmes utilisés\n      aujourd'hui pour afficher le contenu Web adoptent l'encodage sRGB. À\n      moins que l'on sache qu'un autre espace colorimétrique va être utilisé\n      pour traiter et afficher le contenu, les auteurs devraient l'évaluer en\n      utilisant l'espace colorimétrique sRGB. Si l'on utilise d'autres espaces\n      colorimétriques, voir  Comprendre le critère de succès 1.4.3 (en\n      anglais) . \n Note 3 :  si un tramage est effectué après\n      l'affichage, alors la valeur source de la couleur est utilisée. Pour les\n      couleurs tramées à la source, les valeurs moyennes des couleurs qui\n      sont tramées devraient être utilisées (R moyen, G moyen, B moyen). \n Note 4 :  il existe des outils qui effectuent\n      automatiquement les calculs lors des tests de contraste et de flash. \n Note 5 :  une  version MathML de\n      la définition de la luminosité relative  est disponible. \n  mécanisme \n processus  ou technique pour obtenir\n      un résultat \n Note 1 :  le mécanisme peut être\n      explicitement fourni par le contenu ou  dépendre  de la plateforme ou\n      de l' agent utilisateur , y compris\n      les  technologies\n      d'assistance . \n Note 2 :  le mécanisme doit satisfaire à\n      tous les critères de succès (d'un niveau donné) pour déclarer un\n      niveau de conformité. \n média de remplacement pour un texte \n média qui ne donne pas plus d'information que ce que donne le texte\n      (directement ou via un équivalent textuel) \n Note :  une version de remplacement pour un\n      texte est fournie à ceux qui bénéficient de représentations\n      équivalentes du texte. Les versions de remplacement de texte peuvent\n      n'être que seulement audio, que seulement vidéo (y compris la vidéo en\n      langue des signes) ou audio-vidéo. \n média synchronisé \n flux  audio  ou  vidéo  synchronisé avec un autre\n      format pour présenter de l'information et/ou comportant des composants\n      temporels interactifs, à moins que le média soit un  média de remplacement\n      pour un texte  clairement identifié comme telle \n même\n  ordre relatif \n même position relativement aux autres éléments \n Note :  plusieurs éléments sont considérés\n      être dans le même ordre relatif même si d'autres éléments sont\n      insérés ou retirés de l'ordre original. Par exemple, des menus de\n      navigation extensibles peuvent intégrer un niveau de détail\n      additionnel, une section de navigation secondaire peut être insérée\n      dans l'ordre de lecture. \n mis en pause \n arrêté par une action de l'utilisateur et relancé seulement sur\n      demande de l'utilisateur \n nom \n texte grâce auquel un logiciel peut identifier pour l'utilisateur\n      un composant du contenu Web \n Note 1 :  le nom peut être caché et\n      présenté seulement aux technologies d'assistance, alors qu'une  étiquette  est présentée à tous les utilisateurs.\n      Dans de nombreux cas (mais pas dans tous), l'étiquette et le nom sont\n      identiques. \n Note 2 :  celui-ci n'a pas de lien avec\n      l'attribut HTML name. \n normatif \n exigé pour la conformité \n Note 1 :  il est possible d'être en\n      conformité stricte avec ce document de nombreuses manières bien\n      définies. \n Note 2 :  le contenu identifié comme «  informatif  » ou « non-normatif » n'est jamais\n      exigé pour la conformité. \n ordre de lecture correct \n tout ordre séquentiel où les mots et les paragraphes sont\n      présentés dans un ordre qui ne modifie pas la signification du\n      contenu \n page Web \n une ressource autonome obtenue depuis un URI unique grâce au\n      protocole HTTP, accompagnée de toutes les autres ressources utilisées\n      dans la restitution ou conçues pour être restituées simultanément par\n      un  agent utilisateur \n Note 1 :  bien que toutes les « autres\n      ressources » seraient restituées avec la ressource primaire, elles ne\n      sont pas nécessairement restituées simultanément. \n Note 2 :  à des fins de conformité avec ces\n      règles, une ressource doit être autonome à l'intérieur du périmètre\n      de conformité pour être considérée comme une page Web. \n Exemple 1 :  une ressource Web incluant toutes\n      les images et médias liés. \n Exemple 2 :  un programme Web de courrier\n      électronique (Webmail) développé à l'aide d'AJAX ( Asynchronous JavaScript and XML , JavaScript asynchrone\n      et XML). Le programme réside intégralement à l'adresse\n      http://exemple.com/mail, mais comprend une boîte de réception, un\n      carnet d'adresses et un calendrier. Des liens et des boutons permettent\n      d'afficher la boîte de réception, les contacts ou le calendrier, mais\n      ne changent pas globalement l'URI de la page. \n Exemple 3 :  un site portail personnalisable,\n      dans lequel les utilisateurs peuvent choisir le contenu à afficher à\n      partir d'un ensemble de modules de contenu. \n Exemple 4 :  quand on saisit\n      « http://shopping.exemple.com/ » dans son navigateur, on entre dans\n      un environnement commercial animé et interactif dans lequel on se\n      déplace visuellement dans une boutique, retirant les produits\n      directement depuis les rayons pour les placer dans un panier d'achat face\n      à soi. Cliquer sur un produit déclenche une démonstration avec la\n      fiche technique juste à côté. Cela peut être un site Web à page\n      unique ou simplement une page à l'intérieur d'un site Web. \n parcouru de façon\n  séquentielle \n parcouru dans l'ordre défini par le déplacement du focus (d'un\n      élément à l'autre) en utilisant une  interface clavier \n personnalisé visuellement \n la police, la taille, la couleur et le fond sont paramétrables \n pré-enregistré \n information qui n'est pas diffusée  en\n      direct \n premier cycle de\n  l'enseignement secondaire \n les deux ou trois années de scolarité qui commencent après six\n      ans environ d'enseignement primaire et qui se terminent après neuf ans\n      environ de scolarisation depuis le début de l' enseignement primaire \n Note :  cette définition se fonde sur la\n      norme de Classification internationale type de l'éducation de l' [UNESCO] . \n présentation \n rendu du  contenu  sous une forme perceptible par\n      l'utilisateur \n processus \n séries d'actions de l'utilisateur dont l'enchaînement est\n      nécessaire à l'accomplissement d'une tâche \n Exemple 1 :  utilisation réussie par\n      l'utilisateur, sur un site de vente, d'un enchaînement de pages Web\n      permettant de voir différents produits, des prix et des offres, de\n      sélectionner des produits, de soumettre une commande, de fournir les\n      informations d'envoi et de paiement. \n Exemple 2 :  une page permettant de créer un\n      compte utilisateur nécessitant l'accomplissement d'un test de Turing\n      avant de pouvoir accéder à cette page de formulaire de création de\n      compte. \n purement\n  décoratif  \n utilisé seulement dans un but esthétique, ne fournissant aucune\n      information et n'ayant aucune fonctionnalité \n Note :  un texte est purement décoratif si\n      les mots peuvent être réarrangés ou remplacés sans changer leur\n      raison d'être. \n Exemple :  la page couverture d'un\n      dictionnaire présente un arrière-plan estompé et constitué de mots\n      choisis au hasard. \n rapport de contraste \n (L1 + 0,05) / (L2 + 0,05), où \n L1 est la  luminosité relative \n          de la couleur la plus claire et  \n L2 est la  luminosité relative \n          de la couleur la plus sombre. \n Note 1 :  le rapport de contraste peut varier\n      de 1 à 21 (communément écrit 1:1, 1 pour 1, à 21:1, 21 pour 1). \n Note 2 :  étant donné que les auteurs ne\n      contrôlent pas la configuration de l'utilisateur concernant le rendu du\n      texte (par exemple le lissage de police ou l'anti-crénelage), le rapport\n      de contraste du texte peut être évalué en désactivant\n      l'anti-crénelage. \n Note 3 :  en ce qui concerne les critères de\n      succès 1.4.3 et 1.4.6, le contraste est mesuré en tenant compte de\n      l'arrière-plan sur lequel le texte est normalement affiché. Si aucune\n      couleur d'arrière-plan n'est spécifiée, il est considéré comme\n      blanc. \n Note 4 :  la couleur d'arrière-plan est la\n      couleur spécifiée du contenu sur lequel le texte est normalement\n      affiché. Il est considéré comme une erreur de ne pas définir une\n      couleur d'arrière-plan lorsque la couleur du texte est spécifiée,\n      parce que la couleur d'arrière-plan de l'utilisateur est inconnue et ne\n      peut donc pas être évaluée pour vérifier si le contraste est\n      suffisant. Pour la même raison, il est aussi considéré comme une\n      erreur de ne pas définir la couleur du texte lorsqu'une couleur\n      d'arrière-plan est spécifiée. \n Note 5 :  lorsqu'il y a une bordure autour de\n      la lettre, la bordure peut augmenter le contraste et serait utilisée\n      dans le calcul du contraste entre la lettre et son arrière-plan. La\n      couleur d'une bordure étroite autour de la lettre serait utilisée à la\n      place de la lettre. Une bordure large autour de la lettre qui remplit\n      l'espace dans lequel se découpe le détail de la lettre agit comme un\n      halo et serait considérée comme un arrière-plan. \n Note 6 :  la conformité aux WCAG devrait\n      être évaluée pour les paires de couleurs spécifiées dans le contenu\n      qu'un auteur s'attendrait à voir apparaître de façon adjacente dans\n      une présentation habituelle. Les auteurs n'ont pas besoin de prendre en\n      considération les présentations inhabituelles comme les changements de\n      couleurs faits par l'agent utilisateur sauf si ces changements sont\n      provoqués par le code de l'auteur. \n relations \n associations significatives entre des parties distinctes du\n      contenu \n rôle \n texte ou nombre par lequel un logiciel peut identifier la fonction\n      d'un composant dans du contenu Web \n Exemple :  un nombre qui indique si une image\n      sert d'hyperlien, de bouton de commande ou de case à cocher. \n satisfait à\n  un critère de succès \n le critère de succès ne se révèle pas « faux » lors de\n      l'évaluation de la page \n section \n une portion autonome de contenu écrit qui traite d'un ou plusieurs\n      sujets ou idées liés entre eux \n Note :  une section peut consister en un ou\n      plusieurs paragraphes et inclure des graphiques, des tableaux, des listes\n      et des sous-sections. \n  seuil de flash générique et seuil de flash\n  rouge \n un  flash  ou une séquence d'images changeant\n      rapidement est en dessous du seuil de flash (c'est-à-dire que le contenu\n      est  conforme ) si l'une des conditions suivantes est\n      satisfaite : \n il n'y a pas plus de trois  flashs génériques\n           et pas plus de trois  flashs rouges  par\n          seconde ; ou \n la surface d'affichage combinée des flashs simultanés ne\n          représente pas plus de 0,006 stéradian dans chaque champ visuel de\n          10 degrés sur l'écran (soit 25% de chaque champ visuel de 10\n          degrés sur l'écran) à une distance habituelle de visualisation \n où : \n un  flash générique  est défini comme une\n          alternance de  luminosité relative \n          de 10% ou plus par rapport à la luminosité relative maximum, où la\n          luminosité relative de l'image la plus sombre est en dessous de 0,80\n          et où « une alternance » est définie comme étant une\n          augmentation suivie d'une diminution ou une diminution suivie d'une\n          augmentation, et \n un  flash rouge  est défini comme toute\n          alternance de transition impliquant un rouge saturé. \n Exception :  Le flash qui suit un modèle précis et\n      équilibré comme du bruit blanc ou un modèle de damier alterné avec\n      des « carrés » dont les côtés font moins de 0,1 degré (du champ\n      visuel à une distance habituelle de visualisation) ne dépasse pas le\n      seuil de flash. \n Note 1 :  pour les logiciels ou le contenu\n      Web, un rectangle de 341 x 256 pixels n'importe où sur la surface\n      d'affichage de l'écran, quand la résolution est à 1024 x 768 pixels,\n      fournit une bonne estimation de ce que représente 10 degrés du champ\n      visuel sur l'écran pour un écran et une distance habituelle de\n      visualisation (par exemple des écrans de 38 à 43 centimètres (15 à 17\n      pouces) à une distance de 55 à 65 centimètres (22-26 pouces)). (Un\n      affichage à une résolution supérieure du même contenu produirait des\n      images plus petites et plus sûres, c'est pourquoi des résolutions\n      inférieures sont utilisées pour définir le seuil.) \n Note 2 :  une transition est le changement,\n      dans un temps donné, de luminosité relative (ou de luminosité relative\n      ou de couleur pour le flash rouge) entre les pics et les creux adjacents\n      dans un ensemble de mesures de luminosité relative (ou de luminosité\n      relative ou de couleur pour le flash rouge) \n Note 3 :  la définition couramment utilisée\n      dans le domaine pour  « deux transitions opposées de rouge\n      saturé »  est : pour chacun ou tous les états impliqués\n      dans chacune des transitions, R/(R+ G + B) >= 0,8, et le changement\n      dans la valeur de (R-G-B)x320 est > 20 (les valeurs négatives de\n      (R-G-B)x320 sont considérées comme nulles) pour chacune des\n      transitions. Les valeurs R, G, B se classent entre 0 et 1 tel que\n      spécifié dans la définition de « luminosité relative ».  [HARDING-BINNIE] \n Note 4 :  des outils sont disponibles pour\n      effectuer l'analyse depuis des captures vidéos. Cependant, aucun outil\n      n'est nécessaire pour évaluer cette condition si le flash est\n      inférieur ou égal à 3 flashs par seconde. Le contenu est\n      automatiquement conforme (voir #1 et #2 ci-dessus). \n seulement\n  audio \n une présentation temporelle qui contient seulement de l' audio \n      (sans  vidéo  ni interaction) \n seulement\n  vidéo \n une présentation temporelle qui ne contient que de la  vidéo \n      (aucun flux  audio  ni aucune interaction) \n sous-titres \n visuel synchronisé ou  équivalent textuel  pour\n      l'information audio avec ou sans parole nécessaire à la compréhension\n      du contenu d'un média \n Note 1 :  les sous-titres (en anglais  captions ) sont similaires à ceux\n      qui sont utilisés seulement pour les dialogues (en anglais  subtitles ) sauf que les\n      sous-titres ne communiquent pas seulement le contenu des dialogues\n      parlés mais aussi des équivalents pour les informations audio autres\n      que le dialogue et nécessaires à la compréhension du contenu du\n      programme, y compris les effets sonores, la musique, les rires,\n      l'identification et le positionnement des interlocuteurs. \n Note 2 :  les sous-titres codés sont de la\n      même espèce mais peuvent être activés ou désactivés dans certains\n      lecteurs multimédia. \n Note 3 :  les sous-titres visibles sont des\n      sous-titres qui ne peuvent être désactivés. Par exemple, si les\n      sous-titres sont un équivalent visuel en  texte sous forme d'image  intégré à la  vidéo . \n Note 4 :  les sous-titres ne devraient pas\n      masquer l'information pertinente de la vidéo, même partiellement. \n Note 5 :  dans certaines langues comme\n      l'anglais on distingue entre  caption  et  subtitles , le terme  caption  étant parfois traduit en français par\n      sous-titres pour malentendants. \n Note 6 :  l' audio-description  peut aussi être sous-titrée, mais\n      n'a pas besoin de l'être, étant donné qu'il s'agit d'une description\n      d'information qui est déjà présentée visuellement. \n structure \n La manière dont les parties d'une  page Web  sont organisées entre elles ; et \n La manière dont un groupe de  pages Web  est organisé \n technologie d'assistance\n  (tel qu'utilisé dans ce document) \n matériel ou logiciel qui agit comme  agent utilisateur  ou simultanément avec un agent\n      utilisateur usuel afin de fournir des fonctionnalités répondant aux\n      besoins des utilisateurs ayant des limitations fonctionnelles,\n      fonctionnalités qui vont au-delà de celles qui sont offertes par les\n      agents utilisateurs usuels  \n Note 1 :  les fonctionnalités fournies par\n      les technologies d'assistance comprennent des présentations de\n      remplacement (par exemple de la synthèse vocale ou du contenu agrandi),\n      des méthodes de saisie alternatives (par exemple la voix), des\n      mécanismes de navigation ou d'orientation supplémentaires et des\n      transformations de contenu (par exemple pour rendre un tableau plus\n      accessible).  \n Note 2 :  les technologies d'assistance\n      communiquent souvent les données et les messages aux agents utilisateurs\n      usuels en utilisant et en surveillant le fonctionnement d'une  API  (interface de programmation).  \n Note 3 :  la distinction entre agents\n      utilisateurs usuels et technologies d'assistance n'est pas absolue.\n      Plusieurs agents utilisateurs usuels comportent des fonctions\n      d'assistance aux utilisateurs ayant des limitations fonctionnelles. La\n      principale différence est que ces agents utilisateurs usuels visent un\n      public large et diversifié qui comprend des personnes avec et sans\n      limitations fonctionnelles. Les technologies d'assistance visent des\n      populations plus restreintes d'utilisateurs ayant des limitations\n      fonctionnelles particulières. L'assistance fournie par une technologie\n      d'assistance est plus spécifique et appropriée aux besoins des\n      utilisateurs visés. Un agent utilisateur usuel peut comporter des\n      fonctionnalités importantes pour les technologies d'assistance comme\n      l'extraction du contenu Web à partir d'objets de programmation ou\n      l'analyse syntaxique du balisage par paquets identifiables.  \n Exemple :  les technologies d'assistance qui\n      sont importantes dans le contexte du présent document comprennent les\n      technologies suivantes : \n les agrandisseurs d'écran et les autres assistants de lecture\n          visuelle qui sont utilisés par les personnes ayant des limitations\n          de la vision, de la perception ou d'accès physique à l'imprimé\n          pour modifier la police de caractères, la taille, l'espacement, la\n          couleur, la synchronisation avec la synthèse vocale, etc. dans le\n          but d'améliorer la lisibilité visuelle du rendu des textes et des\n          images ; \n les lecteurs d'écran qui sont utilisés par les personnes\n          aveugles pour lire l'information textuelle en synthèse vocale ou en\n          braille ; \n les logiciels de conversion du texte en parole qui sont\n          utilisés par certaines personnes ayant des limitations cognitives,\n          des limitations du langage et des difficultés d'apprentissage pour\n          convertir le texte en synthèse vocale ; \n les logiciels de reconnaissance vocale qui peuvent être\n          utilisés par les personnes ayant certaines limitations\n          motrices ; \n des claviers de remplacement qui sont utilisés par des\n          personnes ayant certaines limitations motrices pour simuler le\n          clavier (y compris des claviers de remplacement qui utilisent des\n          pointeurs de tête, des commutateurs simples, des dispositifs\n          d'aspiration/expiration et d'autres dispositifs spéciaux d'aide à\n          la saisie ; \n des dispositifs de pointage adaptés qui sont utilisés par des\n          personnes ayant certaines limitations motrices pour simuler le\n          pointeur de la souris et l'activation des boutons. \n technologie\n  Web \n mécanisme  pour encoder les instructions devant être\n      restituées, jouées ou exécutées par les  agents utilisateurs \n Note 1 :  tel qu'employés dans ces règles,\n      l'expression « technologie Web » et le mot « technologie »\n      (utilisé seul) désignent les technologies relatives aux contenus\n      Web. \n Note 2 :  les technologies relatives aux\n      contenus Web comprennent les langages de balisage, les formats de\n      données ou les langages de programmation que les auteurs sont amenés à\n      utiliser seuls ou combinés pour créer des expériences pour\n      l'utilisateur final qui vont de pages Web statiques jusqu'à des\n      présentations multimédia synchronisées, en passant par des\n      applications Web dynamiques. \n Exemple :  on compte parmi les exemples les\n      plus fréquents de technologies Web :  HTML ,  CSS ,  SVG ,  PNG ,  PDF , Flash et JavaScript. \n texte \n séquence de caractères pouvant être  déterminée par un\n      programme informatique  et exprimant quelque chose dans une  langue  donnée  \n  texte sous forme d'image \n texte qui est restitué sous une forme non textuelle (par exemple\n      une image) dans le but de permettre un effet visuel particulier \n Note :  cela n'inclut pas le  texte  qui\n      est une partie d'une image qui contient d'autres contenus visuels\n      signifiant. \n Exemple :  le nom d'une personne sur un badge\n      dans une photographie. \n urgence \n un événement ou une situation soudaine et imprévue qui exige une\n      action immédiate afin de préserver la santé, la sécurité ou la\n      propriété \n utilisé de manière inhabituelle ou de façon\n  limitée \n mots employés de telle manière qu'ils obligent les utilisateurs à\n      savoir exactement quelle définition appliquer afin de comprendre\n      correctement le contenu \n Exemple :  le terme « mémoire » possède\n      une signification différente dans une conversation universitaire de\n      celle qu'il peut avoir dans un article consacré au stockage\n      informatique, mais la définition pertinente peut être déduite du\n      contexte. À l'inverse, le mot « texte » est utilisé de manière\n      très spécifique dans les WCAG 2.0, à tel point qu'une définition\n      figure dans le glossaire. \n version de remplacement conforme \n version qui  \n se conforme au niveau déterminé et  \n fournit toutes les informations similaires et les mêmes  fonctionnalités  dans la même  langue  et \n est aussi à jour que le contenu non conforme et  \n pour laquelle au moins l'une des affirmations suivantes est\n          vraie : \n la version conforme peut être atteinte à partir de la page\n              non conforme via un  mécanisme   compatible\n              avec l'accessibilité  ou \n la version non conforme peut être atteinte seulement à\n              partir de la version conforme ou  \n la version non conforme peut être atteinte seulement à\n              partir d'une page conforme qui fournit aussi un mécanisme pour\n              atteindre la version conforme. \n Note 1 :  dans cette définition, « peut\n      être atteinte seulement » signifie qu'il y a un mécanisme comme une\n      redirection conditionnelle, qui empêche un utilisateur\n      « d'atteindre » (de charger) la page non conforme à moins que\n      l'utilisateur ne vienne justement de la version conforme de cette même\n      page. \n Note 2 :  la version de remplacement n'a pas\n      besoin d'être appariée page par page avec la version originale (par\n      exemple la version de remplacement conforme peut se présenter en\n      plusieurs pages). \n Note 3 :  si des versions sont proposées dans\n      plusieurs langues, une version de remplacement conforme est donc requise\n      pour chacune de ces langues. \n Note 4 :  des versions de remplacement peuvent\n      aussi être fournies afin d'accommoder différents environnements\n      technologiques ou différents groupes d'utilisateurs. Chaque version\n      devrait être aussi conforme que possible. Une version devrait être\n      entièrement conforme afin de satisfaire à  l'exigence de\n      conformité 1 . \n Note 5 :  la version de remplacement conforme\n      n'a pas besoin d'être située dans le périmètre de conformité ni\n      même sur le même site Web tant qu'elle est aussi librement disponible\n      que la version non conforme. \n Note 6 :  une version de remplacement ne\n      devrait pas être confondue avec un  contenu additionnel  qui s'ajoute à la page originale\n      pour en améliorer la compréhension. \n Note 7 :  permettre la configuration des\n      préférences de l'utilisateur à l'intérieur du contenu afin de\n      produire une version conforme est un mécanisme acceptable pour atteindre\n      une autre version tant que la méthode utilisée pour configurer les\n      préférences est compatible avec l'accessibilité. \n Voir  Comprendre\n      Version de remplacement conforme (en anglais) \n version de remplacement pour un média\n  temporel \n document renfermant dans un ordre correct une description des\n      contenus visuels et sonores d'un média temporel et fournissant un moyen\n      de réaliser les effets de toute interaction temporelle \n Note :  un scénario utilisé pour créer le\n      contenu d'un média synchronisé serait conforme à cette définition\n      seulement s'il a été corrigé afin de représenter fidèlement la\n      version finale du média synchronisé après édition. \n vidéo \n vidéo la technologie des images ou photos en mouvement ou en\n      séquence \n Note :  une vidéo peut être constituée\n      d'images fixes ou animées ou des deux. \n Annexe B :\nRemerciements \n Cette section est  informative .  \n Cette publication a été en partie financée par des fonds du gouvernement\nfédéral des États-Unis du ministère de l'éducation, de l'Institut National\npour la recherche sur le handicap et la réadaptation ( Institute on Disability and Rehabilitation Research (NIDRR) )\nsous le numéro de référence ED05CO0039. Le contenu de cette publication ne\nreflète pas nécessairement les avis ou politiques du ministère américain de\nl'éducation, la mention de noms de marques, de produits commerciaux ou\nd'organismes ne signifie pas non plus qu'ils ont été approuvés par le\ngouvernement des États-Unis. \n Des informations supplémentaires à propos de la participation au groupe de\ntravail des règles pour l'accessibilité des contenus Web (WCAG WG) sont\nconsultables sur la  page\nd'accueil du groupe de travail (en anglais) .  \n Participants actifs dans le groupe de\ntravail des WCAG au moment de la publication \n Bruce Bailey ( U.S. Access Board )\n Frederick Boland (NIST) \n Ben Caldwell ( Trace R&D\n    Center , Université du  Wisconsin ) \n Sofia Celic (expert invitée du W3C) \n Michael Cooper (W3C) \n Roberto Ellero (association Internationale des Webmasters /  HTML Writers Guild ) \n Bengt Farre (Rigab) \n Loretta Guarino  Reid (Google ) \n Katie Haritos-Shea \n Andrew Kirkpatrick (Adobe) \n Drew LaHart (IBM)  \n Alex Li (SAP AG) \n David MacDonald ( E-Ramp Inc. ) \n Roberto Scano ( International Webmasters\n    Association / HTML Writers Guild ) \n Cynthia Shelly (Microsoft) \n Andi Snow-Weaver (IBM) \n Christophe Strobbe (DocArch, K.U.Leuven) \n Gregg Vanderheiden ( Trace R&D\n    Center , Université du  Wisconsin ) \n Anciens participants dans le groupe de\ntravail des WCAG et autres contributeurs  \n Shadi Abou-Zahra, Jim Allan, Jenae Andershonis, Avi Arditti, Aries Arditi,\nMike Barta, Sandy Bartell, Kynn Bartlett, Marco Bertoni, Harvey Bingham, Chris\nBlouch, Paul Bohman, Patrice Bourlon, Judy Brewer, Andy Brown, Dick Brown,\nDoyle Burnett, Raven Calais, Tomas Caspers, Roberto Castaldo, Sambhavi\nChandrashekar, Mike Cherim, Jonathan Chetwynd, Wendy Chisholm, Alan Chuter,\nDavid M Clark, Joe Clark, James Coltham, James Craig, Tom Croucher, Nir Dagan,\nDaniel Dardailler, Geoff Deering, Pete DeVasto, Don Evans, Neal Ewers, Steve\nFaulkner, Lainey Feingold, Alan J. Flavell, Nikolaos Flo ratos, Kentarou\nFukuda, Miguel Garcia, P.J. Gardner, Greg Gay, Becky Gibson, Al Gilman, Kerstin\nGoldsmith, Michael Grade, Jon Gunderson, Emmanuelle Gutiérrez y Restrepo,\nBrian Hardy, Eric Hansen, Sean Hayes, Shawn Henry, Hans Hillen, Donovan Hipke,\nBjoern Hoehrmann, Chris Hofstader, Yvette Hoitink, Carlos Iglesias, Ian Jacobs,\nPhill Jenkins, Jyotsna Kaki, Leonard R. Kasday, Kazuhito Kidachi, Ken Kipness,\nMarja-Riitta Koivunen, Preety Kumar, Gez Lemon, Chuck Letourneau, Scott\nLuebking, Tim Lacy, Jim Ley, William Loughborough, Greg Lowney, Luca Mascaro,\nLiam McGee, Jens Meiert, Niqui Merret, Alessandro Miele, Mathew J Mirabella,\nCharles McCathieNevile , Matt May, Marti McCuller, Sorcha Moore, Charles F.\nMunat, Robert Neff, Bruno von Niman, Tim Noonan, Sebastiano Nutarelli, Graham\nOliver, Sean B. Palmer, Sailesh Panchang, Nigel Peck, Anne Pemberton, David\nPoehlman, Adam Victor Reed, Chris Ridpath, Lee Roberts, Gregory J. Rosmaita,\nMatthew Ross, Sharron Rush, Gian Sampson-Wild, Joel Sanda, Gordon Schantz, Lisa\nSeeman, John Slatin, Becky Smith, Jared Smith, Neil Soiffer, Jeanne Spellman,\nMike Squillace, Michael Stenitzer, Jim Thatcher, Terry Thompson, Justin Thorp,\nMakoto Ueki, Eric Velleman, Dena Wainwright, Paul Walsch, Takayuki Watanabe,\nJason White. \n Annexe C : Références \n Cette section est  informative .  \n CAPTCHA \n The CAPTCHA Project , Université\n       Carnegie Mellon . Le projet est en\n      ligne à  http://www.captcha.net . \n HARDING-BINNIE \n Harding G. F. A. and Binnie, C.D.,  Independent Analysis of the ITC Photosensitive Epilepsy\n      Calibration Test Tape . 2002. \n IEC-4WD \n IEC/4WD 61966-2-1:  Colour Measurement and\n      Management in Multimedia Systems and Equipment - Part 2.1: Default Colour\n      Space - sRGB . 5 mai 1998. \n sRGB \n \" A Standard Default Color Space for the\n      Internet - sRGB, \" M. Stokes, M. Anderson, S. Chandrasekar, R.\n      Motta, eds ., Version 1.10, 5 novembre 1996. Une copie de cet article est\n      consultable à  http://www.w3.org/Graphics/Color/sRGB.html . \n UNESCO \n Classification internationale type de l'éducation, 1997 Une copie de\n      la norme est consultable à  http://www.uis.unesco.org/ev_fr.php?ID=3813_201ID2=DO_TOPIC . \n WCAG10 \n Web Content Accessibility Guidelines\n      1.0 , auteurs : G. Vanderheiden, W. Chisholm, I. Jacobs,\n      recommandation du W3C, 5 mai 1999,\n      http://www.w3.org/TR/1999/WAI-WEBCONTENT-19990505/. La version la plus\n      récente des WCAG 1.0 est consultable à  http://www.w3.org/TR/WAI-WEBCONTENT/ ."}