{"url": "https://en.wikipedia.org/wiki/Research_design", "content": "Research design - Wikipedia \n Research design   \n From Wikipedia, the free encyclopedia   \n\t\t\t\t\tJump to:\t\t\t\t\t navigation , \t\t\t\t\t search \n This article's  tone or style may not reflect the  encyclopedic tone  used on Wikipedia .  See Wikipedia's  guide to writing better articles  for suggestions.   (January 2013)   ( Learn how and when to remove this template message ) \n A  research design  is the set of methods and procedures used in collecting and analysing measures of the variables specified in the research problem  research . The design of a study defines the study type (descriptive, correlation, semi-experimental, experimental, review, meta-analytic) and sub-type (e.g., descriptive-longitudinal  case study ),  research problem ,  hypotheses ,  independent and dependent variables ,  experimental design , and, if applicable, data collection methods and a statistical analysis plan. Research design is the framework that has been created to find answers to research questions. \n Contents \n 1   Design types and sub-types \n 1.1   Grouping \n 2   Confirmatory versus exploratory research \n 3   State problems versus process problems \n 4   Examples of fixed designs \n 4.1   Experimental research designs \n 4.2   Non-experimental research designs \n 5   Examples of flexible research designs \n 5.1   Case study \n 5.2   Ethnographic study \n 5.3   Grounded theory study \n 6   See also \n 7   References \n Design types and sub-types [ edit ] \n There are many ways to classify research designs, but sometimes the distinction is artificial and other times different designs are combined. Nonetheless, the list below offers a number of useful distinctions between possible research designs. A research design is an arrangement of conditions or collections. [1] \n Descriptive (e.g.,  case-study ,  naturalistic observation ,  survey ) \n Correlational (e.g.,  case-control study ,  observational study ) \n Semi-experimental (e.g.,  field experiment ,  quasi-experiment ) \n Experimental ( experiment  with random assignment) \n Review ( literature review ,  systematic review ) \n Meta-analytic ( meta-analysis ) \n Sometimes a distinction is made between \"fixed\" and \"flexible\" designs. In some cases, these types coincide with  quantitative  and  qualitative  research designs respectively, [2]  though this need not be the case. In fixed designs, the design of the study is fixed before the main stage of data collection takes place. Fixed designs are normally theory-driven; otherwise, it is impossible to know in advance which variables need to be controlled and measured. Often, these variables are measured quantitatively. Flexible designs allow for more freedom during the data collection process. One reason for using a flexible research design can be that the variable of interest is not quantitatively measurable, such as culture. In other cases, theory might not be available before one starts the research. \n Grouping [ edit ] \n The choice of how to group participants depends on the research hypothesis and on how the participants are  sampled . In a typical experimental study, there will be at least one \"experimental\" condition (e.g., \"treatment\") and one \"control\" condition (\"no treatment\"), but the appropriate method of grouping may depend on factors such as the duration of measurement phase and participant characteristics: \n Cohort study \n Cross-sectional study \n Cross-sequential study \n Longitudinal study \n Confirmatory versus exploratory research [ edit ] \n Confirmatory  research tests  a priori  hypotheses — outcome predictions that are made before the measurement phase begins. Such  a priori  hypotheses are usually derived from a theory or the results of previous studies. The advantage of confirmatory research is that the result is more meaningful, in the sense that it is much harder to claim that a certain result is generalizable beyond the data set. The reason for this is that in confirmatory research, one ideally strives to reduce the probability of falsely reporting a coincidental result as meaningful. This probability is known as  α-level  or the probability of a  type I error . \n Exploratory  research on the other hand seeks to generate  a posteriori  hypotheses by examining a data-set and looking for potential relations between variables. It is also possible to have an idea about a relation between variables but to lack knowledge of the direction and strength of the relation. If the researcher does not have any specific hypotheses beforehand, the study is exploratory with respect to the variables in question (although it might be confirmatory for others). The advantage of exploratory research is that it is easier to make new discoveries due to the less stringent methodological restrictions. Here, the researcher does not want to miss a potentially interesting relation and therefore aims to minimize the probability of rejecting a  real  effect or relation; this probability is sometimes referred to as β and the associated error is of  type II . In other words, if the researcher simply wants to see whether some measured variables could be related, he would want to increase the chances of finding a significant result by lowering the threshold of what is deemed to be  significant . \n Sometimes, a researcher may conduct exploratory research but report it as if it had been confirmatory ('Hypothesizing After the Results are Known', HARKing—see  Hypotheses suggested by the data ); this is a questionable research practice bordering on fraud. \n State problems versus process problems [ edit ] \n A distinction can be made between state problems and process problems. State problems aim to answer what the state of a phenomenon is at a given time, while process problems deal with the change of phenomena over time. Examples of state problems are the level of mathematical skills of sixteen-year-old children or the level, computer skills of the elderly, the depression level of a person, etc. Examples of process problems are the development of mathematical skills from puberty to adulthood, the change in computer skills when people get older and how depression symptoms change during therapy. \n State problems are easier to measure than process problems. State problems just require one measurement of the phenomena of interest, while process problems always require multiple measurements. Research designs such as repeated measurements and longitudinal study are needed to address process problems. \n Examples of fixed designs [ edit ] \n Experimental research designs [ edit ] \n See also:  Experiment \n In an experimental design, the researcher actively tries to change the situation, circumstances, or experience of participants (manipulation), which may lead to a change in behavior or outcomes for the participants of the study. The researcher randomly assigns participants to different conditions, measures the variables of interest and tries to control for  confounding variables . Therefore, experiments are often highly fixed even before the  data collection  starts. \n In a good  experimental design , a few things are of great importance. First of all, it is necessary to think of the best way to operationalize the variables that will be measured, as well as which statistical methods would be most appropriate to answer the research question. Thus, the researcher should consider what the expectations of the study are as well as how to analyse any potential results. Finally, in an experimental design the researcher must think of the practical limitations including the availability of participants as well as how representative the participants are to the target population. It is important to consider each of these factors before beginning the experiment. [3]  Additionally, many researchers employ power analysis before they conduct an experiment, in order to determine how large the sample must be to find an effect of a given size with a given design at the desired probability of making a  Type I or Type II error . \n Non-experimental research designs [ edit ] \n Non-experimental research designs do not involve a manipulation of the situation, circumstances or experience of the participants. Non-experimental research designs can be broadly classified into three categories. First, in relational designs, a range of variables are measured. These designs are also called correlation studies, because correlation data are most often used in analysis. Since  correlation does not imply causation , such studies simply identify co-movements of variables. Correlational designs are helpful in identifying the relation of one variable to another, and seeing the frequency of co-occurrence in two natural groups ( See  correlation and dependence ). The second type is  comparative research . These designs compare two or more groups on one or more variable, such as the effect of gender on grades. The third type of non-experimental research is a longitudinal design. A longitudinal design examines variables such as performance exhibited by a group or groups over time.  See  Longitudinal study . \n Examples of flexible research designs [ edit ] \n Case study [ edit ] \n See also:  Case study \n Famous case studies are for example the descriptions about the patients of Freud, who were thoroughly analysed and described. \n Bell (1999) states “a case study approach is particularly appropriate for individual researchers because it gives an opportunity for one aspect of a problem to be studied in some depth within a limited time scale”. [4] \n Ethnographic study [ edit ] \n See also:  Ethnography \n This type of research is involved with a group, organization, culture, or community. Normally the researcher shares a lot of time with the group. \n Grounded theory study [ edit ] \n Grounded theory  research is a systematic research process that works to develop \"a process, and action or an interaction about a substantive topic\". [5] \n See also [ edit ] \n Design of experiments \n Grey box completion and validation \n Research question \n References [ edit ] \n ^   Muaz, Jalil Mohammad (2013), Practical Guidelines for conducting research. Summarizing good research practice in line with the DCED Standard \n ^   Robson, C. (1993). Real-world research: A resource for social scientists and practitioner – researchers. Malden: Blackwell Publishing. \n ^   Adèr, H. J. ,  Mellenbergh, G. J. , & Hand, D. J. (2008). Advising on research methods: a consultant's companion. Huizen: Johannes van Kessel Publishing.  ISBN   978-90-79418-01-5 \n ^   Bell, J. (1999). Doing your research project. Buckingham: OUP. \n ^   Creswell, J.W. (2012). Educational research: Planning, conducting, and evaluating quantitative and qualitative research. Upper Saddle River, NJ: Prentice Hall. \n v \n t \n e \n Design \n Outline \n Portal \n Designer \n Disciplines \n Communication \ndesign \n Advertising \n Book design \n Corporate design \n Exhibit design \n Film title design \n Graphic design \n Motion \n Postage stamp design \n Print design \n Illustration \n Information design \n Instructional design \n News design \n Photography \n Retail design \n Signage  /  Traffic sign design \n Typography  /  Type design \n Video design \n Visual merchandising \n Environmental \ndesign \n Architecture \n Architectural lighting design \n Building design \n Passive solar \n Ecological design \n Environmental impact design \n Garden design \n Computer-aided \n Healthy community design \n Hotel design \n Interior architecture \n Interior design \n EID \n Keyline design \n Landscape architecture \n Sustainable \n Landscape design \n Spatial design \n Urban design \n Industrial \ndesign \n Automotive design \n Automotive suspension design \n CMF design \n Corrugated box design \n Electric guitar design \n Furniture design \n Sustainable \n Hardware interface design \n Motorcycle design \n Packaging and labeling \n Photographic lens design \n Product design \n Production design \n Sensory design \n Service design \n Interaction \ndesign \n Experience design \n EED \n Game design \n Level design \n Video game design \n Hardware interface design \n Icon design \n Immersive design \n Information design \n Sonic interaction design \n User experience design \n User interface design \n Web design \n Other \n applied arts \n Public art design \n Ceramic  /  glass design \n Fashion design \n Costume design \n Jewelry design \n Floral design \n Game art design \n Property design \n Scenic design \n Sound design \n Stage/set lighting design \n Textile design \n Other \ndesign \n&  engineering \n Algorithm design \n Boiler design \n Conceptual design \n Database design \n Drug design \n Electrical system design \n Experimental design \n Filter design \n Job design \n Integrated circuit design \n Circuit design \n Physical design \n Power network design \n Mechanism design \n Nuclear weapon design \n Nucleic acid design \n Organization design \n Process design \n Processor design \n Protein design \n Research design \n Social design \n Software design \n Spacecraft design \n Strategic design \n Systems design \n Approaches \n Activity-centered \n Adaptive web \n Affective \n Brainstorming \n By committee \n By contract \n C-K theory \n Closure \n Co-design \n Concept-oriented \n Configuration \n Contextual \n Continuous \n Cradle-to-cradle \n Creative problem-solving \n Creativity techniques \n Critical \n Design fiction \n Defensive \n Design–bid–build \n Design–build \n architect-led \n Domain-driven \n Ecodesign \n Energy neutral \n Engineering design process \n Probabilistic design \n Error-tolerant \n Fault-tolerant \n Framework-oriented \n For assembly \n For behaviour change \n For manufacturability \n For Six Sigma \n For testing \n For X \n Functional \n Generative \n Geodesign \n High-level \n Integrated \n Integrated topside \n Intelligence-based \n Iterative \n KISS principle \n Low-level \n Metadesign \n Mind mapping \n Modular \n New Wave \n Object-oriented \n Open \n Parametric \n Participatory \n Platform-based \n Policy-based \n Process-centered \n Public interest \n Rational \n Regenerative \n Reliability engineering \n Research-based \n Responsibility-driven \n RWD \n Safe-life \n Sustainable \n Systemic \n SOD \n Tableless web \n Theory of constraints \n Top-down and bottom-up \n Transformation \n Transgenerational \n TRIZ \n Universal \n Design for All \n Usage-centered \n Use-centered \n User-centered \n Empathic \n User innovation \n Value-driven \n Value sensitive \n Privacy by \n Design  choice \n computing \n controls \n flow \n leadership \n management \n marker \n methods \n pattern \n research \n science \n strategy \n theory \n thinking \n Tools \n Intellectual property \n Organizations \n Awards \n Tools \n AAD \n Architectural model \n Blueprint \n Comprehensive layout \n CAD \n CAID \n Virtual home design software \n CAutoD \n Design quality indicator \n Electronic design automation \n Flowchart \n Mockup \n Product design specification \n Prototype \n Sketch \n Storyboard \n Technical drawing \n Web design program \n Website wireframe \n Intellectual \nproperty \n Community design \n Design around \n Design patent \n Geschmacksmuster \n Industrial design rights \n European Union \n Organizations \n AIGA \n Chartered Society of Designers \n Design and Industries Association \n Design Council \n International Forum Design \n The Design Society \n Design Research Society \n Awards \n European Design Award \n German Design Award \n Good Design Award (Chicago) \n Good Design Award (Japan) \n Graphex \n IF product design award \n James Dyson Award \n Prince Philip Designers Prize \n Related topics \n Aesthetics \n Agile \n Concept art \n Creative industries \n Cultural icon \n .design \n Enterprise architecture \n Futures studies \n Innovation Management \n Intelligent design \n Lean Startup \n New product development \n OODA Loop \n Philosophy of design \n Process simulation \n Slow design \n STEAM fields \n Unintelligent design \n Visualization \n Wicked problem \n Design  brief \n change \n classic \n director \n education \n elements and principles \n engineer \n firm \n history \n knowledge \n language \n life \n load \n museum \n paradigm \n rationale \n review \n specification \n studio \n technology \n Commons \n Wikibooks \n Wikinews \n Wikiquote \n Wikisource \n Wiktionary \n\t\t\t\t\t\tRetrieved from \" https://en.wikipedia.org/w/index.php?title=Research_design&oldid=811567719 \"\t\t\t\t\t \n Categories :  Research Hidden categories:  Wikipedia articles needing style editing from January 2013 All articles needing style editing   \n Navigation menu \n Personal tools \n Not logged in Talk Contributions Create account Log in   \n Namespaces \n Article Talk   \n Variants \n Views \n Read Edit View history   \n More \n Search \n Navigation \n Main page Contents Featured content Current events Random article Donate to Wikipedia Wikipedia store   \n Interaction \n Help About Wikipedia Community portal Recent changes Contact page   \n Tools \n What links here Related changes Upload file Special pages Permanent link Page information Wikidata item Cite this page   \n Print/export \n Create a book Download as PDF Printable version   \n Languages \n العربية Deutsch ಕನ್ನಡ Nederlands Shqip   \n Edit links   \n  This page was last edited on 22 November 2017, at 13:27. \n Text is available under the  Creative Commons Attribution-ShareAlike License ;\nadditional terms may apply.  By using this site, you agree to the  Terms of Use  and  Privacy Policy . Wikipedia® is a registered trademark of the  Wikimedia Foundation, Inc. , a non-profit organization. \n Privacy policy \n About Wikipedia \n Disclaimers \n Contact Wikipedia \n Developers \n Cookie statement \n Mobile view"}