{"url": "https://zh.wikipedia.org/wiki/%E5%AE%A4%E5%86%85%E8%AE%BE%E8%AE%A1", "content": "室内设计 - 维基百科，自由的百科全书 \n 室内设计   \n 维基百科，自由的百科全书   \n\t\t\t\t\t跳转至：\t\t\t\t\t 导航 、\t\t\t\t\t 搜索 \n 設計主题 \n 本条目 需要擴充。 （2010年7月28日）   \n 请協助 改善这篇條目 ，更進一步的信息可能會在 討論頁 或 扩充请求 中找到。请在擴充條目後將此模板移除。   \n 本条目 没有列出任何 参考或来源 。 （2010年4月23日）   \n 維基百科所有的內容都應該 可供查證 。请协助添加来自 可靠来源 的引用以 改善这篇条目 。 无法查证 的内容可能被提出异议而移除。   \n挑高店面的 室內設計 \n爵士風格設計 \n 室內設計 （ Interior design ），是一種以居住在該空間的人為對象所從事的 設計 專業，需要 工程技術 上的 知識 ，也需要 艺术 上的 理论 和技能，泛指對室內建立的任何相關物件，包括：牆、窗戶、窗簾、門、表面處理、材質、燈光、空調、水電、環境控制系統、視聽設備、家具與裝飾品的規畫。室內設計是从 建筑设计 中的 装饰 部分演变出来的。他是对 建筑物 内部 环境 的再创造。室内设计可以分为公共空间和 居家 两大类别。當我們提到 室內設計 時，會提到的還有 動線 、 空间 、 色彩 、 照明 、功能等等相關的重要術語。 \n 室内设计 是指为满足一定的建造目的（包括人们对它的使用功能的要求、对它的 视觉 感受的要求）而进行的准备工作，对现有的建筑物内部空间进行 深加工 的 增值 准备工作。目的是为了让具体的物质材料在技术、 经济 等方面，在可行性的有限条件下形成能够成为合格产品的准备工作。 \n 按设计深度分：有 室内方案设计 、室内初步设计、室内施工图设计。 \n 按设计内容分：有室内结构设计、室内物理设计（ 声学 设计、 光学 设计、 热学 设计、 色彩 设计、 能源 设计）、室内设备设计（室内给排水设计、 室内供暖、通风、 空调 设计、 电气 、 通訊 设计）等。 \n 某些國家如中國的室內設計會考慮 風水 。 \n 綠色環保的室內設計也成為人們關注的焦點。綠色室內設計除了著重環保材質的採用，節能環保、低碳理念、精簡設計亦被納入打造理想綠色空間的大前提。 \n 室內設計師 會根據許多的法則規畫他們的作品，這些法則包括： 環境物理學 （如利用日照與空氣等條件）、 建築學 、 美學 、 人因工程学 與人類的慣性及習俗等。他們幾乎規畫所有種類的空間，包括飯店、商辦、學校、醫院、私人住宅、購物商場、餐廳、戲院、博物館以及機場航站等。今日，室內設計師不僅只需懂得規畫建物平面圖、房屋修護跟辨識結構的能力，更需要提升對各種材料、生活型態、設備等的認識。 \n 装修，作为一种居所装修装饰的新理念，在20世纪80年代末在中国诞生。装修即装潢，一般指居室内固定部分的后加工，如地面墙面天棚门窗的装修；室内设计中装修、装饰是不可分的。 \n 參看 [ 编辑 ] \n 風水 \n 三行 \n 裝修 \n 规范控制 \n GND :  4072819-5 \n NDL :  00571298 \n\t\t\t\t\t\t取自“ https://zh.wikipedia.org/w/index.php?title=室内设计&oldid=47013231 ”\t\t\t\t\t \n 分类 ： 室內設計 隐藏分类： 自2010年7月扩充中的条目 自2010年4月缺少来源的条目 包含规范控制信息的维基百科条目   \n 导航菜单 \n 个人工具 \n 没有登录 讨论 贡献 创建账户 登录   \n 名字空间 \n 条目 讨论   \n 不转换 \n 不转换 简体 繁體 大陆简体 香港繁體 澳門繁體 马新简体 台灣正體   \n 视图 \n 阅读 编辑 查看历史   \n 更多 \n 搜索 \n 导航 \n 首页 分类索引 特色内容 新闻动态 最近更改 随机条目   \n 帮助 \n 帮助 维基社群 方针与指引 互助客栈 知识问答 字词转换 IRC即时聊天 联络我们 关于维基百科 资助维基百科   \n 在其他项目中 \n 维基共享资源   \n 打印/导出 \n 下载为PDF   \n 工具 \n 链入页面 相关更改 上传文件 特殊页面 打印页面 固定链接 页面信息 维基数据项 引用本页   \n 其他语言 \n العربية Català Čeština Cymraeg Deutsch English Español Eesti Euskara فارسی Suomi Français עברית हिन्दी Հայերեն Bahasa Indonesia Italiano 日本語 한국어 Lietuvių Македонски Polski Português Română Русский Srpskohrvatski / српскохрватски Simple English Slovenčina Српски / srpski Svenska Kiswahili தமிழ் తెలుగు ไทย Tagalog Türkçe Українська اردو Tiếng Việt Winaray   \n 编辑链接   \n  本页面最后修订于2017年11月17日 (星期五) 07:33。 \n 本站的全部文字在 知识共享 署名-相同方式共享 3.0协议 之条款下提供，附加条款亦可能应用。（请参阅 使用条款 ） \nWikipedia®和维基百科标志是 维基媒体基金会 的注册商标；维基™是维基媒体基金会的商标。 \n维基媒体基金会是在美国佛罗里达州登记的501(c)(3) 免税 、非营利、慈善机构。 \n 隐私政策 \n 关于维基百科 \n 免责声明 \n 开发者 \n Cookie声明 \n 手机版视图"}