{"url": "https://www.wikihow.com/Discussion:Clear-Your-Browser%27s-Cache", "content": "Discussion:Clear Your Browser's Cache - wikiHow \n MESSAGES \n You have no  notifications  at this time.   \n LOG IN \n Log in \n Facebook \n Google \n Civic \n wikiHow Account \n\t\tNo account yet?\t\t Create an account \n EXPLORE \n Community Dashboard Random Article About Us Categories Recent Changes   \n HELP US \n Write an Article Request a New Article Answer a Request More Ideas...   \n Article Edit Discuss \n Discussion:Clear Your Browser's Cache \n Featured Article \n \"Clear Your Browser's Cache\"  was or will be a  featured article  on  2009-08-08 . If you see a way this article can be made even better, please feel free to edit it. \n This discussion page has been archived. \nFeel free to start a new discussion or revive an old one here. \n Discussion Archives:    1 \n At 01:18, Jul 22, 2012 \n 99.57.202.42  said: \n On your section of deleting browsing history by using TOOLS is different on my platform. In Explorer 8 I go to SAFETY(left of tools) and click on deleting browsing history. Now you might have a different version than mine, but I thought all was the same. I'm very sorry if I'm in errow of versions. Thank you, David \n Reply to 99.57.202.42 \n At 20:30, Aug 11, 2012 \n 92.141.116.3  said: \n I delected The Temporary Internet Files N its still not working \n Reply to 92.141.116.3 \n At 19:17, Sep 09, 2012 \n 98.26.26.131  said: \n Clearing the cache did not work. My outlook, which worked yesterday, will not open today. \n Reply to 98.26.26.131 \n At 15:30, Sep 13, 2012 \n 41.133.29.86  said: \n i haven't had ever my first kiss by an girl before ever in my life so ho wants to kiss me and have s.e.x with me in bed my adders is 39 Joosternberg Street. \n Reply to 41.133.29.86 \n At 16:54, Sep 21, 2012 \n 201.141.4.248  said: \n Me estoy encabronando NO ME PUEDO METER PARA INICIAR SECION PORFAVOR AYUDEMME \n Reply to 201.141.4.248 \n At 02:01, Sep 29, 2012 \n 108.240.60.164  said: \n am not getting any messages from models \n Reply to 108.240.60.164 \n At 19:11, Oct 18, 2012 \n 24.177.64.179  said: \n None of this is working on any of my browsers. \n And I deleted cookies I didn't want to delete. \n Why can't they just do a CLEAR CACHE BUTTON THAT WORKS? \n Reply to 24.177.64.179 \n At 01:28, Dec 16, 2012 \n 142.167.116.181  said: \n how the hell can i get of this loop site or web it sucks its garbage it dosent work if this is what im paying for im going to go to rogers \n Reply to 142.167.116.181 \n At 13:15, Feb 18, 2013 \n 5.61.200.3  said: \n according to the machine I am running windows 8 XP up to date. However the drop down from clicking on tools is not listed in the list you have sent me under any browser, I have \n Re Open last browsing session Pop up blocker Manage Add on's Work off line View Settings Full screen Tool bar Developer Tools Suggested Sites Window Mesenger Internet Options \n Please advise as I need to sort out my Hotmail problem \n Reply to 5.61.200.3 \n At 02:18, Feb 28, 2013 \n 177.99.90.109  said: \n linguá portuguesa e meu pc não tem estes conteúdos :( \n Reply to 177.99.90.109 \n At 17:50, Mar 05, 2013 \n 67.219.175.150  said: \n I am starting to avoid looking at \"The Blaze\" I have to dump cookies everyday but that doesn't improve you site. It takes forever to download and let me scroll. Locks up and then have to constantly refuse your newsletter. I've always followed Glenn Beck but this is acking too much and very annoying to deal with. Breitbart is so much better. \n Reply to 67.219.175.150 \n At 11:41, Nov 24, 2013 \n UnlockBoot DevHelp  said: \n The easy method 4 me: CTRL + SHIFT + DEL \n Reply to UnlockBoot DevHelp \n At 20:23, Feb 04, 2014 \n 69.207.99.124  said: \n I followed all your directions and my browser (Firefox) cache did not clear. It would be helpful if this site had instructions on what to do/who to call when it doesn't work. \n Thank you \n Reply to 69.207.99.124 \n At 07:17, Feb 20, 2014 \n 122.179.26.231  said: \n aaaaa \n Reply to 122.179.26.231 \n At 06:07, Mar 01, 2014 \n 117.213.251.18  said: \n easy for me \n Reply to 117.213.251.18 \n At 23:42, Mar 02, 2014 \n 180.214.168.4  said: \n For Safari on MacBook there is no empty cache available. \n Reply to 180.214.168.4 \n At 00:52, Apr 26, 2014 \n 69.121.112.241  said: \n the news feed from my Facebook profile are in the way and when I want to click on a tile the game goes away and I get deducted for the amount it happened before ! and I thought it was fixed but it went back to the news feed and I just won't play the game anymore if its not fixed and I must have had about 300 points deducted already because of that happening what a waste... \n Reply to 69.121.112.241 \n At 21:23, May 05, 2014 \n 172.9.42.160  said: \n For IE, it says specifically to uncheck the box to retain favorites data, while the picture shows that box checked and the other information given would seem to indicate that the box needs to be checked. A little confusing. \n Reply to 172.9.42.160 \n At 16:27, May 14, 2014 \n 115.244.21.227  said: \n I followed your steps and it is working with my browser. Now my website  http://itbloggertips.com/  is working fine. Thanks a lot. \n Reply to 115.244.21.227 \n At 15:22, May 19, 2014 \n 79.116.251.21  said: \n i lost all of my chips wihout even playing pool. i had like 350 and while i was playing i just had on my screen themessage from the end of the game with the winner and looser. without putting the black ball or any reason at all well i worked to get those chips and i would love to get them back.I didnt done anything wrong to loose them and it is not my fault that the game since it was updated has some problems. \n Reply to 79.116.251.21 \n At 16:59, May 21, 2014 \n 79.65.71.13  said: \n The screen shots for Chrome 10+ don't seem to be up-to-date. \n Reply to 79.65.71.13 \n At 17:02, May 21, 2014 \n 79.65.71.13  said: \n I agree with 172.9.42.160 - do you have an answer ? \n Reply to 79.65.71.13 \n At 13:18, May 28, 2014 \n 86.174.22.14  said: \n Regarding the \"How to Clear Cache\" article for Firefox, I do not have a \"Firefox Tab\" in the top left corner!!!!! \n Reply to 86.174.22.14 \n At 23:56, Jul 18, 2014 \n 99.22.28.19  said: \n update for ios 7 needed \n Reply to 99.22.28.19 \n At 19:12, Aug 12, 2014 \n 50.188.128.35  said: \n I can not get it to open \n Reply to 50.188.128.35 \n At 00:02, Sep 20, 2016 \n 24.168.243.229  said: \n been playing for years, now today it says my \"plug in\" is not working. what's going on?? \n Reply to 24.168.243.229 \n At 09:37, Mar 08, 2017 \n 82.66.77.166  said: \n This article is a mess and absolutely unreadable, it should have a Table of Content for usability and one page for each browser, not this gigantic bag of information that is 90% irrelevant to every single reader. \n Reply to 82.66.77.166 \n Can you improve this article? If so, you can edit it directly!  Click here  to go into edit mode and fix it up. \n\t\t\t\tYou are not logged in. Your IP address will be displayed in your posting.\n Enter the word that appears above. \n Security \n Cookies make wikiHow better. By continuing to use our site, you agree to our  cookie policy . \n Random Article \n Write An Article \n Featured Articles \n How to  Buy Nike Stock How to  Deal With Tons of Homework How to  Use a Milk Frother How to  Tame a Fully Grown Quail   \n Follow Us On... \n Home \n About wikiHow \n Jobs \n Terms of Use \n RSS \n Site map \n Log In \n    All text shared under a  Creative Commons License .\n Powered by Mediawiki. \n 49"}