{"url": "https://www.seao.ca/Information/apropos.aspx", "content": "SEAO : À propos de SEAO\r\n Exploité par CGI en partenariat avec  \n Constructo \n  pour le Secrétariat du Conseil du trésor du Québec. \n Rechercher un avis \n Recherche avancée \n Ouvrir une session \n English \n Avis du jour \n Abonnements \n Service à la clientèle \n Aide \n Recherche avancée \n                                      Panier \n                                      À propos de SEAO \n                                      Info sur Constructo \n                                      Conditions d'utilisation \n                                      Polices supportées \n À propos de SEAO \n SEAO est l’acronyme de « Système électronique d’appel d’offres », approuvé par le gouvernement du Québec. C'est une application accessible par Internet  - à l'adresse  www.seao.ca  - qui rassemble les différents avis de marchés publics provenant de la plupart des organismes publics du Québec, soit les ministères et organismes publics de l'administration gouvernementale, les organismes du réseau de l'éducation, les organismes du réseau de la santé et des services sociaux ainsi que les municipalités et les autres organismes municipaux. Ces organismes sont tenus d'utiliser le SEAO pour la publication de leurs avis, la distribution de leurs documents d'appel d'offres et la publication des renseignements de leurs contrats. \n D'autres organismes peuvent aussi utiliser le SEAO, comme les sociétés d'État à vocation commerciale ou industrielle, les organismes à but non lucratif  et autres entreprises privées. \n Les fournisseurs intéressés par les marchés publics peuvent y consulter les avis publiés et se procurer les documents afférents lorsqu’ils sont distribués par le SEAO. \n Le site officiel des appels d’offres du Gouvernement du Québec. \n Les avis publiés sur le site proviennent des ministères et organismes publics, des municipalités, des organisations des réseaux de la santé et des services sociaux ainsi que de l’éducation. \n Besoin d'aide? \n Aide en ligne \n Glossaire \n Plan du site \n Accessibilité \n UPAC-Signaler un acte répréhensible \n Service clientèle \n Grille des tarifs \n Contactez-nous \n Nouvelles \n Marchés publics hors Québec \n Registre des entreprises non admissibles \n                            Autorité des marchés financiers\r\n À propos \n À propos de SEAO \n Info sur Constructo \n Conditions d’utilisation \n Polices supportées \n Partenaires \n © 2003-2017 Tous droits réservés"}